.segment "BANK_33"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $A000 ; for listing file
; 0x026010-0x02800F
; обработка объектов, коллизий, общие коды для объектов

.export sub_0x006233_обработчик_объектов

.export ofs_038_3D_0x006347_0B_удалить_объект_босс
.export ofs_038_50_0x006347_0D_удалить_объект_босс
.export ofs_038_57_0x006347_0C_удалить_объект_босс
.export loc_0x006347_удалить_объект_босс

.export ofs_038_03_0x00628A_08_удалить_объект
.export ofs_038_05_0x00628A_07_удалить_объект
.export ofs_038_06_0x00628A_05_удалить_объект
.export ofs_038_07_0x00628A_07_удалить_объект
.export ofs_038_09_0x00628A_07_удалить_объект
.export ofs_038_0A_0x00628A_08_удалить_объект
.export ofs_038_0B_0x00628A_08_удалить_объект
.export ofs_038_0D_0x00628A_09_удалить_объект
.export ofs_038_10_0x00628A_04_удалить_объект
.export ofs_038_11_0x00628A_09_удалить_объект
.export ofs_038_13_0x00628A_07_удалить_объект
.export ofs_038_14_0x00628A_07_удалить_объект
.export ofs_038_15_0x00628A_06_удалить_объект
.export ofs_038_16_0x00628A_05_удалить_объект
.export ofs_038_17_0x00628A_09_удалить_объект
.export ofs_038_18_0x00628A_07_удалить_объект
.export ofs_038_19_0x00628A_08_удалить_объект
.export ofs_038_1A_0x00628A_05_удалить_объект
.export ofs_038_1B_0x00628A_06_удалить_объект
.export ofs_038_1C_0x00628A_04_удалить_объект
.export ofs_038_1E_0x00628A_05_удалить_объект
.export ofs_038_1F_0x00628A_09_удалить_объект
.export ofs_038_20_0x00628A_05_удалить_объект
.export ofs_038_22_0x00628A_06_удалить_объект
.export ofs_038_23_0x00628A_07_удалить_объект
.export ofs_038_25_0x00628A_06_удалить_объект
.export ofs_038_26_0x00628A_07_удалить_объект
.export ofs_038_27_0x00628A_03_удалить_объект
.export ofs_038_28_0x00628A_06_удалить_объект
.export ofs_038_2B_0x00628A_06_удалить_объект
.export ofs_038_2D_0x00628A_06_удалить_объект
.export ofs_038_2E_0x00628A_05_удалить_объект
.export ofs_038_30_0x00628A_0A_удалить_объект
.export ofs_038_35_0x00628A_06_удалить_объект
.export ofs_038_36_0x00628A_07_удалить_объект
.export ofs_038_37_0x00628A_05_удалить_объект
.export ofs_038_3C_0x00628A_09_удалить_объект
.export ofs_038_3F_0x00628A_05_удалить_объект
.export ofs_038_40_0x00628A_06_удалить_объект
.export ofs_038_41_0x00628A_05_удалить_объект
.export ofs_038_42_0x00628A_0A_удалить_объект
.export ofs_038_45_0x00628A_06_удалить_объект
.export ofs_038_46_0x00628A_09_удалить_объект
.export ofs_038_48_0x00628A_06_удалить_объект
.export ofs_038_4A_0x00628A_07_удалить_объект
.export ofs_038_4C_0x00628A_05_удалить_объект
.export ofs_038_4E_0x00628A_06_удалить_объект
.export ofs_038_51_0x00628A_05_удалить_объект
.export ofs_038_52_0x00628A_05_удалить_объект
.export ofs_038_55_0x00628A_06_удалить_объект
.export ofs_038_56_0x00628A_05_удалить_объект
.export ofs_038_5A_0x00628A_03_удалить_объект
.export sub_0x00628A_удалить_объект
.export loc_0x00628A_удалить_объект

.export loc_0x00628D_очистить_кадр_анимации

.export loc_0x006293_установить_состояние_объекта

.export ofs_038_03_0x00A29A_06_обработка_состояния_смерти_объекта
.export ofs_038_05_0x00A29A_05_обработка_состояния_смерти_объекта
.export ofs_038_07_0x00A29A_05_обработка_состояния_смерти_объекта
.export ofs_038_09_0x00A29A_05_обработка_состояния_смерти_объекта
.export ofs_038_15_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_16_0x0062AA_03_обработка_состояния_смерти_объекта
.export ofs_038_17_0x0062AA_07_обработка_состояния_смерти_объекта
.export ofs_038_1B_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_1E_0x0062AA_03_обработка_состояния_смерти_объекта
.export ofs_038_20_0x0062AA_03_обработка_состояния_смерти_объекта
.export ofs_038_22_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_25_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_26_0x0062AA_05_обработка_состояния_смерти_объекта
.export ofs_038_28_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_2B_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_2E_0x0062AA_03_обработка_состояния_смерти_объекта
.export ofs_038_30_0x0062AA_08_обработка_состояния_смерти_объекта
.export ofs_038_36_0x0062AA_05_обработка_состояния_смерти_объекта
.export ofs_038_3C_0x0062AA_07_обработка_состояния_смерти_объекта
.export ofs_038_3F_0x008E02_03_обработка_состояния_смерти_объекта
.export ofs_038_40_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_41_0x0062AA_03_обработка_состояния_смерти_объекта
.export ofs_038_42_0x0062AA_08_обработка_состояния_смерти_объекта
.export ofs_038_45_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_47_0x0062AA_03_обработка_состояния_смерти_объекта
.export ofs_038_4A_0x0062AA_05_обработка_состояния_смерти_объекта
.export ofs_038_4C_0x0062AA_03_обработка_состояния_смерти_объекта
.export ofs_038_4E_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_52_0x0062AA_03_обработка_состояния_смерти_объекта
.export ofs_038_55_0x0062AA_04_обработка_состояния_смерти_объекта
.export ofs_038_56_0x0062AA_03_обработка_состояния_смерти_объекта
.export sub_0x0062AA_обработка_состояния_смерти_объекта
.export loc_0x0062AA_обработка_состояния_смерти_объекта
.export ofs_038_12_0x0062B2_08_обработка_состояния_смерти_объекта
.export ofs_038_32_0x0062B2_08_обработка_состояния_смерти_объекта
.export loc_0x0062B2_обработка_состояния_смерти_объекта

.export sub_0x0062E7_увеличить_состояние_объекта
.export loc_0x0062E7_увеличить_состояние_объекта

.export ofs_038_12_0x006306_09
.export ofs_038_32_0x006306_09
.export ofs_038_3D_0x006306_0A
.export ofs_038_4F_0x006306_08
.export ofs_038_50_0x006306_0C
.export ofs_038_53_0x006306_09
.export ofs_038_57_0x006306_0B
.export loc_0x006306

.export ofs_038_03_0x00630D_07_обработка_анимации_взрыва_объекта
.export ofs_038_05_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_06_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_07_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_09_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_0A_0x00630D_07_обработка_анимации_взрыва_объекта
.export ofs_038_0B_0x00630D_07_обработка_анимации_взрыва_объекта
.export ofs_038_0D_0x00630D_08_обработка_анимации_взрыва_объекта
.export ofs_038_11_0x00630D_08_обработка_анимации_взрыва_объекта
.export ofs_038_13_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_15_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_16_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_17_0x00630D_08_обработка_анимации_взрыва_объекта
.export ofs_038_18_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_19_0x00630D_07_обработка_анимации_взрыва_объекта
.export ofs_038_1A_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_1B_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_1E_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_1F_0x00630D_08_обработка_анимации_взрыва_объекта
.export ofs_038_20_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_22_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_23_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_25_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_26_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_28_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_2B_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_2E_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_2D_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_30_0x00630D_09_обработка_анимации_взрыва_объекта
.export ofs_038_35_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_36_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_37_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_3B_0x00630D_08_обработка_анимации_взрыва_объекта
.export ofs_038_3C_0x00630D_08_обработка_анимации_взрыва_объекта
.export ofs_038_3E_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_3F_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_40_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_41_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_42_0x00630D_09_обработка_анимации_взрыва_объекта
.export ofs_038_45_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_46_0x00630D_08_обработка_анимации_взрыва_объекта
.export ofs_038_48_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_4A_0x00630D_06_обработка_анимации_взрыва_объекта
.export ofs_038_4C_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_4E_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_51_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_52_0x00630D_04_обработка_анимации_взрыва_объекта
.export ofs_038_55_0x00630D_05_обработка_анимации_взрыва_объекта
.export ofs_038_56_0x00630D_04_обработка_анимации_взрыва_объекта
.export sub_0x00630D_обработка_анимации_взрыва_объекта
.export loc_0x00630D_обработка_анимации_взрыва_объекта

.export ofs_038_11_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам
.export ofs_038_13_0x006364_03_поменять_состояние_хитбокса_и_подготовить_к_взрывам
.export ofs_038_19_0x006364_04_поменять_состояние_хитбокса_и_подготовить_к_взрывам
.export ofs_038_1F_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам
.export ofs_038_46_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам
.export loc_0x006364_поменять_состояние_хитбокса_и_подготовить_к_взрывам

.export ofs_038_0D_0x00636E_04_подготовить_к_взрывам

.export ofs_038_0D_0x00637B_05_маленькие_взрывы_объектов
.export ofs_038_11_0x00637B_06_маленькие_взрывы_объектов
.export ofs_038_13_0x00637B_04_маленькие_взрывы_объектов
.export ofs_038_19_0x00637B_05_маленькие_взрывы_объектов
.export ofs_038_1F_0x00637B_06_маленькие_взрывы_объектов
.export ofs_038_46_0x00637B_06_маленькие_взрывы_объектов
.export loc_0x00637B_маленькие_взрывы_объектов

.export ofs_038_32_0x0063C8_06_установить_статус_уничтожения_босса_и_убить_все_объекты
.export ofs_038_3D_0x0063C8_07_установить_статус_уничтожения_босса_и_убить_все_объекты
.export ofs_038_4F_A3B8_05_установить_статус_уничтожения_босса_и_убить_все_объекты
.export ofs_038_50_A3B8_09_установить_статус_уничтожения_босса_и_убить_все_объекты
.export loc_0x0063C8_установить_статус_уничтожения_босса_и_убить_все_объекты

.export ofs_038_3B_0x0063CE_05_отключить_состояние_хитбокса_и_убить_все_объекты

.export ofs_038_32_0x0063E8_07_большие_взрывы_для_боссов
.export ofs_038_3B_0x0063E8_06_большие_взрывы_для_боссов
.export ofs_038_3D_0x0063E8_08_большие_взрывы_для_боссов
.export ofs_038_50_A3D8_0A_большие_взрывы_для_боссов
.export loc_0x0063E8_большие_взрывы_для_боссов

.export sub_0x006485_установить_состояние_смерти_объекту

.export ofs_038_0D_0x0066C7_03_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
.export sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
.export loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

.export loc_0x0066D4_прибавить_позицию_спрайта_к_скорости_камеры_Y

.export sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
.export loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры

.export sub_0x0066FD_обработка_позиции_X_объекта_от_скорости

.export sub_0x006717_обработка_позиции_объекта_по_Y
.export loc_0x006717_обработка_позиции_объекта_по_Y

.export sub_0x00675F

.export sub_0x00676D

.export sub_0x0067D7_очистить_скорость_X_Y
.export loc_0x0067D7_очистить_скорость_X_Y

.export sub_0x0067DA_очистить_скорость_Y
.export loc_0x0067DA_очистить_скорость_Y

.export sub_0x0067E3_очистить_скорость_X

.export sub_0x0067EC_отразить_скорость_по_X
.export loc_0x0067EC_отразить_скорость_по_X

.export sub_0x0067FE_отразить_скорость_по_Y
.export loc_0x0067FE_отразить_скорость_по_Y

.export sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает

.export sub_0x006815_проверить_есть_или_нет_преграда_на_пути_если_объект_падает

.export sub_0x00681A_проверить_есть_или_нет_преграда_на_пути

.export sub_0x006832

.export sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
.export loc_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности

.export sub_0x0068B8
.export loc_0x0068B8

.export sub_0x0068C2

.export sub_0x0068F6

.export sub_0x006933
.export loc_0x006933

.export sub_0x00693B

.export sub_0x006967

.export sub_0x00697E_смена_скорости_движение_волной

.export sub_0x00699E

.export sub_0x0069DE

.export sub_0x006A1A
.export loc_0x006A1A

.export sub_0x006A5F

.export sub_0x006AA4_save_reg_values

.export sub_0x006AB1_restore_reg_values

.export sub_0x006ABE_копировать_позиции_спрайта

.export sub_0x006AC9_сдвинуть_объект_по_Y_X

.export sub_0x006ADB_прибавить_скорость_Y
.export loc_0x00AACB_прибавить_скорость_Y

.export sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x

.export sub_0x006B34_выбрать_ближайшего_игрока_по_оси_y

.export sub_0x006B74

.export sub_0x006B7B
.export loc_0x006B7B

.export sub_0x006B97

.export sub_0x006BA5_выбрать_количество_HP_от_сложности_игры

.export sub_0x006BA9_выбрать_количество_HP_от_сложности_игры

.export sub_0x006BAB_выбрать_количество_HP_от_сложности_игры

.export sub_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
.export loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта

.export sub_0x00ABCD_попытка_создать_новый_объект_на_позиции_текущего_объекта

.export sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
.export loc_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков

.export sub_0x008418

.export sub_0x007A90

.export sub_0x007ABA_вычислить_тип_поверхности

.export sub_0x007AD0
.export loc_0x007AD0

.export sub_0x007B2B

.export sub_0x007B44

.export sub_0x007B8F

.export sub_0x00BBD0

.export sub_0x007C05

.export sub_0x007C4B_пушки_вертолета

.export sub_0x007D20_очистить_0400_047F

.export sub_0x007D22_очистить_0400_Y

.export sub_0x007D2B_очистить_0480_04FF

.export sub_0x007D2D_очистить_0480_Y

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

sub_0x006233_обработчик_объектов:
C D 1 - - - 0x006233 01:A223: A0 00     LDY #$00
C - - - - - 0x006235 01:A225: A5 72     LDA ram_скорость_камеры_Y
C - - - - - 0x006237 01:A227: 10 01     BPL bra_A22A
C - - - - - 0x006239 01:A229: 88        DEY ; FF
bra_A22A:
C - - - - - 0x00623A 01:A22A: 84 8E     STY ram_008E
C - - - - - 0x00623C 01:A22C: A2 0D     LDX ram_макс_индекс_враги
bra_A22E_loop:
                                        STX ram_0010    ; сохранить индекс объекта
                                        LDY ram_тип_объектов,X
                                        BEQ bra_A230_пусто
                                        JSR sub_A255_обработчик_объектов
                                        LDX ram_0010    ; загрузить индекс объекта
bra_A230_пусто:
C - - - - - 0x006240 01:A230: BD 08 05  LDA ram_кадр_объекта_или_пули,X
C - - - - - 0x006243 01:A233: F0 19     BEQ bra_A24F
; обработка коллизий объектов с игроками
                                        LDA ram_счетчик_кадров
                                        AND #$01
                                        TAY ; индекс игрока
                                        LDA ram_состояние_хитбоксов_объектов,X
                                        ORA ram_флаг_мертвого_игрока,Y
                                        LSR ; нечетный не будет проверять коллизию с игроком
                                        BCS bra_A246
                                        JSR sub_A235_копировать_показатели_объекта
C - - - - - 0x006254 01:A244: 20 E0 A0  JSR sub_A0E0_обработчик_объектов_и_пуль_с_игроками
                                        LDX ram_0010    ; загрузить индекс объекта
bra_A246:
                                        LDA ram_состояние_хитбоксов_объектов,X
                                        BMI bra_A24F
                                        JSR sub_A235_копировать_показатели_объекта
C - - - - - 0x006259 01:A249: 20 96 A1  JSR sub_A196_обработчик_пуль_игроков_с_объектами_и_пулями
C - - - - - 0x00625C 01:A24C: A6 10     LDX ram_0010    ; загрузить индекс объекта
bra_A24F:
C - - - - - 0x006261 01:A251: CA        DEX
C - - - - - 0x006262 01:A252: 10 DA     BPL bra_A22E_loop
bra_A24F_RTS:
C - - - - - 0x006264 01:A254: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_A235_копировать_показатели_объекта:
C - - - - - 0x006245 01:A235: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006248 01:A238: 85 06     STA ram_0006    ; y объекта
C - - - - - 0x00624A 01:A23A: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00624D 01:A23D: 85 05     STA ram_0005    ; x объекта
C - - - - - 0x00624F 01:A23F: BD 3A 07  LDA ram_хитбоксы_объектов,X
C - - - - - 0x006252 01:A242: 85 07     STA ram_0007    ; хитбокс объекта
                                        RTS

; ******************************************************************************************************************

sub_A0E0_обработчик_объектов_и_пуль_с_игроками:
C - - - - - 0x0060F5 01:A0E5: B5 C6     LDA ram_хитбоксы_игрока,Y
                                        BEQ bra_A10D_RTS
C - - - - - 0x0060F7 01:A0E7: 38        SEC
C - - - - - 0x0060F8 01:A0E8: 65 07     ADC ram_0007    ; хитбоксы_объектов
C - - - - - 0x0060FA 01:A0EA: A8        TAX
; X
C - - - - - 0x0060FB 01:A0EB: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
                                        SEC
                                        SBC ram_0005    ; x объекта
                                        BCS bra_A0EC
                                        BPL bra_A10D_RTS
                                        BMI bra_A0ED_далее  ; jmp
bra_A0EC:
                                        BMI bra_A10D_RTS
bra_A0ED_далее:
                                        SEC
                                        SBC tbl_A000_хитбоксы + $01,X
                                        BMI bra_A10D_RTS
                                        CMP tbl_A000_хитбоксы + $03,X
                                        BCS bra_A10D_RTS
; Y
C - - - - - 0x006108 01:A0F8: BD 32 05  LDA ram_позиция_y_спрайта_игрока,Y
                                        SEC
                                        SBC ram_0006    ; y объекта
                                        BCS bra_A0EE
                                        BPL bra_A10D_RTS
                                        BMI bra_A0EF_далее  ; jmp
bra_A0EE:
                                        BMI bra_A10D_RTS
bra_A0EF_далее:
                                        SEC
                                        SBC tbl_A000_хитбоксы,X
                                        BMI bra_A10D_RTS
                                        CMP tbl_A000_хитбоксы + $02,X
                                        BCC bra_A10E_коллизия_объектов_или_пуль_с_игроком
bra_A10D_RTS:
                                        RTS
bra_A10E_коллизия_объектов_или_пуль_с_игроком:
                                        STY ram_0011    ; сохранить индекс игрока
C - - - - - 0x006120 01:A110: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x00613B 01:A12B: BD D8 06  LDA ram_тип_объектов,X
                                        CMP #con_obj_id_08  ; бонусный предмет
C - - - - - 0x00613E 01:A12E: F0 1B     BEQ bra_A14B_00_бонусный_предмет
C - - - - - 0x006140 01:A130: B9 C4 00  LDA ram_инвиз_игрока,Y
C - - - - - 0x006143 01:A133: D0 D8     BNE bra_A10D_RTS
C - - - - - 0x006145 01:A135: B9 D4 00  LDA ram_бессмертие_игрока,Y
C - - - - - 0x006148 01:A138: D0 05     BNE bra_A13F_бессмертие
; есть попадание по игроку, очистить объект или нет
                                        LDA ram_характеристики_объектов,X
                                        BEQ bra_A13A_убить_игрока
; пуля объекта
                                        AND #$04    ; бронебойная пуля объекта
                                        BNE bra_A13A_убить_игрока
                                        JSR sub_A475_установить_состояние_смерти_объекту
bra_A13A_убить_игрока:
C - - - - - 0x00614A 01:A13A: A6 11     LDX ram_0011    ; загрузить индекс игрока
C - - - - - 0x00614C 01:A13C: 4C AC F6  JMP loc_0x01F6BD_убить_игрока
bra_A13F_бессмертие:
C - - - - - 0x006151 01:A141: BD 76 06  LDA ram_жизни_объектов_32bit,X
C - - - - - 0x006154 01:A144: C9 F0     CMP #con_HP_F0
C - - - - - 0x006156 01:A146: B0 C5     BCS bra_A10D_RTS
                                        STY ram_0012    ; сохраним индекс игрока для начисления очков
C - - - - - 0x006158 01:A148: 4C 70 A4  JMP loc_A470_обработка_очков_и_установка_состояния_смерти_объекту
bra_A14B_00_бонусный_предмет:
C - - - - - 0x00615D 01:A14D: A9 50     LDA #$50
C - - - - - 0x00615F 01:A14F: 85 01     STA ram_0001
C - - - - - 0x006161 01:A151: 20 38 E6  JSR sub_E638_обработка_очков
C - - - - - 0x006164 01:A154: A9 19     LDA #con_sound_19   ; звук взятия приза
C - - - - - 0x006166 01:A156: 20 DE FD  JSR sub_0x01FDEE_play_sound
C - - - - - 0x006169 01:A159: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x00616B 01:A15B: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00616E 01:A15E: 29 0F     AND #$0F
                                        TAY
                                        LDA tbl_A165_lo,y
                                        STA ram_0000
                                        LDA tbl_A166_hi,y
                                        STA ram_0001
C - - - - - 0x006170 01:A160: A4 11     LDY ram_0011    ; загрузить индекс игрока
    ; загрузить индекс игрока
                                        JMP (ram_0000)

tbl_A165_lo:
- D 1 - I - 0x006175 01:A165: 88 A1     .byte < ofs_016_A188_00_M
- D 1 - I - 0x006177 01:A167: 88 A1     .byte < ofs_016_A188_01_S
- D 1 - I - 0x006179 01:A169: 88 A1     .byte < ofs_016_A188_02_L
- D 1 - I - 0x00617B 01:A16B: 88 A1     .byte < ofs_016_A188_03_F
- D 1 - I - 0x00617D 01:A16D: 81 A1     .byte < ofs_016_A181_04_R
- D 1 - I - 0x00617F 01:A16F: 73 A1     .byte < ofs_016_A173_05_B
- D 1 - I - 0x006181 01:A171: 7B A1     .byte < ofs_016_A17B_06_falcon
tbl_A166_hi:
- D 1 - I - 0x006175 01:A165: 88 A1     .byte > ofs_016_A188_00_M
- D 1 - I - 0x006177 01:A167: 88 A1     .byte > ofs_016_A188_01_S
- D 1 - I - 0x006179 01:A169: 88 A1     .byte > ofs_016_A188_02_L
- D 1 - I - 0x00617B 01:A16B: 88 A1     .byte > ofs_016_A188_03_F
- D 1 - I - 0x00617D 01:A16D: 81 A1     .byte > ofs_016_A181_04_R
- D 1 - I - 0x00617F 01:A16F: 73 A1     .byte > ofs_016_A173_05_B
- D 1 - I - 0x006181 01:A171: 7B A1     .byte > ofs_016_A17B_06_falcon

; _________________________________________________________________________________________________________________

ofs_016_A173_05_B:
C - - J - - 0x006183 01:A173: A9 80     LDA #$80
C - - - - - 0x006185 01:A175: 99 D4 00  STA ram_бессмертие_игрока,Y
C - - - - - 0x006188 01:A178: 4C 75 A2  JMP loc_A27A_удалить_объект

; _________________________________________________________________________________________________________________

ofs_016_A17B_06_falcon:
                                        LDA #$20
                                        STA ram_счетчик_мерцания_экрана
C - - J - - 0x00618B 01:A17B: 20 96 A5  JSR sub_A596_установить_состояние_смерти_для_всех_объектов
C - - - - - 0x00618E 01:A17E: 4C 75 A2  JMP loc_A27A_удалить_объект

; _________________________________________________________________________________________________________________

ofs_016_A181_04_R:
C - - J - - 0x006191 01:A181: B9 B8 00  LDA ram_оружие_игрока,Y
;C - - - - - 0x006194 01:A184: 09 80     ORA #$80
C - - - - - 0x006196 01:A186: D0 08     BNE bra_A190    ; jmp

; _________________________________________________________________________________________________________________

ofs_016_A188_00_M:
ofs_016_A188_01_S:
ofs_016_A188_02_L:
ofs_016_A188_03_F:
C - - J - - 0x006198 01:A188: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00619B 01:A18B: 29 0F     AND #$0F
C - - - - - 0x00619D 01:A18D: 18        CLC
C - - - - - 0x00619E 01:A18E: 69 01     ADC #$01
bra_A190:
C - - - - - 0x0061A0 01:A190: 99 B8 00  STA ram_оружие_игрока,Y
C - - - - - 0x0061A3 01:A193: 4C 75 A2  JMP loc_A27A_удалить_объект

; ******************************************************************************************************************

sub_A196_обработчик_пуль_игроков_с_объектами_и_пулями:
C - - - - - 0x0061A6 01:A196: A2 0F     LDX ram_макс_индекс_пули_игрока
bra_A199_loop:
C - - - - - 0x0061A9 01:A199: BD 38 06  LDA ram_пули_игрока_хитбокс,X
C - - - - - 0x0061AC 01:A19C: F0 1D     BEQ bra_A1BB_минус_X    ; if not active
                                        SEC
C - - - - - 0x0061AE 01:A19E: 65 07     ADC ram_0007    ; хитбокс объекта
C - - - - - 0x0061B0 01:A1A0: A8        TAY
; X
C - - - - - 0x0061B1 01:A1A1: BD 88 05  LDA ram_позиция_x_спрайта,X ; x пуля игрока
                                        SEC
                                        SBC ram_0005    ; x объекта
                                        BCS bra_A1A2
                                        BPL bra_A1BB_минус_X
                                        BMI bra_A1A3_далее  ; jmp
bra_A1A2:
                                        BMI bra_A1BB_минус_X
bra_A1A3_далее:
                                        SEC
                                        SBC tbl_A000_хитбоксы + $01,Y
                                        BMI bra_A1BB_минус_X
                                        CMP tbl_A000_хитбоксы + $03,Y
                                        BCS bra_A1BB_минус_X
; Y
C - - - - - 0x0061BE 01:A1AE: BD 78 05  LDA ram_позиция_y_спрайта,X ; y пуля игрока
                                        SEC
                                        SBC ram_0006    ; y объекта
                                        BCS bra_A1AF
                                        BPL bra_A1BB_минус_X
                                        BMI bra_A1B0_далее  ; jmp
bra_A1AF:
                                        BMI bra_A1BB_минус_X
bra_A1B0_далее:
                                        SEC
                                        SBC tbl_A000_хитбоксы,Y
                                        BMI bra_A1BB_минус_X
                                        CMP tbl_A000_хитбоксы + $02,Y
                                        BCC bra_A1BF_коллизии_пуль_игроков_с_объектами_или_пулями
bra_A1BB_минус_X:
C - - - - - 0x0061CB 01:A1BB: CA        DEX
C - - - - - 0x0061CC 01:A1BC: 10 DB     BPL bra_A199_loop
bra_A1BE_RTS:
C - - - - - 0x0061CE 01:A1BE: 60        RTS

bra_A1BF_коллизии_пуль_игроков_с_объектами_или_пулями:
                                        STX ram_0011    ; сохранить индекс пули игрока
C - - - - - 0x0061CF 01:A1BF: A4 10     LDY ram_0010    ; загрузить индекс объекта
                                        LDA ram_характеристики_объектов,Y
                                        BEQ bra_A1C1_объекты
; пули объектов
                                        AND #$0C    ; бронебойная или сжигающая пуля объекта
                                        BNE bra_A1C0
; пули объектов без дополнительных свойств
                                        LDA ram_пули_игрока_характеристики,X
                                        AND #$06    ; биты сжигания
                                        BEQ bra_A1BE_RTS
; сжечь пулю объекта
                                        LDX ram_0010    ; загрузить индекс объекта
                                        JSR sub_A475_установить_состояние_смерти_объекту   ; убить объект пулю
; проверка на удаления пули игрока
                                        LDX ram_0011    ; загрузить индекс пули игрока
                                        LDA ram_пули_игрока_характеристики,X
                                        AND #$02    ; бит сжигания пули объекта и очистки пули игрока
                                        BNE bra_A1E8_пуля_врезалась
                                        RTS
bra_A1C0:
                                        AND #$08    ; сжигающая пуля объекта
                                        BEQ bra_A1FO_RTS
                                        LDA ram_пули_игрока_характеристики,X
                                        AND #$06    ; биты сжигания
                                        BEQ bra_A1E8_пуля_врезалась
                                        RTS
bra_A1C1_объекты:
C - - - - - 0x0061F4 01:A1E4: 20 F1 A1  JSR sub_A1F1_вычетание_HP_объекта_после_попадания_пули
                                        LDX ram_0011    ; загрузить индекс пули игрока
                                        LDA ram_пули_игрока_характеристики,X
                                        AND #$08    ; bit пули игрока пронзают противника насквозь
                                        BNE bra_A1FO_RTS
bra_A1E8_пуля_врезалась:
                                        LDA ram_пули_игрока_номер_действия,X
                                        BMI bra_A1EE_разрыв_пули
                                        LDA #$02    ; подготовка_пуля_врезалась
                                        STA ram_пули_игрока_атрибуты_обработки,X
bra_A1FO_RTS:
                                        RTS
bra_A1EE_разрыв_пули:
                                        LDA ram_пули_игрока_индексы,X
                                        LSR
                                        CMP #con_weapon_flame
                                        BEQ bra_A1EF_flame
                                        CMP #con_weapon_grenade_launcher
                                        BNE bra_A1FO_RTS
; grenade_launcher
                                        LDA #$80    ; bit разрыва grenade_launcher
                                        STA ram_пули_игрока_номер_действия,X
                                        LDA ram_пули_игрока_характеристики,X   ; главной пули
                                        ORA #$09    ; бит игнорировая стен и врагов
                                        STA ram_пули_игрока_характеристики,X   ; новой пули
                                        RTS
bra_A1EF_flame:
loc_0x01FE6D_разрыв_flame:
C D 3 - - - 0x01FE6D 07:FE5D: A9 30     LDA #con_prg_bank + $30
                                        STA $5114   ; 8000
                                        JMP loc_0x001271_flame_разрыв

tbl_A000_хитбоксы:
; 00-1F хитбокс игрока в обычной позе
; надо поправить хитбокс вылазиющей пушки с земли
;                                              -------------------- Y
;                                              |    --------------- X
;                                              |    |    ---------  Y cmp
;                                              |    |    |    ----- X cmp
;                                              |    |    |    |
- D 1 - - - 0x006010 01:A000: EA        .byte $EA, $F4, $2A, $16    ; 00
- D 1 - - - 0x006014 01:A004: F0        .byte $F0, $FA, $1E, $0A    ; 04
- D 1 - - - 0x006018 01:A008: E5        .byte $E5, $F7, $34, $10    ; 08
- D 1 - - - 0x00601C 01:A00C: E1        .byte $E1, $EB, $3C, $28    ; 0C
- D 1 - - - 0x006020 01:A010: F1        .byte $F1, $EF, $28, $20    ; 10
- D 1 - - - 0x006024 01:A014: E1        .byte $E1, $D3, $3C, $58    ; 14
- D 1 - - - 0x006028 01:A018: D1        .byte $D1, $DB, $6C, $48    ; 18
- D 1 - - - 0x00602C 01:A01C: D1        .byte $D1, $EB, $5C, $28    ; 1C

; 1F-3F хитбокс игрока в прыжке
- D 1 - - - 0x006030 01:A020: F2        .byte $F2, $F2, $1A, $1A    ; 20
- D 1 - - - 0x006034 01:A024: F8        .byte $F8, $F8, $0E, $0E    ; 24
- D 1 - - - 0x006038 01:A028: ED        .byte $ED, $F5, $24, $14    ; 28
- D 1 - - - 0x00603C 01:A02C: E9        .byte $E9, $E9, $2C, $2C    ; 2C
- D 1 - - - 0x006040 01:A030: F9        .byte $F9, $ED, $18, $24    ; 30
- - - - - - 0x006044 01:A034: E9        .byte $E9, $D1, $2C, $5C    ; 34
- - - - - - 0x006048 01:A038: D9        .byte $D9, $D9, $5C, $4C    ; 38
- D 1 - - - 0x00604C 01:A03C: D9        .byte $D9, $E9, $4C, $2C    ; 3C

; 3F-5F хитбокс игрока сидя
- D 1 - - - 0x006050 01:A040: EA        .byte $EA, $EA, $16, $2A    ; 40
- D 1 - - - 0x006054 01:A044: F0        .byte $F0, $F0, $0A, $1E    ; 44
- D 1 - - - 0x006058 01:A048: E5        .byte $E5, $ED, $20, $24    ; 48
- D 1 - - - 0x00605C 01:A04C: E1        .byte $E1, $E1, $28, $3C    ; 4C
- - - - - - 0x006060 01:A050: F1        .byte $F1, $E5, $14, $34    ; 50
- - - - - - 0x006064 01:A054: E1        .byte $E1, $C9, $28, $6C    ; 54
- - - - - - 0x006068 01:A058: D1        .byte $D1, $D1, $58, $5C    ; 58
- - - - - - 0x00606C 01:A05C: D1        .byte $D1, $E1, $48, $3C    ; 5C

; 5F-7F хитбокс игрока лежа
- D 1 - - - 0x006070 01:A060: EA        .byte $EA, $F4, $22, $16    ; 60
- D 1 - - - 0x006074 01:A064: F0        .byte $F0, $FA, $16, $0A    ; 64
- - - - - - 0x006078 01:A068: E5        .byte $E5, $F7, $2C, $10    ; 68
- D 1 - - - 0x00607C 01:A06C: E1        .byte $E1, $EB, $34, $28    ; 6C
- - - - - - 0x006080 01:A070: F1        .byte $F1, $EF, $20, $20    ; 70
- - - - - - 0x006084 01:A074: E1        .byte $E1, $D3, $34, $58    ; 74
- - - - - - 0x006088 01:A078: D1        .byte $D1, $DB, $64, $48    ; 78
- - - - - - 0x00608C 01:A07C: D1        .byte $D1, $EB, $54, $28    ; 7C

; 7F-9F хитбокс в воде
- D 1 - - - 0x006090 01:A080: F8        .byte $F8, $F4, $1A, $16    ; 80
- D 1 - - - 0x006094 01:A084: FE        .byte $FE, $FA, $0E, $0A    ; 84
- D 1 - - - 0x006098 01:A088: F3        .byte $F3, $F7, $24, $10    ; 88
- - - - - - 0x00609C 01:A08C: EF        .byte $EF, $EB, $2C, $28    ; 8C
- - - - - - 0x0060A0 01:A090: FF        .byte $FF, $EF, $18, $20    ; 90
- - - - - - 0x0060A4 01:A094: EF        .byte $EF, $D3, $2C, $58    ; 94
- - - - - - 0x0060A8 01:A098: DF        .byte $DF, $DB, $5C, $48    ; 98
- - - - - - 0x0060AC 01:A09C: DF        .byte $DF, $EB, $4C, $28    ; 9C

; 9F-BF хитбокс пуль игрока
- D 1 - - - 0x0060B0 01:A0A0: F3        .byte $F3, $F3, $18, $18    ; A0
- D 1 - - - 0x0060B4 01:A0A4: F7        .byte $F7, $F7, $10, $10    ; A4
- D 1 - - - 0x0060B8 01:A0A8: EC        .byte $EC, $F3, $26, $18    ; A8
- D 1 - - - 0x0060BC 01:A0AC: EB        .byte $EB, $EB, $28, $28    ; AC
- D 1 - - - 0x0060C0 01:A0B0: FB        .byte $FB, $EF, $14, $20    ; B0
- D 1 - - - 0x0060C4 01:A0B4: EB        .byte $EB, $D3, $28, $58    ; B4
- D 1 - - - 0x0060C8 01:A0B8: D3        .byte $D3, $EB, $28, $28    ; B8
- D 1 - - - 0x0060CC 01:A0BC: DB        .byte $DB, $EB, $48, $28    ; BC

; BF-DF хитбокс игрока в уровне с видом сверху
- D 1 - - - 0x0060D0 01:A0C0: F0        .byte $F0, $F4, $1E, $16    ; C0
- D 1 - - - 0x0060D4 01:A0C4: F6        .byte $F6, $FA, $12, $0A    ; C4
- D 1 - - - 0x0060D8 01:A0C8: EB        .byte $EB, $F7, $28, $10    ; C8
- D 1 - - - 0x0060DC 01:A0CC: E7        .byte $E7, $EB, $30, $28    ; CC
- - - - - - 0x0060E0 01:A0D0: F7        .byte $F7, $EF, $1C, $20    ; D0
- D 1 - - - 0x0060E4 01:A0D4: E7        .byte $E7, $D3, $30, $58    ; D4
- D 1 - - - 0x0060E8 01:A0D8: D7        .byte $D7, $DB, $60, $48    ; D8
- - - - - - 0x0060EC 01:A0DC: D7        .byte $D7, $EB, $50, $28    ; DC

; DF-FF новый хитбокс для гранатомета
                                        .byte $E7, $E7, $30, $30    ; E0
                                        .byte $EB, $EB, $28, $28    ; E4
                                        .byte $E0, $E7, $40, $30    ; E8
                                        .byte $DF, $DF, $40, $40    ; EC
                                        .byte $EF, $E3, $2C, $38    ; F0
                                        .byte $DF, $C7, $40, $70    ; F4
                                        .byte $C7, $DF, $40, $40    ; F8
                                        .byte $CF, $DF, $60, $40    ; FC

; ******************************************************************************************************************

sub_A1F1_вычетание_HP_объекта_после_попадания_пули:
                                        LDA ram_жизни_объектов_32bit,Y
C - - - - - 0x00620A 01:A1FA: C9 F0     CMP #con_HP_F0
C - - - - - 0x00620C 01:A1FC: B0 21     BCS bra_A217_попадание
; 8bit HP
                                        LDA ram_жизни_объектов_8bit,Y
                                        SEC
                                        SBC ram_пули_игрока_урон_младш,X
                                        STA ram_жизни_объектов_8bit,Y
; 16bit HP
                                        LDA ram_жизни_объектов_16bit,Y
                                        SBC ram_пули_игрока_урон_старш,X
                                        STA ram_жизни_объектов_16bit,Y
                                        BCS bra_A208_проверка_HP
; 32bit HP                                  
                                        LDA ram_жизни_объектов_32bit,Y
                                        SBC #$00
                                        BCC bra_A209_убить_объект
                                        STA ram_жизни_объектов_32bit,Y
; проверка на 00 HP по всем адресам
bra_A208_проверка_HP:
                                        LDA ram_жизни_объектов_8bit,Y
                                        ORA ram_жизни_объектов_16bit,Y
                                        ORA ram_жизни_объектов_32bit,Y
                                        BNE bra_A217_попадание
bra_A209_убить_объект:
                                        LDA ram_пули_игрока_индексы,X
                                        AND #$01    ; определить номер игрока
                                        STA ram_0012    ; сохраним индекс игрока для начисления очков
C - - - - - 0x006219 01:A209: A6 10     LDX ram_0010    ; загрузить индекс объекта
                                        JMP loc_A470_обработка_очков_и_установка_состояния_смерти_объекту
bra_A217_попадание:
C - - - - - 0x006227 01:A217: A9 11     LDA #con_sound_11
C - - - - - 0x006229 01:A219: 20 DE FD  JMP loc_0x01FDEE_play_sound

; ******************************************************************************************************************

sub_A255_обработчик_объектов:
; смена банка $8000 в зависимости от ID объекта
                                        LDA tbl_A273_выбор_prg_банка_объекта - $01,Y
                                        STA $5114
                                        TYA
C - - - - - 0x006268 01:A258: 0A        ASL
C - - - - - 0x006269 01:A259: A8        TAY
C - - - - - 0x00626A 01:A25A: B9 B4 A5  LDA tbl_A5B4_типы_объектов - $02,Y
C - - - - - 0x00626D 01:A25D: 85 02     STA ram_0002
C - - - - - 0x00626F 01:A25F: B9 B5 A5  LDA tbl_A5B4_типы_объектов - $01,Y
C - - - - - 0x006272 01:A262: 85 03     STA ram_0003
C - - - - - 0x006274 01:A264: BD 68 06  LDA ram_состояние_объектов_для_обработчика,X
C - - - - - 0x006277 01:A267: 0A        ASL
C - - - - - 0x006278 01:A268: A8        TAY
C - - - - - 0x006279 01:A269: B1 02     LDA (ram_0002),Y
C - - - - - 0x00627B 01:A26B: 85 04     STA ram_0004
C - - - - - 0x00627D 01:A26D: C8        INY
C - - - - - 0x00627E 01:A26E: B1 02     LDA (ram_0002),Y
C - - - - - 0x006280 01:A270: 85 05     STA ram_0005
C - - - - - 0x006282 01:A272: 6C 04 00  JMP (ram_0004)
; пустые и возможно новые объекты: 5C-7E

tbl_A273_выбор_prg_банка_объекта:
                                        .byte con_prg_bank + $33   ; con_obj_id_01
                                        .byte con_prg_bank + $33   ; con_obj_id_02
                                        .byte con_prg_bank + $2C   ; con_obj_id_03
                                        .byte con_prg_bank + $33   ; con_obj_id_04
                                        .byte con_prg_bank + $2C   ; con_obj_id_05
                                        .byte con_prg_bank + $2C   ; con_obj_id_06
                                        .byte con_prg_bank + $2C   ; con_obj_id_07
                                        .byte con_prg_bank + $33   ; con_obj_id_08
                                        .byte con_prg_bank + $2C   ; con_obj_id_09
                                        .byte con_prg_bank + $2B   ; con_obj_id_0A
                                        .byte con_prg_bank + $2B   ; con_obj_id_0B
                                        .byte con_prg_bank + $33   ; con_obj_id_0C
                                        .byte con_prg_bank + $2C   ; con_obj_id_0D
                                        .byte con_prg_bank + $33   ; con_obj_id_0E
                                        .byte con_prg_bank + $2C   ; con_obj_id_0F
                                        .byte con_prg_bank + $2C   ; con_obj_id_10
                                        .byte con_prg_bank + $2B   ; con_obj_id_11
                                        .byte con_prg_bank + $2D   ; con_obj_id_12
                                        .byte con_prg_bank + $2D   ; con_obj_id_13
                                        .byte con_prg_bank + $2D   ; con_obj_id_14
                                        .byte con_prg_bank + $2B   ; con_obj_id_15
                                        .byte con_prg_bank + $2B   ; con_obj_id_16
                                        .byte con_prg_bank + $2C   ; con_obj_id_17
                                        .byte con_prg_bank + $2B   ; con_obj_id_18
                                        .byte con_prg_bank + $2B   ; con_obj_id_19
                                        .byte con_prg_bank + $2C   ; con_obj_id_1A
                                        .byte con_prg_bank + $2B   ; con_obj_id_1B
                                        .byte con_prg_bank + $2F   ; con_obj_id_1C
                                        .byte con_prg_bank + $2C   ; con_obj_id_1D
                                        .byte con_prg_bank + $2C   ; con_obj_id_1E
                                        .byte con_prg_bank + $2C   ; con_obj_id_1F
                                        .byte con_prg_bank + $2B   ; con_obj_id_20
                                        .byte con_prg_bank + $33   ; con_obj_id_21
                                        .byte con_prg_bank + $2B   ; con_obj_id_22
                                        .byte con_prg_bank + $2B   ; con_obj_id_23
                                        .byte con_prg_bank + $33   ; con_obj_id_24
                                        .byte con_prg_bank + $2C   ; con_obj_id_25
                                        .byte con_prg_bank + $2E   ; con_obj_id_26
                                        .byte con_prg_bank + $2D   ; con_obj_id_27
                                        .byte con_prg_bank + $2F   ; con_obj_id_28
                                        .byte con_prg_bank + $2C   ; con_obj_id_29
                                        .byte con_prg_bank + $33   ; con_obj_id_2A
                                        .byte con_prg_bank + $2B   ; con_obj_id_2B
                                        .byte con_prg_bank + $33   ; con_obj_id_2C
                                        .byte con_prg_bank + $2B   ; con_obj_id_2D
                                        .byte con_prg_bank + $2B   ; con_obj_id_2E
                                        .byte con_prg_bank + $2C   ; con_obj_id_2F
                                        .byte con_prg_bank + $2C   ; con_obj_id_30
                                        .byte con_prg_bank + $2C   ; con_obj_id_31
                                        .byte con_prg_bank + $2E   ; con_obj_id_32
                                        .byte con_prg_bank + $2E   ; con_obj_id_33
                                        .byte con_prg_bank + $2E   ; con_obj_id_34
                                        .byte con_prg_bank + $2B   ; con_obj_id_35
                                        .byte con_prg_bank + $2B   ; con_obj_id_36
                                        .byte con_prg_bank + $2B   ; con_obj_id_37
                                        .byte con_prg_bank + $33   ; con_obj_id_38
                                        .byte con_prg_bank + $2C   ; con_obj_id_39
                                        .byte con_prg_bank + $2D   ; con_obj_id_3A
                                        .byte con_prg_bank + $2D   ; con_obj_id_3B
                                        .byte con_prg_bank + $2D   ; con_obj_id_3C
                                        .byte con_prg_bank + $2F   ; con_obj_id_3D
                                        .byte con_prg_bank + $2F   ; con_obj_id_3E
                                        .byte con_prg_bank + $2F   ; con_obj_id_3F
                                        .byte con_prg_bank + $2F   ; con_obj_id_40
                                        .byte con_prg_bank + $2F   ; con_obj_id_41
                                        .byte con_prg_bank + $2F   ; con_obj_id_42
                                        .byte con_prg_bank + $2C   ; con_obj_id_43
                                        .byte con_prg_bank + $2E   ; con_obj_id_44
                                        .byte con_prg_bank + $2E   ; con_obj_id_45
                                        .byte con_prg_bank + $2B   ; con_obj_id_46
                                        .byte con_prg_bank + $2C   ; con_obj_id_47
                                        .byte con_prg_bank + $2B   ; con_obj_id_48
                                        .byte con_prg_bank + $2B   ; con_obj_id_49 
                                        .byte con_prg_bank + $2B   ; con_obj_id_4A
                                        .byte con_prg_bank + $2E   ; con_obj_id_4B
                                        .byte con_prg_bank + $2E   ; con_obj_id_4C
                                        .byte con_prg_bank + $2C   ; con_obj_id_4D
                                        .byte con_prg_bank + $2C   ; con_obj_id_4E
                                        .byte con_prg_bank + $2E   ; con_obj_id_4F
                                        .byte con_prg_bank + $2E   ; con_obj_id_50
                                        .byte con_prg_bank + $2E   ; con_obj_id_51
                                        .byte con_prg_bank + $2E   ; con_obj_id_52
                                        .byte con_prg_bank + $2D   ; con_obj_id_53
                                        .byte con_prg_bank + $2D   ; con_obj_id_54
                                        .byte con_prg_bank + $2B   ; con_obj_id_55
                                        .byte con_prg_bank + $2B   ; con_obj_id_56
                                        .byte con_prg_bank + $2F   ; con_obj_id_57
                                        .byte con_prg_bank + $2F   ; con_obj_id_58
                                        .byte con_prg_bank + $2C   ; con_obj_id_59
                                        .byte con_prg_bank + $2E   ; con_obj_id_5A
                                        .byte con_prg_bank + $2C   ; con_obj_id_5B

tbl_A5B4_типы_объектов:
- D 1 - - - 0x0065C6 01:A5B6: 83 AD     .word _off001_AD83_01_бонусная_капсула - $02
- D 1 - - - 0x0065C8 01:A5B8: 8D AE     .word _off001_AE8D_02_обычная_пуля - $02
- D 1 - - - 0x0065CA 01:A5BA: EF AE     .word _off001_0x00AEEF_03_выбегающий_солдат_уровни_сбоку - $02
- D 1 - - - 0x0065CC 01:A5BC: 6E B2     .word _off001_B26E_04_бонусная_капсула_в_скале - $02
- D 1 - - - 0x0065CE 01:A5BE: 12 B3     .word _off001_0x00B312_05_солдат_кидающий_гранаты - $02
- D 1 - - - 0x0065D0 01:A5C0: A8 B3     .word _off001_0x00B3A8_06_граната - $02
- D 1 - - - 0x0065D2 01:A5C2: 3C B4     .word _off001_0x00B43C_07_стреляющий_солдат_лежа - $02
- D 1 - - - 0x0065C4 01:A5B4: DA AC     .word _off001_ACDC_08_бонусный_предмет - $02
- D 1 - - - 0x0065D6 01:A5C6: BE B4     .word _off001_0x00B4BE_09_стреляющий_солдат_стоя_уровни_сбоку - $02
- D 1 - - - 0x0065D8 01:A5C8: 86 B5     .word _off001_0x00B586_0A_вращающаяся_пушка - $02
- D 1 - - - 0x0065DA 01:A5CA: E1 B6     .word _off001_0x00B6E1_0B_скрытая_пушка_уровень_5 - $02
- D 1 - - - 0x0065DC 01:A5CC: 6C B8     .word _off001_B86C_0C_взрывы - $02
- D 1 - - - 0x0065DE 01:A5CE: 72 B8     .word _off001_0x00B872_0D_бетонная_дверь_или_ворота - $02
- D 1 - - - 0x0065E0 01:A5D0: 42 AE     .word _общий_RTS - $02  ; была обычная пуля вид сверху - нужно будет удалить
- D 1 - - - 0x0065E2 01:A5D2: 65 B9     .word _off001_0x00B965_0F_автоспавнер_гранат - $02
- D 1 - - - 0x0065E4 01:A5D4: D4 B9     .word _off001_0x00B9D4_10_автоспавнер_выбегающих_солдат - $02
- D 1 - - - 0x006604 01:A5F4: 01 80     .word _off001_0x004011_11_скрытая_пушка_уровень_1 - $02
- D 1 - - - 0x006606 01:A5F6: F6 84     .word _off001_0x004506_12_босс_1_вертолет - $02
- D 1 - - - 0x006608 01:A5F8: D9 80     .word _off001_0x0040E9_13_босс_1_пушка_вертолета - $02
- D 1 - - - 0x00660A 01:A5FA: 40 82     .word _off001_0x004250_14_босс_1_дверь_вертолета - $02
- D 1 - - - 0x00660C 01:A5FC: C2 8E     .word _off001_0x010ED2_15_ползающие_синии_пауки - $02
- D 1 - - - 0x00660E 01:A5FE: 81 8B     .word _off001_0x014B91_16_движущиеся_пушка - $02
- D 1 - - - 0x006610 01:A600: 04 8C     .word _off001_0x004C14_17_скрытый_снайпер - $02
- D 1 - - - 0x006612 01:A602: DA 8C     .word _off001_0x004CEA_18_скрытая_пушка_уровень_3 - $02
- D 1 - - - 0x006614 01:A604: EF 8D     .word _off001_0x004DFF_19_гаубица - $02
- D 1 - - - 0x006616 01:A606: CF 8E     .word _off001_0x004EDF_1A_пуля_гаубицы - $02
- D 1 - - - 0x006618 01:A608: A1 81     .word _off001_0x0081B1_1B_летающий_круглый_эмбрион - $02
- D 1 - - - 0x00661A 01:A60A: 6F 84     .word _off001_0x00847F_1C_босс_8_летящий_красный_шип - $02
- D 1 - - - 0x00661C 01:A60C: 57 8C     .word _off001_0x014C67_1D_падающая_платформа - $02
- D 1 - - - 0x00661E 01:A60E: AA 8D     .word _off001_0x014DBA_1E_блок_падающей_платформы - $02
- D 1 - - - 0x006620 01:A610: 01 80     .word _off001_0x014011_1F_солдат_на_танке - $02
- D 1 - - - 0x006622 01:A612: 01 80     .word _off001_0x01510E_20_движущийся_камень - $02
- D 1 - - - 0x006624 01:A614: 99 81     .word _off001_41A9_21_пуля_танка - $02
- D 1 - - - 0x006626 01:A616: E0 8D     .word _off001_0x014DF0_22_двойные_летающие_шарики - $02
- D 1 - - - 0x006628 01:A618: AD 80     .word _off001_0x0100BD_23_скрытая_пушка_2_уровень_5 - $02
- D 1 - - - 0x00662A 01:A61A: 77 81     .word _off001_0187_24_пуля_скрытой_пушки_2_уровень_5 - $02
- D 1 - - - 0x00662C 01:A61C: B2 81     .word _off001_0x0101C2_25_летающий_стреляющий_солдат - $02
- D 1 - - - 0x00662E 01:A61E: A9 83     .word _off001_0x0103B9_26_босс_5_летающие_шипы - $02
- D 1 - - - 0x006630 01:A620: 3D 8B     .word _off001_0x014B4D_27_босс_2_электричество - $02
- D 1 - - - 0x006632 01:A622: A9 84     .word _off001_0x0084B9_28_босс_8_летящий_синий_шип - $02
- D 1 - - - 0x006636 01:A626: 3B 8E     .word _off001_0x014E4B_29_лифт - $02
- D 1 - - - 0x006638 01:A628: C0 91     .word _off001_51D0_2A_пуля_робота_паука - $02
- D 1 - - - 0x00663A 01:A62A: 49 89     .word _off001_0x008959_2B_мутант_с_двумя_пастями - $02
- D 1 - - - 0x00663C 01:A62C: 3C 8A     .word _off001_8A4C_2C_пуля_мутанта_с_двумя_пастями - $02
- D 1 - - - 0x00663E 01:A62E: C4 8A     .word _off001_0x008AD4_2D_кокан_с_лицехватами - $02
- D 1 - - - 0x006640 01:A630: A0 8B     .word _off001_0x008BB0_2E_лицехват - $02
- D 1 - - - 0x006642 01:A632: 63 8F     .word _off001_0x004F73_2F_землятресение - $02
- D 1 - - - 0x006644 01:A634: FE 90     .word _off001_0x01510E_30_солдат_с_крыльями - $02
- D 1 - - - 0x006646 01:A636: 8D 92     .word _off001_0x01529D_31_автоспавнер_солдат_с_крыльями - $02
- D 1 - - - 0x006648 01:A638: F2 95     .word _off001_0x015602_32_босс_4_лазерная_установка - $02
- D 1 - - - 0x00664A 01:A63A: CB 92     .word _off001_0x0152DB_33_босс_4_лазерный_ствол - $02
- D 1 - - - 0x00664C 01:A63C: 0F 94     .word _off001_0x01541F_34_босс_4_лазерная_пуля - $02
- D 1 - - - 0x00664E 01:A63E: 01 80     .word _off001_0x008011_35_пасть_автоспавнер_летающих_шипов - $02
- D 1 - - - 0x006650 01:A640: 28 81     .word _off001_0x008138_36_летающий_шип - $02
- D 1 - - - 0x006652 01:A642: 06 82     .word _off001_0x008216_37_пушечный_череп - $02
- D 1 - - - 0x006654 01:A644: 89 82     .word _off001_8299_38_пуля_пушечного_черепа - $02
- D 1 - - - 0x006656 01:A646: B5 82     .word _off001_0x0082C5_39_падающий_потолок - $02 
- D 1 - - - 0x00665A 01:A64A: C2 99     .word _off001_0x0059D2_3A_босс_3_база_с_шарами - $02
- D 1 - - - 0x006660 01:A650: 06 92     .word _off001_0x005216_3B_босс_3_робот_паук - $02
- D 1 - - - 0x006664 01:A654: DE 9B     .word _off001_0x005BEE_3C_босс_3_стреляющий_шар - $02
- D 1 - - - 0x006666 01:A656: F2 8F     .word _off001_0x009002_3D_босс_7_пасть_черепа - $02
- D 1 - - - 0x006668 01:A658: 8D 8C     .word _off001_0x008C9D_3E_босс_7_грудная_клетка - $02
- D 1 - - - 0x00666A 01:A65A: C4 8D     .word _off001_0x008DD4_3F_босс_7_костяное_ухо - $02
- D 1 - - - 0x00666C 01:A65C: 08 8E     .word _off001_0x008E18_40_босс_7_большой_красный_шар - $02
- D 1 - - - 0x00666E 01:A65E: 41 8E     .word _off001_0x008E51_41_босс_7_летающие_шипы - $02
- D 1 - - - 0x006670 01:A660: A4 8E     .word _off001_0x008EB4_42_босс_7_ползающая_слизь - $02
- D 1 - - - 0x006674 01:A664: 66 82     .word _off001_0x010276_43_дверь_спавнер_выбегающих_солдат - $02
- D 1 - - - 0x006676 01:A666: 2B 84     .word _off001_0x01043B_44_босс_5_летающий_аппарат_череп - $02
- D 1 - - - 0x006678 01:A668: FC 82     .word _off001_0x01030C_45_босс_5_ползающий_черепок - $02
- D 1 - - - 0x00667A 01:A66A: EE 81     .word _off001_0x0141FE_46_круглая_турель - $02
- D 1 - - - 0x00667C 01:A66C: 22 83     .word _off001_0x014332_47_стреляющий_солдат_стоя_уровни_сверху - $02
- D 1 - - - 0x00667E 01:A66E: 71 88     .word _off001_0x010881_48_большая_пасть - $02
- D 1 - - - 0x006680 01:A670: 14 8B     .word _off001_0x010B24_49_спавнер_большой_пасти - $02
- D 1 - - - 0x006682 01:A672: 45 8C     .word _off001_0x010C55_4A_вращающийся_большой_череп - $02
- D 1 - - - 0x006684 01:A674: A7 91     .word _off001_0x0111B7_4B_красный_шип_автоспавн - $02
- D 1 - - - 0x006686 01:A676: EC 92     .word _off001_0x0112FC_4C_босс_6_шип_с_автонаводкой - $02
- D 1 - - - 0x006688 01:A678: D0 83     .word _off001_0x0043E0_4D_лопасти_начального_вертолета_игроков - $02
- D 1 - - - 0x00668A 01:A67A: C2 83     .word _off001_0x0143D2_4E_выбегающий_солдат_уровни_сверху - $02
- D 1 - - - 0x00668C 01:A67C: 28 98     .word _off001_0x011838_4F_босс_6_фаза_1_пасть - $02
- D 1 - - - 0x00668E 01:A67E: 14 94     .word _off001_0x011424_50_босс_6_фаза_2_череп - $02
- D 1 - - - 0x006690 01:A680: 32 9B     .word _off001_0x011B42_51_босс_6_фаза_2_змея - $02
- D 1 - - - 0x006694 01:A684: F2 97     .word _off001_0x011802_52_босс_6_фаза_2_пуля_с_автонаводкой - $02
- D 1 - - - 0x006696 01:A686: 27 87     .word _off001_0x014737_53_босс_2_зеленый_солдат_на_танке - $02
- D 1 - - - 0x006698 01:A688: F9 89     .word _off001_0x014A09_54_босс_2_красный_солдат_на_танке - $02
- D 1 - - - 0x00669A 01:A68A: E3 94     .word _off001_0x0154F3_55_голубой_летающий_шарик - $02
- D 1 - - - 0x00669C 01:A68C: B1 95     .word _off001_0x0155C1_56_спавнер_голубых_летающих_шариков - $02
- D 1 - - - 0x00669E 01:A68E: 94 85     .word _off001_0x0085A4_57_босс_8_глаз - $02
- D 1 - - - 0x0066A0 01:A690: BD 88     .word _off001_0x0088CD_58_босс_8_падающие_камни - $02
- D 1 - - - 0x0066A2 01:A692: 7A 84     .word _off001_0x00448A_59_гроза - $02
- D 1 - - - 0x0066A4 01:A694: A2 93     .word _off001_0x0113B2_5A_босс_6_дыра_автоспавнер_шипов - $02
- D 1 - - - 0x0066A6 01:A696: CA 93     .word _off001_0x0113DA_5B_смена_банков_chr - $02

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_AD83_01_бонусная_капсула:
- D 1 - I - 0x006D93 01:AD83: 8D AD     .word ofs_038_01_AD8D_01_активировать_объект ; 
- D 1 - I - 0x006D95 01:AD85: 03 AE     .word ofs_038_01_AE03_02 ; капсула летит и ждет когда по ней попадут 
- D 1 - I - 0x006D97 01:AD87: 3A AE     .word ofs_038_01_AE3A_03_создание_бонусного_предмета ; 
- D 1 - I - 0x006D99 01:AD89: FD A2     .word ofs_038_01_A2FD_04_обработка_анимации_взрыва_объекта ;
- D 1 - I - 0x006D9B 01:AD8B: 3D A3     .word ofs_038_01_A27A_05_удалить_объект ;  

; ******************************************************************************************************************

ofs_038_01_AD8D_01_активировать_объект:
C - - J - - 0x006D9D 01:AD8D: A9 00     LDA #$00
C - - - - - 0x006D9F 01:AD8F: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x006DA2 01:AD92: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x006DA5 01:AD95: A9 01     LDA #$01
C - - - - - 0x006DA7 01:AD97: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x006DAA 01:AD9A: A9 1D     LDA #$1D
C - - - - - 0x006DAC 01:AD9C: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x006DAF 01:AD9F: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x006DB2 01:ADA2: 29 30     AND #$30
C - - - - - 0x006DB4 01:ADA4: 4A        LSR
C - - - - - 0x006DB5 01:ADA5: 4A        LSR
C - - - - - 0x006DB6 01:ADA6: A8        TAY
C - - - - - 0x006DB7 01:ADA7: B9 EF AD  LDA tbl_ADEF_скорость,Y
C - - - - - 0x006DBA 01:ADAA: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x006DBD 01:ADAD: B9 F0 AD  LDA tbl_ADEF_скорость + $01,Y
C - - - - - 0x006DC0 01:ADB0: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x006DC3 01:ADB3: B9 F1 AD  LDA tbl_ADEF_скорость + $02,Y
C - - - - - 0x006DC6 01:ADB6: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x006DC9 01:ADB9: B9 F2 AD  LDA tbl_ADEF_скорость + $03,Y
C - - - - - 0x006DCC 01:ADBC: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x006DCF 01:ADBF: 98        TYA
C - - - - - 0x006DD0 01:ADC0: 4A        LSR
C - - - - - 0x006DD1 01:ADC1: A8        TAY
C - - - - - 0x006DD2 01:ADC2: B9 E7 AD  LDA tbl_ADE7_позиция,Y
C - - - - - 0x006DD5 01:ADC5: F0 03     BEQ bra_ADCA
C - - - - - 0x006DD7 01:ADC7: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
bra_ADCA:
C - - - - - 0x006DDA 01:ADCA: B9 E8 AD  LDA tbl_ADE7_позиция + $01,Y
C - - - - - 0x006DDD 01:ADCD: F0 03     BEQ bra_ADD2
C - - - - - 0x006DDF 01:ADCF: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
bra_ADD2:
C - - - - - 0x006DE2 01:ADD2: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006DE5 01:ADD5: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x006DE8 01:ADD8: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006DEB 01:ADDB: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x006DEE 01:ADDE: 20 D3 A6  JSR sub_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x006DF1 01:ADE1: 20 27 AE  JSR sub_AE27
C - - - - - 0x006DF4 01:ADE4: 4C D7 A2  JMP loc_A2D7_увеличить_состояние_объекта

tbl_ADE7_позиция:
;                                              +---------- pos_Y
;                                              |    +----- pos_X
;                                              |    |
- D 1 - - - 0x006DF7 01:ADE7: 50        .byte $50, $F8   ; 00 
- D 1 - - - 0x006DF9 01:ADE9: 00        .byte $00, $08   ; 10 
- D 1 - - - 0x006DFB 01:ADEB: D0        .byte $D0, $00   ; 20 
- D 1 - - - 0x006DFD 01:ADED: 30        .byte $30, $08   ; 30 

tbl_ADEF_скорость:
; 00 
- D 1 - - - 0x006DFF 01:ADEF: 00 FE     .word $FE00 ; Y
- D 1 - - - 0x006E01 01:ADF1: 00 FE     .word $FE00 ; X
; 10 
- D 1 - - - 0x006E03 01:ADF3: 00 FE     .word $FE00 ; Y
- D 1 - - - 0x006E05 01:ADF5: 00 02     .word $0200 ; X
; 20 
- D 1 - - - 0x006E07 01:ADF7: 00 FE     .word $FE00 ; Y
- D 1 - - - 0x006E09 01:ADF9: 00 02     .word $0200 ; X
; 30 
- D 1 - - - 0x006E0B 01:ADFB: 00 FE     .word $FE00 ; Y
- D 1 - - - 0x006E0D 01:ADFD: 00 02     .word $0200 ; X

; ******************************************************************************************************************

ofs_038_01_AE03_02:
C - - J - - 0x006E13 01:AE03: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x006E16 01:AE06: 29 30     AND #$30
C - - - - - 0x006E18 01:AE08: 4A        LSR
C - - - - - 0x006E19 01:AE09: 4A        LSR
C - - - - - 0x006E1A 01:AE0A: 4A        LSR
C - - - - - 0x006E1B 01:AE0B: 4A        LSR
C - - - - - 0x006E1C 01:AE0C: A8        TAY
C - - - - - 0x006E1D 01:AE0D: B9 FF AD  LDA tbl_ADFF,Y
C - - - - - 0x006E20 01:AE10: D0 08     BNE bra_AE1A
C - - - - - 0x006E22 01:AE12: A0 02     LDY #$02
C - - - - - 0x006E24 01:AE14: 20 6E A9  JSR sub_A96E_смена_скорости_движение_волной
C - - - - - 0x006E27 01:AE17: 4C 1F AE  JMP loc_AE1F
bra_AE1A:
C - - - - - 0x006E2A 01:AE1A: A0 02     LDY #$02
C - - - - - 0x006E2C 01:AE1C: 20 8E A9  JSR sub_A98E
loc_AE1F:
C D 1 - - - 0x006E2F 01:AE1F: A9 07     LDA #$07
C - - - - - 0x006E31 01:AE21: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x006E34 01:AE24: 20 D3 A6  JSR sub_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
sub_AE27:
C - - - - - 0x006E37 01:AE27: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x006E3A 01:AE2A: 38        SEC
C - - - - - 0x006E3B 01:AE2B: E5 72     SBC ram_скорость_камеры_Y
C - - - - - 0x006E3D 01:AE2D: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x006E40 01:AE30: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x006E43 01:AE33: 18        CLC
C - - - - - 0x006E44 01:AE34: 65 62     ADC ram_скорость_камеры_X
C - - - - - 0x006E46 01:AE36: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x006E49 01:AE39: 60        RTS
C - - - - - 0x006E49 01:AE39: 60        RTS

tbl_ADFF:
- D 1 - - - 0x006E0F 01:ADFF: 00        .byte $00   ; 00 
- D 1 - - - 0x006E10 01:AE00: 00        .byte $00   ; 10 
- D 1 - - - 0x006E11 01:AE01: 01        .byte $01   ; 20 
- D 1 - - - 0x006E12 01:AE02: 00        .byte $00   ; 30 

; ******************************************************************************************************************

ofs_038_01_AE3A_03_создание_бонусного_предмета:
loc_ABBD_создание_бонусного_предмета:
                                        LDY #$08    ; ID бонусный предмет
C - - - - - 0x006BCD 01:ABBD: 20 C8 AB  JSR loc_ABC8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x006BD0 01:ABC0: B0 3A     BCS bra_AE3F
- - - - - - 0x006BD2 01:ABC2: 20 1C F7  JSR sub_0x01F72C_поиск_вражеской_пули_в_слотах_объектов
                                        JSR sub_ABCD_попытка_создать_новый_объект_на_позиции_текущего_объекта
bra_AE3F:
C - - - - - 0x006E4F 01:AE3F: 4C 9A A2  JMP loc_A29A_обработка_состояния_смерти_объекта

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_B26E_04_бонусная_капсула_в_скале:
- D 1 - I - 0x00727E 01:B26E: 78 B2     .word ofs_038_04_B278_01_активировать_объект ; 
- D 1 - I - 0x007280 01:B270: A4 B2     .word ofs_038_04_B2A4_02 ; коробка открывается и закрывается 
- D 1 - I - 0x007282 01:B272: 03 B3     .word ofs_038_04_B303_03 ; 
- D 1 - I - 0x007284 01:B274: FD A2     .word ofs_038_04_A2FD_04_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x007286 01:B276: 3D A3     .word ofs_038_04_A27A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_04_B278_01_активировать_объект:
C - - J - - 0x007288 01:B278: A9 9D     LDA #$9D
C - - - - - 0x00728A 01:B27A: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00728D 01:B27D: A9 01     LDA #$01
C - - - - - 0x00728F 01:B27F: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x007292 01:B282: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x007295 01:B285: 0A        ASL
C - - - - - 0x007296 01:B286: 0A        ASL
C - - - - - 0x007297 01:B287: 0A        ASL
C - - - - - 0x007298 01:B288: 0A        ASL
C - - - - - 0x007299 01:B289: A9 04     LDA #$04    ; Y ось
C - - - - - 0x00729B 01:B28B: 90 02     BCC bra_B28F
C - - - - - 0x00729D 01:B28D: A9 14     LDA #$14    ; Y ось
bra_B28F:
C - - - - - 0x0072A1 01:B291: 20 B9 AA  JSR sub_AAB9_сдвинуть_объект_по_Y_X
C - - - - - 0x0072A4 01:B294: A9 20     LDA #$20
C - - - - - 0x0072A6 01:B296: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0072A9 01:B299: A9 01     LDA #$01
C - - - - - 0x0072AB 01:B29B: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0072AE 01:B29E: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0072B1 01:B2A1: 4C D7 A2  JMP loc_A2D7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_04_B2A4_02:
C - - J - - 0x0072B4 01:B2A4: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0072B7 01:B2A7: C9 D0     CMP #$D0
C - - - - - 0x0072B9 01:B2A9: 90 03     BCC bra_B2AE
C - - - - - 0x0072BB 01:B2AB: 4C 75 A2  JMP loc_A27A_удалить_объект
bra_B2AE:
C - - - - - 0x0072BE 01:B2AE: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0072C1 01:B2B1: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0072C4 01:B2B4: D0 48     BNE bra_B2FE_RTS
C - - - - - 0x0072C6 01:B2B6: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0072C9 01:B2B9: B9 FF B2  LDA tbl_B2FF,Y
C - - - - - 0x0072CC 01:B2BC: 20 9A A8  JSR sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер
C - - - - - 0x0072CF 01:B2BF: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0072D2 01:B2C2: A9 01     LDA #$01
C - - - - - 0x0072D4 01:B2C4: B0 31     BCS bra_B2F7
C - - - - - 0x0072D6 01:B2C6: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0072D9 01:B2C9: D0 10     BNE bra_B2DB
C - - - - - 0x0072DB 01:B2CB: C8        INY
C - - - - - 0x0072DC 01:B2CC: C0 04     CPY #$04
C - - - - - 0x0072DE 01:B2CE: 90 25     BCC bra_B2F5
C - - - - - 0x0072E0 01:B2D0: 88        DEY
C - - - - - 0x0072E1 01:B2D1: 88        DEY
C - - - - - 0x0072E2 01:B2D2: A9 1D     LDA #$1D
C - - - - - 0x0072E4 01:B2D4: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0072E7 01:B2D7: A9 40     LDA #$40
C - - - - - 0x0072E9 01:B2D9: D0 0C     BNE bra_B2E7    ; jmp
bra_B2DB:
C - - - - - 0x0072EB 01:B2DB: A9 9D     LDA #$9D
C - - - - - 0x0072ED 01:B2DD: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0072F0 01:B2E0: A9 50     LDA #$50
C - - - - - 0x0072F2 01:B2E2: 88        DEY
C - - - - - 0x0072F3 01:B2E3: 10 10     BPL bra_B2F5
C - - - - - 0x0072F5 01:B2E5: C8        INY
C - - - - - 0x0072F6 01:B2E6: C8        INY
bra_B2E7:
C - - - - - 0x0072F7 01:B2E7: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0072FA 01:B2EA: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0072FD 01:B2ED: 49 01     EOR #$01
C - - - - - 0x0072FF 01:B2EF: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x007302 01:B2F2: 4C FA B2  JMP loc_B2FA
bra_B2F5:
C - - - - - 0x007305 01:B2F5: A9 08     LDA #$08
bra_B2F7:
C - - - - - 0x007307 01:B2F7: 9D E6 06  STA ram_счетчики_для_объектов,X
loc_B2FA:
C D 1 - - - 0x00730A 01:B2FA: 98        TYA
C - - - - - 0x00730B 01:B2FB: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
bra_B2FE_RTS:
C - - - - - 0x00730E 01:B2FE: 60        RTS

tbl_B2FF:
- D 1 - - - 0x00730F 01:B2FF: 0E        .byte $0E   ; 00 
- D 1 - - - 0x007310 01:B300: 0F        .byte $0F   ; 01 
- D 1 - - - 0x007311 01:B301: 11        .byte $11   ; 02 
- D 1 - - - 0x007312 01:B302: 12        .byte $12   ; 03 

; ******************************************************************************************************************

ofs_038_04_B303_03:
C - - J - - 0x007313 01:B303: A9 0D     LDA #$0D
C - - - - - 0x007315 01:B305: 20 9A A8  JSR sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер
C - - - - - 0x007318 01:B308: B0 F4     BCS bra_B2FE_RTS
                                        JMP loc_ABBD_создание_бонусного_предмета

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_ACDC_08_бонусный_предмет:
- D 1 - I - 0x006CEC 01:ACDC: E2 AC     .word ofs_038_08_ACE2_01_активировать_объект ; 
- D 1 - I - 0x006CEE 01:ACDE: 10 AD     .word ofs_038_08_AD10_02 ;
- D 1 - I - 0x006CF0 01:ACE0: 5C AD     .word ofs_038_08_AD5C_03 ; выпал из капсулы/ящика, опускается и затем лежит на земле

; ******************************************************************************************************************

ofs_038_08_ACE2_01_активировать_объект:
C - - J - - 0x006CF2 01:ACE2: A9 00     LDA #$00
C - - - - - 0x006CF4 01:ACE4: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x006CF7 01:ACE7: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x006CFA 01:ACEA: A9 80     LDA #$80
C - - - - - 0x006CFC 01:ACEC: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x006CFF 01:ACEF: A9 F0     LDA #con_HP_F0
C - - - - - 0x006D01 01:ACF1: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x006D04 01:ACF4: A5 5D     LDA ram_тип_уровней
C - - - - - 0x006D06 01:ACF6: 0A        ASL
C - - - - - 0x006D07 01:ACF7: A8        TAY
C - - - - - 0x006D08 01:ACF8: B9 0C AD  LDA tbl_AD0C_скорость_Y,Y
C - - - - - 0x006D0B 01:ACFB: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x006D0E 01:ACFE: B9 0D AD  LDA tbl_AD0C_скорость_Y + $01,Y
C - - - - - 0x006D11 01:AD01: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x006D14 01:AD04: 20 07 A7  JSR sub_A707_обработка_позиции_объекта_по_Y
C - - - - - 0x006D17 01:AD07: A9 F0     LDA #$F0    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_A2D7_увеличить_состояние_объекта

tbl_AD0C_скорость_Y:
- D 1 - - - 0x006D1C 01:AD0C: 40 FC     .word $FC40 ; 00 уровни вид сверху
- D 1 - - - 0x006D1E 01:AD0E: 00 FD     .word $FD00 ; 01 уровни вид сбоку

; ******************************************************************************************************************

ofs_038_08_AD10_02:
C - - J - - 0x006D20 01:AD10: 20 6F AD  JSR sub_AD6F
C - - - - - 0x006D23 01:AD13: 20 07 A7  JSR sub_A707_обработка_позиции_объекта_по_Y
C - - - - - 0x006D26 01:AD16: A5 5D     LDA ram_тип_уровней
C - - - - - 0x006D28 01:AD18: F0 0C     BEQ bra_AD26_вид_сбоку
; вид сверху
C - - - - - 0x006D2A 01:AD1A: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x006D2D 01:AD1D: 30 35     BMI bra_AD54
C - - - - - 0x006D2F 01:AD1F: C9 03     CMP #$03
C - - - - - 0x006D31 01:AD21: 90 31     BCC bra_AD54
C - - - - - 0x006D33 01:AD23: 4C D7 A2  JMP loc_A2D7_увеличить_состояние_объекта
bra_AD26_вид_сбоку:
C - - - - - 0x006D36 01:AD26: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006D39 01:AD29: C9 08     CMP #$08
C - - - - - 0x006D3B 01:AD2B: 90 27     BCC bra_AD54
C - - - - - 0x006D3D 01:AD2D: BC 8E 07  LDY ram_позиция_объектов_Y_старш,X
C - - - - - 0x006D40 01:AD30: D0 22     BNE bra_AD54
C - - - - - 0x006D42 01:AD32: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x006D45 01:AD35: 10 0D     BPL bra_AD44_падает
; набирает высоту
C - - - - - 0x006D47 01:AD37: A9 F8     LDA #$F8    ; добавочная позиция по Y
C - - - - - 0x006D49 01:AD39: 20 0A A8  JSR sub_A80A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x006D4C 01:AD3C: A8        TAY
C - - - - - 0x006D4D 01:AD3D: B9 D8 F8  LDA tbl_0x01F8E8,Y
C - - - - - 0x006D50 01:AD40: F0 12     BEQ bra_AD54
C - - - - - 0x006D52 01:AD42: D0 0A     BNE bra_AD4E    ; jmp
bra_AD44_падает:
C - - - - - 0x006D54 01:AD44: A9 08     LDA #$08    ; добавочная позиция по Y
C - - - - - 0x006D56 01:AD46: 20 0A A8  JSR sub_A80A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x006D59 01:AD49: F0 09     BEQ bra_AD54
C - - - - - 0x006D5B 01:AD4B: 20 3D A8  JSR sub_A83D_установить_Y_позицию_объекта_исходя_из_поверхности
bra_AD4E:
C - - - - - 0x006D5E 01:AD4E: 20 C7 A7  JSR sub_A7C7_очистить_скорость_X_Y
                                        BEQ bra_AD62    ; jmp
bra_AD54:
C - - - - - 0x006D64 01:AD54: A9 18     LDA #$18
C - - - - - 0x006D66 01:AD56: 20 CB AA  JSR sub_AACB_прибавить_скорость_Y
C - - - - - 0x006D69 01:AD59: 4C 62 AD  JMP loc_AD62

; ******************************************************************************************************************

ofs_038_08_AD5C_03:
C - - J - - 0x006D6C 01:AD5C: 20 6F AD  JSR sub_AD6F
C - - - - - 0x006D6F 01:AD5F: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
loc_AD62:
bra_AD62:
C D 1 - - - 0x006D72 01:AD62: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x006D74 01:AD64: 4A        LSR
C - - - - - 0x006D75 01:AD65: B0 1B     BCS bra_AD82_RTS
C - - - - - 0x006D77 01:AD67: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x006D7A 01:AD6A: D0 16     BNE bra_AD82_RTS
C - - - - - 0x006D7C 01:AD6C: 4C 75 A2  JMP loc_A27A_удалить_объект
sub_AD6F:
; мигание призов перед исчезновением
                                        LDA ram_счетчики_для_объектов,X
                                        CMP #$30
                                        BCS bra_AD6F
                                        AND #$01
                                        BEQ bra_AD77
bra_AD6F:
C - - - - - 0x006D7F 01:AD6F: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x006D82 01:AD72: 29 0F     AND #$0F
C - - - - - 0x006D84 01:AD74: 18        CLC
C - - - - - 0x006D85 01:AD75: 69 08     ADC #$08
bra_AD77:
C - - - - - 0x006D87 01:AD77: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x006D8A 01:AD7A: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x006D8C 01:AD7C: 4A        LSR
C - - - - - 0x006D8D 01:AD7D: 29 03     AND #$03
C - - - - - 0x006D8F 01:AD7F: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
bra_AD82_RTS:
C - - - - - 0x006D92 01:AD82: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_AE8D_02_обычная_пуля:
- D 1 - I - 0x006E9D 01:AE8D: 95 AE     .word ofs_038_02_AE95_01_активация_объекта_дульная_вспышка ; 
- D 1 - I - 0x006E9F 01:AE8F: A9 AE     .word ofs_038_02_AEA9_02 ; 
- D 1 - I - 0x006EA1 01:AE91: C9 AE     .word ofs_038_02_AEC9_03 ; пуля в полете, в ожидании касания игрока или фона
                                        .word ofs_038_02_AECA_04 ; пуля врезалась, подготовка спрайта и счетчика
                                        .word ofs_038_02_AECB_05 ; 

; ******************************************************************************************************************

ofs_038_02_AE95_01_активация_объекта_дульная_вспышка:
loc_AE95_подготовка_к_выстрелу_дульная_вспышка:
C D 1 J - - 0x006EA5 01:AE95: A9 80     LDA #$81    ; нет коллизий с игроком и пулями игрока
C - - - - - 0x006EA7 01:AE97: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x006EAA 01:AE9A: A9 02     LDA #$02
C - - - - - 0x006EAC 01:AE9C: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x006EB1 01:AEA1: 9D 08 05  STA ram_кадр_объекта_или_пули,X ; кадр дульной вспышки
C - - - - - 0x006EB4 01:AEA4: A9 04     LDA #$04    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_A2D7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_02_AEA9_02:
ofs_038_21_6EB9_02:
ofs_038_24_8188_02:
C - - J - - 0x006EB9 01:AEA9: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x006EBC 01:AEAC: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x006EBF 01:AEAF: D0 3D     BNE bra_AEC1_RTS
C - - - - - 0x006EC1 01:AEB1: BC 48 07  LDY ram_скролл_объекта_Y,X
loc_AEAC:
C - - - - - 0x006EC4 01:AEB4: B9 C3 AE  LDA tbl_AEC3_кадры_пуль,Y
C - - - - - 0x006EC7 01:AEB7: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x006ECA 01:AEBA: B9 C6 AE  LDA tbl_AEC6_таймеры_жизни_пуль,Y
C - - - - - 0x006ECD 01:AEBD: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
                                        LDA ram_характеристики_объектов,X
                                        ORA tbl_AEC7_характеристики_пуль,Y
                                        STA ram_характеристики_объектов,X
                                        LDA tbl_AEC8_состояние_хибокса,Y
                                        STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x006ED0 01:AEC0: 4C D7 A2  JMP loc_A2D7_увеличить_состояние_объекта
bra_AEC1_RTS:
                                        RTS

tbl_AEC3_кадры_пуль:
- D 1 - - - 0x006ED3 01:AEC3: 05        .byte $05   ; 00 
- D 1 - - - 0x006ED4 01:AEC4: 06        .byte $06   ; 01 
- D 1 - - - 0x006ED5 01:AEC5: 06        .byte $06   ; 02 

tbl_AEC6_таймеры_жизни_пуль:
- D 1 - - - 0x006ED6 01:AEC6: 50        .byte $50   ; 00 
- D 1 - - - 0x006ED7 01:AEC7: 50        .byte $50   ; 01 
- D 1 - - - 0x006ED8 01:AEC8: 38        .byte $38   ; 02 

tbl_AEC7_характеристики_пуль:
                                        .byte $01   ; 00, пуля (любая) без дополнительных свойств
                                        .byte $04   ; 01, пуля (любая) без дополнительных свойств
                                        .byte $04   ; 02, бронебойная пуля объекта (пролетает насквозь игроков)

tbl_AEC8_состояние_хибокса:
                                        .byte $00   ; 01, пуля (любая) без дополнительных свойств
                                        .byte $80   ; 01, пуля (любая) без дополнительных свойств
                                        .byte $80   ; 02, бронебойная пуля объекта (пролетает насквозь игроков)

; ******************************************************************************************************************

ofs_038_02_AEC9_03:
C - - J - - 0x006ED9 01:AEC9: FE E6 06  INC ram_счетчики_для_объектов,X
C - - - - - 0x006EDC 01:AECC: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x006EDF 01:AECF: 4A        LSR
C - - - - - 0x006EE0 01:AED0: 4A        LSR
C - - - - - 0x006EE1 01:AED1: 29 03     AND #$03    ; смена палитры
C - - - - - 0x006EE3 01:AED3: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x006EE6 01:AED6: 20 D3 A6  JSR sub_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
                                        LDA ram_тип_уровней
                                        BEQ bra_AE6E
; уровни с видом сверху
C - - - - - 0x006E6C 01:AE5C: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x006E6F 01:AE5F: F0 0B     BEQ bra_AE6C_пуля_врезалась
                                        LDA ram_характеристики_объектов,X
                                        AND #$01    ; бит - пуля объекта пролетает насквозь стен
                                        BNE bra_AEEE_RTS
C - - - - - 0x006E71 01:AE61: A9 00     LDA #$00
C - - - - - 0x006E73 01:AE63: 20 0A A8  JSR sub_A80A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x006E76 01:AE66: A8        TAY
C - - - - - 0x006E77 01:AE67: B9 CC F8  LDA tbl_0x01F8DC,Y
C - - - - - 0x006E7A 01:AE6A: F0 03     BEQ bra_AEEE_RTS
loc_AE6A_пуля_врезалась:
bra_AE6C_пуля_врезалась:
C - - - - - 0x006E7C 01:AE6C: 4C D7 A2  JMP loc_A2D7_увеличить_состояние_объекта
bra_AE6E:
                                        LDA ram_характеристики_объектов,X
                                        AND #$01    ; бит - пуля пролетает насквозь стен
                                        BNE bra_AEEE_RTS
C - - - - - 0x006EE9 01:AED9: A9 F8     LDA #$F8
C - - - - - 0x006EEB 01:AEDB: 20 0A A8  JSR sub_A80A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x006EEE 01:AEDE: A8        TAY
C - - - - - 0x006EEF 01:AEDF: A5 8F     LDA ram_конфиг_уровня_для_пуль_объектов
C - - - - - 0x006EF1 01:AEE1: D0 06     BNE bra_AEE9
; 00 - 5й и 8й уровень: скорей всего не проверять диагональный платформы и платформы с которых можно спрыгнуть
C - - - - - 0x006EF3 01:AEE3: B9 D8 F8  LDA tbl_0x01F8E8,Y
C - - - - - 0x006EF6 01:AEE6: D0 D8     BEQ bra_AEEE_RTS
                                        BNE bra_AE6C_пуля_врезалась ; jmp
bra_AEE9:
C - - - - - 0x006EF9 01:AEE9: B9 CC F8  LDA tbl_0x01F8DC,Y
C - - - - - 0x006EFC 01:AEEC: D0 D2     BNE bra_AE6C_пуля_врезалась
bra_AEEE_RTS:
C - - - - - 0x006EFE 01:AEEE: 60        RTS

; ******************************************************************************************************************

ofs_038_02_AECA_04:
ofs_038_21_6E80_04:
ofs_038_24_A27A_04:
ofs_038_2A_A27A_04:
ofs_038_2C_A27A_03:
ofs_038_38_82B0_03:
                                        LDA #$04    ; кадр когда пуля врезалась
                                        STA ram_кадр_объекта_или_пули,X
                                        LDA #$03
                                        STA ram_счетчики_для_объектов,X
                                        LDA #$02    ; палитра
                                        STA ram_атрибуты_спрайта_объекта_или_пули,X
                                        LDA #$81
                                        STA ram_состояние_хитбоксов_объектов,X
                                        LDA #$00
                                        STA ram_характеристики_объектов,X
                                        JMP loc_A2D7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_02_AECB_05:
ofs_038_21_6E88_05:
ofs_038_24_A280_05:
ofs_038_2A_A288_05:
ofs_038_2C_A282_04:
ofs_038_38_82B4_04:
C - - J - - 0x006E88 01:AE78: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x006E95 01:AE85: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x006E98 01:AE88: D0 E5     BNE bra_AEEE_RTS
C - - - - - 0x006E9A 01:AE8A: 4C 75 A2  JMP loc_A27A_удалить_объект

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_41A9_21_пуля_танка:
- D 0 - I - 0x0141A9 05:8199: A3 81     .word ofs_038_21_81A3_01_активация_объекта ; 
- D 0 - I - 0x0141AB 05:819B: A9 AE     .word ofs_038_21_6EB9_02 ; 
- D 0 - I - 0x0141AD 05:819D: DB 81     .word ofs_038_21_81DB_03 ; 
- D 0 - I - 0x0141AF 05:819F: 70 AE     .word ofs_038_21_6E80_04 ; 
- D 0 - I - 0x0141B1 05:81A1: 78 AE     .word ofs_038_21_6E88_05 ; 

; ******************************************************************************************************************

ofs_038_21_81A3_01_активация_объекта:
C - - J - - 0x0141B3 05:81A3: A9 02     LDA #$02
C - - - - - 0x0141B5 05:81A5: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0141C0 05:81B0: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0141C3 05:81B3: 0A        ASL
C - - - - - 0x0141C4 05:81B4: 0A        ASL
                                        LDY ram_option_сложность
                                        CLC
                                        ADC tbl_81CE_добавочный_индекс,Y
C - - - - - 0x0141C5 05:81B5: A8        TAY
C - - - - - 0x0141C6 05:81B6: B9 CF 81  LDA tbl_81CF_скорость,Y
C - - - - - 0x0141C9 05:81B9: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0141CC 05:81BC: B9 D0 81  LDA tbl_81CF_скорость + $01,Y
C - - - - - 0x0141CF 05:81BF: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0141D2 05:81C2: B9 D1 81  LDA tbl_81CF_скорость + $02,Y
C - - - - - 0x0141D5 05:81C5: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0141D8 05:81C8: B9 D2 81  LDA tbl_81CF_скорость + $03,Y
C - - - - - 0x0141DB 05:81CB: 9D CA 06  STA ram_скорость_объектов_X_старш,X
                                        JMP loc_AE95_подготовка_к_выстрелу_дульная_вспышка
C - - - - - 0x0141DE 05:81CE: 60        RTS

tbl_81CE_добавочный_индекс:
                                        .byte off_81CF_скорость_изи - tbl_81CF_скорость     ; изи
                                        .byte off_81CF_скорость_нормал - tbl_81CF_скорость  ; нормал
                                        .byte off_81CF_скорость_хард - tbl_81CF_скорость    ; хард

tbl_81CF_скорость:
off_81CF_скорость_изи:
; 00 левая пушка - изи
- D 0 - - - 0x0141DF 05:81CF: E8 01     .word $01E8 ; Y
- D 0 - - - 0x0141E1 05:81D1: 6C FF     .word $FF6C ; X
; 01 правая пушка - изи
- D 0 - - - 0x0141E3 05:81D3: E8 01     .word $01E8 ; Y
- D 0 - - - 0x0141E5 05:81D5: 94 00     .word $0094 ; X
; 02 центральная пушка - изи
- D 0 - - - 0x0141E7 05:81D7: 00 02     .word $0200 ; Y
- D 0 - - - 0x0141E9 05:81D9: 00 00     .word $0000 ; X
off_81CF_скорость_нормал:
; 03 левая пушка - нормал
- D 0 - - - 0x0141DF 05:81CF: E8 01     .word $02E0 ; Y
- D 0 - - - 0x0141E1 05:81D1: 6C FF     .word $FF00 ; X
; 04 правая пушка - нормал
- D 0 - - - 0x0141E3 05:81D3: E8 01     .word $02E0 ; Y
- D 0 - - - 0x0141E5 05:81D5: 94 00     .word $0100 ; X
; 05 центральная пушка - нормал
- D 0 - - - 0x0141E7 05:81D7: 00 02     .word $0300 ; Y
- D 0 - - - 0x0141E9 05:81D9: 00 00     .word $0000 ; X
off_81CF_скорость_хард:
; 06 левая пушка - хард
- D 0 - - - 0x0141DF 05:81CF: E8 01     .word $03E0 ; Y
- D 0 - - - 0x0141E1 05:81D1: 6C FF     .word $FE80 ; X
; 07 правая пушка - хард
- D 0 - - - 0x0141E3 05:81D3: E8 01     .word $03E0 ; Y
- D 0 - - - 0x0141E5 05:81D5: 94 00     .word $0180 ; X
; 08 центральная пушка - хард
- D 0 - - - 0x0141E7 05:81D7: 00 02     .word $0400 ; Y
- D 0 - - - 0x0141E9 05:81D9: 00 00     .word $0000 ; X

; ******************************************************************************************************************

ofs_038_21_81DB_03:
C - - J - - 0x0141EB 05:81DB: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x0141ED 05:81DD: 29 01     AND #$01
C - - - - - 0x0141EF 05:81DF: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0141F2 05:81E2: 20 D3 A6  JSR sub_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x0141F5 05:81E5: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x0141F8 05:81E8: D0 03     BNE bra_81ED_RTS
C - - - - - 0x0141FA 05:81EA: 4C D7 A2  JMP loc_A2D7_увеличить_состояние_объекта
bra_81ED_RTS:
C - - - - - 0x0141FD 05:81ED: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0187_24_пуля_скрытой_пушки_2_уровень_5:
- D 0 - I - 0x010187 04:8177: 7D 81     .word ofs_038_24_817D_01_активация_объекта ; 
                                        .word ofs_038_24_8188_02 ; 
- D 0 - I - 0x010189 04:8179: 9F 81     .word ofs_038_24_819F_03 ; 
- - - - - - 0x01018B 04:817B: 75 A2     .word ofs_038_24_A27A_04 ;  
                                        .word ofs_038_24_A280_05 ; 

; ******************************************************************************************************************

ofs_038_24_817D_01_активация_объекта:
                                        LDA #$02
                                        STA ram_скролл_объекта_Y,X
                                        LDA ram_option_сложность
C - - - - - 0x01019A 04:818A: 0A        ASL
C - - - - - 0x01019B 04:818B: A8        TAY
C - - - - - 0x01019C 04:818C: B9 9B 81  LDA tbl_819B_скорость_X,Y
C - - - - - 0x01019F 04:818F: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0101A2 04:8192: B9 9C 81  LDA tbl_819B_скорость_X + $01,Y
C - - - - - 0x0101A5 04:8195: 9D CA 06  STA ram_скорость_объектов_X_старш,X
                                        JMP loc_AE95_подготовка_к_выстрелу_дульная_вспышка

tbl_819B_скорость_X:
- D 0 - - - 0x0101AB 04:819B: 00 FC     .word $FC00 ; 00 изи
- - - - - - 0x0101AD 04:819D: 00 04     .word $FB00 ; 01 нормал
                                        .word $FA00 ; 01 хард

; ******************************************************************************************************************

ofs_038_24_819F_03:
C - - - - - 0x0101B4 04:81A4: 20 D3 A6  JSR sub_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x0101B7 04:81A7: A9 00     LDA #$00
C - - - - - 0x0101B9 04:81A9: 20 0A A8  JSR sub_A80A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x0101BC 04:81AC: F0 03     BEQ bra_81B1_RTS
                                        JMP loc_A2D7_увеличить_состояние_объекта
bra_81B1_RTS:
C - - - - - 0x0101C1 04:81B1: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_51D0_2A_пуля_робота_паука:
- D 0 - I - 0x0051D0 01:91C0: C8 91     .word ofs_038_2A_91C8_01_активация_объекта ; 
- D 0 - I - 0x0051D2 01:91C2: D1 91     .word ofs_038_2A_91D1_02 ; 
- D 0 - I - 0x0051D4 01:91C4: E1 91     .word ofs_038_2A_91E1_03 ; 
- D 0 - I - 0x0051D6 01:91C6: 75 A2     .word ofs_038_2A_A27A_04 ; 
                                        .word ofs_038_2A_A288_05 ; 

; ******************************************************************************************************************

ofs_038_2A_91C8_01_активация_объекта:
C - - J - - 0x0051D8 01:91C8: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0051DB 01:91CB: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0051DE 01:91CE: 4C 95 AE  JMP loc_AE95_подготовка_к_выстрелу_дульная_вспышка

; ******************************************************************************************************************

ofs_038_2A_91D1_02:
C - - - - - 0x0051E4 01:91D4: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0051E7 01:91D7: D0 2C     BNE bra_9205_RTS
                                        LDY #$02    ; укажем свой индекс, чтобы записать нужные параметры
                                        JMP loc_AEAC
; ******************************************************************************************************************

ofs_038_2A_91E1_03:
C - - J - - 0x0051F1 01:91E1: FE E6 06  INC ram_счетчики_для_объектов,X
C - - - - - 0x0051F4 01:91E4: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x0051F7 01:91E7: 4A        LSR
C - - - - - 0x0051F8 01:91E8: 4A        LSR
C - - - - - 0x0051F9 01:91E9: 29 03     AND #$03
C - - - - - 0x0051FB 01:91EB: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0051FE 01:91EE: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x005201 01:91F1: F0 05     BEQ bra_91F8
C - - - - - 0x005203 01:91F3: A0 05     LDY #$05
C - - - - - 0x005205 01:91F5: 20 6E A9  JSR sub_A96E_смена_скорости_движение_волной
bra_91F8:
C - - - - - 0x005208 01:91F8: 20 D3 A6  JSR sub_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x00520B 01:91FB: A9 F8     LDA #$F8
C - - - - - 0x00520D 01:91FD: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x005210 01:9200: F0 03     BEQ bra_9205_RTS
                                        JMP loc_A2D7_увеличить_состояние_объекта
bra_9205_RTS:
C - - - - - 0x005215 01:9205: 60        RTS
; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_8A4C_2C_пуля_мутанта_с_двумя_пастями:
- D 0 - I - 0x008A4C 02:8A3C: 42 8A     .word ofs_038_2C_8A42_01_активация_объекта ; 
- D 0 - I - 0x008A4E 02:8A3E: A0 8A     .word ofs_038_2C_8AA0_02 ; 
- - - - - - 0x008A50 02:8A40: 75 A2     .word ofs_038_2C_A27A_03 ; 
                                        .word ofs_038_2C_A282_04 ; 

; ******************************************************************************************************************

ofs_038_2C_8A42_01_активация_объекта:
C - - - - - 0x008A57 02:8A47: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008A5A 02:8A4A: 18        CLC
C - - - - - 0x008A5B 02:8A4B: 65 23     ADC ram_рандом_байт
C - - - - - 0x008A5D 02:8A4D: 29 07     AND #$07
C - - - - - 0x008A5F 02:8A4F: 0A        ASL
C - - - - - 0x008A60 02:8A50: A8        TAY
C - - - - - 0x008A61 02:8A51: B9 90 8A  LDA tbl_8A90_скорость_X,Y
C - - - - - 0x008A64 02:8A54: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x008A67 02:8A57: B9 91 8A  LDA tbl_8A90_скорость_X + $01,Y
C - - - - - 0x008A6A 02:8A5A: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x008A6D 02:8A5D: A5 23     LDA ram_счетчик_кадров
C - - - - - 0x008A6F 02:8A5F: 29 07     AND #$07
C - - - - - 0x008A71 02:8A61: 0A        ASL
C - - - - - 0x008A72 02:8A62: A8        TAY
C - - - - - 0x008A73 02:8A63: B9 80 8A  LDA tbl_8A80_скорость_Y,Y
C - - - - - 0x008A76 02:8A66: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x008A79 02:8A69: B9 81 8A  LDA tbl_8A80_скорость_Y + $01,Y
C - - - - - 0x008A7C 02:8A6C: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x008A7F 02:8A6F: A9 02     LDA #$02
C - - - - - 0x008A81 02:8A71: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x008A84 02:8A74: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008A87 02:8A77: 4A        LSR
C - - - - - 0x008A88 02:8A78: B0 03     BCS bra_8A7D
C - - - - - 0x008A8A 02:8A7A: 20 DC A7  JSR sub_A7DC_отразить_скорость_по_X
bra_8A7D:
                                        LDY #$00    ; укажем свой индекс, чтобы записать нужные параметры
                                        JMP loc_AEAC

tbl_8A80_скорость_Y:
- D 0 - - - 0x008A90 02:8A80: 00 FF     .word $FF00 ; 00 
- D 0 - - - 0x008A92 02:8A82: 10 FF     .word $FF10 ; 01 
- D 0 - - - 0x008A94 02:8A84: 20 FF     .word $FF20 ; 02 
- D 0 - - - 0x008A96 02:8A86: 30 FF     .word $FF30 ; 03 
- D 0 - - - 0x008A98 02:8A88: 40 FF     .word $FF40 ; 04 
- D 0 - - - 0x008A9A 02:8A8A: 50 FF     .word $FF50 ; 05 
- D 0 - - - 0x008A9C 02:8A8C: 60 FF     .word $FF60 ; 06 
- D 0 - - - 0x008A9E 02:8A8E: 70 FF     .word $FF70 ; 07 

tbl_8A90_скорость_X:
- D 0 - - - 0x008AA0 02:8A90: A0 00     .word $00A0 ; 00 
- D 0 - - - 0x008AA2 02:8A92: C0 00     .word $00C0 ; 01 
- D 0 - - - 0x008AA4 02:8A94: E0 00     .word $00E0 ; 02 
- D 0 - - - 0x008AA6 02:8A96: 00 01     .word $0100 ; 03 
- D 0 - - - 0x008AA8 02:8A98: 20 01     .word $0120 ; 04 
- D 0 - - - 0x008AAA 02:8A9A: 40 01     .word $0140 ; 05 
- D 0 - - - 0x008AAC 02:8A9C: 60 01     .word $0160 ; 06 
- D 0 - - - 0x008AAE 02:8A9E: 80 01     .word $0180 ; 07 

; ******************************************************************************************************************

ofs_038_2C_8AA0_02:
C - - J - - 0x008AB0 02:8AA0: A0 0F     LDY #$0F
C - - - - - 0x008AB2 02:8AA2: 20 FD AB  JSR sub_ABFD_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008AB5 02:8AA5: 20 D3 A6  JSR sub_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x008AB8 02:8AA8: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x008ABB 02:8AAB: 18        CLC
C - - - - - 0x008ABC 02:8AAC: 69 0C     ADC #< $000C
C - - - - - 0x008ABE 02:8AAE: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x008AC1 02:8AB1: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x008AC4 02:8AB4: 69 00     ADC #> $000C
C - - - - - 0x008AC6 02:8AB6: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x008AC9 02:8AB9: A9 00     LDA #$00
C - - - - - 0x008ACB 02:8ABB: 20 0A A8  JSR sub_A80A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x008ACE 02:8ABE: F0 03     BEQ bra_8AC3_RTS
                                        JMP loc_A2D7_увеличить_состояние_объекта
bra_8AC3_RTS:
C - - - - - 0x008AD3 02:8AC3: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_8299_38_пуля_пушечного_черепа:
- D 0 - I - 0x008299 02:8289: 8D 82     .word ofs_038_38_828D_01_активация_объекта ; 
- D 0 - I - 0x00829B 02:828B: A8 82     .word ofs_038_38_82A8_02 ; 
                                        .word ofs_038_38_82B0_03 ; 
                                        .word ofs_038_38_82B4_04 ; 
                                        
; ******************************************************************************************************************

ofs_038_38_828D_01_активация_объекта:
                                        LDA ram_option_сложность
                                        ASL
                                        TAY
                                        LDA tbl_82A5_скорость_X,Y
C - - - - - 0x0082AD 02:829D: 9D BC 06  STA ram_скорость_объектов_x_младш,X
                                        LDA tbl_82A5_скорость_X + $01,Y
C - - - - - 0x0082B2 02:82A2: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x0082BD 02:82AD: A9 02     LDA #$02
C - - - - - 0x0082BF 02:82AF: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
                                        TAY    ; укажем свой индекс, чтобы записать нужные параметры
                                        JMP loc_AEAC

tbl_82A5_скорость_X:
                                        .word $FC00 ; 00 изи
                                        .word $FB00 ; 01 нормал
                                        .word $FA00 ; 01 хард

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_B86C_0C_взрывы:
- D 1 - I - 0x00787C 01:B86C: 9A A2     .word ofs_038_0C_A29A_01_обработка_состояния_смерти_объекта ; 
- D 1 - I - 0x00787E 01:B86E: FD A2     .word ofs_038_0C_A2FD_02_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x007880 01:B870: 3D A3     .word ofs_038_0C_A27A_03_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_3D_0x006347_0B_удалить_объект_босс:
ofs_038_50_0x006347_0D_удалить_объект_босс:
ofs_038_57_0x006347_0C_удалить_объект_босс:
loc_0x006347_удалить_объект_босс:
C D 1 - - - 0x006347 01:A337: A9 80     LDA #$80
C - - - - - 0x006349 01:A339: 85 5C     STA ram_статус_завершения_уровня
; далее удалить объект (сразу ниже)
; ******************************************************************************************************************

ofs_038_01_A27A_05_удалить_объект:
ofs_038_03_0x00628A_08_удалить_объект:
ofs_038_04_A27A_05_удалить_объект:
ofs_038_05_0x00628A_07_удалить_объект:
ofs_038_06_0x00628A_05_удалить_объект:
ofs_038_07_0x00628A_07_удалить_объект:
ofs_038_09_0x00628A_07_удалить_объект:
ofs_038_0A_0x00628A_08_удалить_объект:
ofs_038_0B_0x00628A_08_удалить_объект:
ofs_038_0C_A27A_03_удалить_объект:
ofs_038_0D_0x00628A_09_удалить_объект:
ofs_038_10_0x00628A_04_удалить_объект:
ofs_038_11_0x00628A_09_удалить_объект:
ofs_038_13_0x00628A_07_удалить_объект:
ofs_038_14_0x00628A_07_удалить_объект:
ofs_038_15_0x00628A_06_удалить_объект:
ofs_038_16_0x00628A_05_удалить_объект:
ofs_038_17_0x00628A_09_удалить_объект:
ofs_038_18_0x00628A_07_удалить_объект:
ofs_038_19_0x00628A_08_удалить_объект:
ofs_038_1A_0x00628A_05_удалить_объект:
ofs_038_1B_0x00628A_06_удалить_объект:
ofs_038_1C_0x00628A_04_удалить_объект:
ofs_038_1E_0x00628A_05_удалить_объект:
ofs_038_1F_0x00628A_09_удалить_объект:
ofs_038_20_0x00628A_05_удалить_объект:
ofs_038_22_0x00628A_06_удалить_объект:
ofs_038_23_0x00628A_07_удалить_объект:
ofs_038_25_0x00628A_06_удалить_объект:
ofs_038_26_0x00628A_07_удалить_объект:
ofs_038_27_0x00628A_03_удалить_объект:
ofs_038_28_0x00628A_06_удалить_объект:
ofs_038_2B_0x00628A_06_удалить_объект:
ofs_038_2D_0x00628A_06_удалить_объект:
ofs_038_2E_0x00628A_05_удалить_объект:
ofs_038_30_0x00628A_0A_удалить_объект:
ofs_038_35_0x00628A_06_удалить_объект:
ofs_038_36_0x00628A_07_удалить_объект:
ofs_038_37_0x00628A_05_удалить_объект:
ofs_038_3C_0x00628A_09_удалить_объект:
ofs_038_3F_0x00628A_05_удалить_объект:
ofs_038_40_0x00628A_06_удалить_объект:
ofs_038_41_0x00628A_05_удалить_объект:
ofs_038_42_0x00628A_0A_удалить_объект:
ofs_038_45_0x00628A_06_удалить_объект:
ofs_038_46_0x00628A_09_удалить_объект:
ofs_038_48_0x00628A_06_удалить_объект:
ofs_038_4A_0x00628A_07_удалить_объект:
ofs_038_4C_0x00628A_05_удалить_объект:
ofs_038_4E_0x00628A_06_удалить_объект:
ofs_038_51_0x00628A_05_удалить_объект:
ofs_038_52_0x00628A_05_удалить_объект:
ofs_038_55_0x00628A_06_удалить_объект:
ofs_038_56_0x00628A_05_удалить_объект:
ofs_038_5A_0x00628A_03_удалить_объект:
sub_0x00628A_удалить_объект:
loc_0x00628A_удалить_объект:
loc_A27A_удалить_объект:
bra_A27A_удалить_объект:
C - - - - - 0x00628A 01:A27A: 20 9C F7  JSR sub_0x01F7AC_очистить_ID_объекта_и_его_хитбокс  ; на выходе A=00, Y=00
C - - - - - 0x006287 01:A277: 9D 68 06  STA ram_состояние_объектов_для_обработчика,X
loc_0x00628D_очистить_кадр_анимации:
sub_A27D_очистить_кадр_анимации:
loc_A27D_очистить_кадр_анимации:
bra_A27D_очистить_кадр_анимации:
C D 1 - - - 0x00628D 01:A27D: A9 00     LDA #$00
C - - - - - 0x00628F 01:A27F: 9D 08 05  STA ram_кадр_объекта_или_пули,X
                                        STA ram_характеристики_объектов,X
C - - - - - 0x006292 01:A282: 60        RTS

; ******************************************************************************************************************

loc_0x006293_установить_состояние_объекта:
sub_A283_установить_состояние_объекта:
loc_A283_установить_состояние_объекта:
C D 1 - - - 0x006293 01:A283: BC 68 06  LDY ram_состояние_объектов_для_обработчика,X
C - - - - - 0x006296 01:A286: F0 F5     BEQ bra_A27D_очистить_кадр_анимации
C - - - - - 0x006298 01:A288: 9D 68 06  STA ram_состояние_объектов_для_обработчика,X
C - - - - - 0x00629B 01:A28B: 60        RTS

; ******************************************************************************************************************

ofs_038_03_0x00A29A_06_обработка_состояния_смерти_объекта:
ofs_038_05_0x00A29A_05_обработка_состояния_смерти_объекта:
ofs_038_07_0x00A29A_05_обработка_состояния_смерти_объекта:
ofs_038_09_0x00A29A_05_обработка_состояния_смерти_объекта:
ofs_038_0C_A29A_01_обработка_состояния_смерти_объекта:
ofs_038_15_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_16_0x0062AA_03_обработка_состояния_смерти_объекта:
ofs_038_17_0x0062AA_07_обработка_состояния_смерти_объекта:
ofs_038_1B_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_1E_0x0062AA_03_обработка_состояния_смерти_объекта:
ofs_038_20_0x0062AA_03_обработка_состояния_смерти_объекта:
ofs_038_22_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_25_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_26_0x0062AA_05_обработка_состояния_смерти_объекта:
ofs_038_28_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_2B_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_2E_0x0062AA_03_обработка_состояния_смерти_объекта:
ofs_038_30_0x0062AA_08_обработка_состояния_смерти_объекта:
ofs_038_36_0x0062AA_05_обработка_состояния_смерти_объекта:
ofs_038_3C_0x0062AA_07_обработка_состояния_смерти_объекта:
ofs_038_3F_0x008E02_03_обработка_состояния_смерти_объекта:
ofs_038_40_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_41_0x0062AA_03_обработка_состояния_смерти_объекта:
ofs_038_42_0x0062AA_08_обработка_состояния_смерти_объекта:
ofs_038_45_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_47_0x0062AA_03_обработка_состояния_смерти_объекта:
ofs_038_4A_0x0062AA_05_обработка_состояния_смерти_объекта:
ofs_038_4C_0x0062AA_03_обработка_состояния_смерти_объекта:
ofs_038_4E_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_52_0x0062AA_03_обработка_состояния_смерти_объекта:
ofs_038_55_0x0062AA_04_обработка_состояния_смерти_объекта:
ofs_038_56_0x0062AA_03_обработка_состояния_смерти_объекта:
sub_0x0062AA_обработка_состояния_смерти_объекта:
loc_0x0062AA_обработка_состояния_смерти_объекта:
sub_A29A_обработка_состояния_смерти_объекта:
loc_A29A_обработка_состояния_смерти_объекта:
C D 1 J - - 0x0062AA 01:A29A: BD 08 05  LDA ram_кадр_объекта_или_пули,X
C - - - - - 0x0062AD 01:A29D: F0 D6     BEQ bra_A27A_удалить_объект
C - - - - - 0x0062AF 01:A29F: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
ofs_038_12_0x0062B2_08_обработка_состояния_смерти_объекта:
ofs_038_32_0x0062B2_08_обработка_состояния_смерти_объекта:
loc_0x0062B2_обработка_состояния_смерти_объекта:
C D 1 - - - 0x0062B2 01:A2A2: A9 02     LDA #$02
C - - - - - 0x0062B4 01:A2A4: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0062B7 01:A2A7: BD 2C 07  LDA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0062BA 01:A2AA: 4A        LSR
C - - - - - 0x0062BB 01:A2AB: 4A        LSR
C - - - - - 0x0062BC 01:A2AC: 29 0F     AND #$0F
C - - - - - 0x0062BE 01:A2AE: A8        TAY
C - - - - - 0x0062BF 01:A2AF: B9 E6 A2  LDA tbl_A2E6_звук_смерти,Y
C - - - - - 0x0062C4 01:A2B4: 10 07     BPL bra_A2BD
C - - - - - 0x0062C6 01:A2B6: 48        PHA
C - - - - - 0x0062C7 01:A2B7: 20 0E FE  JSR sub_0x01FE1E_остановить_звуковой_движок
C - - - - - 0x0062CA 01:A2BA: 68        PLA
C - - - - - 0x0062CB 01:A2BB: 29 7F     AND #$7F
bra_A2BD:
C - - - - - 0x0062CD 01:A2BD: 20 DE FD  JSR sub_0x01FDEE_play_sound
C - - - - - 0x0062D0 01:A2C0: A9 01     LDA #$01
C - - - - - 0x0062D2 01:A2C2: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x0062D5 01:A2C5: A9 FF     LDA #$FF
C - - - - - 0x0062D7 01:A2C7: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0062DA 01:A2CA: A9 01     LDA #$01
C - - - - - 0x0062DC 01:A2CC: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x0062DF 01:A2CF: BD 2C 07  LDA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0062E2 01:A2D2: 09 81     ORA #$81
C - - - - - 0x0062E4 01:A2D4: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
sub_0x0062E7_увеличить_состояние_объекта:
loc_0x0062E7_увеличить_состояние_объекта:
loc_A2D7_увеличить_состояние_объекта:
bra_A2D7_увеличить_состояние_объекта:
C D 1 - - - 0x0062E7 01:A2D7: BD 68 06  LDA ram_состояние_объектов_для_обработчика,X
C - - - - - 0x0062EA 01:A2DA: F0 A1     BEQ bra_A27D_очистить_кадр_анимации
C - - - - - 0x0062EC 01:A2DC: FE 68 06  INC ram_состояние_объектов_для_обработчика,X
C - - - - - 0x0062EF 01:A2DF: 60        RTS

tbl_A2E6_звук_смерти:
- D 1 - - - 0x0062F6 01:A2E6: 13        .byte $00 + con_sound_13   ; 00
- D 1 - - - 0x0062F7 01:A2E7: 1B        .byte $00 + con_sound_1B   ; 04
- D 1 - - - 0x0062F8 01:A2E8: 1C        .byte $00 + con_sound_1C   ; 08
- D 1 - - - 0x0062F9 01:A2E9: 1A        .byte $00 + con_sound_1A   ; 0C
- D 1 - - - 0x0062FA 01:A2EA: A6        .byte $80 + con_sound_26   ; 10 +
- D 1 - - - 0x0062FB 01:A2EB: 14        .byte $00 + con_sound_14   ; 14
- D 1 - - - 0x0062FC 01:A2EC: 12        .byte $00 + con_sound_12   ; 18
- D 1 - - - 0x0062FD 01:A2ED: 18        .byte $00 + con_sound_18   ; 1C
- D 1 - - - 0x0062FE 01:A2EE: 24        .byte $00 + con_sound_24   ; 20

; ******************************************************************************************************************

ofs_038_12_0x006306_09:
ofs_038_32_0x006306_09:
ofs_038_3D_0x006306_0A:
ofs_038_4F_0x006306_08:
ofs_038_50_0x006306_0C:
ofs_038_53_0x006306_09:
ofs_038_57_0x006306_0B:
loc_0x006306:
C D 1 J - - 0x006306 01:A2F6: BD 08 05  LDA ram_кадр_объекта_или_пули,X
C - - - - - 0x006309 01:A2F9: F0 DC     BEQ bra_A2D7_увеличить_состояние_объекта
C - - - - - 0x00630B 01:A2FB: D0 03     BNE bra_A300    ; jmp

; ******************************************************************************************************************

ofs_038_01_A2FD_04_обработка_анимации_взрыва_объекта:
ofs_038_03_0x00630D_07_обработка_анимации_взрыва_объекта:
ofs_038_04_A2FD_04_обработка_анимации_взрыва_объекта:
ofs_038_05_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_06_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_07_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_09_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_0A_0x00630D_07_обработка_анимации_взрыва_объекта:
ofs_038_0B_0x00630D_07_обработка_анимации_взрыва_объекта:
ofs_038_0C_A2FD_02_обработка_анимации_взрыва_объекта:
ofs_038_0D_0x00630D_08_обработка_анимации_взрыва_объекта:
ofs_038_11_0x00630D_08_обработка_анимации_взрыва_объекта:
ofs_038_13_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_15_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_16_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_17_0x00630D_08_обработка_анимации_взрыва_объекта:
ofs_038_18_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_19_0x00630D_07_обработка_анимации_взрыва_объекта:
ofs_038_1A_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_1B_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_1E_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_1F_0x00630D_08_обработка_анимации_взрыва_объекта:
ofs_038_20_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_22_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_23_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_25_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_26_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_28_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_2B_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_2E_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_2D_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_30_0x00630D_09_обработка_анимации_взрыва_объекта:
ofs_038_35_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_36_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_37_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_3B_0x00630D_08_обработка_анимации_взрыва_объекта:
ofs_038_3C_0x00630D_08_обработка_анимации_взрыва_объекта:
ofs_038_3E_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_3F_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_40_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_41_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_42_0x00630D_09_обработка_анимации_взрыва_объекта:
ofs_038_45_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_46_0x00630D_08_обработка_анимации_взрыва_объекта:
ofs_038_48_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_4A_0x00630D_06_обработка_анимации_взрыва_объекта:
ofs_038_4C_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_4E_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_51_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_52_0x00630D_04_обработка_анимации_взрыва_объекта:
ofs_038_55_0x00630D_05_обработка_анимации_взрыва_объекта:
ofs_038_56_0x00630D_04_обработка_анимации_взрыва_объекта:
sub_0x00630D_обработка_анимации_взрыва_объекта:
loc_0x00630D_обработка_анимации_взрыва_объекта:
C D 1 J - - 0x00630D 01:A2FD: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
bra_A300:
C - - - - - 0x006310 01:A300: BD 68 06  LDA ram_состояние_объектов_для_обработчика,X
C - - - - - 0x006313 01:A303: F0 31     BEQ bra_A336_RTS
C - - - - - 0x006315 01:A305: DE 02 07  DEC ram_счетчик_анимации_объектов,X
C - - - - - 0x006318 01:A308: D0 2C     BNE bra_A336_RTS
C - - - - - 0x00631A 01:A30A: BD 2C 07  LDA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00631D 01:A30D: 4A        LSR
C - - - - - 0x00631E 01:A30E: 4A        LSR
C - - - - - 0x00631F 01:A30F: A9 04     LDA #$04
C - - - - - 0x006321 01:A311: 90 02     BCC bra_A315
C - - - - - 0x006323 01:A313: A9 03     LDA #$03
bra_A315:
C - - - - - 0x006325 01:A315: 85 00     STA ram_0000
C - - - - - 0x006327 01:A317: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00632A 01:A31A: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00632D 01:A31D: C4 00     CPY ram_0000
C - - - - - 0x00632F 01:A31F: B0 B6     BCS bra_A2D7_увеличить_состояние_объекта
C - - - - - 0x006331 01:A321: A9 05     LDA #$05
C - - - - - 0x006333 01:A323: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x006336 01:A326: BD 2C 07  LDA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x006339 01:A329: 4A        LSR
C - - - - - 0x00633A 01:A32A: 4A        LSR
C - - - - - 0x00633B 01:A32B: B9 4D A3  LDA tbl_A34D_кадры_анимации,Y
C - - - - - 0x00633E 01:A32E: 90 03     BCC bra_A333
C - - - - - 0x006340 01:A330: B9 51 A3  LDA tbl_A351_кадры_анимации,Y
bra_A333:
C - - - - - 0x006343 01:A333: 9D 08 05  STA ram_кадр_объекта_или_пули,X
bra_A336_RTS:
C - - - - - 0x006346 01:A336: 60        RTS

tbl_A34D_кадры_анимации:
- D 1 - - - 0x00635D 01:A34D: 02        .byte $02   ; 00 кадр дульной вспышки
- D 1 - - - 0x00635E 01:A34E: 0F        .byte $0F   ; 01 кадр взрыва в виде звезды
- D 1 - - - 0x00635F 01:A34F: 10        .byte $10   ; 02 кадр взрыва в виде звезды
- D 1 - - - 0x006360 01:A350: 11        .byte $11   ; 03 кадр взрыва в виде звезды

tbl_A351_кадры_анимации:
- D 1 - - - 0x006361 01:A351: 12        .byte $12   ; 00 кадр взрыва большого шара
- D 1 - - - 0x006362 01:A352: 13        .byte $13   ; 01 кадр взрыва большого шара
- D 1 - - - 0x006363 01:A353: 14        .byte $14   ; 02 кадр взрыва большого шара

; ******************************************************************************************************************

ofs_038_11_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам:
ofs_038_13_0x006364_03_поменять_состояние_хитбокса_и_подготовить_к_взрывам:
ofs_038_19_0x006364_04_поменять_состояние_хитбокса_и_подготовить_к_взрывам:
ofs_038_1F_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам:
ofs_038_46_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам:
loc_0x006364_поменять_состояние_хитбокса_и_подготовить_к_взрывам:
C D 1 J - - 0x006364 01:A354: BD 2C 07  LDA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x006367 01:A357: 29 E3     AND #$E3
C - - - - - 0x006369 01:A359: 09 04     ORA #$05    ; пока идут взрывы пушек, хитбокс не будет задевать игроков
C - - - - - 0x00636B 01:A35B: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
ofs_038_0D_0x00636E_04_подготовить_к_взрывам:
C - - - - - 0x00636E 01:A35E: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x006371 01:A361: A9 05     LDA #$05
C - - - - - 0x006373 01:A363: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x006376 01:A366: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_A2D7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0D_0x00637B_05_маленькие_взрывы_объектов:
ofs_038_11_0x00637B_06_маленькие_взрывы_объектов:
ofs_038_13_0x00637B_04_маленькие_взрывы_объектов:
ofs_038_19_0x00637B_05_маленькие_взрывы_объектов:
ofs_038_1F_0x00637B_06_маленькие_взрывы_объектов:
ofs_038_46_0x00637B_06_маленькие_взрывы_объектов:
loc_0x00637B_маленькие_взрывы_объектов:
C D 1 J - - 0x00637B 01:A36B: 20 B7 A6  JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00637E 01:A36E: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x006381 01:A371: D0 37     BNE bra_A3AA_RTS
C - - - - - 0x006383 01:A373: A9 08     LDA #$08
C - - - - - 0x006385 01:A375: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x006388 01:A378: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x00638B 01:A37B: 30 2E     BMI bra_A3AB
C - - - - - 0x00638D 01:A37D: A0 0C     LDY #con_obj_id_0C  ; объект взрывы
C - - - - - 0x00638F 01:A37F: 20 C8 AB  JSR sub_ABC8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x006392 01:A382: 90 26     BCC bra_A3AA_RTS
C - - - - - 0x006394 01:A384: BC 72 07  LDY ram_0772_obj,X
C - - - - - 0x006397 01:A387: B9 AE A3  LDA tbl_A3AE_добавочная_позиция_Y_спрайта,Y
C - - - - - 0x00639A 01:A38A: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00639D 01:A38D: 85 08     STA ram_0008
C - - - - - 0x00639F 01:A38F: 6A        ROR
C - - - - - 0x0063A0 01:A390: 59 AE A3  EOR tbl_A3AE_добавочная_позиция_Y_спрайта,Y
C - - - - - 0x0063A3 01:A393: 30 0E     BMI bra_A3A3
C - - - - - 0x0063A5 01:A395: B9 B3 A3  LDA tbl_A3B3_добавочная_позиция_X_спрайта,Y
C - - - - - 0x0063A8 01:A398: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0063AB 01:A39B: 85 09     STA ram_0009
C - - - - - 0x0063AD 01:A39D: 6A        ROR
C - - - - - 0x0063AE 01:A39E: 59 B3 A3  EOR tbl_A3B3_добавочная_позиция_X_спрайта,Y
C - - - - - 0x0063B1 01:A3A1: 10 74     BPL bra_A417
bra_A3A3:
C - - - - - 0x0063B3 01:A3A3: A4 11     LDY ram_0011
C - - - - - 0x0063B5 01:A3A5: A9 00     LDA #$00
C - - - - - 0x0063B7 01:A3A7: 99 08 05  STA ram_кадр_объекта_или_пули,Y
bra_A3AA_RTS:
C - - - - - 0x0063BA 01:A3AA: 60        RTS
bra_A3AB:
C - - - - - 0x0063BB 01:A3AB: 4C D7 A2  JMP loc_A2D7_увеличить_состояние_объекта

tbl_A3AE_добавочная_позиция_Y_спрайта:
- D 1 - - - 0x0063BE 01:A3AE: 0E        .byte $0E   ; 00 
- D 1 - - - 0x0063BF 01:A3AF: F0        .byte $F0   ; 01 
- D 1 - - - 0x0063C0 01:A3B0: 02        .byte $02   ; 02 
- D 1 - - - 0x0063C1 01:A3B1: FC        .byte $FC   ; 03 
- D 1 - - - 0x0063C2 01:A3B2: 08        .byte $08   ; 04 

tbl_A3B3_добавочная_позиция_X_спрайта:
- D 1 - - - 0x0063C3 01:A3B3: F8        .byte $F8   ; 00 
- D 1 - - - 0x0063C4 01:A3B4: 03        .byte $03   ; 01 
- D 1 - - - 0x0063C5 01:A3B5: F4        .byte $F4   ; 02 
- D 1 - - - 0x0063C6 01:A3B6: 0E        .byte $0E   ; 03 
- D 1 - - - 0x0063C7 01:A3B7: FE        .byte $FE   ; 04 

; ******************************************************************************************************************

ofs_038_32_0x0063C8_06_установить_статус_уничтожения_босса_и_убить_все_объекты:
ofs_038_3D_0x0063C8_07_установить_статус_уничтожения_босса_и_убить_все_объекты:
ofs_038_4F_A3B8_05_установить_статус_уничтожения_босса_и_убить_все_объекты:
ofs_038_50_A3B8_09_установить_статус_уничтожения_босса_и_убить_все_объекты:
loc_0x0063C8_установить_статус_уничтожения_босса_и_убить_все_объекты:
C D 1 - - - 0x0063C8 01:A3B8: E6 5C     INC ram_статус_завершения_уровня
C - - - - - 0x0063CA 01:A3BA: A9 1D     LDA #$1D
C - - - - - 0x0063CC 01:A3BC: D0 02     BNE bra_A3C0    ; jmp

; ******************************************************************************************************************

ofs_038_3B_0x0063CE_05_отключить_состояние_хитбокса_и_убить_все_объекты:
C - - J - - 0x0063CE 01:A3BE: A9 0E     LDA #$0E
bra_A3C0:
C - - - - - 0x0063D0 01:A3C0: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0063D3 01:A3C3: A9 01     LDA #$01
C - - - - - 0x0063D5 01:A3C5: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x0063D8 01:A3C8: BD 2C 07  LDA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0063DB 01:A3CB: 09 81     ORA #$81
C - - - - - 0x0063DD 01:A3CD: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0063E0 01:A3D0: 20 96 A5  JSR sub_A596_установить_состояние_смерти_для_всех_объектов
C - - - - - 0x0063E3 01:A3D3: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_A2D7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_32_0x0063E8_07_большие_взрывы_для_боссов:
ofs_038_3B_0x0063E8_06_большие_взрывы_для_боссов:
ofs_038_3D_0x0063E8_08_большие_взрывы_для_боссов:
ofs_038_50_A3D8_0A_большие_взрывы_для_боссов:
loc_0x0063E8_большие_взрывы_для_боссов:
C D 1 - - - 0x0063E8 01:A3D8: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0063EB 01:A3DB: D0 53     BNE bra_A430_RTS
C - - - - - 0x0063ED 01:A3DD: A9 08     LDA #$08
C - - - - - 0x0063EF 01:A3DF: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0063F2 01:A3E2: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x0063F5 01:A3E5: 30 4A     BMI bra_A431
C - - - - - 0x0063F7 01:A3E7: A0 0C     LDY #con_obj_id_0C  ; взрывы
C - - - - - 0x0063F9 01:A3E9: 20 C8 AB  JSR sub_ABC8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0063FC 01:A3EC: 90 42     BCC bra_A430_RTS
C - - - - - 0x0063FE 01:A3EE: BC 72 07  LDY ram_0772_obj,X
C - - - - - 0x006401 01:A3F1: B9 34 A4  LDA tbl_A434_добавочная_позиция_Y_спрайта,Y
C - - - - - 0x006404 01:A3F4: 18        CLC
C - - - - - 0x006405 01:A3F5: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006408 01:A3F8: 85 08     STA ram_0008
C - - - - - 0x00640A 01:A3FA: 6A        ROR
C - - - - - 0x00640B 01:A3FB: 59 34 A4  EOR tbl_A434_добавочная_позиция_Y_спрайта,Y
C - - - - - 0x00640E 01:A3FE: 30 A3     BMI bra_A3A3
C - - - - - 0x006410 01:A400: B9 52 A4  LDA tbl_A452_добавочная_позиция_X_спрайта,Y
C - - - - - 0x006413 01:A403: 18        CLC
C - - - - - 0x006414 01:A404: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006417 01:A407: 85 09     STA ram_0009
C - - - - - 0x006419 01:A409: 6A        ROR
C - - - - - 0x00641A 01:A40A: 59 52 A4  EOR tbl_A452_добавочная_позиция_X_спрайта,Y
C - - - - - 0x00641D 01:A40D: BC 9C 07  LDY ram_позиция_объектов_X_старш,X
C - - - - - 0x006420 01:A410: F0 02     BEQ bra_A414
C - - - - - 0x006422 01:A412: 49 80     EOR #$80
bra_A414:
C - - - - - 0x006424 01:A414: A8        TAY
C - - - - - 0x006425 01:A415: 30 8C     BMI bra_A3A3
bra_A417:
C - - - - - 0x006427 01:A417: A4 11     LDY ram_0011
C - - - - - 0x006429 01:A419: A5 09     LDA ram_0009
C - - - - - 0x00642B 01:A41B: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x00642E 01:A41E: A5 08     LDA ram_0008
C - - - - - 0x006430 01:A420: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x006433 01:A423: A9 01     LDA #$01
C - - - - - 0x006435 01:A425: 99 08 05  STA ram_кадр_объекта_или_пули,Y
C - - - - - 0x006438 01:A428: B9 2C 07  LDA ram_состояние_хитбоксов_объектов,Y
C - - - - - 0x00643B 01:A42B: 09 A1     ORA #$A1
C - - - - - 0x00643D 01:A42D: 99 2C 07  STA ram_состояние_хитбоксов_объектов,Y
bra_A430_RTS:
C - - - - - 0x006440 01:A430: 60        RTS
bra_A431:
C - - - - - 0x006441 01:A431: 4C D7 A2  JMP loc_A2D7_увеличить_состояние_объекта

tbl_A434_добавочная_позиция_Y_спрайта:
- D 1 - - - 0x006444 01:A434: 00        .byte $00   ; 00 
- D 1 - - - 0x006445 01:A435: F8        .byte $F8   ; 01 
- D 1 - - - 0x006446 01:A436: 18        .byte $18   ; 02 
- D 1 - - - 0x006447 01:A437: 08        .byte $08   ; 03 
- D 1 - - - 0x006448 01:A438: E8        .byte $E8   ; 04 
- D 1 - - - 0x006449 01:A439: 00        .byte $00   ; 05 
- D 1 - - - 0x00644A 01:A43A: F8        .byte $F8   ; 06 
- D 1 - - - 0x00644B 01:A43B: 18        .byte $18   ; 07 
- D 1 - - - 0x00644C 01:A43C: 00        .byte $00   ; 08 
- D 1 - - - 0x00644D 01:A43D: E8        .byte $E8   ; 09 
- D 1 - - - 0x00644E 01:A43E: F0        .byte $F0   ; 0A 
- D 1 - - - 0x00644F 01:A43F: E8        .byte $E8   ; 0B 
- D 1 - - - 0x006450 01:A440: 00        .byte $00   ; 0C 
- D 1 - - - 0x006451 01:A441: 10        .byte $10   ; 0D 
- D 1 - - - 0x006452 01:A442: 00        .byte $00   ; 0E 
- D 1 - - - 0x006453 01:A443: 00        .byte $00   ; 0F 
- D 1 - - - 0x006454 01:A444: F8        .byte $F8   ; 10 
- D 1 - - - 0x006455 01:A445: 18        .byte $18   ; 11 
- D 1 - - - 0x006456 01:A446: 08        .byte $08   ; 12 
- D 1 - - - 0x006457 01:A447: E8        .byte $E8   ; 13 
- D 1 - - - 0x006458 01:A448: 00        .byte $00   ; 14 
- D 1 - - - 0x006459 01:A449: F8        .byte $F8   ; 15 
- D 1 - - - 0x00645A 01:A44A: 18        .byte $18   ; 16 
- D 1 - - - 0x00645B 01:A44B: 00        .byte $00   ; 17 
- D 1 - - - 0x00645C 01:A44C: E8        .byte $E8   ; 18 
- D 1 - - - 0x00645D 01:A44D: F0        .byte $F0   ; 19 
- D 1 - - - 0x00645E 01:A44E: E8        .byte $E8   ; 1A 
- D 1 - - - 0x00645F 01:A44F: 00        .byte $00   ; 1B 
- D 1 - - - 0x006460 01:A450: 10        .byte $10   ; 1C 
- - - - - - 0x006461 01:A451: 00        .byte $00   ; 1D 

tbl_A452_добавочная_позиция_X_спрайта:
- D 1 - - - 0x006462 01:A452: F8        .byte $F8   ; 00 
- D 1 - - - 0x006463 01:A453: 10        .byte $10   ; 01 
- D 1 - - - 0x006464 01:A454: 00        .byte $00   ; 02 
- D 1 - - - 0x006465 01:A455: E0        .byte $E0   ; 03 
- D 1 - - - 0x006466 01:A456: 00        .byte $00   ; 04 
- D 1 - - - 0x006467 01:A457: DD        .byte $DD   ; 05 
- D 1 - - - 0x006468 01:A458: 20        .byte $20   ; 06 
- D 1 - - - 0x006469 01:A459: 15        .byte $15   ; 07 
- D 1 - - - 0x00646A 01:A45A: F0        .byte $F0   ; 08 
- D 1 - - - 0x00646B 01:A45B: 00        .byte $00   ; 09 
- D 1 - - - 0x00646C 01:A45C: E8        .byte $E8   ; 0A 
- D 1 - - - 0x00646D 01:A45D: 18        .byte $18   ; 0B 
- D 1 - - - 0x00646E 01:A45E: 18        .byte $18   ; 0C 
- D 1 - - - 0x00646F 01:A45F: 20        .byte $20   ; 0D 
- D 1 - - - 0x006470 01:A460: 00        .byte $00   ; 0E 
- D 1 - - - 0x006471 01:A461: F8        .byte $F8   ; 0F 
- D 1 - - - 0x006472 01:A462: 10        .byte $10   ; 10 
- D 1 - - - 0x006473 01:A463: 00        .byte $00   ; 11 
- D 1 - - - 0x006474 01:A464: E0        .byte $E0   ; 12 
- D 1 - - - 0x006475 01:A465: 00        .byte $00   ; 13 
- D 1 - - - 0x006476 01:A466: DD        .byte $DD   ; 14 
- D 1 - - - 0x006477 01:A467: 20        .byte $20   ; 15 
- D 1 - - - 0x006478 01:A468: 15        .byte $15   ; 16 
- D 1 - - - 0x006479 01:A469: F0        .byte $F0   ; 17 
- D 1 - - - 0x00647A 01:A46A: 00        .byte $00   ; 18 
- D 1 - - - 0x00647B 01:A46B: E8        .byte $E8   ; 19 
- D 1 - - - 0x00647C 01:A46C: 18        .byte $18   ; 1A 
- D 1 - - - 0x00647D 01:A46D: 18        .byte $18   ; 1B 
- D 1 - - - 0x00647E 01:A46E: 20        .byte $20   ; 1C 
- - - - - - 0x00647F 01:A46F: 00        .byte $00   ; 1D 

; ******************************************************************************************************************

loc_A470_обработка_очков_и_установка_состояния_смерти_объекту:
; на входе: в X должен быть индекс объекта
C D 1 - - - 0x006480 01:A470: 20 A8 A4  JSR sub_A4A8_выбрать_колво_очков_для_обработки
C - - - - - 0x006483 01:A473: A6 10     LDX ram_0010    ; загрузить индекс объекта
sub_0x006485_установить_состояние_смерти_объекту:
sub_A475_установить_состояние_смерти_объекту:
loc_A475_установить_состояние_смерти_объекту:
                                        LDY ram_тип_объектов,X
C - - - - - 0x00648A 01:A47A: B9 56 A5  LDA tbl_A556_выбрать_состояние_смерти_для_объекта - $01,Y
C - - - - - 0x006495 01:A485: DD 68 06  CMP ram_состояние_объектов_для_обработчика,X
C - - - - - 0x006498 01:A488: 90 1D     BCC bra_A4A7_RTS    ; если состояние ниже
C - - - - - 0x00649A 01:A48A: F0 1B     BEQ bra_A4A7_RTS    ; если состояние равно
C - - - - - 0x00649C 01:A48C: 9D 68 06  STA ram_состояние_объектов_для_обработчика,X
                                        LDA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0064A7 01:A497: 09 80     ORA #$81    ; выключить все коллизии
C - - - - - 0x0064A9 01:A499: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
bra_A4A7_RTS:
C - - - - - 0x0064B7 01:A4A7: 60        RTS

tbl_A556_выбрать_состояние_смерти_для_объекта:

;                                              00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F
                                        .byte      $03, $04, $04, $03, $03, $03, $03, $00, $03, $06, $06, $00, $04, $04, $01   ; 00
                                        .byte $04, $05, $06, $03, $07, $04, $03, $05, $05, $04, $03, $04, $04, $04, $03, $05   ; 10
                                        .byte $03, $00, $04, $05, $03, $04, $05, $03, $04, $00, $04, $04, $03, $04, $03, $00   ; 20
                                        .byte $06, $00, $06, $06, $00, $04, $05, $03, $00, $00, $08, $05, $07, $07, $05, $03   ; 30
                                        .byte $04, $03, $08, $00, $06, $04, $05, $03, $04, $01, $05, $05, $03, $00, $04, $05   ; 40
                                        .byte $09, $03, $03, $06, $03, $04, $03, $08, $00, $00, $03, $02                       ; 50

; ******************************************************************************************************************

sub_A4A8_выбрать_колво_очков_для_обработки:
C - - - - - 0x0064B8 01:A4A8: BC D8 06  LDY ram_тип_объектов,X
C - - - - - 0x0064BB 01:A4AB: B9 C0 A4  LDA tbl_A4C0_индекс_определения_очков - $01,Y
                                        BEQ bra_A4BE_RTS
C - - - - - 0x0064BE 01:A4AE: A8        TAY
C - - - - - 0x0064C3 01:A4B3: B9 40 A5  LDA tbl_A540_очки,Y
C - - - - - 0x0064C6 01:A4B6: 85 01     STA ram_0001
C - - - - - 0x0064C8 01:A4B8: B9 41 A5  LDA tbl_A540_очки + $01,Y
C - - - - - 0x0064CB 01:A4BB: 85 02     STA ram_0002
C - - - - - 0x0064CD 01:A4BD: 4C 3C E6  JMP loc_E63C_обработка_очков_из_таблицы
bra_A4BE_RTS:
                                        RTS

tbl_A4C0_индекс_определения_очков:
- D 1 - - - 0x0064D1 01:A4C1: 0C        .byte off_A54C_0C___500 - tbl_A540_очки   ; 01 
- - - - - - 0x0064D2 01:A4C2: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 02 
- D 1 - - - 0x0064D3 01:A4C3: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 03 
- D 1 - - - 0x0064D4 01:A4C4: 08        .byte off_A548_08___200 - tbl_A540_очки   ; 04 
- D 1 - - - 0x0064D5 01:A4C5: 0A        .byte off_A54A_0A___300 - tbl_A540_очки   ; 05 
- - - - - - 0x0064D6 01:A4C6: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 06 
- D 1 - - - 0x0064D7 01:A4C7: 0A        .byte off_A54A_0A___300 - tbl_A540_очки   ; 07 
- - - - - - 0x0064D8 01:A4C8: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 08 
- D 1 - - - 0x0064D9 01:A4C9: 08        .byte off_A548_08___200 - tbl_A540_очки   ; 09 
- D 1 - - - 0x0064DA 01:A4CA: 08        .byte off_A548_08___200 - tbl_A540_очки   ; 0A 
- D 1 - - - 0x0064DB 01:A4CB: 0C        .byte off_A54C_0C___500 - tbl_A540_очки   ; 0B 
- - - - - - 0x0064DC 01:A4CC: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 0C 
- D 1 - - - 0x0064DD 01:A4CD: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 0D 
- - - - - - 0x0064DE 01:A4CE: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 0E 
- - - - - - 0x0064DF 01:A4CF: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 0F 
- - - - - - 0x0064E0 01:A4D0: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 10 
- D 1 - - - 0x0064F0 01:A4E0: 0C        .byte off_A54C_0C___500 - tbl_A540_очки   ; 11 
- D 1 - - - 0x0064F1 01:A4E1: 14        .byte off_A554_14_15000 - tbl_A540_очки   ; 12 
- D 1 - - - 0x0064F2 01:A4E2: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 13 
- - - - - - 0x0064F3 01:A4E3: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 14 
- D 1 - - - 0x0064F4 01:A4E4: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 15 
- D 1 - - - 0x0064F5 01:A4E5: 08        .byte off_A548_08___200 - tbl_A540_очки   ; 16 
- D 1 - - - 0x0064F6 01:A4E6: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 17 
- D 1 - - - 0x0064F7 01:A4E7: 08        .byte off_A548_08___200 - tbl_A540_очки   ; 18 
- D 1 - - - 0x0064F8 01:A4E8: 0E        .byte off_A54E_0E__1000 - tbl_A540_очки   ; 19 
- D 1 - - - 0x0064F9 01:A4E9: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 1A 
- D 1 - - - 0x0064FA 01:A4EA: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 1B 
- - - - - - 0x0064FB 01:A4EB: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 1C 
- D 1 - - - 0x0064FC 01:A4EC: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 1D 
- D 1 - - - 0x0064FD 01:A4ED: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 1E 
- D 1 - - - 0x0064FE 01:A4EE: 0E        .byte off_A54E_0E__1000 - tbl_A540_очки   ; 1F 
- D 1 - - - 0x0064FF 01:A4EF: 0A        .byte off_A54A_0A___300 - tbl_A540_очки   ; 20 
- - - - - - 0x006500 01:A4F0: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 21 
- D 1 - - - 0x006501 01:A4F1: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 22 
- D 1 - - - 0x006502 01:A4F2: 0A        .byte off_A54A_0A___300 - tbl_A540_очки   ; 23 
- - - - - - 0x006503 01:A4F3: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 24 
- D 1 - - - 0x006504 01:A4F4: 08        .byte off_A548_08___200 - tbl_A540_очки   ; 25 
- D 1 - - - 0x006505 01:A4F5: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 26 
- - - - - - 0x006506 01:A4F6: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 27 
- D 1 - - - 0x006507 01:A4F7: 02        .byte off_A542_02____30 - tbl_A540_очки   ; 28 
- - - - - - 0x006509 01:A4F9: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 29 
- - - - - - 0x00650A 01:A4FA: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 2A 
- D 1 - - - 0x00650B 01:A4FB: 0C        .byte off_A54C_0C___500 - tbl_A540_очки   ; 2B 
- - - - - - 0x00650C 01:A4FC: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 2C 
- D 1 - - - 0x00650D 01:A4FD: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 2D 
- D 1 - - - 0x00650E 01:A4FE: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 2E 
- - - - - - 0x00650F 01:A4FF: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 2F 
- D 1 - - - 0x006510 01:A500: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 30 
- - - - - - 0x006511 01:A501: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 31 
- - - - - - 0x006512 01:A502: 14        .byte off_A554_14_15000 - tbl_A540_очки   ; 32 
- D 1 - - - 0x006513 01:A503: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 33 
- - - - - - 0x006514 01:A504: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 34 
- D 1 - - - 0x006515 01:A505: 0A        .byte off_A54A_0A___300 - tbl_A540_очки   ; 35 
- D 1 - - - 0x006516 01:A506: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 36 
- D 1 - - - 0x006517 01:A507: 08        .byte off_A548_08___200 - tbl_A540_очки   ; 37 
- - - - - - 0x006518 01:A508: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 38 
- - - - - - 0x006519 01:A509: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 39 
- D 1 - - - 0x00651B 01:A50B: 14        .byte off_A554_14_15000 - tbl_A540_очки   ; 3A 
- D 1 - - - 0x00651E 01:A50E: 10        .byte off_A550_10__5000 - tbl_A540_очки   ; 3B 
- D 1 - - - 0x006520 01:A510: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 3C 
- D 1 - - - 0x006521 01:A511: 14        .byte off_A554_14_15000 - tbl_A540_очки   ; 3D 
- D 1 - - - 0x006522 01:A512: 08        .byte off_A548_08___200 - tbl_A540_очки   ; 3E 
- - - - - - 0x006523 01:A513: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 3F 
- D 1 - - - 0x006524 01:A514: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 40 
- D 1 - - - 0x006525 01:A515: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 41 
- D 1 - - - 0x006526 01:A516: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 42  
- - - - - - 0x006528 01:A518: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 43 
- D 1 - - - 0x006529 01:A519: 14        .byte off_A554_14_15000 - tbl_A540_очки   ; 44 
- D 1 - - - 0x00652A 01:A51A: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 45 
- D 1 - - - 0x00652B 01:A51B: 0C        .byte off_A54C_0C___500 - tbl_A540_очки   ; 46 
- D 1 - - - 0x00652C 01:A51C: 06        .byte off_A546_06___100 - tbl_A540_очки   ; 47 
- D 1 - - - 0x00652D 01:A51D: 0C        .byte off_A54C_0C___500 - tbl_A540_очки   ; 48 
- - - - - - 0x00652E 01:A51E: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 49 
- D 1 - - - 0x00652F 01:A51F: 0A        .byte off_A54A_0A___300 - tbl_A540_очки   ; 4A 
- D 1 - - - 0x006530 01:A520: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 4B 
- D 1 - - - 0x006531 01:A521: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 4C 
- - - - - - 0x006532 01:A522: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 4D 
- D 1 - - - 0x006533 01:A523: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 4E 
- D 1 - - - 0x006534 01:A524: 10        .byte off_A550_10__5000 - tbl_A540_очки   ; 4F 
- D 1 - - - 0x006535 01:A525: 12        .byte off_A552_12_10000 - tbl_A540_очки   ; 50 
- D 1 - - - 0x006536 01:A526: 0E        .byte off_A54E_0E__1000 - tbl_A540_очки   ; 51 
- D 1 - - - 0x006538 01:A528: 04        .byte off_A544_04____60 - tbl_A540_очки   ; 52 
- D 1 - - - 0x006539 01:A529: 14        .byte off_A554_14_15000 - tbl_A540_очки   ; 53 
- D 1 - - - 0x00653A 01:A52A: 0C        .byte off_A54C_0C___500 - tbl_A540_очки   ; 54 
- D 1 - - - 0x00653B 01:A52B: 02        .byte off_A542_02____30 - tbl_A540_очки   ; 55 
- - - - - - 0x00653C 01:A52C: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 56 
- D 1 - - - 0x00653D 01:A52D: 14        .byte off_A554_14_15000 - tbl_A540_очки   ; 57 
- - - - - - 0x00653E 01:A52E: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 58 
- - - - - - 0x00653F 01:A52F: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 59 
- - - - - - 0x006540 01:A530: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 5A 
- - - - - - 0x006541 01:A531: 00        .byte off_A540_00_____0 - tbl_A540_очки   ; 5B 

tbl_A540_очки:
off_A540_00_____0:
- D 1 - - - 0x006550 01:A540: 00 00     .word $0000 ; 

off_A542_02____30:
- D 1 - - - 0x006552 01:A542: 03 00     .word $0003 ; 

off_A544_04____60:
- D 1 - - - 0x006554 01:A544: 06 00     .word $0006 ; 

off_A546_06___100:
- D 1 - - - 0x006556 01:A546: 10 00     .word $0010 ; 

off_A548_08___200:
- D 1 - - - 0x006558 01:A548: 20 00     .word $0020 ; 

off_A54A_0A___300:
- D 1 - - - 0x00655A 01:A54A: 30 00     .word $0030 ; 

off_A54C_0C___500:
- D 1 - - - 0x00655C 01:A54C: 50 00     .word $0050 ; 

off_A54E_0E__1000:
- D 1 - - - 0x00655E 01:A54E: 00 01     .word $0100 ; 

off_A550_10__5000:
- D 1 - - - 0x006560 01:A550: 00 05     .word $0500 ; 

off_A552_12_10000:
- D 1 - - - 0x006562 01:A552: 00 10     .word $1000 ; 

off_A554_14_15000:
- D 1 - - - 0x006564 01:A554: 00 15     .word $1500 ; 

; ******************************************************************************************************************

sub_E638_обработка_очков:
C - - - - - 0x01E648 07:E638: A9 00     LDA #$00
C - - - - - 0x01E64A 07:E63A: 85 02     STA ram_0002
loc_E63C_обработка_очков_из_таблицы:
C D 3 - - - 0x01E64C 07:E63C: A9 00     LDA #$00
C - - - - - 0x01E64E 07:E63E: 85 03     STA ram_0003
C - - - - - 0x01E650 07:E640: A5 1F     LDA ram_флаг_игры_ботов_в_демке
C - - - - - 0x01E652 07:E642: F0 01     BEQ bra_E645_игроки
C - - - - - 0x01E654 07:E644: 60        RTS
bra_E645_игроки:
C - - - - - 0x01E65D 07:E64D: A9 E3     LDA #< ram_1p_очки
C - - - - - 0x01E65F 07:E64F: A4 21     LDY ram_0012    ; player index
C - - - - - 0x01E661 07:E651: F0 02     BEQ bra_E655
C - - - - - 0x01E663 07:E653: A9 E6     LDA #< ram_2p_очки
bra_E655:
C - - - - - 0x01E665 07:E655: 85 04     STA ram_0004
C - - - - - 0x01E667 07:E657: A0 07     LDY #$07
C - - - - - 0x01E669 07:E659: 84 05     STY ram_0005
C - - - - - 0x01E66B 07:E65B: A2 01     LDX #$01
C - - - - - 0x01E66D 07:E65D: A0 00     LDY #$00
C - - - - - 0x01E66F 07:E65F: A9 03     LDA #$03
C - - - - - 0x01E671 07:E661: 85 00     STA ram_0000
C - - - - - 0x01E673 07:E663: 18        CLC
bra_E664_loop:
C - - - - - 0x01E674 07:E664: B1 04     LDA (ram_0004),Y
C - - - - - 0x01E676 07:E666: 20 E3 E6  JSR sub_E6E3
C - - - - - 0x01E679 07:E669: 91 04     STA (ram_0004),Y
C - - - - - 0x01E67B 07:E66B: C8        INY
C - - - - - 0x01E67C 07:E66C: E8        INX
C - - - - - 0x01E67D 07:E66D: C6 00     DEC ram_0000
C - - - - - 0x01E67F 07:E66F: D0 F3     BNE bra_E664_loop
C - - - - - 0x01E681 07:E671: 90 0B     BCC bra_E67E
; if max hi-score
- - - - - - 0x01E683 07:E673: A2 02     LDX #$02
- - - - - - 0x01E685 07:E675: A9 99     LDA #$99
bra_E677_loop:
- - - - - - 0x01E687 07:E677: 9D E0 07  STA ram_рекорд_очки,X
- - - - - - 0x01E68A 07:E67A: CA        DEX
- - - - - - 0x01E68B 07:E67B: 10 FA     BPL bra_E677_loop
- - - - - - 0x01E68D 07:E67D: 60        RTS
bra_E67E:
C - - - - - 0x01E68E 07:E67E: A6 21     LDX ram_0012    ; player index
C - - - - - 0x01E690 07:E680: A0 02     LDY #$02
C - - - - - 0x01E692 07:E682: B1 04     LDA (ram_0004),Y
C - - - - - 0x01E694 07:E684: D5 57     CMP ram_очки_до_жизни_старш,X
C - - - - - 0x01E696 07:E686: 90 3E     BCC bra_E6C6
C - - - - - 0x01E698 07:E688: D0 07     BNE bra_E691
C - - - - - 0x01E69A 07:E68A: 88        DEY ; 01
C - - - - - 0x01E69B 07:E68B: B1 04     LDA (ram_0004),Y
C - - - - - 0x01E69D 07:E68D: D5 55     CMP ram_очки_до_жизни_младш,X
C - - - - - 0x01E69F 07:E68F: 90 35     BCC bra_E6C6
bra_E691:
C - - - - - 0x01E6A1 07:E691: A4 21     LDY ram_0012    ; player index
C - - - - - 0x01E6A3 07:E693: A2 20     LDX #$20
C - - - - - 0x01E6A5 07:E695: B9 55 00  LDA ram_очки_до_жизни_младш,Y
C - - - - - 0x01E6A8 07:E698: 18        CLC
C - - - - - 0x01E6A9 07:E699: 20 DF E6  JSR sub_E6DF
C - - - - - 0x01E6AC 07:E69C: 99 55 00  STA ram_очки_до_жизни_младш,Y
C - - - - - 0x01E6AF 07:E69F: 90 10     BCC bra_E6B1
C - - - - - 0x01E6B1 07:E6A1: A2 01     LDX #$01
C - - - - - 0x01E6B3 07:E6A3: B9 57 00  LDA ram_очки_до_жизни_старш,Y
C - - - - - 0x01E6B6 07:E6A6: 18        CLC
C - - - - - 0x01E6B7 07:E6A7: 20 DF E6  JSR sub_E6DF
C - - - - - 0x01E6BA 07:E6AA: 90 02     BCC bra_E6AE_not_overflow
- - - - - - 0x01E6BC 07:E6AC: A9 FF     LDA #$FF
bra_E6AE_not_overflow:
C - - - - - 0x01E6BE 07:E6AE: 99 57 00  STA ram_очки_до_жизни_старш,Y
bra_E6B1:
C - - - - - 0x01E6C1 07:E6B1: A6 21     LDX ram_0012    ; player index
C - - - - - 0x01E6C3 07:E6B3: B5 53     LDA ram_жизни,X
C - - - - - 0x01E6C5 07:E6B5: C9 63     CMP #$63
C - - - - - 0x01E6C7 07:E6B7: 90 06     BCC bra_E6BF_not_overflow
C - - - - - 0x01E6C9 07:E6B9: A9 63     LDA #$63
C - - - - - 0x01E6CB 07:E6BB: 95 53     STA ram_жизни,X
C - - - - - 0x01E6CD 07:E6BD: D0 07     BNE bra_E6C6    ; jmp
bra_E6BF_not_overflow:
C - - - - - 0x01E6CF 07:E6BF: F6 53     INC ram_жизни,X
C - - - - - 0x01E6D1 07:E6C1: A9 23     LDA #con_sound_23
C - - - - - 0x01E6D3 07:E6C3: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_E6C6:
C - - - - - 0x01E6D6 07:E6C6: A0 02     LDY #$02
bra_E6C8_loop:
C - - - - - 0x01E6D8 07:E6C8: B9 E0 07  LDA ram_рекорд_очки,Y
C - - - - - 0x01E6DB 07:E6CB: D1 04     CMP (ram_0004),Y
C - - - - - 0x01E6DD 07:E6CD: 90 05     BCC bra_E6D4
C - - - - - 0x01E6DF 07:E6CF: D0 0D     BNE bra_E6DE_RTS
C - - - - - 0x01E6E1 07:E6D1: 88        DEY
C - - - - - 0x01E6E2 07:E6D2: 10 F4     BPL bra_E6C8_loop
bra_E6D4:
C - - - - - 0x01E6E4 07:E6D4: A0 02     LDY #$02
bra_E6D6_loop:
C - - - - - 0x01E6E6 07:E6D6: B1 04     LDA (ram_0004),Y
C - - - - - 0x01E6E8 07:E6D8: 99 E0 07  STA ram_рекорд_очки,Y
C - - - - - 0x01E6EB 07:E6DB: 88        DEY
C - - - - - 0x01E6EC 07:E6DC: 10 F8     BPL bra_E6D6_loop
bra_E6DE_RTS:
C - - - - - 0x01E6EE 07:E6DE: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_E6DF:
C - - - - - 0x01E6EF 07:E6DF: 86 00     STX ram_0000
C - - - - - 0x01E6F1 07:E6E1: A2 00     LDX #$00
sub_E6E3:
C - - - - - 0x01E6F3 07:E6E3: 85 07     STA ram_0007
C - - - - - 0x01E6F5 07:E6E5: 29 F0     AND #$F0
C - - - - - 0x01E6F7 07:E6E7: 85 06     STA ram_0006
C - - - - - 0x01E6F9 07:E6E9: 45 07     EOR ram_0007
C - - - - - 0x01E6FB 07:E6EB: 85 07     STA ram_0007
C - - - - - 0x01E6FD 07:E6ED: B5 00     LDA ram_0000,X ; 0000 0001 0002 0003 
C - - - - - 0x01E6FF 07:E6EF: 29 0F     AND #$0F
C - - - - - 0x01E701 07:E6F1: 65 07     ADC ram_0007
C - - - - - 0x01E703 07:E6F3: C9 0A     CMP #$0A
C - - - - - 0x01E705 07:E6F5: 90 02     BCC bra_E6F9
C - - - - - 0x01E707 07:E6F7: 69 05     ADC #$05
bra_E6F9:
C - - - - - 0x01E709 07:E6F9: 65 06     ADC ram_0006
C - - - - - 0x01E70B 07:E6FB: 85 06     STA ram_0006
C - - - - - 0x01E70D 07:E6FD: B5 00     LDA ram_0000,X ; 0000 0001 0002 0003 
C - - - - - 0x01E70F 07:E6FF: 29 F0     AND #$F0
C - - - - - 0x01E711 07:E701: 65 06     ADC ram_0006
C - - - - - 0x01E713 07:E703: B0 04     BCS bra_E709
C - - - - - 0x01E715 07:E705: C9 A0     CMP #$A0
C - - - - - 0x01E717 07:E707: 90 03     BCC bra_E70C_RTS
bra_E709:
C - - - - - 0x01E719 07:E709: E9 A0     SBC #$A0
C - - - - - 0x01E71B 07:E70B: 38        SEC
bra_E70C_RTS:
C - - - - - 0x01E71C 07:E70C: 60        RTS

; ******************************************************************************************************************

sub_A596_установить_состояние_смерти_для_всех_объектов:
C - - - - - 0x0065A6 01:A596: 86 08     STX ram_0008    ; сохранить X
C - - - - - 0x0065A8 01:A598: A2 0D     LDX ram_макс_индекс_враги
bra_A59A_loop:
C - - - - - 0x0065AA 01:A59A: BD 68 06  LDA ram_состояние_объектов_для_обработчика,X
C - - - - - 0x0065AD 01:A59D: F0 0A     BEQ bra_A5A9_skip
C - - - - - 0x0065AF 01:A59F: BD 76 06  LDA ram_жизни_объектов_32bit,X
C - - - - - 0x0065B2 01:A5A2: C9 F0     CMP #con_HP_F0
C - - - - - 0x0065B4 01:A5A4: F0 03     BEQ bra_A5A9_skip
C - - - - - 0x0065B6 01:A5A6: 20 75 A4  JSR sub_A475_установить_состояние_смерти_объекту
bra_A5A9_skip:
C - - - - - 0x0065B9 01:A5A9: CA        DEX
C - - - - - 0x0065BA 01:A5AA: 10 EE     BPL bra_A59A_loop
C - - - - - 0x0065BC 01:A5AC: A6 08     LDX ram_0008    ; загрузить X
C - - - - - 0x0065BE 01:A5AE: 60        RTS

; ******************************************************************************************************************

ofs_038_0D_0x0066C7_03_прибавить_позицию_спрайта_к_скорости_камеры_X_Y:
sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y:
loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y:
sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y:
C D 1 - - - 0x0066C7 01:A6B7: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0066CA 01:A6BA: 38        SEC
C - - - - - 0x0066CB 01:A6BB: E5 62     SBC ram_скорость_камеры_X
C - - - - - 0x0066CD 01:A6BD: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0066D0 01:A6C0: C9 06     CMP #$06
C - - - - - 0x0066D2 01:A6C2: 90 0C     BCC bra_A6D0_удалить_объект
loc_0x0066D4_прибавить_позицию_спрайта_к_скорости_камеры_Y:
bra_A6C4:
C - - - - - 0x0066D4 01:A6C4: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
                                        SEC
C - - - - - 0x0066D7 01:A6C7: E5 72     SBC ram_скорость_камеры_Y
C - - - - - 0x0066D9 01:A6C9: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0066DC 01:A6CC: C9 F0     CMP #$F4
C - - - - - 0x0066DE 01:A6CE: 90 36     BCC bra_A706_RTS
bra_A6D0_удалить_объект:
C - - - - - 0x0066E0 01:A6D0: 4C 75 A2  JMP loc_A27A_удалить_объект

; ******************************************************************************************************************

ofs_038_38_82A8_02:
sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры:
loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры:
sub_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры:
loc_A6D3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры:
; y lo
C D 1 - - - 0x0066E3 01:A6D3: BD 84 06  LDA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x0066E6 01:A6D6: 18        CLC
C - - - - - 0x0066E7 01:A6D7: 7D A0 06  ADC ram_скорость_объектов_y_младш,X
C - - - - - 0x0066EA 01:A6DA: 9D 84 06  STA ram_дробная_скорость_объекта_y_младш,X
; Y HI
                                        LDA ram_скорость_объектов_Y_старш,X
                                        ADC #$00
                                        SEC
                                        SBC ram_скорость_камеры_Y
                                        CLC
                                        BMI bra_A6DB
                                        ADC ram_позиция_y_спрайта_объекта_или_пули,X
                                        BCS bra_A6D0_удалить_объект
                                        BCC bra_A6DC    ; jmp
bra_A6DB:
                                        ADC ram_позиция_y_спрайта_объекта_или_пули,X
                                        BCC bra_A6D0_удалить_объект
bra_A6DC:
                                        CMP #$F4
                                        BCS bra_A6D0_удалить_объект
                                        STA ram_позиция_y_спрайта_объекта_или_пули,X
sub_0x0066FD_обработка_позиции_X_объекта_от_скорости:
sub_A6ED_обработка_позиции_X_объекта_от_скорости:
; x lo
C - - - - - 0x0066FD 01:A6ED: BD 92 06  LDA ram_дробная_скорость_объекта_x_младш,X
                                        CLC
C - - - - - 0x006700 01:A6F0: 7D BC 06  ADC ram_скорость_объектов_x_младш,X
C - - - - - 0x006703 01:A6F3: 9D 92 06  STA ram_дробная_скорость_объекта_x_младш,X
; X HI
                                        LDA ram_скорость_объектов_X_старш,X
                                        ADC #$00
                                        SEC
                                        SBC ram_скорость_камеры_X
                                        CLC
                                        BMI bra_A6F3
                                        ADC ram_позиция_x_спрайта_объекта_или_пули,X
                                        BCS bra_A6D0_удалить_объект
                                        BCC bra_A6F4    ; jmp
bra_A6F3:
                                        ADC ram_позиция_x_спрайта_объекта_или_пули,X
                                        BCC bra_A6D0_удалить_объект
bra_A6F4:
                                        CMP #$06
                                        BCC bra_A6D0_удалить_объект
                                        STA ram_позиция_x_спрайта_объекта_или_пули,X
bra_A706_RTS:
C - - - - - 0x006716 01:A706: 60        RTS

; ******************************************************************************************************************

sub_0x006717_обработка_позиции_объекта_по_Y:
loc_0x006717_обработка_позиции_объекта_по_Y:
sub_A707_обработка_позиции_объекта_по_Y:
C D 1 - - - 0x006717 01:A707: 18        CLC
C - - - - - 0x006718 01:A708: 20 ED A6  JSR sub_A6ED_обработка_позиции_X_объекта_от_скорости
C - - - - - 0x00671B 01:A70B: A0 00     LDY #$00
C - - - - - 0x00671D 01:A70D: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x006720 01:A710: 10 01     BPL bra_A713_опускается
; подымается вверх
C - - - - - 0x006722 01:A712: 88        DEY
bra_A713_опускается:
C - - - - - 0x006723 01:A713: 38        SEC
C - - - - - 0x006724 01:A714: E5 72     SBC ram_скорость_камеры_Y
C - - - - - 0x006726 01:A716: 85 01     STA ram_0001
C - - - - - 0x006728 01:A718: 98        TYA ; FF - набирает высоту, 00 - падает
C - - - - - 0x006729 01:A719: E5 8E     SBC ram_008E    ; ram_скорость_камеры_Y FF/00
C - - - - - 0x00672B 01:A71B: A8        TAY
; y lo
C - - - - - 0x00672C 01:A71C: BD 84 06  LDA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x00672F 01:A71F: 18        CLC
C - - - - - 0x006730 01:A720: 7D A0 06  ADC ram_скорость_объектов_y_младш,X
C - - - - - 0x006733 01:A723: 9D 84 06  STA ram_дробная_скорость_объекта_y_младш,X
; Y HI
C - - - - - 0x006736 01:A726: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006739 01:A729: 65 01     ADC ram_0001
C - - - - - 0x00673B 01:A72B: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00673E 01:A72E: 98        TYA
C - - - - - 0x00673F 01:A72F: 7D 8E 07  ADC ram_позиция_объектов_Y_старш,X
C - - - - - 0x006742 01:A732: 9D 8E 07  STA ram_позиция_объектов_Y_старш,X
C - - - - - 0x006745 01:A735: F0 0E     BEQ bra_A745
; объект не на экране
C - - - - - 0x006747 01:A737: C9 FF     CMP #$FF
C - - - - - 0x006749 01:A739: D0 95     BNE bra_A74A
; объект выше на 1 экран (FF)
C - - - - - 0x00674B 01:A73B: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00674E 01:A73E: C9 80     CMP #$80
C - - - - - 0x006750 01:A740: 90 8E     BCC bra_A74A
; временно удалить спрайт объекта с экрана
C - - - - - 0x006752 01:A742: 4C 7D A2  JMP loc_A27D_очистить_кадр_анимации
bra_A745:
C - - - - - 0x006755 01:A745: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006758 01:A748: C9 F0     CMP #$F0
C - - - - - 0x00675A 01:A74A: 90 BA     BCC bra_A706_RTS
bra_A74A:
C - - - - - 0x00675C 01:A74C: 4C 75 A2  JMP loc_A27A_удалить_объект

; ******************************************************************************************************************

sub_0x00675F:
C - - - - - 0x00675F 01:A74F: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x006761 01:A751: 4A        LSR
C - - - - - 0x006762 01:A752: B0 09     BCS bra_A75D
C - - - - - 0x006764 01:A754: 4A        LSR
C - - - - - 0x006765 01:A755: A9 01     LDA #$01
C - - - - - 0x006767 01:A757: 90 06     BCC bra_A75F
C - - - - - 0x006769 01:A759: A9 FF     LDA #$FF
C - - - - - 0x00676B 01:A75B: B0 02     BCS bra_A75F    ; jmp
sub_0x00676D:
bra_A75D:
C - - - - - 0x00676D 01:A75D: A9 00     LDA #$00
bra_A75F:
C - - - - - 0x00676F 01:A75F: 18        CLC
C - - - - - 0x006770 01:A760: 7D AE 06  ADC ram_скорость_объектов_Y_старш,X
C - - - - - 0x006773 01:A763: 85 01     STA ram_0001    ; скорость_объектов_Y_старш
C - - - - - 0x006775 01:A765: 0A        ASL
C - - - - - 0x006776 01:A766: A9 0F     LDA #$0F
C - - - - - 0x006778 01:A768: 90 02     BCC bra_A76C
C - - - - - 0x00677A 01:A76A: A9 EF     LDA #$EF
bra_A76C:
C - - - - - 0x00677C 01:A76C: 85 00     STA ram_0000    ; EF/0F
C - - - - - 0x00677E 01:A76E: BD 84 06  LDA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x006781 01:A771: 18        CLC
C - - - - - 0x006782 01:A772: 7D A0 06  ADC ram_скорость_объектов_y_младш,X
C - - - - - 0x006785 01:A775: 9D 84 06  STA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x006788 01:A778: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00678B 01:A77B: 65 01     ADC ram_0001    ; скорость_объектов_Y_старш
C - - - - - 0x00678D 01:A77D: A0 00     LDY #$00
C - - - - - 0x00678F 01:A77F: C9 F0     CMP #$F0
C - - - - - 0x006791 01:A781: 90 0A     BCC bra_A78D
C - - - - - 0x006793 01:A783: 65 00     ADC ram_0000    ; EF/0F
C - - - - - 0x006795 01:A785: 06 00     ASL ram_0000
C - - - - - 0x006797 01:A787: A0 01     LDY #$01
C - - - - - 0x006799 01:A789: 90 02     BCC bra_A78D
C - - - - - 0x00679B 01:A78B: A0 FF     LDY #$FF
bra_A78D:
C - - - - - 0x00679D 01:A78D: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0067A0 01:A790: 98        TYA
C - - - - - 0x0067A1 01:A791: 18        CLC
C - - - - - 0x0067A2 01:A792: 7D 8E 07  ADC ram_позиция_объектов_Y_старш,X
C - - - - - 0x0067A5 01:A795: 9D 8E 07  STA ram_позиция_объектов_Y_старш,X
C - - - - - 0x0067A8 01:A798: F0 03     BEQ bra_A79D
C - - - - - 0x0067AA 01:A79A: 20 7D A2  JSR sub_A27D_очистить_кадр_анимации
bra_A79D:
C - - - - - 0x0067AD 01:A79D: A0 00     LDY #$00
C - - - - - 0x0067AF 01:A79F: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x0067B2 01:A7A2: 10 01     BPL bra_A7A5
C - - - - - 0x0067B4 01:A7A4: 88        DEY
bra_A7A5:
C - - - - - 0x0067B5 01:A7A5: 84 00     STY ram_0000    ; FF/00
C - - - - - 0x0067B7 01:A7A7: BD BC 06  LDA ram_скорость_объектов_x_младш,X
C - - - - - 0x0067BA 01:A7AA: 18        CLC
C - - - - - 0x0067BB 01:A7AB: 7D 92 06  ADC ram_дробная_скорость_объекта_x_младш,X
C - - - - - 0x0067BE 01:A7AE: 9D 92 06  STA ram_дробная_скорость_объекта_x_младш,X
C - - - - - 0x0067C1 01:A7B1: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x0067C4 01:A7B4: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0067C7 01:A7B7: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0067CA 01:A7BA: A5 00     LDA ram_0000    ; FF/00
C - - - - - 0x0067CC 01:A7BC: 7D 9C 07  ADC ram_позиция_объектов_X_старш,X
C - - - - - 0x0067CF 01:A7BF: 9D 9C 07  STA ram_позиция_объектов_X_старш,X
C - - - - - 0x0067D2 01:A7C2: F0 0E     BEQ bra_A7D2_RTS
C - - - - - 0x0067D4 01:A7C4: 4C 7D A2  JMP loc_A27D_очистить_кадр_анимации

; ******************************************************************************************************************

sub_0x0067D7_очистить_скорость_X_Y:
loc_0x0067D7_очистить_скорость_X_Y:
sub_A7C7_очистить_скорость_X_Y:
C D 1 - - - 0x0067D7 01:A7C7: 20 D3 A7  JSR sub_A7D3_очистить_скорость_X
sub_0x0067DA_очистить_скорость_Y:
loc_0x0067DA_очистить_скорость_Y:
C D 1 - - - 0x0067DA 01:A7CA: A9 00     LDA #$00
C - - - - - 0x0067DC 01:A7CC: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0067DF 01:A7CF: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
bra_A7D2_RTS:
C - - - - - 0x0067E2 01:A7D2: 60        RTS

; ******************************************************************************************************************

sub_0x0067E3_очистить_скорость_X:
sub_A7D3_очистить_скорость_X:
C - - - - - 0x0067E3 01:A7D3: A9 00     LDA #$00
C - - - - - 0x0067E5 01:A7D5: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0067E8 01:A7D8: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x0067EB 01:A7DB: 60        RTS

; ******************************************************************************************************************

sub_0x0067EC_отразить_скорость_по_X:
loc_0x0067EC_отразить_скорость_по_X:
sub_A7DC_отразить_скорость_по_X:
C D 1 - - - 0x0067EC 01:A7DC: A9 00     LDA #$00
C - - - - - 0x0067EE 01:A7DE: 38        SEC
C - - - - - 0x0067EF 01:A7DF: FD BC 06  SBC ram_скорость_объектов_x_младш,X
C - - - - - 0x0067F2 01:A7E2: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0067F5 01:A7E5: A9 00     LDA #$00
C - - - - - 0x0067F7 01:A7E7: FD CA 06  SBC ram_скорость_объектов_X_старш,X
C - - - - - 0x0067FA 01:A7EA: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x0067FD 01:A7ED: 60        RTS

; ******************************************************************************************************************

sub_0x0067FE_отразить_скорость_по_Y:
loc_0x0067FE_отразить_скорость_по_Y:
C D 1 - - - 0x0067FE 01:A7EE: A9 00     LDA #$00
C - - - - - 0x006800 01:A7F0: 38        SEC
C - - - - - 0x006801 01:A7F1: FD A0 06  SBC ram_скорость_объектов_y_младш,X
C - - - - - 0x006804 01:A7F4: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x006807 01:A7F7: A9 00     LDA #$00
C - - - - - 0x006809 01:A7F9: FD AE 06  SBC ram_скорость_объектов_Y_старш,X
C - - - - - 0x00680C 01:A7FC: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x00680F 01:A7FF: 60        RTS

; ******************************************************************************************************************

sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает:
C - - - - - 0x006810 01:A800: BC 8E 07  LDY ram_позиция_объектов_Y_старш,X
C - - - - - 0x006813 01:A803: D0 1A     BNE bra_A81F
; объект в видимой части экрана по Y
sub_0x006815_проверить_есть_или_нет_преграда_на_пути_если_объект_падает:
C - - - - - 0x006815 01:A805: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x006818 01:A808: 30 15     BMI bra_A81F
sub_0x00681A_проверить_есть_или_нет_преграда_на_пути:
sub_A80A_проверить_есть_или_нет_преграда_на_пути:
C - - - - - 0x00681A 01:A80A: 85 07     STA ram_0007
C - - - - - 0x00681C 01:A80C: 18        CLC
C - - - - - 0x00681D 01:A80D: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006820 01:A810: C9 10     CMP #$10    ; верхняя граница экрана
C - - - - - 0x006822 01:A812: 90 0B     BCC bra_A81F
C - - - - - 0x006824 01:A814: C9 F0     CMP #$F0    ; нижняя граница экрана
C - - - - - 0x006826 01:A816: B0 07     BCS bra_A81F
C - - - - - 0x006828 01:A818: A8        TAY
C - - - - - 0x006829 01:A819: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00682C 01:A81C: 4C AA BA  JMP loc_BAAA_вычислить_тип_поверхности
bra_A81F:
C - - - - - 0x00682F 01:A81F: A9 00     LDA #$00    ; нет преград
C - - - - - 0x006831 01:A821: 60        RTS

; ******************************************************************************************************************

sub_0x006832:
C - - - - - 0x006832 01:A822: 85 00     STA ram_0000
C - - - - - 0x006834 01:A824: 18        CLC
C - - - - - 0x006835 01:A825: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006838 01:A828: 85 01     STA ram_0001
C - - - - - 0x00683A 01:A82A: 6A        ROR
C - - - - - 0x00683B 01:A82B: 45 00     EOR ram_0000
C - - - - - 0x00683D 01:A82D: 30 0B     BMI bra_A83A
C - - - - - 0x00683F 01:A82F: A5 01     LDA ram_0001
C - - - - - 0x006841 01:A831: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006844 01:A834: 20 C0 BA  JSR sub_BAC0
C - - - - - 0x006847 01:A837: 4C D0 BB  JMP loc_BBD0
bra_A83A:
C - - - - - 0x00684A 01:A83A: A9 00     LDA #$00
C - - - - - 0x00684C 01:A83C: 60        RTS

; ******************************************************************************************************************

sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности:
loc_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности:
sub_A83D_установить_Y_позицию_объекта_исходя_из_поверхности:
C D 1 - - - 0x00684D 01:A83D: 85 09     STA ram_0009    ; тип поверхности
C - - - - - 0x00684F 01:A83F: 20 50 F8  JSR sub_0x01F860
C - - - - - 0x006852 01:A842: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006855 01:A845: 60        RTS

; ******************************************************************************************************************

sub_0x0068B8:
loc_0x0068B8:
C D 1 - - - 0x0068B8 01:A8A8: 85 08     STA ram_0008
C - - - - - 0x0068BA 01:A8AA: 84 0D     STY ram_000D
C - - - - - 0x0068BC 01:A8AC: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0068BF 01:A8AF: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
sub_0x0068C2:
C - - - - - 0x0068C2 01:A8B2: 20 A0 F0  JSR sub_0x01F0B0
C - - - - - 0x0068C5 01:A8B5: B0 24     BCS bra_A8DB
C - - - - - 0x0068C7 01:A8B7: A6 10     LDX ram_0010
C - - - - - 0x0068C9 01:A8B9: A5 0C     LDA ram_000C
C - - - - - 0x0068CB 01:A8BB: 85 08     STA ram_0008
C - - - - - 0x0068CD 01:A8BD: A5 0D     LDA ram_000D
C - - - - - 0x0068CF 01:A8BF: 0A        ASL
C - - - - - 0x0068D0 01:A8C0: 0A        ASL
C - - - - - 0x0068D1 01:A8C1: 0A        ASL
C - - - - - 0x0068D2 01:A8C2: 0A        ASL
C - - - - - 0x0068D3 01:A8C3: 09 08     ORA #$08
C - - - - - 0x0068D5 01:A8C5: 85 0E     STA ram_000E
C - - - - - 0x0068D7 01:A8C7: A5 0D     LDA ram_000D
C - - - - - 0x0068D9 01:A8C9: 29 F0     AND #$F0
C - - - - - 0x0068DB 01:A8CB: 09 08     ORA #$08
C - - - - - 0x0068DD 01:A8CD: 18        CLC
C - - - - - 0x0068DE 01:A8CE: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0068E1 01:A8D1: A8        TAY
C - - - - - 0x0068E2 01:A8D2: A5 0E     LDA ram_000E
C - - - - - 0x0068E4 01:A8D4: 18        CLC
C - - - - - 0x0068E5 01:A8D5: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0068E8 01:A8D8: 20 A4 FE  JSR sub_0x01FEB4_подготовка_и_выбор_банков_для_перерисовки_части_фона_через_буфер
bra_A8DB:
C - - - - - 0x0068EB 01:A8DB: A6 10     LDX ram_0010
C - - - - - 0x0068ED 01:A8DD: 60        RTS

; ******************************************************************************************************************

sub_0x0068F6:
C - - - - - 0x0068F6 01:A8E6: 20 02 BC  JSR sub_BC02
C - - - - - 0x0068F9 01:A8E9: A6 10     LDX ram_0010
C - - - - - 0x0068FB 01:A8EB: 60        RTS

; ******************************************************************************************************************

sub_0x006933:
loc_0x006933:
C D 1 - - - 0x006933 01:A923: 84 06     STY ram_0006
C - - - - - 0x006935 01:A925: 20 AE AA  JSR sub_AAAE_копировать_позиции_спрайта
C - - - - - 0x006938 01:A928: 20 A5 F4  JSR sub_0x01F4B5
sub_0x00693B:
C - - - - - 0x00693B 01:A92B: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x00693E 01:A92E: 85 0C     STA ram_000C
C - - - - - 0x006940 01:A930: A0 00     LDY #$00
C - - - - - 0x006942 01:A932: C9 0D     CMP #$0D
C - - - - - 0x006944 01:A934: 90 08     BCC bra_A93E
C - - - - - 0x006946 01:A936: A0 01     LDY #$01
C - - - - - 0x006948 01:A938: A9 18     LDA #$18
C - - - - - 0x00694A 01:A93A: E5 0C     SBC ram_000C
C - - - - - 0x00694C 01:A93C: 85 0C     STA ram_000C
bra_A93E:
C - - - - - 0x00694E 01:A93E: C9 07     CMP #$07
C - - - - - 0x006950 01:A940: 90 0A     BCC bra_A94C
C - - - - - 0x006952 01:A942: 98        TYA
C - - - - - 0x006953 01:A943: 09 02     ORA #$02
C - - - - - 0x006955 01:A945: A8        TAY
C - - - - - 0x006956 01:A946: A9 0C     LDA #$0C
C - - - - - 0x006958 01:A948: E5 0C     SBC ram_000C
C - - - - - 0x00695A 01:A94A: 85 0C     STA ram_000C
bra_A94C:
C - - - - - 0x00695C 01:A94C: 84 07     STY ram_0007
C - - - - - 0x00695E 01:A94E: 20 AB F3  JSR sub_0x01F3BB
C - - - - - 0x006961 01:A951: 20 96 F3  JSR sub_0x01F3A6_записать_скорость_Y_X
C - - - - - 0x006964 01:A954: A9 01     LDA #$01
C - - - - - 0x006966 01:A956: 60        RTS

; ******************************************************************************************************************

sub_0x006967:
C - - - - - 0x006967 01:A957: 84 06     STY ram_0006
C - - - - - 0x006969 01:A959: 20 AE AA  JSR sub_AAAE_копировать_позиции_спрайта
C - - - - - 0x00696C 01:A95C: 20 F0 F4  JSR sub_0x01F500
C - - - - - 0x00696F 01:A95F: A5 0C     LDA ram_000C
C - - - - - 0x006971 01:A961: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x006974 01:A964: A5 17     LDA ram_0017
C - - - - - 0x006976 01:A966: 20 AB F3  JSR sub_0x01F3BB
C - - - - - 0x006979 01:A969: 4C 96 F3  JMP loc_0x01F3A6_записать_скорость_Y_X

; ******************************************************************************************************************

sub_0x00697E_смена_скорости_движение_волной:
sub_A96E_смена_скорости_движение_волной:
C - - - - - 0x00697E 01:A96E: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006981 01:A971: 38        SEC
C - - - - - 0x006982 01:A972: FD 48 07  SBC ram_скролл_объекта_Y,X
C - - - - - 0x006985 01:A975: 20 AE A9  JSR sub_A9AE
C - - - - - 0x006988 01:A978: A6 10     LDX ram_0010
C - - - - - 0x00698A 01:A97A: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x00698D 01:A97D: 38        SEC
C - - - - - 0x00698E 01:A97E: E5 01     SBC ram_0001
C - - - - - 0x006990 01:A980: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x006993 01:A983: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x006996 01:A986: E5 00     SBC ram_0000
C - - - - - 0x006998 01:A988: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x00699B 01:A98B: 60        RTS

; ******************************************************************************************************************

sub_0x00699E:
sub_A98E:
C - - - - - 0x00699E 01:A98E: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0069A1 01:A991: 38        SEC
C - - - - - 0x0069A2 01:A992: FD 56 07  SBC ram_скролл_объекта_X,X
C - - - - - 0x0069A5 01:A995: 20 AE A9  JSR sub_A9AE
C - - - - - 0x0069A8 01:A998: A6 10     LDX ram_0010
C - - - - - 0x0069AA 01:A99A: BD BC 06  LDA ram_скорость_объектов_x_младш,X
C - - - - - 0x0069AD 01:A99D: 38        SEC
C - - - - - 0x0069AE 01:A99E: E5 01     SBC ram_0001
C - - - - - 0x0069B0 01:A9A0: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0069B3 01:A9A3: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x0069B6 01:A9A6: E5 00     SBC ram_0000
C - - - - - 0x0069B8 01:A9A8: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x0069BB 01:A9AB: 60        RTS

; ******************************************************************************************************************

sub_A9AE:
C - - - - - 0x0069BE 01:A9AE: 85 01     STA ram_0001
C - - - - - 0x0069C0 01:A9B0: A2 00     LDX #$00
C - - - - - 0x0069C2 01:A9B2: B0 01     BCS bra_A9B5
C - - - - - 0x0069C4 01:A9B4: CA        DEX
bra_A9B5:
C - - - - - 0x0069C5 01:A9B5: 98        TYA
C - - - - - 0x0069C6 01:A9B6: 30 0C     BMI bra_A9C4
C - - - - - 0x0069C8 01:A9B8: F0 11     BEQ bra_A9CB
C - - - - - 0x0069CA 01:A9BA: 8A        TXA
bra_A9BB_loop:
C - - - - - 0x0069CB 01:A9BB: 06 01     ASL ram_0001
C - - - - - 0x0069CD 01:A9BD: 2A        ROL
C - - - - - 0x0069CE 01:A9BE: 88        DEY
C - - - - - 0x0069CF 01:A9BF: D0 FA     BNE bra_A9BB_loop
C - - - - - 0x0069D1 01:A9C1: 85 00     STA ram_0000
C - - - - - 0x0069D3 01:A9C3: 60        RTS
bra_A9C4:
C - - - - - 0x0069D4 01:A9C4: 8A        TXA
bra_A9C5_loop:
C - - - - - 0x0069D5 01:A9C5: 4A        LSR
C - - - - - 0x0069D6 01:A9C6: 66 01     ROR ram_0001
C - - - - - 0x0069D8 01:A9C8: C8        INY
C - - - - - 0x0069D9 01:A9C9: D0 FA     BNE bra_A9C5_loop
bra_A9CB:
C - - - - - 0x0069DB 01:A9CB: 86 00     STX ram_0000
C - - - - - 0x0069DD 01:A9CD: 60        RTS

; ******************************************************************************************************************

sub_0x0069DE:
C - - - - - 0x0069DE 01:A9CE: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0069E1 01:A9D1: 18        CLC
C - - - - - 0x0069E2 01:A9D2: 65 FC     ADC ram_scroll_Y
C - - - - - 0x0069E4 01:A9D4: B0 04     BCS bra_A9DA
C - - - - - 0x0069E6 01:A9D6: C9 F0     CMP #$F0
C - - - - - 0x0069E8 01:A9D8: 90 03     BCC bra_A9DD
bra_A9DA:
C - - - - - 0x0069EA 01:A9DA: 69 0F     ADC #$0F
C - - - - - 0x0069EC 01:A9DC: 38        SEC
bra_A9DD:
C - - - - - 0x0069ED 01:A9DD: 8D CA 03  STA ram_03CA
C - - - - - 0x0069F0 01:A9E0: 08        PHP
C - - - - - 0x0069F1 01:A9E1: BD 8E 07  LDA ram_позиция_объектов_Y_старш,X
C - - - - - 0x0069F4 01:A9E4: 29 01     AND #$01
C - - - - - 0x0069F6 01:A9E6: 0A        ASL
C - - - - - 0x0069F7 01:A9E7: 28        PLP
C - - - - - 0x0069F8 01:A9E8: 90 02     BCC bra_A9EC
C - - - - - 0x0069FA 01:A9EA: 49 02     EOR #$02
bra_A9EC:
C - - - - - 0x0069FC 01:A9EC: 85 00     STA ram_0000
C - - - - - 0x0069FE 01:A9EE: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006A01 01:A9F1: 18        CLC
C - - - - - 0x006A02 01:A9F2: 65 FD     ADC ram_scroll_X
C - - - - - 0x006A04 01:A9F4: 8D CB 03  STA ram_03CB
C - - - - - 0x006A07 01:A9F7: BD 9C 07  LDA ram_позиция_объектов_X_старш,X
C - - - - - 0x006A0A 01:A9FA: 29 01     AND #$01
C - - - - - 0x006A0C 01:A9FC: 90 02     BCC bra_AA00
- - - - - - 0x006A0E 01:A9FE: 49 01     EOR #$01
bra_AA00:
C - - - - - 0x006A10 01:AA00: 05 00     ORA ram_0000
C - - - - - 0x006A12 01:AA02: 45 FF     EOR ram_for_2000
C - - - - - 0x006A14 01:AA04: 29 03     AND #$03
C - - - - - 0x006A16 01:AA06: 8D CC 03  STA ram_03CC
C - - - - - 0x006A19 01:AA09: 60        RTS

; ******************************************************************************************************************

sub_0x006A1A:
loc_0x006A1A:
C D 1 - - - 0x006A1A 01:AA0A: AD CA 03  LDA ram_03CA
C - - - - - 0x006A1D 01:AA0D: 38        SEC
C - - - - - 0x006A1E 01:AA0E: FD 22 05  SBC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006A21 01:AA11: 90 04     BCC bra_AA17
C - - - - - 0x006A23 01:AA13: C9 F0     CMP #$F0
C - - - - - 0x006A25 01:AA15: 90 04     BCC bra_AA1B
bra_AA17:
C - - - - - 0x006A27 01:AA17: 38        SEC
C - - - - - 0x006A28 01:AA18: E9 10     SBC #$10
C - - - - - 0x006A2A 01:AA1A: 38        SEC
bra_AA1B:
C - - - - - 0x006A2B 01:AA1B: 85 FC     STA ram_scroll_Y
C - - - - - 0x006A2D 01:AA1D: 08        PHP
C - - - - - 0x006A2E 01:AA1E: BD 8E 07  LDA ram_позиция_объектов_Y_старш,X
C - - - - - 0x006A31 01:AA21: 0A        ASL
C - - - - - 0x006A32 01:AA22: 29 02     AND #$02
C - - - - - 0x006A34 01:AA24: 28        PLP
C - - - - - 0x006A35 01:AA25: 90 02     BCC bra_AA29
C - - - - - 0x006A37 01:AA27: 49 02     EOR #$02
bra_AA29:
C - - - - - 0x006A39 01:AA29: 85 00     STA ram_0000
C - - - - - 0x006A3B 01:AA2B: AD CB 03  LDA ram_03CB
C - - - - - 0x006A3E 01:AA2E: 38        SEC
C - - - - - 0x006A3F 01:AA2F: FD 3C 05  SBC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006A42 01:AA32: 85 FD     STA ram_scroll_X
C - - - - - 0x006A44 01:AA34: BD 9C 07  LDA ram_позиция_объектов_X_старш,X
C - - - - - 0x006A47 01:AA37: 29 01     AND #$01
C - - - - - 0x006A49 01:AA39: B0 02     BCS bra_AA3D
C - - - - - 0x006A4B 01:AA3B: 49 01     EOR #$01
bra_AA3D:
C - - - - - 0x006A4D 01:AA3D: 05 00     ORA ram_0000
C - - - - - 0x006A4F 01:AA3F: 4D CC 03  EOR ram_03CC
C - - - - - 0x006A52 01:AA42: 29 03     AND #$03
C - - - - - 0x006A54 01:AA44: 85 00     STA ram_0000
C - - - - - 0x006A56 01:AA46: A5 FF     LDA ram_for_2000
C - - - - - 0x006A58 01:AA48: 29 FC     AND #$FC
C - - - - - 0x006A5A 01:AA4A: 05 00     ORA ram_0000
C - - - - - 0x006A5C 01:AA4C: 85 FF     STA ram_for_2000
C - - - - - 0x006A5E 01:AA4E: 60        RTS

; ******************************************************************************************************************

sub_0x006A5F:
C - - - - - 0x006A5F 01:AA4F: AD CA 03  LDA ram_03CA
C - - - - - 0x006A62 01:AA52: 38        SEC
C - - - - - 0x006A63 01:AA53: FD 22 05  SBC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006A66 01:AA56: 90 04     BCC bra_AA5C
C - - - - - 0x006A68 01:AA58: C9 F0     CMP #$F0
C - - - - - 0x006A6A 01:AA5A: 90 04     BCC bra_AA60
bra_AA5C:
C - - - - - 0x006A6C 01:AA5C: 38        SEC
C - - - - - 0x006A6D 01:AA5D: E9 10     SBC #$10
C - - - - - 0x006A6F 01:AA5F: 38        SEC
bra_AA60:
C - - - - - 0x006A70 01:AA60: 85 F9     STA ram_00F9
C - - - - - 0x006A72 01:AA62: 08        PHP
C - - - - - 0x006A73 01:AA63: BD 8E 07  LDA ram_позиция_объектов_Y_старш,X
C - - - - - 0x006A76 01:AA66: 0A        ASL
C - - - - - 0x006A77 01:AA67: 29 02     AND #$02
C - - - - - 0x006A79 01:AA69: 28        PLP
C - - - - - 0x006A7A 01:AA6A: 90 02     BCC bra_AA6E
C - - - - - 0x006A7C 01:AA6C: 49 02     EOR #$02
bra_AA6E:
C - - - - - 0x006A7E 01:AA6E: 85 00     STA ram_0000
C - - - - - 0x006A80 01:AA70: AD CB 03  LDA ram_03CB
C - - - - - 0x006A83 01:AA73: 38        SEC
C - - - - - 0x006A84 01:AA74: FD 3C 05  SBC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006A87 01:AA77: 85 FA     STA ram_00FA
C - - - - - 0x006A89 01:AA79: BD 9C 07  LDA ram_позиция_объектов_X_старш,X
C - - - - - 0x006A8C 01:AA7C: 29 01     AND #$01
C - - - - - 0x006A8E 01:AA7E: B0 02     BCS bra_AA82
C - - - - - 0x006A90 01:AA80: 49 01     EOR #$01
bra_AA82:
C - - - - - 0x006A92 01:AA82: 05 00     ORA ram_0000
C - - - - - 0x006A94 01:AA84: 4D CC 03  EOR ram_03CC
C - - - - - 0x006A97 01:AA87: 29 03     AND #$03
C - - - - - 0x006A99 01:AA89: 85 00     STA ram_0000
C - - - - - 0x006A9B 01:AA8B: A5 FB     LDA ram_00FB
C - - - - - 0x006A9D 01:AA8D: 29 FC     AND #$FC
C - - - - - 0x006A9F 01:AA8F: 05 00     ORA ram_0000
C - - - - - 0x006AA1 01:AA91: 85 FB     STA ram_00FB
C - - - - - 0x006AA3 01:AA93: 60        RTS

; ******************************************************************************************************************

sub_0x006AA4_save_reg_values:
C - - - - - 0x006AA4 01:AA94: A5 FD     LDA ram_scroll_X
C - - - - - 0x006AA6 01:AA96: 85 7A     STA ram_007A
C - - - - - 0x006AA8 01:AA98: A5 FC     LDA ram_scroll_Y
C - - - - - 0x006AAA 01:AA9A: 85 7B     STA ram_007B
C - - - - - 0x006AAC 01:AA9C: A5 FF     LDA ram_for_2000
C - - - - - 0x006AAE 01:AA9E: 85 7C     STA ram_007C
C - - - - - 0x006AB0 01:AAA0: 60        RTS

; ******************************************************************************************************************

sub_0x006AB1_restore_reg_values:
C - - - - - 0x006AB1 01:AAA1: A5 7A     LDA ram_007A
C - - - - - 0x006AB3 01:AAA3: 85 FD     STA ram_scroll_X
C - - - - - 0x006AB5 01:AAA5: A5 7B     LDA ram_007B
C - - - - - 0x006AB7 01:AAA7: 85 FC     STA ram_scroll_Y
C - - - - - 0x006AB9 01:AAA9: A5 7C     LDA ram_007C
C - - - - - 0x006ABB 01:AAAB: 85 FF     STA ram_for_2000
C - - - - - 0x006ABD 01:AAAD: 60        RTS

; ******************************************************************************************************************

sub_0x006ABE_копировать_позиции_спрайта:
sub_AAAE_копировать_позиции_спрайта:
C - - - - - 0x006ABE 01:AAAE: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006AC1 01:AAB1: 85 08     STA ram_0008
C - - - - - 0x006AC3 01:AAB3: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006AC6 01:AAB6: 85 09     STA ram_0009
C - - - - - 0x006AC8 01:AAB8: 60        RTS

; ******************************************************************************************************************

sub_0x006AC9_сдвинуть_объект_по_Y_X:
sub_AAB9_сдвинуть_объект_по_Y_X:
C - - - - - 0x006AC9 01:AAB9: 18        CLC
C - - - - - 0x006ACA 01:AABA: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006ACD 01:AABD: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
                                        LDA #$08
C - - - - - 0x006AD1 01:AAC1: 18        CLC
C - - - - - 0x006AD2 01:AAC2: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006AD5 01:AAC5: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006AD8 01:AAC8: 60        RTS

; ******************************************************************************************************************

sub_0x006ADB_прибавить_скорость_Y:
loc_0x00AACB_прибавить_скорость_Y:
sub_AACB_прибавить_скорость_Y:
C D 1 - - - 0x006ADB 01:AACB: 18        CLC
C - - - - - 0x006ADC 01:AACC: 7D A0 06  ADC ram_скорость_объектов_y_младш,X
C - - - - - 0x006ADF 01:AACF: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x006AE2 01:AAD2: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x006AE5 01:AAD5: 69 00     ADC #$00
C - - - - - 0x006AE7 01:AAD7: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x006AEA 01:AADA: 60        RTS

; ******************************************************************************************************************

sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x:
; по итогу Y = индекс игрока
C - - - - - 0x006B1B 01:AB0B: AD 4C 05  LDA ram_позиция_x_спрайта_игрока
C - - - - - 0x006B1E 01:AB0E: 38        SEC
C - - - - - 0x006B1F 01:AB0F: FD 3C 05  SBC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006B22 01:AB12: B0 04     BCS bra_AB18
C - - - - - 0x006B24 01:AB14: 49 FF     EOR #$FF
C - - - - - 0x006B26 01:AB16: 69 01     ADC #$01
bra_AB18:
C - - - - - 0x006B28 01:AB18: 85 08     STA ram_0008    ; игрок 1
C - - - - - 0x006B2A 01:AB1A: AD 4D 05  LDA ram_позиция_x_спрайта_игрока + $01
C - - - - - 0x006B2D 01:AB1D: 38        SEC
C - - - - - 0x006B2E 01:AB1E: FD 3C 05  SBC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006B31 01:AB21: 4C 3A AB  JMP loc_AB3A

; ******************************************************************************************************************

sub_0x006B34_выбрать_ближайшего_игрока_по_оси_y:
sub_AB24_выбрать_ближайшего_игрока_по_оси_y:
; по итогу Y = индекс игрока
C - - - - - 0x006B34 01:AB24: AD 32 05  LDA ram_позиция_y_спрайта_игрока
C - - - - - 0x006B37 01:AB27: 38        SEC
C - - - - - 0x006B38 01:AB28: FD 22 05  SBC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006B3B 01:AB2B: B0 04     BCS bra_AB31
C - - - - - 0x006B3D 01:AB2D: 49 FF     EOR #$FF
C - - - - - 0x006B3F 01:AB2F: 69 01     ADC #$01
bra_AB31:
C - - - - - 0x006B41 01:AB31: 85 08     STA ram_0008    ; игрок 1
C - - - - - 0x006B43 01:AB33: AD 33 05  LDA ram_позиция_y_спрайта_игрока + $01
C - - - - - 0x006B46 01:AB36: 38        SEC
C - - - - - 0x006B47 01:AB37: FD 22 05  SBC ram_позиция_y_спрайта_объекта_или_пули,X
loc_AB3A:
C D 1 - - - 0x006B4A 01:AB3A: B0 04     BCS bra_AB40
C - - - - - 0x006B4C 01:AB3C: 49 FF     EOR #$FF
C - - - - - 0x006B4E 01:AB3E: 69 01     ADC #$01
bra_AB40:
C - - - - - 0x006B50 01:AB40: 85 09     STA ram_0009    ; игрок 2

C - - - - - 0x006B52 01:AB42: A0 FE     LDY #$FE
C - - - - - 0x006B54 01:AB44: A5 A0     LDA ram_статус_игрока
C - - - - - 0x006B56 01:AB46: C9 02     CMP #con_plr_status_живой
C - - - - - 0x006B58 01:AB48: F0 02     BEQ bra_AB4C_живой_1
C - - - - - 0x006B5A 01:AB4A: 84 08     STY ram_0008    ; FE игрок 1
bra_AB4C_живой_1:
C - - - - - 0x006B5C 01:AB4C: A0 FF     LDY #$FF
C - - - - - 0x006B5E 01:AB4E: A5 A1     LDA ram_статус_игрока + $01
C - - - - - 0x006B60 01:AB50: C9 02     CMP #con_plr_status_живой
C - - - - - 0x006B62 01:AB52: F0 02     BEQ bra_AB56_живой_2
C - - - - - 0x006B64 01:AB54: 84 09     STY ram_0009    ; FF игрок 2
bra_AB56_живой_2:
C - - - - - 0x006B66 01:AB56: A5 09     LDA ram_0009    ; игрок 2
C - - - - - 0x006B68 01:AB58: A0 01     LDY #$01
C - - - - - 0x006B6A 01:AB5A: C5 08     CMP ram_0008    ; игрок 1
C - - - - - 0x006B6C 01:AB5C: 90 03     BCC bra_AB61
C - - - - - 0x006B6E 01:AB5E: 88        DEY ; 00
C - - - - - 0x006B6F 01:AB5F: A5 08     LDA ram_0008    ; игрок 1
bra_AB61:
C - - - - - 0x006B71 01:AB61: 84 0A     STY ram_000A    ; индекс игрока
C - - - - - 0x006B73 01:AB63: 60        RTS

; ******************************************************************************************************************

sub_0x006B74:
C - - - - - 0x006B74 01:AB64: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x006B76 01:AB66: 4A        LSR
C - - - - - 0x006B77 01:AB67: A0 02     LDY #$02
C - - - - - 0x006B79 01:AB69: D0 05     BNE bra_AB70    ; jmp

; ******************************************************************************************************************

sub_0x006B7B:
loc_0x006B7B:
C D 1 - - - 0x006B7B 01:AB6B: 20 87 AB  JSR sub_AB87
C - - - - - 0x006B7E 01:AB6E: A0 01     LDY #$01
bra_AB70:
C - - - - - 0x006B80 01:AB70: 4A        LSR
C - - - - - 0x006B81 01:AB71: B0 02     BCS bra_AB75
C - - - - - 0x006B83 01:AB73: A0 00     LDY #$00
bra_AB75:
C - - - - - 0x006B85 01:AB75: 84 FC     STY ram_scroll_Y
C - - - - - 0x006B87 01:AB77: DE 02 07  DEC ram_счетчик_анимации_объектов,X
C - - - - - 0x006B8A 01:AB7A: D0 0A     BNE bra_AB86_RTS
C - - - - - 0x006B8C 01:AB7C: A9 10     LDA #$10
C - - - - - 0x006B8E 01:AB7E: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x006B91 01:AB81: A9 08     LDA #con_sound_08
C - - - - - 0x006B93 01:AB83: 4C DE FD  JMP loc_0x01FDEE_play_sound
bra_AB86_RTS:
C - - - - - 0x006B96 01:AB86: 60        RTS

; ******************************************************************************************************************

sub_0x006B97:
sub_AB87:
C - - - - - 0x006B97 01:AB87: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x006B99 01:AB89: 4A        LSR
C - - - - - 0x006B9A 01:AB8A: 4A        LSR
C - - - - - 0x006B9B 01:AB8B: A0 00     LDY #$00
C - - - - - 0x006B9D 01:AB8D: 90 01     BCC bra_AB90
C - - - - - 0x006B9F 01:AB8F: C8        INY ; 01
bra_AB90:
C - - - - - 0x006BA0 01:AB90: 84 FD     STY ram_scroll_X
C - - - - - 0x006BA2 01:AB92: 84 FA     STY ram_00FA
C - - - - - 0x006BA4 01:AB94: 60        RTS

; ******************************************************************************************************************

; выбор кол-во HP нужно будет потом переделать!!
sub_0x006BA5_выбрать_количество_HP_от_сложности_игры:
C - - - - - 0x006BA5 01:AB95: A0 00     LDY #$00
C - - - - - 0x006BA7 01:AB97: F0 02     BEQ bra_AB9B    ; jmp
sub_0x006BA9_выбрать_количество_HP_от_сложности_игры:
bra_AB9B:
C - - - - - 0x006BA9 01:AB99: A0 03     LDY #$03
sub_0x006BAB_выбрать_количество_HP_от_сложности_игры:
C - - - - - 0x006BAB 01:AB9B: 85 08     STA ram_0008
C - - - - - 0x006BAD 01:AB9D: 84 09     STY ram_0009
; bzk optimize, CLC + LDA, that's it
C - - - - - 0x006BAF 01:AB9F: A5 52     LDA ram_option_сложность
C - - - - - 0x006BB1 01:ABA1: C9 02     CMP #$02
C - - - - - 0x006BB3 01:ABA3: 90 02     BCC bra_ABA7
; C = 1
C - - - - - 0x006BB5 01:ABA5: A9 01     LDA #$01
bra_ABA7:   ; C = 0
C - - - - - 0x006BB7 01:ABA7: 65 09     ADC ram_0009
C - - - - - 0x006BB9 01:ABA9: A8        TAY
C - - - - - 0x006BBA 01:ABAA: B9 B4 AB  LDA tbl_ABB4,Y
C - - - - - 0x006BBD 01:ABAD: 18        CLC
C - - - - - 0x006BBE 01:ABAE: 65 08     ADC ram_0008
C - - - - - 0x006BC0 01:ABB0: 9D 76 06  STA ram_жизни_объектов_8bit,X
; временно хп врагов будет только 8 bit
                                        LDA #$00
                                        STA ram_жизни_объектов_16bit,X
                                        STA ram_жизни_объектов_32bit,X
C - - - - - 0x006BC3 01:ABB3: 60        RTS

tbl_ABB4:
; +00 = 0 S weapon
; +01 = 1 S weapon
; +02 = 2 S weapon
; 00 enemy
- D 1 - - - 0x006BC4 01:ABB4: 00        .byte $00   ; 
- D 1 - - - 0x006BC5 01:ABB5: 04        .byte $04   ; 
- D 1 - - - 0x006BC6 01:ABB6: 07        .byte $07   ; 
; 03 boss
- D 1 - - - 0x006BC7 01:ABB7: 00        .byte $00   ; 
- D 1 - - - 0x006BC8 01:ABB8: 10        .byte $10   ; 
- - - - - - 0x006BC9 01:ABB9: 18        .byte $18   ; 
; 06 ?
- D 1 - - - 0x006BCA 01:ABBA: 00        .byte $00   ; 
- D 1 - - - 0x006BCB 01:ABBB: 04        .byte $04   ; 
- - - - - - 0x006BCC 01:ABBC: 08        .byte $08   ; 

; ******************************************************************************************************************

sub_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта:
loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта:
sub_ABC8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта:
loc_ABC8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта:
; Y = номер типа объекта
C D 1 - - - 0x006BD8 01:ABC8: 84 17     STY ram_0017    ; номер типа объекта
C - - - - - 0x006BDA 01:ABCA: 20 FD F6  JSR sub_0x01F70D_попытка_создать_объект
sub_0x00ABCD_попытка_создать_новый_объект_на_позиции_текущего_объекта:
sub_ABCD_попытка_создать_новый_объект_на_позиции_текущего_объекта:
C - - - - - 0x006BDD 01:ABCD: D0 2A     BNE bra_ABF9_не_получилось
C - - - - - 0x006BDF 01:ABCF: 86 11     STX ram_0011    ; сохранить индекс нового объекта
C - - - - - 0x006BE1 01:ABD1: A4 10     LDY ram_0010    ; загрузить индекс объекта
C - - - - - 0x006BE3 01:ABD3: A5 17     LDA ram_0017    ; номер типа объекта
C - - - - - 0x006BE5 01:ABD5: 9D D8 06  STA ram_тип_объектов,X
C - - - - - 0x006BE8 01:ABD8: B9 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x006BEB 01:ABDB: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006BEE 01:ABDE: B9 8E 07  LDA ram_позиция_объектов_Y_старш,Y
C - - - - - 0x006BF1 01:ABE1: 9D 8E 07  STA ram_позиция_объектов_Y_старш,X
C - - - - - 0x006BF4 01:ABE4: B9 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x006BF7 01:ABE7: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006BFA 01:ABEA: B9 9C 07  LDA ram_позиция_объектов_X_старш,Y
C - - - - - 0x006BFD 01:ABED: 9D 9C 07  STA ram_позиция_объектов_X_старш,X
C - - - - - 0x006C00 01:ABF0: B9 1E 07  LDA ram_флаги_объектов,Y
C - - - - - 0x006C03 01:ABF3: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x006C06 01:ABF6: 38        SEC
C - - - - - 0x006C07 01:ABF7: B0 01     BCS bra_ABFA    ; jmp
bra_ABF9_не_получилось:
C - - - - - 0x006C09 01:ABF9: 18        CLC
bra_ABFA:
C - - - - - 0x006C0A 01:ABFA: A6 10     LDX ram_0010    ; загрузить индекс объекта
bra_ABFC_RTS:
C - - - - - 0x006C0C 01:ABFC: 60        RTS

; ******************************************************************************************************************

sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков:
loc_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков:
sub_ABFD_выбрать_кадр_анимации_исходя_из_счетчиков:
C D 1 - - - 0x006C0D 01:ABFD: DE 02 07  DEC ram_счетчик_анимации_объектов,X
C - - - - - 0x006C10 01:AC00: 10 1F     BPL bra_AC21_RTS
C - - - - - 0x006C12 01:AC02: B9 22 AC  LDA tbl_AC22_счетчики_анимации,Y
C - - - - - 0x006C15 01:AC05: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x006C18 01:AC08: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x006C1B 01:AC0B: 38        SEC
C - - - - - 0x006C1C 01:AC0C: E9 01     SBC #$01
C - - - - - 0x006C1E 01:AC0E: B0 04     BCS bra_AC14
C - - - - - 0x006C20 01:AC10: 38        SEC
C - - - - - 0x006C21 01:AC11: B9 42 AC  LDA tbl_AC42_счетчики_анимации_взрыва,Y
bra_AC14:
C - - - - - 0x006C24 01:AC14: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x006C27 01:AC17: 79 C3 AC  ADC tbl_ACC3_индексы_кадров_анимации,Y
C - - - - - 0x006C2A 01:AC1A: A8        TAY
C - - - - - 0x006C2B 01:AC1B: B9 62 AC  LDA tbl_AC62_кадры_анимации,Y
C - - - - - 0x006C2E 01:AC1E: 9D 08 05  STA ram_кадр_объекта_или_пули,X
bra_AC21_RTS:
C - - - - - 0x006C31 01:AC21: 60        RTS

tbl_AC22_счетчики_анимации:
- D 1 - - - 0x006C32 01:AC22: 06        .byte $06   ; 00 
- D 1 - - - 0x006C33 01:AC23: 06        .byte $06   ; 01 
- - - - - - 0x006C34 01:AC24: 04        .byte $04   ; 02 
- D 1 - - - 0x006C35 01:AC25: 04        .byte $04   ; 03 
- D 1 - - - 0x006C36 01:AC26: 04        .byte $04   ; 04 
- D 1 - - - 0x006C37 01:AC27: 03        .byte $03   ; 05 
- D 1 - - - 0x006C38 01:AC28: 01        .byte $01   ; 06 
- D 1 - - - 0x006C39 01:AC29: 06        .byte $06   ; 07 
- D 1 - - - 0x006C3A 01:AC2A: 05        .byte $05   ; 08 
- D 1 - - - 0x006C3B 01:AC2B: 05        .byte $05   ; 09 
- D 1 - - - 0x006C3C 01:AC2C: 05        .byte $05   ; 0A 
- D 1 - - - 0x006C3D 01:AC2D: 04        .byte $04   ; 0B 
- D 1 - - - 0x006C3E 01:AC2E: 03        .byte $03   ; 0C 
- D 1 - - - 0x006C3F 01:AC2F: 04        .byte $04   ; 0D 
- D 1 - - - 0x006C40 01:AC30: 04        .byte $04   ; 0E 
- D 1 - - - 0x006C41 01:AC31: 04        .byte $04   ; 0F 
- D 1 - - - 0x006C42 01:AC32: 04        .byte $04   ; 10 
- D 1 - - - 0x006C43 01:AC33: 04        .byte $04   ; 11 
- D 1 - - - 0x006C44 01:AC34: 04        .byte $04   ; 12 
- D 1 - - - 0x006C45 01:AC35: 06        .byte $06   ; 13 
- D 1 - - - 0x006C46 01:AC36: 06        .byte $06   ; 14 
- D 1 - - - 0x006C47 01:AC37: 04        .byte $04   ; 15 
- D 1 - - - 0x006C48 01:AC38: 04        .byte $04   ; 16 
- D 1 - - - 0x006C49 01:AC39: 01        .byte $01   ; 17 
- D 1 - - - 0x006C4A 01:AC3A: 05        .byte $05   ; 18 
; bzk garbage?
- - - - - - 0x006C4B 01:AC3B: 00        .byte $06   ; 19 
- - - - - - 0x006C4C 01:AC3C: 00        .byte $00   ; 1A 
- - - - - - 0x006C4D 01:AC3D: 00        .byte $00   ; 1B 
- - - - - - 0x006C4E 01:AC3E: 00        .byte $00   ; 1C 
- - - - - - 0x006C4F 01:AC3F: 00        .byte $00   ; 1D 
- - - - - - 0x006C50 01:AC40: 00        .byte $00   ; 1E 
- - - - - - 0x006C51 01:AC41: 00        .byte $00   ; 1F 

tbl_AC42_счетчики_анимации_взрыва:
- D 1 - - - 0x006C52 01:AC42: 05        .byte $05   ; 00 
- D 1 - - - 0x006C53 01:AC43: 05        .byte $05   ; 01 
- - - - - - 0x006C54 01:AC44: 03        .byte $03   ; 02 
- D 1 - - - 0x006C55 01:AC45: 07        .byte $07   ; 03 
- D 1 - - - 0x006C56 01:AC46: 05        .byte $05   ; 04 
- D 1 - - - 0x006C57 01:AC47: 05        .byte $05   ; 05 
- D 1 - - - 0x006C58 01:AC48: 05        .byte $05   ; 06 
- D 1 - - - 0x006C59 01:AC49: 05        .byte $05   ; 07 
- D 1 - - - 0x006C5A 01:AC4A: 03        .byte $03   ; 08 
- D 1 - - - 0x006C5B 01:AC4B: 03        .byte $03   ; 09 
- D 1 - - - 0x006C5C 01:AC4C: 01        .byte $01   ; 0A 
- D 1 - - - 0x006C5D 01:AC4D: 03        .byte $03   ; 0B 
- D 1 - - - 0x006C5E 01:AC4E: 01        .byte $01   ; 0C 
- D 1 - - - 0x006C5F 01:AC4F: 01        .byte $01   ; 0D 
- D 1 - - - 0x006C60 01:AC50: 01        .byte $01   ; 0E 
- D 1 - - - 0x006C61 01:AC51: 01        .byte $01   ; 0F 
- D 1 - - - 0x006C62 01:AC52: 02        .byte $02   ; 10 
- D 1 - - - 0x006C63 01:AC53: 03        .byte $03   ; 11 
- D 1 - - - 0x006C64 01:AC54: 01        .byte $01   ; 12 
- D 1 - - - 0x006C65 01:AC55: 01        .byte $01   ; 13 
- D 1 - - - 0x006C66 01:AC56: 01        .byte $01   ; 14 
- D 1 - - - 0x006C67 01:AC57: 01        .byte $01   ; 15 
- D 1 - - - 0x006C68 01:AC58: 01        .byte $01   ; 16 
- D 1 - - - 0x006C69 01:AC59: 07        .byte $07   ; 17 
- D 1 - - - 0x006C6A 01:AC5A: 01        .byte $01   ; 18 
; bzk garbage?
- - - - - - 0x006C6B 01:AC5B: 00        .byte $05   ; 19 
- - - - - - 0x006C6C 01:AC5C: 00        .byte $00   ; 1A 
- - - - - - 0x006C6D 01:AC5D: 00        .byte $00   ; 1B 
- - - - - - 0x006C6E 01:AC5E: 00        .byte $00   ; 1C 
- - - - - - 0x006C6F 01:AC5F: 00        .byte $00   ; 1D 
- - - - - - 0x006C70 01:AC60: 00        .byte $00   ; 1E 
- - - - - - 0x006C71 01:AC61: 00        .byte $00   ; 1F 

tbl_AC62_кадры_анимации:
; ???
- D 1 - - - 0x006C72 01:AC62: 1F        .byte $1F   ; 00
- D 1 - - - 0x006C73 01:AC63: 1C        .byte $1C   ; 01
- D 1 - - - 0x006C74 01:AC64: 1E        .byte $1E   ; 02
- D 1 - - - 0x006C75 01:AC65: 1D        .byte $1D   ; 03
- D 1 - - - 0x006C76 01:AC66: 1C        .byte $1C   ; 04
- D 1 - - - 0x006C77 01:AC67: 1B        .byte $1B   ; 05
- D 1 - - - 0x006C78 01:AC68: 38        .byte $38   ; 06
- D 1 - - - 0x006C79 01:AC69: 39        .byte $39   ; 07
- D 1 - - - 0x006C7A 01:AC6A: 39        .byte $39   ; 08
- D 1 - - - 0x006C7B 01:AC6B: 38        .byte $38   ; 09
- D 1 - - - 0x006C7C 01:AC6C: 37        .byte $37   ; 0A
- D 1 - - - 0x006C7D 01:AC6D: 37        .byte $37   ; 0B
- - - - - - 0x006C7E 01:AC6E: 05        .byte $05   ; 0C
- - - - - - 0x006C7F 01:AC6F: 02        .byte $02   ; 0D
- - - - - - 0x006C80 01:AC70: 04        .byte $04   ; 0E
- - - - - - 0x006C81 01:AC71: 03        .byte $03   ; 0F
- D 1 - - - 0x006C82 01:AC72: 30        .byte $30   ; 10
- D 1 - - - 0x006C83 01:AC73: 2F        .byte $2F   ; 11
- D 1 - - - 0x006C84 01:AC74: 2E        .byte $2E   ; 12
- D 1 - - - 0x006C85 01:AC75: 2D        .byte $2D   ; 13
- D 1 - - - 0x006C86 01:AC76: 2C        .byte $2C   ; 14
- D 1 - - - 0x006C87 01:AC77: 2B        .byte $2B   ; 15
- D 1 - - - 0x006C88 01:AC78: 2A        .byte $2A   ; 16
- D 1 - - - 0x006C89 01:AC79: 29        .byte $29   ; 17
- D 1 - - - 0x006C8A 01:AC7A: 35        .byte $35   ; 18
- D 1 - - - 0x006C8B 01:AC7B: 32        .byte $32   ; 19
- D 1 - - - 0x006C8C 01:AC7C: 34        .byte $34   ; 1A
- D 1 - - - 0x006C8D 01:AC7D: 33        .byte $33   ; 1B
- D 1 - - - 0x006C8E 01:AC7E: 32        .byte $32   ; 1C
- D 1 - - - 0x006C8F 01:AC7F: 31        .byte $31   ; 1D
- D 1 - - - 0x006C90 01:AC80: 61        .byte $61   ; 1E
- D 1 - - - 0x006C91 01:AC81: 60        .byte $60   ; 1F
- D 1 - - - 0x006C92 01:AC82: 5F        .byte $5F   ; 20
- D 1 - - - 0x006C93 01:AC83: 5E        .byte $5E   ; 21
- D 1 - - - 0x006C94 01:AC84: 5D        .byte $5D   ; 22
- D 1 - - - 0x006C95 01:AC85: 5C        .byte $5C   ; 23
- D 1 - - - 0x006C96 01:AC86: 61        .byte $61   ; 24
- D 1 - - - 0x006C97 01:AC87: 60        .byte $60   ; 25
- D 1 - - - 0x006C98 01:AC88: 5F        .byte $5F   ; 26
- D 1 - - - 0x006C99 01:AC89: 5E        .byte $5E   ; 27
- D 1 - - - 0x006C9A 01:AC8A: 5D        .byte $5D   ; 28
- D 1 - - - 0x006C9B 01:AC8B: 5C        .byte $5C   ; 29
- D 1 - - - 0x006C9C 01:AC8C: 6A        .byte $6A   ; 2A
- D 1 - - - 0x006C9D 01:AC8D: 67        .byte $67   ; 2B
- D 1 - - - 0x006C9E 01:AC8E: 69        .byte $69   ; 2C
- D 1 - - - 0x006C9F 01:AC8F: 68        .byte $68   ; 2D
- D 1 - - - 0x006CA0 01:AC90: 67        .byte $67   ; 2E
- D 1 - - - 0x006CA1 01:AC91: 66        .byte $66   ; 2F
- D 1 - - - 0x006CA2 01:AC92: 72        .byte $72   ; 30
- D 1 - - - 0x006CA3 01:AC93: 71        .byte $71   ; 31
- D 1 - - - 0x006CA4 01:AC94: 70        .byte $70   ; 32
- D 1 - - - 0x006CA5 01:AC95: 6F        .byte $6F   ; 33
- D 1 - - - 0x006CA6 01:AC96: 6F        .byte $6F   ; 34
- D 1 - - - 0x006CA7 01:AC97: 70        .byte $70   ; 35
- D 1 - - - 0x006CA8 01:AC98: 71        .byte $71   ; 36
- D 1 - - - 0x006CA9 01:AC99: 72        .byte $72   ; 37
- D 1 - - - 0x006CAA 01:AC9A: 74        .byte $74   ; 38
- D 1 - - - 0x006CAB 01:AC9B: 73        .byte $73   ; 39
- D 1 - - - 0x006CAC 01:AC9C: 76        .byte $76   ; 3A
- D 1 - - - 0x006CAD 01:AC9D: 77        .byte $77   ; 3B
- D 1 - - - 0x006CAE 01:AC9E: 76        .byte $76   ; 3C
- D 1 - - - 0x006CAF 01:AC9F: 75        .byte $75   ; 3D
- D 1 - - - 0x006CB0 01:ACA0: 6E        .byte $6E   ; 3E
- D 1 - - - 0x006CB1 01:ACA1: 6D        .byte $6D   ; 3F
- D 1 - - - 0x006CB2 01:ACA2: 83        .byte $83   ; 40
- D 1 - - - 0x006CB3 01:ACA3: 82        .byte $82   ; 41
- D 1 - - - 0x006CB4 01:ACA4: 91        .byte $91   ; 42
- D 1 - - - 0x006CB5 01:ACA5: 90        .byte $90   ; 43
- D 1 - - - 0x006CB6 01:ACA6: 93        .byte $93   ; 44
- D 1 - - - 0x006CB7 01:ACA7: 92        .byte $92   ; 45
- D 1 - - - 0x006CB8 01:ACA8: A0        .byte $A0   ; 46
- D 1 - - - 0x006CB9 01:ACA9: 9F        .byte $9F   ; 47
- D 1 - - - 0x006CBA 01:ACAA: 9E        .byte $9E   ; 48
- D 1 - - - 0x006CBB 01:ACAB: A4        .byte $A4   ; 49
- D 1 - - - 0x006CBC 01:ACAC: A3        .byte $A3   ; 4A
- D 1 - - - 0x006CBD 01:ACAD: A2        .byte $A2   ; 4B
- D 1 - - - 0x006CBE 01:ACAE: A1        .byte $A1   ; 4C
- D 1 - - - 0x006CBF 01:ACAF: A6        .byte $A6   ; 4D
- D 1 - - - 0x006CC0 01:ACB0: A5        .byte $A5   ; 4E
- D 1 - - - 0x006CC1 01:ACB1: 99        .byte $99   ; 4F
- D 1 - - - 0x006CC2 01:ACB2: 98        .byte $98   ; 50
- D 1 - - - 0x006CC3 01:ACB3: 98        .byte $98   ; 51
- D 1 - - - 0x006CC4 01:ACB4: 9D        .byte $9D   ; 52
- D 1 - - - 0x006CC5 01:ACB5: A9        .byte $A9   ; 53
- D 1 - - - 0x006CC6 01:ACB6: A8        .byte $A8   ; 54
- D 1 - - - 0x006CC7 01:ACB7: AB        .byte $AB   ; 55
- D 1 - - - 0x006CC8 01:ACB8: AA        .byte $AA   ; 56
- D 1 - - - 0x006CC9 01:ACB9: B3        .byte $B3   ; 57
- D 1 - - - 0x006CCA 01:ACBA: B2        .byte $B2   ; 58
- D 1 - - - 0x006CCB 01:ACBB: B1        .byte $B1   ; 59
- D 1 - - - 0x006CCC 01:ACBC: B0        .byte $B0   ; 5A
- D 1 - - - 0x006CCD 01:ACBD: AF        .byte $AF   ; 5B
- D 1 - - - 0x006CCE 01:ACBE: AE        .byte $AE   ; 5C
- D 1 - - - 0x006CCF 01:ACBF: AD        .byte $AD   ; 5D
- D 1 - - - 0x006CD0 01:ACC0: AC        .byte $AC   ; 5E
- D 1 - - - 0x006CD1 01:ACC1: B5        .byte $B5   ; 5F
- D 1 - - - 0x006CD2 01:ACC2: B4        .byte $B4   ; 60
                                        .byte $C0   ; 61
                                        .byte $BD   ; 62
                                        .byte $BF   ; 63
                                        .byte $BE   ; 64
                                        .byte $BD   ; 65
                                        .byte $BC   ; 66

tbl_ACC3_индексы_кадров_анимации:
- D 1 - - - 0x006CD3 01:ACC3: FF        .byte $FF   ; 00 
- D 1 - - - 0x006CD4 01:ACC4: 05        .byte $05   ; 01 
- - - - - - 0x006CD5 01:ACC5: 0B        .byte $0B   ; 02 
- D 1 - - - 0x006CD6 01:ACC6: 0F        .byte $0F   ; 03 
- D 1 - - - 0x006CD7 01:ACC7: 17        .byte $17   ; 04 
- D 1 - - - 0x006CD8 01:ACC8: 1D        .byte $1D   ; 05 
- D 1 - - - 0x006CD9 01:ACC9: 23        .byte $23   ; 06 
- D 1 - - - 0x006CDA 01:ACCA: 29        .byte $29   ; 07 
- D 1 - - - 0x006CDB 01:ACCB: 2F        .byte $2F   ; 08 
- D 1 - - - 0x006CDC 01:ACCC: 33        .byte $33   ; 09 
- D 1 - - - 0x006CDD 01:ACCD: 37        .byte $37   ; 0A 
- D 1 - - - 0x006CDE 01:ACCE: 39        .byte $39   ; 0B 
- D 1 - - - 0x006CDF 01:ACCF: 3D        .byte $3D   ; 0C 
- D 1 - - - 0x006CE0 01:ACD0: 3F        .byte $3F   ; 0D 
- D 1 - - - 0x006CE1 01:ACD1: 41        .byte $41   ; 0E 
- D 1 - - - 0x006CE2 01:ACD2: 43        .byte $43   ; 0F 
- D 1 - - - 0x006CE3 01:ACD3: 45        .byte $45   ; 10 
- D 1 - - - 0x006CE4 01:ACD4: 48        .byte $48   ; 11 
- D 1 - - - 0x006CE5 01:ACD5: 4C        .byte $4C   ; 12 
- D 1 - - - 0x006CE6 01:ACD6: 4E        .byte $4E   ; 13 
- D 1 - - - 0x006CE7 01:ACD7: 50        .byte $50   ; 14 
- D 1 - - - 0x006CE8 01:ACD8: 52        .byte $52   ; 15 
- D 1 - - - 0x006CE9 01:ACD9: 54        .byte $54   ; 16 
- D 1 - - - 0x006CEA 01:ACDA: 56        .byte $56   ; 17 
- D 1 - - - 0x006CEB 01:ACDB: 5E        .byte $5E   ; 18 
                                        .byte $60   ; 19 

; ******************************************************************************************************************

sub_0x008418:
C - - - - - 0x010428 04:8418: 20 24 AB  JSR sub_AB24_выбрать_ближайшего_игрока_по_оси_y
C - - - - - 0x01042B 04:841B: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01042E 04:841E: 38        SEC
C - - - - - 0x01042F 04:841F: F9 32 05  SBC ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x010432 04:8422: B0 04     BCS bra_8428
- - - - - - 0x010434 04:8424: 49 FF     EOR #$FF
- - - - - - 0x010436 04:8426: 69 01     ADC #$01
bra_8428:
C - - - - - 0x010438 04:8428: C9 20     CMP #$20
C - - - - - 0x01043A 04:842A: 60        RTS

; ******************************************************************************************************************

sub_0x007A90:
C - - - - - 0x007A90 01:BA80: 85 03     STA ram_0003
C - - - - - 0x007A92 01:BA82: A9 08     LDA #$08
C - - - - - 0x007A94 01:BA84: 85 01     STA ram_0001
C - - - - - 0x007A96 01:BA86: 98        TYA
C - - - - - 0x007A97 01:BA87: 18        CLC
C - - - - - 0x007A98 01:BA88: 65 FC     ADC ram_scroll_Y
C - - - - - 0x007A9A 01:BA8A: B0 04     BCS bra_BA90
C - - - - - 0x007A9C 01:BA8C: C9 F0     CMP #$F0
C - - - - - 0x007A9E 01:BA8E: 90 02     BCC bra_BA92
bra_BA90:
- - - - - - 0x007AA0 01:BA90: 69 0F     ADC #$0F
bra_BA92:
C - - - - - 0x007AA2 01:BA92: 29 F8     AND #$F8
C - - - - - 0x007AA4 01:BA94: 0A        ASL
C - - - - - 0x007AA5 01:BA95: 26 01     ROL ram_0001
C - - - - - 0x007AA7 01:BA97: 0A        ASL
C - - - - - 0x007AA8 01:BA98: 26 01     ROL ram_0001
C - - - - - 0x007AAA 01:BA9A: 85 02     STA ram_0002
C - - - - - 0x007AAC 01:BA9C: A5 03     LDA ram_0003
C - - - - - 0x007AAE 01:BA9E: 18        CLC
C - - - - - 0x007AAF 01:BA9F: 65 FD     ADC ram_scroll_X
C - - - - - 0x007AB1 01:BAA1: 4A        LSR
C - - - - - 0x007AB2 01:BAA2: 4A        LSR
C - - - - - 0x007AB3 01:BAA3: 4A        LSR
C - - - - - 0x007AB4 01:BAA4: A8        TAY
C - - - - - 0x007AB5 01:BAA5: 05 02     ORA ram_0002
C - - - - - 0x007AB7 01:BAA7: 85 00     STA ram_0000
C - - - - - 0x007AB9 01:BAA9: 60        RTS

; ******************************************************************************************************************

loc_BAAA_вычислить_тип_поверхности:
sub_BAAA_вычислить_тип_поверхности:
sub_0x007ABA_вычислить_тип_поверхности:
C D 1 - - - 0x007ABA 01:BAAA: 20 C0 BA  JSR sub_BAC0
C - - - - - 0x007ABD 01:BAAD: C9 06     CMP #$06    ; диагональные поверхности
C - - - - - 0x007ABF 01:BAAF: A8        TAY
C - - - - - 0x007AC0 01:BAB0: 90 0D     BCC bra_BABF_RTS
C - - - - - 0x007AC2 01:BAB2: A5 01     LDA ram_0001
C - - - - - 0x007AC4 01:BAB4: 29 0F     AND #$0F
C - - - - - 0x007AC6 01:BAB6: D9 28 BB  CMP tbl_BB2E - $06,Y
C - - - - - 0x007AC9 01:BAB9: B0 03     BCS bra_BABE
C - - - - - 0x007ACB 01:BABB: A9 00     LDA #$00
C - - - - - 0x007ACD 01:BABD: 60        RTS
bra_BABE:
C - - - - - 0x007ACE 01:BABE: 98        TYA
bra_BABF_RTS:
C - - - - - 0x007ACF 01:BABF: 60        RTS

; ******************************************************************************************************************

sub_BAC0:
sub_0x007AD0:
loc_0x007AD0:
C D 1 - - - 0x007AD0 01:BAC0: 85 00     STA ram_0000    ; позиция X
C - - - - - 0x007AD2 01:BAC2: 84 06     STY ram_0006    ; позиция Y
C - - - - - 0x007AD4 01:BAC4: C4 45     CPY ram_номер_сканлинии
C - - - - - 0x007AD6 01:BAC6: 90 13     BCC bra_BADB
C - - - - - 0x007AD8 01:BAC8: C4 49     CPY ram_0049
C - - - - - 0x007ADA 01:BACA: B0 0F     BCS bra_BADB
C - - - - - 0x007ADC 01:BACC: A5 FA     LDA ram_00FA
C - - - - - 0x007ADE 01:BACE: 85 04     STA ram_0004
C - - - - - 0x007AE0 01:BAD0: A5 F9     LDA ram_00F9
C - - - - - 0x007AE2 01:BAD2: C9 FF     CMP #$FF
C - - - - - 0x007AE4 01:BAD4: F0 55     BEQ bra_BB2B
C - - - - - 0x007AE6 01:BAD6: A4 FB     LDY ram_00FB
C - - - - - 0x007AE8 01:BAD8: 4C E3 BA  JMP loc_BAE3
bra_BADB:
C - - - - - 0x007AEB 01:BADB: A5 FD     LDA ram_scroll_X
C - - - - - 0x007AED 01:BADD: 85 04     STA ram_0004
C - - - - - 0x007AEF 01:BADF: A5 FC     LDA ram_scroll_Y
C - - - - - 0x007AF1 01:BAE1: A4 FF     LDY ram_for_2000
loc_BAE3:
C D 1 - - - 0x007AF3 01:BAE3: 84 05     STY ram_0005
C - - - - - 0x007AF5 01:BAE5: A0 00     LDY #$00
C - - - - - 0x007AF7 01:BAE7: 18        CLC
C - - - - - 0x007AF8 01:BAE8: 65 06     ADC ram_0006
C - - - - - 0x007AFA 01:BAEA: B0 04     BCS bra_BAF0
C - - - - - 0x007AFC 01:BAEC: C9 F0     CMP #$F0
C - - - - - 0x007AFE 01:BAEE: 90 04     BCC bra_BAF4
bra_BAF0:
C - - - - - 0x007B00 01:BAF0: 69 0F     ADC #$0F
C - - - - - 0x007B02 01:BAF2: A0 02     LDY #$02
bra_BAF4:
C - - - - - 0x007B04 01:BAF4: 85 01     STA ram_0001
C - - - - - 0x007B06 01:BAF6: 29 F0     AND #$F0
C - - - - - 0x007B08 01:BAF8: 85 02     STA ram_0002
C - - - - - 0x007B0A 01:BAFA: A5 04     LDA ram_0004
C - - - - - 0x007B0C 01:BAFC: 18        CLC
C - - - - - 0x007B0D 01:BAFD: 65 00     ADC ram_0000
C - - - - - 0x007B0F 01:BAFF: 85 00     STA ram_0000
C - - - - - 0x007B11 01:BB01: 90 01     BCC bra_BB04
C - - - - - 0x007B13 01:BB03: C8        INY
bra_BB04:
C - - - - - 0x007B14 01:BB04: 4A        LSR
C - - - - - 0x007B15 01:BB05: 4A        LSR
C - - - - - 0x007B16 01:BB06: 4A        LSR
C - - - - - 0x007B17 01:BB07: 4A        LSR
C - - - - - 0x007B18 01:BB08: 85 03     STA ram_0003
C - - - - - 0x007B1A 01:BB0A: 05 02     ORA ram_0002
C - - - - - 0x007B1C 01:BB0C: 85 04     STA ram_0004
C - - - - - 0x007B1E 01:BB0E: 98        TYA
C - - - - - 0x007B1F 01:BB0F: 45 05     EOR ram_0005
C - - - - - 0x007B21 01:BB11: 4A        LSR
C - - - - - 0x007B22 01:BB12: A4 26     LDY ram_mirroring
C - - - - - 0x007B24 01:BB14: F0 01     BEQ bra_BB17    ; if con_mirroring_V
; if con_mirroring_H
C - - - - - 0x007B26 01:BB16: 4A        LSR
bra_BB17:
C - - - - - 0x007B27 01:BB17: 66 04     ROR ram_0004
C - - - - - 0x007B29 01:BB19: A4 04     LDY ram_0004
sub_BB1B:
sub_0x007B2B:
C - - - - - 0x007B2B 01:BB1B: A5 03     LDA ram_0003
C - - - - - 0x007B2D 01:BB1D: 4A        LSR
C - - - - - 0x007B2E 01:BB1E: B9 00 04  LDA ram_0400,Y
C - - - - - 0x007B31 01:BB21: B0 05     BCS bra_BB28
C - - - - - 0x007B33 01:BB23: 4A        LSR
C - - - - - 0x007B34 01:BB24: 4A        LSR
C - - - - - 0x007B35 01:BB25: 4A        LSR
C - - - - - 0x007B36 01:BB26: 4A        LSR
C - - - - - 0x007B37 01:BB27: 60        RTS
bra_BB28:
C - - - - - 0x007B38 01:BB28: 29 0F     AND #$0F
C - - - - - 0x007B3A 01:BB2A: 60        RTS
bra_BB2B:
C - - - - - 0x007B3B 01:BB2B: A9 00     LDA #$00
C - - - - - 0x007B3D 01:BB2D: 60        RTS

tbl_BB2E:
- D 1 - - - 0x007B3E 01:BB2E: 00        .byte $00   ; 06 
- D 1 - - - 0x007B3F 01:BB2F: 00        .byte $00   ; 07 
- D 1 - - - 0x007B40 01:BB30: 08        .byte $08   ; 08 
- D 1 - - - 0x007B41 01:BB31: 00        .byte $00   ; 09 
- D 1 - - - 0x007B42 01:BB32: 00        .byte $00   ; 0A 
- D 1 - - - 0x007B43 01:BB33: 08        .byte $08   ; 0B 

; ******************************************************************************************************************

sub_0x007B44:
C - - - - - 0x007B44 01:BB34: 86 17     STX ram_0017
C - - - - - 0x007B46 01:BB36: 85 00     STA ram_0000
C - - - - - 0x007B48 01:BB38: A5 F9     LDA ram_00F9
C - - - - - 0x007B4A 01:BB3A: C9 FF     CMP #$FF
C - - - - - 0x007B4C 01:BB3C: D0 04     BNE bra_BB42
C - - - - - 0x007B4E 01:BB3E: C4 45     CPY ram_номер_сканлинии
C - - - - - 0x007B50 01:BB40: B0 35     BCS bra_BB77
bra_BB42:
C - - - - - 0x007B52 01:BB42: A5 00     LDA ram_0000
C - - - - - 0x007B54 01:BB44: 20 C0 BA  JSR sub_BAC0
C - - - - - 0x007B57 01:BB47: 20 C3 BB  JSR sub_BBC3
C - - - - - 0x007B5A 01:BB4A: D0 2F     BNE bra_BB7B
C - - - - - 0x007B5C 01:BB4C: A5 00     LDA ram_0000
C - - - - - 0x007B5E 01:BB4E: 29 0F     AND #$0F
C - - - - - 0x007B60 01:BB50: 85 00     STA ram_0000
C - - - - - 0x007B62 01:BB52: A5 0F     LDA ram_000F
C - - - - - 0x007B64 01:BB54: 38        SEC
C - - - - - 0x007B65 01:BB55: E5 00     SBC ram_0000
C - - - - - 0x007B67 01:BB57: 90 1E     BCC bra_BB77
C - - - - - 0x007B69 01:BB59: F0 1C     BEQ bra_BB77
C - - - - - 0x007B6B 01:BB5B: 4A        LSR
C - - - - - 0x007B6C 01:BB5C: 4A        LSR
C - - - - - 0x007B6D 01:BB5D: 4A        LSR
C - - - - - 0x007B6E 01:BB5E: 4A        LSR
C - - - - - 0x007B6F 01:BB5F: 85 0E     STA ram_000E
bra_BB61_loop:
C - - - - - 0x007B71 01:BB61: A5 03     LDA ram_0003
C - - - - - 0x007B73 01:BB63: 49 01     EOR #$01
C - - - - - 0x007B75 01:BB65: 85 03     STA ram_0003
C - - - - - 0x007B77 01:BB67: 4A        LSR
C - - - - - 0x007B78 01:BB68: 90 01     BCC bra_BB6B
C - - - - - 0x007B7A 01:BB6A: 88        DEY
bra_BB6B:
C - - - - - 0x007B7B 01:BB6B: 20 1B BB  JSR sub_BB1B
C - - - - - 0x007B7E 01:BB6E: 20 C3 BB  JSR sub_BBC3
C - - - - - 0x007B81 01:BB71: D0 08     BNE bra_BB7B
C - - - - - 0x007B83 01:BB73: C6 0E     DEC ram_000E
C - - - - - 0x007B85 01:BB75: 10 EA     BPL bra_BB61_loop
bra_BB77:
C - - - - - 0x007B87 01:BB77: A6 17     LDX ram_0017
C - - - - - 0x007B89 01:BB79: 18        CLC
C - - - - - 0x007B8A 01:BB7A: 60        RTS
bra_BB7B:
C - - - - - 0x007B8B 01:BB7B: A6 17     LDX ram_0017
C - - - - - 0x007B8D 01:BB7D: 38        SEC
C - - - - - 0x007B8E 01:BB7E: 60        RTS

; ******************************************************************************************************************

sub_0x007B8F:
C - - - - - 0x007B8F 01:BB7F: 86 17     STX ram_0017
C - - - - - 0x007B91 01:BB81: 20 C0 BA  JSR sub_BAC0
C - - - - - 0x007B94 01:BB84: 20 C3 BB  JSR sub_BBC3
C - - - - - 0x007B97 01:BB87: D0 F2     BNE bra_BB7B
C - - - - - 0x007B99 01:BB89: A5 01     LDA ram_0001
C - - - - - 0x007B9B 01:BB8B: 29 0F     AND #$0F
C - - - - - 0x007B9D 01:BB8D: 85 01     STA ram_0001
C - - - - - 0x007B9F 01:BB8F: A5 0F     LDA ram_000F
C - - - - - 0x007BA1 01:BB91: 38        SEC
C - - - - - 0x007BA2 01:BB92: E5 01     SBC ram_0001
C - - - - - 0x007BA4 01:BB94: 90 29     BCC bra_BBBF
C - - - - - 0x007BA6 01:BB96: F0 27     BEQ bra_BBBF
C - - - - - 0x007BA8 01:BB98: 4A        LSR
C - - - - - 0x007BA9 01:BB99: 4A        LSR
C - - - - - 0x007BAA 01:BB9A: 4A        LSR
C - - - - - 0x007BAB 01:BB9B: 4A        LSR
C - - - - - 0x007BAC 01:BB9C: 85 0E     STA ram_000E
bra_BB9E_loop:
C - - - - - 0x007BAE 01:BB9E: 98        TYA
C - - - - - 0x007BAF 01:BB9F: 29 7F     AND #$7F
C - - - - - 0x007BB1 01:BBA1: C9 08     CMP #$08
C - - - - - 0x007BB3 01:BBA3: 98        TYA
C - - - - - 0x007BB4 01:BBA4: B0 0A     BCS bra_BBB0
; C = 0
C - - - - - 0x007BB6 01:BBA6: 69 70     ADC #$70
C - - - - - 0x007BB8 01:BBA8: A4 26     LDY ram_mirroring
C - - - - - 0x007BBA 01:BBAA: F0 02     BEQ bra_BBAE    ; if con_mirroring_V
; if con_mirroring_H
C - - - - - 0x007BBC 01:BBAC: 49 80     EOR #$80
bra_BBAE:
C - - - - - 0x007BBE 01:BBAE: 90 02     BCC bra_BBB2
bra_BBB0:
C - - - - - 0x007BC0 01:BBB0: E9 08     SBC #$08
bra_BBB2:
C - - - - - 0x007BC2 01:BBB2: A8        TAY
C - - - - - 0x007BC3 01:BBB3: 20 1B BB  JSR sub_BB1B
C - - - - - 0x007BC6 01:BBB6: 20 C3 BB  JSR sub_BBC3
C - - - - - 0x007BC9 01:BBB9: D0 C0     BNE bra_BB7B
C - - - - - 0x007BCB 01:BBBB: C6 0E     DEC ram_000E
C - - - - - 0x007BCD 01:BBBD: 10 DF     BPL bra_BB9E_loop
bra_BBBF:
C - - - - - 0x007BCF 01:BBBF: A6 17     LDX ram_0017
C - - - - - 0x007BD1 01:BBC1: 18        CLC
C - - - - - 0x007BD2 01:BBC2: 60        RTS

; ******************************************************************************************************************

sub_BBC3:
C - - - - - 0x007BD3 01:BBC3: AA        TAX
C - - - - - 0x007BD4 01:BBC4: A5 5D     LDA ram_тип_уровней
C - - - - - 0x007BD6 01:BBC6: D0 04     BNE bra_BBCC_вид_сверху
; вид сбоку
C - - - - - 0x007BD8 01:BBC8: BD DD BB  LDA tbl_BBDD,X
C - - - - - 0x007BDB 01:BBCB: 60        RTS
bra_BBCC_вид_сверху:
C - - - - - 0x007BDC 01:BBCC: BD E9 BB  LDA tbl_BBE9,X
C - - - - - 0x007BDF 01:BBCF: 60        RTS

; ******************************************************************************************************************

sub_0x00BBD0:
loc_BBD0:
C D 1 - - - 0x007BE0 01:BBD0: A8        TAY
C - - - - - 0x007BE1 01:BBD1: A5 5D     LDA ram_тип_уровней
C - - - - - 0x007BE3 01:BBD3: D0 04     BNE bra_BBD9_вид_сверху
; вид сбоку
C - - - - - 0x007BE5 01:BBD5: B9 DD BB  LDA tbl_BBDD,Y
C - - - - - 0x007BE8 01:BBD8: 60        RTS
bra_BBD9_вид_сверху:
- - - - - - 0x007BE9 01:BBD9: B9 E9 BB  LDA tbl_BBE9,Y
- - - - - - 0x007BEC 01:BBDC: 60        RTS

tbl_BBDD:
- D 1 - - - 0x007BED 01:BBDD: 00        .byte $00   ; 00 
- D 1 - - - 0x007BEE 01:BBDE: 00        .byte $00   ; 01 
- D 1 - - - 0x007BEF 01:BBDF: 01        .byte $01   ; 02 
- D 1 - - - 0x007BF0 01:BBE0: 01        .byte $01   ; 03 
- D 1 - - - 0x007BF1 01:BBE1: 00        .byte $00   ; 04 
- - - - - - 0x007BF2 01:BBE2: 00        .byte $00   ; 05 
- D 1 - - - 0x007BF3 01:BBE3: 00        .byte $00   ; 06 
- D 1 - - - 0x007BF4 01:BBE4: 00        .byte $00   ; 07 
- D 1 - - - 0x007BF5 01:BBE5: 00        .byte $00   ; 08 
- D 1 - - - 0x007BF6 01:BBE6: 00        .byte $00   ; 09 
- D 1 - - - 0x007BF7 01:BBE7: 00        .byte $00   ; 0A 
- D 1 - - - 0x007BF8 01:BBE8: 00        .byte $00   ; 0B 

tbl_BBE9:
- D 1 - - - 0x007BF9 01:BBE9: 00        .byte $00   ; 00 
- D 1 - - - 0x007BFA 01:BBEA: 01        .byte $01   ; 01 
- D 1 - - - 0x007BFB 01:BBEB: 01        .byte $01   ; 02 
- - - - - - 0x007BFC 01:BBEC: 01        .byte $01   ; 03 
- - - - - - 0x007BFD 01:BBED: 00        .byte $00   ; 04 
- - - - - - 0x007BFE 01:BBEE: 00        .byte $00   ; 05 
- - - - - - 0x007BFF 01:BBEF: 00        .byte $00   ; 06 
- - - - - - 0x007C00 01:BBF0: 00        .byte $00   ; 07 
- - - - - - 0x007C01 01:BBF1: 00        .byte $00   ; 08 
- - - - - - 0x007C02 01:BBF2: 00        .byte $00   ; 09 
- - - - - - 0x007C03 01:BBF3: 00        .byte $00   ; 0A 
- - - - - - 0x007C04 01:BBF4: 00        .byte $00   ; 0B 

; ******************************************************************************************************************

sub_0x007C05:
C - - - - - 0x007C05 01:BBF5: 20 AA BA  JSR sub_BAAA_вычислить_тип_поверхности
C - - - - - 0x007C08 01:BBF8: C9 06     CMP #$06    ; диагональные поверхности
C - - - - - 0x007C0A 01:BBFA: B0 05     BCS bra_BC01_RTS
C - - - - - 0x007C0C 01:BBFC: A8        TAY
C - - - - - 0x007C0D 01:BBFD: B9 DD BB  LDA tbl_BBDD,Y
C - - - - - 0x007C10 01:BC00: 4A        LSR
bra_BC01_RTS:
C - - - - - 0x007C11 01:BC01: 60        RTS

; ******************************************************************************************************************

sub_BC02:
C - - - - - 0x007C12 01:BC02: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x007C14 01:BC04: E0 50     CPX #$50
C - - - - - 0x007C16 01:BC06: B0 F9     BCS bra_BC01_RTS
; if buffer is not too loaded
C - - - - - 0x007C18 01:BC08: 18        CLC
C - - - - - 0x007C19 01:BC09: 65 FD     ADC ram_scroll_X
C - - - - - 0x007C1B 01:BC0B: 85 00     STA ram_0000
C - - - - - 0x007C1D 01:BC0D: A5 FF     LDA ram_for_2000
C - - - - - 0x007C1F 01:BC0F: 90 02     BCC bra_BC13
- - - - - - 0x007C21 01:BC11: 49 01     EOR #$01
bra_BC13:
C - - - - - 0x007C23 01:BC13: 29 01     AND #$01
C - - - - - 0x007C25 01:BC15: 09 08     ORA #$08
C - - - - - 0x007C27 01:BC17: 85 01     STA ram_0001
C - - - - - 0x007C29 01:BC19: A5 00     LDA ram_0000
C - - - - - 0x007C2B 01:BC1B: 29 F8     AND #$F8
C - - - - - 0x007C2D 01:BC1D: 4A        LSR
C - - - - - 0x007C2E 01:BC1E: 4A        LSR
C - - - - - 0x007C2F 01:BC1F: 4A        LSR
C - - - - - 0x007C30 01:BC20: 85 00     STA ram_0000
C - - - - - 0x007C32 01:BC22: 98        TYA
C - - - - - 0x007C33 01:BC23: 18        CLC
C - - - - - 0x007C34 01:BC24: 65 FC     ADC ram_scroll_Y
C - - - - - 0x007C36 01:BC26: B0 04     BCS bra_BC2C
C - - - - - 0x007C38 01:BC28: C9 F0     CMP #$F0
C - - - - - 0x007C3A 01:BC2A: 90 03     BCC bra_BC2F
bra_BC2C:
- - - - - - 0x007C3C 01:BC2C: 18        CLC
- - - - - - 0x007C3D 01:BC2D: 69 10     ADC #$10
bra_BC2F:
C - - - - - 0x007C3F 01:BC2F: 29 F8     AND #$F8
C - - - - - 0x007C41 01:BC31: 0A        ASL
C - - - - - 0x007C42 01:BC32: 26 01     ROL ram_0001
C - - - - - 0x007C44 01:BC34: 0A        ASL
C - - - - - 0x007C45 01:BC35: 26 01     ROL ram_0001
C - - - - - 0x007C47 01:BC37: 05 00     ORA ram_0000
C - - - - - 0x007C49 01:BC39: 85 00     STA ram_0000
sub_0x007C4B_пушки_вертолета:
C - - - - - 0x007C4B 01:BC3B: A9 06     LDA #con_buf_mode_06
C - - - - - 0x007C4D 01:BC3D: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x007C50 01:BC40: E8        INX
C - - - - - 0x007C51 01:BC41: A9 02     LDA #$02
C - - - - - 0x007C53 01:BC43: 85 04     STA ram_0004
C - - - - - 0x007C55 01:BC45: A5 08     LDA ram_0008
C - - - - - 0x007C57 01:BC47: 0A        ASL
C - - - - - 0x007C58 01:BC48: 0A        ASL
; пушки вертолета
                                        BIT ram_регион
                                        BVC bra_BC49_US
                                        ADC #$14
bra_BC49_US:
C - - - - - 0x007C59 01:BC49: A8        TAY
bra_BC4A_loop:
C - - - - - 0x007C5A 01:BC4A: A5 01     LDA ram_0001    ; ppu hi
C - - - - - 0x007C5C 01:BC4C: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x007C5F 01:BC4F: E8        INX
C - - - - - 0x007C60 01:BC50: A5 00     LDA ram_0000    ; ppu lo
C - - - - - 0x007C62 01:BC52: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x007C65 01:BC55: E8        INX
C - - - - - 0x007C66 01:BC56: A9 02     LDA #$02    ; counter
C - - - - - 0x007C68 01:BC58: 85 05     STA ram_0005
C - - - - - 0x007C6A 01:BC5A: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x007C6D 01:BC5D: E8        INX
bra_BC5E_loop:
C - - - - - 0x007C6E 01:BC5E: B9 83 BC  LDA tbl_BC83_тайлы_пушек,Y
C - - - - - 0x007C71 01:BC61: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x007C74 01:BC64: C8        INY
C - - - - - 0x007C75 01:BC65: E8        INX
C - - - - - 0x007C76 01:BC66: C6 05     DEC ram_0005
C - - - - - 0x007C78 01:BC68: D0 F4     BNE bra_BC5E_loop
C - - - - - 0x007C7A 01:BC6A: A5 00     LDA ram_0000
C - - - - - 0x007C7C 01:BC6C: 18        CLC
C - - - - - 0x007C7D 01:BC6D: 69 20     ADC #$20
C - - - - - 0x007C7F 01:BC6F: 85 00     STA ram_0000
C - - - - - 0x007C81 01:BC71: 90 02     BCC bra_BC75_not_overflow
- - - - - - 0x007C83 01:BC73: E6 01     INC ram_0001
bra_BC75_not_overflow:
C - - - - - 0x007C85 01:BC75: C6 04     DEC ram_0004
C - - - - - 0x007C87 01:BC77: D0 D1     BNE bra_BC4A_loop
C - - - - - 0x007C89 01:BC79: A9 FF     LDA #$FF
C - - - - - 0x007C8B 01:BC7B: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x007C8E 01:BC7E: E8        INX
C - - - - - 0x007C8F 01:BC7F: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x007C91 01:BC81: 18        CLC
C - - - - - 0x007C92 01:BC82: 60        RTS

tbl_BC83_тайлы_пушек:
; 00
- D 1 - - - 0x007C93 01:BC83: 00        .byte $00, $00   ; 00 US
- D 1 - - - 0x007C95 01:BC85: 00        .byte $00, $00   ; 02 US
; 01
- D 1 - - - 0x007C97 01:BC87: BE        .byte $BE, $BF   ; 04 US
- D 1 - - - 0x007C99 01:BC89: C0        .byte $C0, $C1   ; 06 US
; 02
- D 1 - - - 0x007C9B 01:BC8B: 52        .byte $52, $53   ; 08 US
- D 1 - - - 0x007C9D 01:BC8D: 5E        .byte $5E, $5F   ; 0A US
; 03
- D 1 - - - 0x007C9F 01:BC8F: BA        .byte $BA, $BB   ; 0C US
- D 1 - - - 0x007CA1 01:BC91: BC        .byte $BC, $BD   ; 0E US
; 04
- D 1 - - - 0x007CA3 01:BC93: C2        .byte $C2, $C3   ; 10 US
- D 1 - - - 0x007CA5 01:BC95: C4        .byte $C4, $C5   ; 12 US

; 00
                                        .byte $00, $00   ; 14 EU
                                        .byte $00, $00   ; 16 EU
; 01
                                        .byte $32, $33   ; 18 EU
                                        .byte $38, $39   ; 1A EU
; 02
                                        .byte $30, $31   ; 1C EU
                                        .byte $36, $37   ; 1E EU
; 03
                                        .byte $20, $21   ; 20 EU
                                        .byte $29, $2A   ; 22 EU
; 04
                                        .byte $34, $35   ; 24 EU
                                        .byte $3A, $3B   ; 26 EU

; ******************************************************************************************************************

sub_0x007D20_очистить_0400_047F:
C - - - - - 0x007D20 01:BD10: A0 7F     LDY #$7F
sub_0x007D22_очистить_0400_Y:
C - - - - - 0x007D22 01:BD12: A9 00     LDA #$00
bra_BD14_loop:
C - - - - - 0x007D24 01:BD14: 99 00 04  STA ram_0400,Y
C - - - - - 0x007D27 01:BD17: 88        DEY
C - - - - - 0x007D28 01:BD18: 10 FA     BPL bra_BD14_loop
C - - - - - 0x007D2A 01:BD1A: 60        RTS

; ******************************************************************************************************************

sub_0x007D2B_очистить_0480_04FF:
C - - - - - 0x007D2B 01:BD1B: A0 7F     LDY #$7F
sub_0x007D2D_очистить_0480_Y:
C - - - - - 0x007D2D 01:BD1D: A9 00     LDA #$00
bra_BD1F_loop:
C - - - - - 0x007D2F 01:BD1F: 99 80 04  STA ram_0480,Y
C - - - - - 0x007D32 01:BD22: 88        DEY
C - - - - - 0x007D33 01:BD23: 10 FA     BPL bra_BD1F_loop
C - - - - - 0x007D35 01:BD25: 60        RTS


.out .sprintf("Free bytes in bank 33: %Xh [%d]", ($BFFF - *), ($BFFF - *))

.segment "BANK_33b"
- D 1 - - - 0x00800F 01:BFFF: 33        .byte con_prg_bank + $33   ; 



