.segment "BANK_28"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000 ; for listing file
; 0x010010-0x01400F



.export loc_0x001411_спавн_рядовых_мобов
.export loc_0x001C02_prepare_area_config
.export loc_0x001CA6
.export loc_0x002178_stage_complete_handler
.export loc_0x0023C7_credits_handler




bra_9400_RTS:
C - - - - - 0x001410 00:9400: 60        RTS

loc_0x001411_спавн_рядовых_мобов:
C D 0 - - - 0x001411 00:9401: A5 5C     LDA ram_статус_завершения_уровня
C - - - - - 0x001413 00:9403: D0 FB     BNE bra_9400_RTS
C - - - - - 0x001415 00:9405: 24 94     BIT ram_0094_конфиг_уровня
C - - - - - 0x001417 00:9407: 70 F7     BVS bra_9400_RTS
C - - - - - 0x001419 00:9409: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x00141B 00:940B: 4A        LSR
C - - - - - 0x00141C 00:940C: A5 63     LDA ram_0063
C - - - - - 0x00141E 00:940E: 90 02     BCC bra_9412
C - - - - - 0x001420 00:9410: A5 82     LDA ram_0082_конфиг_уровня
bra_9412:
C - - - - - 0x001422 00:9412: 85 16     STA ram_0016
C - - - - - 0x001424 00:9414: C5 92     CMP ram_0092
C - - - - - 0x001426 00:9416: F0 06     BEQ bra_941E
C - - - - - 0x001428 00:9418: 85 92     STA ram_0092
C - - - - - 0x00142A 00:941A: A9 00     LDA #$00
C - - - - - 0x00142C 00:941C: 85 90     STA ram_колво_спавн_мобов
bra_941E:
; leon опт
                                        LDY ram_0091
                                        LDA tbl_9423_lo,y
                                        STA ram_0000
                                        LDA tbl_9423_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_9423_lo:
- D 0 - I - 0x001433 00:9423: 27 94     .byte < ofs_006_9427_00
- D 0 - I - 0x001435 00:9425: 5B 94     .byte < ofs_006_945B_01
tbl_9423_hi:
- D 0 - I - 0x001433 00:9423: 27 94     .byte > ofs_006_9427_00
- D 0 - I - 0x001435 00:9425: 5B 94     .byte > ofs_006_945B_01


ofs_006_9427_00:
C - - J - - 0x001437 00:9427: A5 50     LDA ram_номер_уровня
; bzk bug, Y is always 33 here because of 0x01FD6D,
; and it reads a byte from 0x0016F8.
; was it supposed to be LDY ram_номер_уровня ?
C - - - - - 0x001439 00:9429: B9 B5 96  LDA tbl_96B5,Y
C - - - - - 0x00143C 00:942C: F0 1C     BEQ bra_944A_RTS
C - - - - - 0x00143E 00:942E: 85 93     STA ram_таймер_до_спавна_моба
; 1путин: удалено чтение кругов
; C - - - - - 0x00144A 00:943A: A9 10     LDA #$10
; C - - - - - 0x00144C 00:943C: 20 4B 94  JSR sub_944B_decrease_timer
; 1путин: удалена проверка на колво S
C - - - - - 0x001458 00:9448: E6 91     INC ram_0091    ; 00 -> 01
bra_944A_RTS:
C - - - - - 0x00145A 00:944A: 60        RTS



sub_944B_decrease_timer:
C - - - - - 0x00145B 00:944B: 85 08     STA ram_0008
C - - - - - 0x00145D 00:944D: A5 93     LDA ram_таймер_до_спавна_моба
bra_944F_loop:
C - - - - - 0x00145F 00:944F: 88        DEY
C - - - - - 0x001460 00:9450: 30 F8     BMI bra_944A_RTS
C - - - - - 0x001462 00:9452: 38        SEC
C - - - - - 0x001463 00:9453: E5 08     SBC ram_0008
C - - - - - 0x001465 00:9455: 90 F3     BCC bra_944A_RTS
C - - - - - 0x001467 00:9457: 85 93     STA ram_таймер_до_спавна_моба
C - - - - - 0x001469 00:9459: B0 F4     BCS bra_944F_loop    ; jmp



ofs_006_945B_01:
C - - J - - 0x00146B 00:945B: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x00146D 00:945D: 4A        LSR
C - - - - - 0x00146E 00:945E: 90 0F     BCC bra_946F
C - - - - - 0x001470 00:9460: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x001472 00:9462: A0 02     LDY #$02
C - - - - - 0x001474 00:9464: 4A        LSR
C - - - - - 0x001475 00:9465: A5 62     LDA ram_cam_spd_X
C - - - - - 0x001477 00:9467: 90 02     BCC bra_946B
C - - - - - 0x001479 00:9469: A5 72     LDA ram_cam_spd_Y
bra_946B:
C - - - - - 0x00147B 00:946B: 85 17     STA ram_0017
C - - - - - 0x00147D 00:946D: D0 02     BNE bra_9471
bra_946F:
C - - - - - 0x00147F 00:946F: A0 01     LDY #$01
bra_9471:
C - - - - - 0x001481 00:9471: 84 08     STY ram_0008
C - - - - - 0x001483 00:9473: A5 93     LDA ram_таймер_до_спавна_моба
C - - - - - 0x001485 00:9475: F0 0A     BEQ bra_9481
C - - - - - 0x001487 00:9477: 38        SEC
C - - - - - 0x001488 00:9478: E5 08     SBC ram_0008
C - - - - - 0x00148A 00:947A: B0 02     BCS bra_947E
C - - - - - 0x00148C 00:947C: A9 00     LDA #$00
bra_947E:
C - - - - - 0x00148E 00:947E: 85 93     STA ram_таймер_до_спавна_моба
C - - - - - 0x001490 00:9480: 60        RTS
bra_9481:
C - - - - - 0x001491 00:9481: A5 50     LDA ram_номер_уровня
C - - - - - 0x001493 00:9483: 0A        ASL
C - - - - - 0x001495 00:9485: A8        TAY
bra_948D:
C - - - - - 0x00149D 00:948D: B9 BD 96  LDA tbl_96BD,Y
C - - - - - 0x0014A0 00:9490: 85 08     STA ram_0008
C - - - - - 0x0014A2 00:9492: B9 BE 96  LDA tbl_96BD + $01,Y
C - - - - - 0x0014A5 00:9495: 85 09     STA ram_0009
C - - - - - 0x0014A7 00:9497: A4 16     LDY ram_0016
C - - - - - 0x0014A9 00:9499: B1 08     LDA (ram_0008),Y
C - - - - - 0x0014AB 00:949B: C9 FF     CMP #$FF
C - - - - - 0x0014AD 00:949D: D0 03     BNE bra_94A2
; FF
C - - - - - 0x0014AF 00:949F: 4C 23 95  JMP loc_9523
bra_94A2:
C - - - - - 0x0014B2 00:94A2: 84 0F     STY ram_000F
C - - - - - 0x0014B4 00:94A4: 20 AE 95  JSR sub_95AE
C - - - - - 0x0014B7 00:94A7: B0 03     BCS bra_94AC
C - - - - - 0x0014B9 00:94A9: 4C 23 95  JMP loc_9523
bra_94AC:
C - - - - - 0x0014BC 00:94AC: A5 99     LDA ram_0099
C - - - - - 0x0014BE 00:94AE: D0 19     BNE bra_94C9
C - - - - - 0x0014C0 00:94B0: A4 0F     LDY ram_000F
C - - - - - 0x0014C2 00:94B2: B1 08     LDA (ram_0008),Y
C - - - - - 0x0014C4 00:94B4: 10 08     BPL bra_94BE
C - - - - - 0x0014C6 00:94B6: A5 23     LDA ram_рандом_байт
C - - - - - 0x0014C8 00:94B8: 29 02     AND #$02
C - - - - - 0x0014CA 00:94BA: D0 67     BNE bra_9523
C - - - - - 0x0014CC 00:94BC: F0 0B     BEQ bra_94C9    ; jmp
bra_94BE:
C - - - - - 0x0014CE 00:94BE: B1 08     LDA (ram_0008),Y
C - - - - - 0x0014D0 00:94C0: 0A        ASL
C - - - - - 0x0014D1 00:94C1: 10 06     BPL bra_94C9
C - - - - - 0x0014D3 00:94C3: A5 23     LDA ram_рандом_байт
C - - - - - 0x0014D5 00:94C5: 29 0C     AND #$0C
C - - - - - 0x0014D7 00:94C7: D0 5A     BNE bra_9523
bra_94C9:
C - - - - - 0x0014D9 00:94C9: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x0014DB 00:94CB: 10 03     BPL bra_94D0
C - - - - - 0x0014DD 00:94CD: 4C 28 95  JMP loc_9528
bra_94D0:
C - - - - - 0x0014E0 00:94D0: 20 82 95  JSR sub_9582
C - - - - - 0x0014E3 00:94D3: B0 4E     BCS bra_9523
C - - - - - 0x0014E5 00:94D5: A5 99     LDA ram_0099
C - - - - - 0x0014E7 00:94D7: F0 03     BEQ bra_94DC
C - - - - - 0x0014E9 00:94D9: 4C 6A 95  JMP loc_956A
bra_94DC:
C - - - - - 0x0014EC 00:94DC: A5 17     LDA ram_0017
C - - - - - 0x0014EE 00:94DE: F0 09     BEQ bra_94E9
C - - - - - 0x0014F0 00:94E0: A5 23     LDA ram_рандом_байт
C - - - - - 0x0014F2 00:94E2: 29 03     AND #$03
C - - - - - 0x0014F4 00:94E4: D0 03     BNE bra_94E9
C - - - - - 0x0014F6 00:94E6: 4C 66 95  JMP loc_9566
bra_94E9:
C - - - - - 0x0014F9 00:94E9: 20 06 F7  JSR sub_0x01F716_попытка_найти_свободный_слот_для_объекта___первые_4_слота
C - - - - - 0x0014FC 00:94EC: D0 35     BNE bra_9523
C - - - - - 0x0014FE 00:94EE: A0 03     LDY #con_obj_id_03
C - - - - - 0x001500 00:94F0: 20 9E F7  JSR sub_0x01F7AE_подготовить_объект
C - - - - - 0x001503 00:94F3: A4 0F     LDY ram_000F
C - - - - - 0x001505 00:94F5: B1 08     LDA (ram_0008),Y
C - - - - - 0x001507 00:94F7: 29 0F     AND #$0F
C - - - - - 0x001509 00:94F9: 0A        ASL
C - - - - - 0x00150A 00:94FA: 0A        ASL
C - - - - - 0x00150B 00:94FB: 85 0A     STA ram_000A
C - - - - - 0x00150D 00:94FD: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x00150F 00:94FF: 4A        LSR
C - - - - - 0x001510 00:9500: 4A        LSR
C - - - - - 0x001511 00:9501: 4A        LSR
C - - - - - 0x001512 00:9502: 4A        LSR
C - - - - - 0x001513 00:9503: 29 03     AND #$03
C - - - - - 0x001515 00:9505: 18        CLC
C - - - - - 0x001516 00:9506: 65 0A     ADC ram_000A
C - - - - - 0x001518 00:9508: A8        TAY
C - - - - - 0x001519 00:9509: B9 4C 97  LDA tbl_974C,Y
C - - - - - 0x00151C 00:950C: 9D 1E 07  STA ram_obj_flags,X
sub_950F:
C - - - - - 0x00151F 00:950F: A5 10     LDA ram_0010
C - - - - - 0x001521 00:9511: 38        SEC
C - - - - - 0x001522 00:9512: E9 12     SBC #$12
C - - - - - 0x001524 00:9514: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x001527 00:9517: A5 11     LDA ram_0011
C - - - - - 0x001529 00:9519: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00152C 00:951C: 30 03     BMI bra_9521
C - - - - - 0x00152E 00:951E: FE 1E 07  INC ram_obj_flags,X
bra_9521:
loc_9521:
C D 0 - - - 0x001531 00:9521: E6 90     INC ram_колво_спавн_мобов
bra_9523:
loc_9523:
C D 0 - - - 0x001533 00:9523: A9 00     LDA #$00
C - - - - - 0x001535 00:9525: 85 91     STA ram_0091
C - - - - - 0x001537 00:9527: 60        RTS



loc_9528:
C D 0 - - - 0x001538 00:9528: 20 06 F7  JSR sub_0x01F716_попытка_найти_свободный_слот_для_объекта___первые_4_слота
C - - - - - 0x00153B 00:952B: D0 F6     BNE bra_9523
C - - - - - 0x00153D 00:952D: A0 63     LDY #con_obj_id_63
C - - - - - 0x00153F 00:952F: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x001541 00:9531: 4A        LSR
C - - - - - 0x001542 00:9532: 4A        LSR
C - - - - - 0x001543 00:9533: 90 02     BCC bra_9537
C - - - - - 0x001545 00:9535: A0 24     LDY #con_obj_id_24
bra_9537:
C - - - - - 0x001547 00:9537: 20 9E F7  JSR sub_0x01F7AE_подготовить_объект
C - - - - - 0x00154A 00:953A: A4 0F     LDY ram_000F
C - - - - - 0x00154C 00:953C: B1 08     LDA (ram_0008),Y
C - - - - - 0x00154E 00:953E: 29 0F     AND #$0F
C - - - - - 0x001550 00:9540: 0A        ASL
C - - - - - 0x001551 00:9541: 0A        ASL
C - - - - - 0x001552 00:9542: 85 0A     STA ram_000A
C - - - - - 0x001554 00:9544: A5 23     LDA ram_рандом_байт
C - - - - - 0x001556 00:9546: 4A        LSR
C - - - - - 0x001557 00:9547: 4A        LSR
C - - - - - 0x001558 00:9548: 29 03     AND #$03
C - - - - - 0x00155A 00:954A: 18        CLC
C - - - - - 0x00155B 00:954B: 65 0A     ADC ram_000A
C - - - - - 0x00155D 00:954D: A8        TAY
C - - - - - 0x00155E 00:954E: B9 68 97  LDA tbl_9768,Y
C - - - - - 0x001561 00:9551: 9D 1E 07  STA ram_obj_flags,X
C - - - - - 0x001564 00:9554: A5 11     LDA ram_0011
C - - - - - 0x001566 00:9556: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x001569 00:9559: A5 10     LDA ram_0010
C - - - - - 0x00156B 00:955B: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00156E 00:955E: 10 03     BPL bra_9563
C - - - - - 0x001570 00:9560: FE 1E 07  INC ram_obj_flags,X
bra_9563:
C - - - - - 0x001573 00:9563: 4C 21 95  JMP loc_9521



loc_9566:
C D 0 - - - 0x001576 00:9566: A9 03     LDA #$03
C - - - - - 0x001578 00:9568: 85 99     STA ram_0099
loc_956A:
C D 0 - - - 0x00157A 00:956A: 20 06 F7  JSR sub_0x01F716_попытка_найти_свободный_слот_для_объекта___первые_4_слота
C - - - - - 0x00157D 00:956D: D0 B4     BNE bra_9523
C - - - - - 0x00157F 00:956F: A0 03     LDY #con_obj_id_03
C - - - - - 0x001581 00:9571: 20 9E F7  JSR sub_0x01F7AE_подготовить_объект
C - - - - - 0x001584 00:9574: 20 0F 95  JSR sub_950F
C - - - - - 0x001587 00:9577: E6 91     INC ram_0091
C - - - - - 0x001589 00:9579: A9 10     LDA #$10
C - - - - - 0x00158B 00:957B: 85 93     STA ram_таймер_до_спавна_моба
C - - - - - 0x00158D 00:957D: C6 99     DEC ram_0099
C - - - - - 0x00158F 00:957F: F0 A2     BEQ bra_9523
C - - - - - 0x001591 00:9581: 60        RTS



sub_9582:
C - - - - - 0x001592 00:9582: A5 90     LDA ram_колво_спавн_мобов
C - - - - - 0x001594 00:9584: C9 1E     CMP #$1E
C - - - - - 0x001596 00:9586: B0 20     BCS bra_95A8
; 1путин: удалено чтение кругов
; 1st loop
C - - - - - 0x00159C 00:958C: A0 00     LDY #$00
C - - - - - 0x00159E 00:958E: A5 11     LDA ram_0011
C - - - - - 0x0015A0 00:9590: 10 01     BPL bra_9593
C - - - - - 0x0015A2 00:9592: C8        INY ; 01
bra_9593:
C - - - - - 0x0015A3 00:9593: A2 01     LDX #$01
bra_9595_loop:
C - - - - - 0x0015A5 00:9595: B5 CA     LDA ram_plr_game_over,X
C - - - - - 0x0015A7 00:9597: D0 0C     BNE bra_95A5
C - - - - - 0x0015A9 00:9599: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0015AC 00:959C: D9 AC 95  CMP tbl_95AC,Y
C - - - - - 0x0015AF 00:959F: 6A        ROR
C - - - - - 0x0015B0 00:95A0: 59 AC 95  EOR tbl_95AC,Y
C - - - - - 0x0015B3 00:95A3: 10 05     BPL bra_95AA
bra_95A5:
C - - - - - 0x0015B5 00:95A5: CA        DEX
C - - - - - 0x0015B6 00:95A6: 10 ED     BPL bra_9595_loop
bra_95A8:
C - - - - - 0x0015B8 00:95A8: 18        CLC
C - - - - - 0x0015B9 00:95A9: 60        RTS
bra_95AA:
C - - - - - 0x0015BA 00:95AA: 38        SEC
C - - - - - 0x0015BB 00:95AB: 60        RTS



tbl_95AC:
- D 0 - - - 0x0015BC 00:95AC: 38        .byte $38   ; 00 
- D 0 - - - 0x0015BD 00:95AD: C8        .byte $C8   ; 01 



sub_95AE:
C - - - - - 0x0015BE 00:95AE: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x0015C0 00:95B0: 10 03     BPL bra_95B5
C - - - - - 0x0015C2 00:95B2: 4C 5C 96  JMP loc_965C
bra_95B5:
C - - - - - 0x0015C5 00:95B5: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x0015C7 00:95B7: 65 23     ADC ram_рандом_байт
C - - - - - 0x0015C9 00:95B9: 85 23     STA ram_рандом_байт
C - - - - - 0x0015CB 00:95BB: 4A        LSR
C - - - - - 0x0015CC 00:95BC: 29 0F     AND #$0F
C - - - - - 0x0015CE 00:95BE: A8        TAY
C - - - - - 0x0015CF 00:95BF: B9 40 96  LDA tbl_9640,Y
C - - - - - 0x0015D2 00:95C2: 85 11     STA ram_0011
C - - - - - 0x0015D4 00:95C4: A4 50     LDY ram_номер_уровня
C - - - - - 0x0015D6 00:95C6: B9 54 96  LDA tbl_9654,Y
C - - - - - 0x0015D9 00:95C9: F0 08     BEQ bra_95D3
C - - - - - 0x0015DB 00:95CB: A5 23     LDA ram_рандом_байт
C - - - - - 0x0015DD 00:95CD: 4A        LSR
C - - - - - 0x0015DE 00:95CE: 4A        LSR
C - - - - - 0x0015DF 00:95CF: 4A        LSR
C - - - - - 0x0015E0 00:95D0: 4A        LSR
C - - - - - 0x0015E1 00:95D1: 29 03     AND #$03
bra_95D3:
C - - - - - 0x0015E3 00:95D3: 85 13     STA ram_0013
C - - - - - 0x0015E5 00:95D5: A8        TAY
C - - - - - 0x0015E6 00:95D6: 4A        LSR
C - - - - - 0x0015E7 00:95D7: B9 50 96  LDA tbl_9650,Y
C - - - - - 0x0015EA 00:95DA: 90 03     BCC bra_95DF
C - - - - - 0x0015EC 00:95DC: AD 32 05  LDA ram_позиция_y_спрайта_игрока
bra_95DF:
C - - - - - 0x0015EF 00:95DF: 29 F0     AND #$F0
C - - - - - 0x0015F1 00:95E1: A8        TAY
C - - - - - 0x0015F2 00:95E2: A5 FC     LDA ram_scroll_Y
C - - - - - 0x0015F4 00:95E4: 29 0F     AND #$0F
C - - - - - 0x0015F6 00:95E6: 85 14     STA ram_0014
C - - - - - 0x0015F8 00:95E8: 98        TYA
C - - - - - 0x0015F9 00:95E9: 38        SEC
C - - - - - 0x0015FA 00:95EA: E5 14     SBC ram_0014
C - - - - - 0x0015FC 00:95EC: 18        CLC
C - - - - - 0x0015FD 00:95ED: 69 08     ADC #$08
C - - - - - 0x0015FF 00:95EF: 85 10     STA ram_0010
C - - - - - 0x001601 00:95F1: A9 0F     LDA #$0F
C - - - - - 0x001603 00:95F3: 85 12     STA ram_0012
bra_95F5_loop:
C - - - - - 0x001605 00:95F5: A4 10     LDY ram_0010
C - - - - - 0x001607 00:95F7: A5 11     LDA ram_0011
C - - - - - 0x001609 00:95F9: 20 16 96  JSR sub_9616
C - - - - - 0x00160C 00:95FC: B0 17     BCS bra_9615_RTS
bra_95FE_loop:
C - - - - - 0x00160E 00:95FE: A5 13     LDA ram_0013
C - - - - - 0x001610 00:9600: 4A        LSR
C - - - - - 0x001611 00:9601: 4A        LSR
C - - - - - 0x001612 00:9602: A9 10     LDA #$10
C - - - - - 0x001614 00:9604: 90 02     BCC bra_9608
C - - - - - 0x001616 00:9606: A9 EF     LDA #$EF
bra_9608:
C - - - - - 0x001618 00:9608: 65 10     ADC ram_0010
C - - - - - 0x00161A 00:960A: 85 10     STA ram_0010
C - - - - - 0x00161C 00:960C: C9 F0     CMP #$F0
C - - - - - 0x00161E 00:960E: B0 EE     BCS bra_95FE_loop
C - - - - - 0x001620 00:9610: C6 12     DEC ram_0012
C - - - - - 0x001622 00:9612: D0 E1     BNE bra_95F5_loop
bra_9614:
C - - - - - 0x001624 00:9614: 18        CLC
bra_9615_RTS:
C - - - - - 0x001625 00:9615: 60        RTS



sub_9616:
C - - - - - 0x001626 00:9616: 20 AA BA  JSR sub_0x007ABA_вычислить_тип_поверхности
C - - - - - 0x001629 00:9619: F0 F9     BEQ bra_9614
C - - - - - 0x00162B 00:961B: A5 10     LDA ram_0010
C - - - - - 0x00162D 00:961D: 38        SEC
C - - - - - 0x00162E 00:961E: E9 10     SBC #$10
C - - - - - 0x001630 00:9620: A8        TAY
C - - - - - 0x001631 00:9621: A5 11     LDA ram_0011
C - - - - - 0x001633 00:9623: 20 F5 BB  JSR sub_0x007C05
C - - - - - 0x001636 00:9626: B0 EC     BCS bra_9614
C - - - - - 0x001638 00:9628: A5 10     LDA ram_0010
C - - - - - 0x00163A 00:962A: 38        SEC
C - - - - - 0x00163B 00:962B: E9 10     SBC #$10
C - - - - - 0x00163D 00:962D: A8        TAY
C - - - - - 0x00163E 00:962E: A5 11     LDA ram_0011
C - - - - - 0x001640 00:9630: 0A        ASL
C - - - - - 0x001641 00:9631: A9 10     LDA #$10
C - - - - - 0x001643 00:9633: 90 02     BCC bra_9637
C - - - - - 0x001645 00:9635: A9 EF     LDA #$EF
bra_9637:
C - - - - - 0x001647 00:9637: 65 11     ADC ram_0011
C - - - - - 0x001649 00:9639: 20 F5 BB  JSR sub_0x007C05
C - - - - - 0x00164C 00:963C: B0 D6     BCS bra_9614
C - - - - - 0x00164E 00:963E: 38        SEC
C - - - - - 0x00164F 00:963F: 60        RTS



tbl_9640:
- D 0 - - - 0x001650 00:9640: F8        .byte $F8   ; 00 
- D 0 - - - 0x001651 00:9641: 08        .byte $08   ; 01 
- D 0 - - - 0x001652 00:9642: F8        .byte $F8   ; 02 
- D 0 - - - 0x001653 00:9643: F8        .byte $F8   ; 03 
- D 0 - - - 0x001654 00:9644: 08        .byte $08   ; 04 
- D 0 - - - 0x001655 00:9645: F8        .byte $F8   ; 05 
- D 0 - - - 0x001656 00:9646: 08        .byte $08   ; 06 
- D 0 - - - 0x001657 00:9647: F8        .byte $F8   ; 07 
- D 0 - - - 0x001658 00:9648: 08        .byte $08   ; 08 
- D 0 - - - 0x001659 00:9649: F8        .byte $F8   ; 09 
- D 0 - - - 0x00165A 00:964A: 08        .byte $08   ; 0A 
- D 0 - - - 0x00165B 00:964B: F8        .byte $F8   ; 0B 
- D 0 - - - 0x00165C 00:964C: F8        .byte $F8   ; 0C 
- D 0 - - - 0x00165D 00:964D: 08        .byte $08   ; 0D 
- D 0 - - - 0x00165E 00:964E: 08        .byte $08   ; 0E 
- D 0 - - - 0x00165F 00:964F: F8        .byte $F8   ; 0F 



tbl_9650:
- D 0 - - - 0x001660 00:9650: 10        .byte $10   ; 00 
- D 0 - - - 0x001661 00:9651: 80        .byte $80   ; 01 
- D 0 - - - 0x001662 00:9652: E0        .byte $E0   ; 02 
- D 0 - - - 0x001663 00:9653: 80        .byte $80   ; 03 



tbl_9654:
- D 0 - - - 0x001664 00:9654: 00        .byte $00   ; 00 
- - - - - - 0x001665 00:9655: 01        .byte $01   ; 01 
- D 0 - - - 0x001666 00:9656: 00        .byte $00   ; 02 
- - - - - - 0x001667 00:9657: 01        .byte $01   ; 03 
- D 0 - - - 0x001668 00:9658: 01        .byte $01   ; 04 
- - - - - - 0x001669 00:9659: 01        .byte $01   ; 05 
- D 0 - - - 0x00166A 00:965A: 01        .byte $01   ; 06 
- D 0 - - - 0x00166B 00:965B: 01        .byte $01   ; 07 



loc_965C:
C D 0 - - - 0x00166C 00:965C: A4 0F     LDY ram_000F
C - - - - - 0x00166E 00:965E: B1 08     LDA (ram_0008),Y
C - - - - - 0x001670 00:9660: A0 10     LDY #$10
C - - - - - 0x001672 00:9662: 29 20     AND #$20
C - - - - - 0x001674 00:9664: F0 0A     BEQ bra_9670
C - - - - - 0x001676 00:9666: A5 23     LDA ram_рандом_байт
C - - - - - 0x001678 00:9668: 65 1B     ADC ram_счетчик_кадров
C - - - - - 0x00167A 00:966A: 4A        LSR
C - - - - - 0x00167B 00:966B: 4A        LSR
C - - - - - 0x00167C 00:966C: B0 02     BCS bra_9670
C - - - - - 0x00167E 00:966E: A0 E0     LDY #$E0
bra_9670:
C - - - - - 0x001680 00:9670: 84 10     STY ram_0010
C - - - - - 0x001682 00:9672: A5 23     LDA ram_рандом_байт
C - - - - - 0x001684 00:9674: 29 07     AND #$07
C - - - - - 0x001686 00:9676: A8        TAY
C - - - - - 0x001687 00:9677: B9 AD 96  LDA tbl_96AD,Y
C - - - - - 0x00168A 00:967A: 85 11     STA ram_0011
C - - - - - 0x00168C 00:967C: 85 12     STA ram_0012
C - - - - - 0x00168E 00:967E: A5 23     LDA ram_рандом_байт
C - - - - - 0x001690 00:9680: 4A        LSR
C - - - - - 0x001691 00:9681: 29 01     AND #$01
C - - - - - 0x001693 00:9683: 85 13     STA ram_0013
bra_9685_loop:
C - - - - - 0x001695 00:9685: A4 10     LDY ram_0010
C - - - - - 0x001697 00:9687: A5 11     LDA ram_0011
C - - - - - 0x001699 00:9689: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x00169C 00:968C: F0 13     BEQ bra_96A1
C - - - - - 0x00169E 00:968E: A5 13     LDA ram_0013
C - - - - - 0x0016A0 00:9690: 4A        LSR
C - - - - - 0x0016A1 00:9691: A9 10     LDA #$10
C - - - - - 0x0016A3 00:9693: 90 02     BCC bra_9697
C - - - - - 0x0016A5 00:9695: A9 EF     LDA #$EF
bra_9697:
C - - - - - 0x0016A7 00:9697: 65 11     ADC ram_0011
C - - - - - 0x0016A9 00:9699: 85 11     STA ram_0011
C - - - - - 0x0016AB 00:969B: C5 12     CMP ram_0012
C - - - - - 0x0016AD 00:969D: D0 E6     BNE bra_9685_loop
C - - - - - 0x0016AF 00:969F: 18        CLC
C - - - - - 0x0016B0 00:96A0: 60        RTS
bra_96A1:
C - - - - - 0x0016B1 00:96A1: A5 10     LDA ram_0010
C - - - - - 0x0016B3 00:96A3: C9 10     CMP #$10
C - - - - - 0x0016B5 00:96A5: D0 02     BNE bra_96A9
C - - - - - 0x0016B7 00:96A7: A9 08     LDA #$08
bra_96A9:
C - - - - - 0x0016B9 00:96A9: 85 10     STA ram_0010
C - - - - - 0x0016BB 00:96AB: 38        SEC
C - - - - - 0x0016BC 00:96AC: 60        RTS



tbl_96AD:
- D 0 - - - 0x0016BD 00:96AD: 28        .byte $28   ; 00 
- D 0 - - - 0x0016BE 00:96AE: 48        .byte $48   ; 01 
- D 0 - - - 0x0016BF 00:96AF: 68        .byte $68   ; 02 
- D 0 - - - 0x0016C0 00:96B0: 88        .byte $88   ; 03 
- D 0 - - - 0x0016C1 00:96B1: A8        .byte $A8   ; 04 
- D 0 - - - 0x0016C2 00:96B2: C8        .byte $C8   ; 05 
- D 0 - - - 0x0016C3 00:96B3: E8        .byte $E8   ; 06 
- D 0 - - - 0x0016C4 00:96B4: 78        .byte $78   ; 07 



tbl_96B5:
- - - - - - 0x0016C5 00:96B5: 7B        .byte $7B   ; 00 
- - - - - - 0x0016C6 00:96B6: 53        .byte $53   ; 01 
- - - - - - 0x0016C7 00:96B7: 53        .byte $53   ; 02 
- - - - - - 0x0016C8 00:96B8: 53        .byte $53   ; 03 
- - - - - - 0x0016C9 00:96B9: 53        .byte $53   ; 04 
- - - - - - 0x0016CA 00:96BA: 53        .byte $53   ; 05 
- - - - - - 0x0016CB 00:96BB: 53        .byte $53   ; 06 
- - - - - - 0x0016CC 00:96BC: 53        .byte $53   ; 07 


tbl_96BD:
; bzk optimize, both cases have the same pointers for each area
- D 0 - - - 0x0016CD 00:96BD: DD 96     .word _off008_00_96DD_00_area_1
- - - - - - 0x0016D1 00:96C1: EB 96     .word _off008_00_96EB_01_area_2
- D 0 - - - 0x0016D5 00:96C5: F9 96     .word _off008_00_96F9_02_area_3
- D 0 - - - 0x0016D9 00:96C9: 0F 97     .word _off008_00_970F_03_area_4
- - - - - - 0x0016DD 00:96CD: 17 97     .word _off008_00_9717_04_area_5
- - - - - - 0x0016E1 00:96D1: 1F 97     .word _off008_00_971F_05_area_6
- - - - - - 0x0016E5 00:96D5: 2F 97     .word _off008_00_972F_06_area_7
- D 0 - - - 0x0016E9 00:96D9: 3C 97     .word _off008_00_973C_07_area_8


; ???
_off008_00_96DD_00_area_1:
_off008_01_96DD_00_area_1:
- D 0 - I - 0x0016ED 00:96DD: FF        .byte $FF   ; 
- D 0 - I - 0x0016EE 00:96DE: 80        .byte $80   ; 
- D 0 - I - 0x0016EF 00:96DF: 80        .byte $80   ; 
- D 0 - I - 0x0016F0 00:96E0: 80        .byte $80   ; 
- D 0 - I - 0x0016F1 00:96E1: 00        .byte $00   ; 
- D 0 - I - 0x0016F2 00:96E2: 00        .byte $00   ; 
- D 0 - I - 0x0016F3 00:96E3: 80        .byte $80   ; 
- D 0 - I - 0x0016F4 00:96E4: 80        .byte $80   ; 
- D 0 - I - 0x0016F5 00:96E5: 00        .byte $00   ; 
- D 0 - I - 0x0016F6 00:96E6: 00        .byte $00   ; 
- D 0 - I - 0x0016F7 00:96E7: 00        .byte $00   ; 
- D 0 - - - 0x0016F8 00:96E8: 80        .byte $80   ; 
- D 0 - I - 0x0016F9 00:96E9: 80        .byte $80   ; 
- - - - - - 0x0016FA 00:96EA: FF        .byte $FF   ; 



_off008_00_96EB_01_area_2:
_off008_01_96EB_01_area_2:
- - - - - - 0x0016FB 00:96EB: FF        .byte $FF   ; 
- D 0 - I - 0x0016FC 00:96EC: FF        .byte $FF   ; 
- D 0 - I - 0x0016FD 00:96ED: FF        .byte $FF   ; 
- D 0 - I - 0x0016FE 00:96EE: 22        .byte $22   ; 
- D 0 - I - 0x0016FF 00:96EF: 82        .byte $82   ; 
- D 0 - I - 0x001700 00:96F0: 81        .byte $81   ; 
- D 0 - I - 0x001701 00:96F1: 22        .byte $22   ; 
- D 0 - I - 0x001702 00:96F2: 02        .byte $02   ; 
- D 0 - I - 0x001703 00:96F3: A1        .byte $A1   ; 
- D 0 - I - 0x001704 00:96F4: 81        .byte $81   ; 
- D 0 - I - 0x001705 00:96F5: 02        .byte $02   ; 
- D 0 - I - 0x001706 00:96F6: 80        .byte $80   ; 
- D 0 - I - 0x001707 00:96F7: 80        .byte $80   ; 
- - - - - - 0x001708 00:96F8: FF        .byte $FF   ; 



_off008_00_96F9_02_area_3:
_off008_01_96F9_02_area_3:
- D 0 - I - 0x001709 00:96F9: 80        .byte $80   ; 
- D 0 - I - 0x00170A 00:96FA: 00        .byte $00   ; 
- D 0 - I - 0x00170B 00:96FB: 80        .byte $80   ; 
- D 0 - I - 0x00170C 00:96FC: 81        .byte $81   ; 
- D 0 - I - 0x00170D 00:96FD: 82        .byte $82   ; 
- D 0 - I - 0x00170E 00:96FE: 40        .byte $40   ; 
- D 0 - I - 0x00170F 00:96FF: 80        .byte $80   ; 
- D 0 - I - 0x001710 00:9700: 80        .byte $80   ; 
- D 0 - I - 0x001711 00:9701: 80        .byte $80   ; 
- D 0 - I - 0x001712 00:9702: 80        .byte $80   ; 
- D 0 - I - 0x001713 00:9703: 80        .byte $80   ; 
- D 0 - I - 0x001714 00:9704: 80        .byte $80   ; 
- D 0 - I - 0x001715 00:9705: 80        .byte $80   ; 
- D 0 - I - 0x001716 00:9706: 40        .byte $40   ; 
- D 0 - I - 0x001717 00:9707: FF        .byte $FF   ; 
- D 0 - I - 0x001718 00:9708: 40        .byte $40   ; 
- D 0 - I - 0x001719 00:9709: 00        .byte $00   ; 
- D 0 - I - 0x00171A 00:970A: 81        .byte $81   ; 
- D 0 - I - 0x00171B 00:970B: 01        .byte $01   ; 
- D 0 - I - 0x00171C 00:970C: FF        .byte $FF   ; 
- - - - - - 0x00171D 00:970D: FF        .byte $FF   ; 
- - - - - - 0x00171E 00:970E: FF        .byte $FF   ; 



_off008_00_970F_03_area_4:
_off008_01_970F_03_area_4:
- D 0 - I - 0x00171F 00:970F: FF        .byte $FF   ; 
- D 0 - I - 0x001720 00:9710: FF        .byte $FF   ; 
- D 0 - I - 0x001721 00:9711: FF        .byte $FF   ; 
- D 0 - I - 0x001722 00:9712: FF        .byte $FF   ; 
- - - - - - 0x001723 00:9713: FF        .byte $FF   ; 
- - - - - - 0x001724 00:9714: FF        .byte $FF   ; 
- - - - - - 0x001725 00:9715: FF        .byte $FF   ; 
- - - - - - 0x001726 00:9716: FF        .byte $FF   ; 



_off008_00_9717_04_area_5:
_off008_01_9717_04_area_5:
- D 0 - I - 0x001727 00:9717: 00        .byte $00   ; 
- D 0 - I - 0x001728 00:9718: 00        .byte $00   ; 
- D 0 - I - 0x001729 00:9719: 40        .byte $40   ; 
- D 0 - I - 0x00172A 00:971A: 00        .byte $00   ; 
- D 0 - I - 0x00172B 00:971B: 00        .byte $00   ; 
- D 0 - I - 0x00172C 00:971C: 00        .byte $00   ; 
- D 0 - I - 0x00172D 00:971D: 00        .byte $00   ; 
- - - - - - 0x00172E 00:971E: FF        .byte $FF   ; 



_off008_00_971F_05_area_6:
_off008_01_971F_05_area_6:
- - - - - - 0x00172F 00:971F: FF        .byte $FF   ; 
- D 0 - I - 0x001730 00:9720: FF        .byte $FF   ; 
- D 0 - I - 0x001731 00:9721: 02        .byte $02   ; 
- D 0 - I - 0x001732 00:9722: 21        .byte $21   ; 
- D 0 - I - 0x001733 00:9723: FF        .byte $FF   ; 
- D 0 - I - 0x001734 00:9724: A0        .byte $A0   ; 
- D 0 - I - 0x001735 00:9725: 22        .byte $22   ; 
- D 0 - I - 0x001736 00:9726: 81        .byte $81   ; 
- D 0 - I - 0x001737 00:9727: 02        .byte $02   ; 
- D 0 - I - 0x001738 00:9728: 83        .byte $83   ; 
- D 0 - I - 0x001739 00:9729: 02        .byte $02   ; 
- D 0 - I - 0x00173A 00:972A: 01        .byte $01   ; 
- D 0 - I - 0x00173B 00:972B: 00        .byte $00   ; 
- - - - - - 0x00173C 00:972C: FF        .byte $FF   ; 
- - - - - - 0x00173D 00:972D: FF        .byte $FF   ; 
- - - - - - 0x00173E 00:972E: FF        .byte $FF   ; 



_off008_00_972F_06_area_7:
_off008_01_972F_06_area_7:
- D 0 - I - 0x00173F 00:972F: FF        .byte $FF   ; 
- D 0 - I - 0x001740 00:9730: 00        .byte $00   ; 
- D 0 - I - 0x001741 00:9731: 80        .byte $80   ; 
- D 0 - I - 0x001742 00:9732: 00        .byte $00   ; 
- D 0 - I - 0x001743 00:9733: 00        .byte $00   ; 
- D 0 - I - 0x001744 00:9734: 00        .byte $00   ; 
- D 0 - I - 0x001745 00:9735: 80        .byte $80   ; 
- D 0 - I - 0x001746 00:9736: FF        .byte $FF   ; 
- D 0 - I - 0x001747 00:9737: FF        .byte $FF   ; 
- D 0 - I - 0x001748 00:9738: FF        .byte $FF   ; 
- D 0 - I - 0x001749 00:9739: FF        .byte $FF   ; 
- D 0 - I - 0x00174A 00:973A: FF        .byte $FF   ; 
- D 0 - I - 0x00174B 00:973B: FF        .byte $FF   ; 



_off008_00_973C_07_area_8:
_off008_01_973C_07_area_8:
- D 0 - I - 0x00174C 00:973C: FF        .byte $FF   ; 
- D 0 - I - 0x00174D 00:973D: 00        .byte $00   ; 
- D 0 - I - 0x00174E 00:973E: 00        .byte $00   ; 
- D 0 - I - 0x00174F 00:973F: 00        .byte $00   ; 
- D 0 - I - 0x001750 00:9740: 00        .byte $00   ; 
- D 0 - I - 0x001751 00:9741: 00        .byte $00   ; 
- D 0 - I - 0x001752 00:9742: 00        .byte $00   ; 
- D 0 - I - 0x001753 00:9743: 00        .byte $00   ; 
- D 0 - I - 0x001754 00:9744: 00        .byte $00   ; 
- D 0 - I - 0x001755 00:9745: 00        .byte $00   ; 
- D 0 - I - 0x001756 00:9746: 00        .byte $00   ; 
- D 0 - I - 0x001757 00:9747: 00        .byte $00   ; 
- D 0 - I - 0x001758 00:9748: 00        .byte $00   ; 
- D 0 - I - 0x001759 00:9749: FF        .byte $FF   ; 
- D 0 - I - 0x00175A 00:974A: FF        .byte $FF   ; 
- - - - - - 0x00175B 00:974B: FF        .byte $FF   ; 



tbl_974C:
- D 0 - - - 0x00175C 00:974C: 00        .byte $00, $00, $00, $00   ; 00 
- D 0 - - - 0x001760 00:9750: 00        .byte $00, $00, $00, $08   ; 01 
- D 0 - - - 0x001764 00:9754: 00        .byte $00, $00, $08, $08   ; 02 
; bzk garbage?
- - - - - - 0x001768 00:9758: 00        .byte $00, $08, $08, $08   ; 03 
- - - - - - 0x00176C 00:975C: 08        .byte $08, $08, $08, $08   ; 04 
- - - - - - 0x001770 00:9760: 00        .byte $00, $00, $00, $10   ; 05 
- - - - - - 0x001774 00:9764: 00        .byte $00, $00, $08, $10   ; 06 



tbl_9768:
- D 0 - - - 0x001778 00:9768: 00        .byte $00, $00, $00, $00   ; 00 
- D 0 - - - 0x00177C 00:976C: 00        .byte $00, $00, $00, $02   ; 01 
- D 0 - - - 0x001780 00:9770: 00        .byte $00, $00, $02, $02   ; 02 
- D 0 - - - 0x001784 00:9774: 00        .byte $00, $02, $02, $02   ; 03 
- - - - - - 0x001788 00:9778: 02        .byte $02, $02, $02, $02   ; 01 


loc_0x001C02_prepare_area_config:
; ???
C D 0 - - - 0x001C02 00:9BF2: A9 00     LDA #$00
C - - - - - 0x001C04 00:9BF4: 85 2F     STA ram_002F
C - - - - - 0x001C06 00:9BF6: A2 09     LDX #$09
bra_9BF8_loop:
C - - - - - 0x001C08 00:9BF8: 9D D0 07  STA ram_07D0,X
C - - - - - 0x001C0B 00:9BFB: CA        DEX
C - - - - - 0x001C0C 00:9BFC: 10 FA     BPL bra_9BF8_loop
; A = 00
C - - - - - 0x001C0E 00:9BFE: 85 26     STA ram_mirroring    ; con_mirroring_V
C - - - - - 0x001C10 00:9C00: 85 FD     STA ram_scroll_X
C - - - - - 0x001C12 00:9C02: 85 7A     STA ram_007A
C - - - - - 0x001C14 00:9C04: 85 FC     STA ram_scroll_Y
C - - - - - 0x001C16 00:9C06: 85 7B     STA ram_007B
C - - - - - 0x001C18 00:9C08: A5 FF     LDA ram_for_2000
C - - - - - 0x001C1A 00:9C0A: 29 FC     AND #$FC
C - - - - - 0x001C1C 00:9C0C: 85 FF     STA ram_for_2000
C - - - - - 0x001C1E 00:9C0E: 85 7C     STA ram_007C
C - - - - - 0x001C20 00:9C10: A9 FF     LDA #$FF
C - - - - - 0x001C22 00:9C12: 85 9C     STA ram_009C
C - - - - - 0x001C24 00:9C14: A4 50     LDY ram_номер_уровня
C - - - - - 0x001C26 00:9C16: A9 00     LDA #$00
C - - - - - 0x001C28 00:9C18: 85 63     STA ram_0063
C - - - - - 0x001C2A 00:9C1A: B9 4E 9C  LDA tbl_9C4E,Y
C - - - - - 0x001C2D 00:9C1D: 85 74     STA ram_0074_конфиг_уровня
C - - - - - 0x001C2F 00:9C1F: 85 82     STA ram_0082_конфиг_уровня
C - - - - - 0x001C31 00:9C21: B9 56 9C  LDA tbl_9C56,Y
C - - - - - 0x001C34 00:9C24: 85 61     STA ram_0061_конфиг_уровня
C - - - - - 0x001C36 00:9C26: B9 5E 9C  LDA tbl_9C5E,Y
C - - - - - 0x001C39 00:9C29: 85 71     STA ram_0071_тип_скролла
C - - - - - 0x001C3B 00:9C2B: 85 7D     STA ram_007D_тип_скролла
C - - - - - 0x001C3D 00:9C2D: B9 66 9C  LDA tbl_9C66,Y
C - - - - - 0x001C40 00:9C30: 85 8F     STA ram_008F_конфиг_уровня
C - - - - - 0x001C42 00:9C32: B9 6E 9C  LDA tbl_9C6E_вид,Y
C - - - - - 0x001C45 00:9C35: 85 5D     STA ram_конфиг_уровня_вид
C - - - - - 0x001C47 00:9C37: B9 76 9C  LDA tbl_9C76,Y
C - - - - - 0x001C4A 00:9C3A: 85 97     STA ram_0097_конфиг_уровня
C - - - - - 0x001C4C 00:9C3C: B9 7E 9C  LDA tbl_9C7E,Y
C - - - - - 0x001C4F 00:9C3F: 85 94     STA ram_0094_конфиг_уровня
C - - - - - 0x001C51 00:9C41: B9 86 9C  LDA tbl_9C86,Y
C - - - - - 0x001C54 00:9C44: 8D CD 03  STA ram_03CD
C - - - - - 0x001C57 00:9C47: B9 8E 9C  LDA tbl_9C8E,Y
C - - - - - 0x001C5A 00:9C4A: 8D CF 03  STA ram_03CF
C - - - - - 0x001C5D 00:9C4D: 60        RTS



tbl_9C4E:
- D 0 - - - 0x001C5E 00:9C4E: 02        .byte $02   ; 00 
- D 0 - - - 0x001C5F 00:9C4F: 0C        .byte $0C   ; 01 
- D 0 - - - 0x001C60 00:9C50: 00        .byte $00   ; 02 
- D 0 - - - 0x001C61 00:9C51: 0C        .byte $0C   ; 03 
- D 0 - - - 0x001C62 00:9C52: 06        .byte $06   ; 04 
- D 0 - - - 0x001C63 00:9C53: 0C        .byte $0C   ; 05 
- D 0 - - - 0x001C64 00:9C54: 00        .byte $00   ; 06 
- D 0 - - - 0x001C65 00:9C55: 03        .byte $03   ; 07 



tbl_9C56:
- D 0 - - - 0x001C66 00:9C56: 00        .byte $00   ; 00 
- D 0 - - - 0x001C67 00:9C57: 01        .byte $01   ; 01 
- D 0 - - - 0x001C68 00:9C58: 00        .byte $00   ; 02 
- D 0 - - - 0x001C69 00:9C59: 00        .byte $00   ; 03 
- D 0 - - - 0x001C6A 00:9C5A: 01        .byte $01   ; 04 
- D 0 - - - 0x001C6B 00:9C5B: 01        .byte $01   ; 05 
- D 0 - - - 0x001C6C 00:9C5C: 01        .byte $01   ; 06 
- D 0 - - - 0x001C6D 00:9C5D: 00        .byte $00   ; 07 



tbl_9C5E:
- D 0 - - - 0x001C6E 00:9C5E: 80        .byte $80   ; 00 
- D 0 - - - 0x001C6F 00:9C5F: 40        .byte $40   ; 01 
- D 0 - - - 0x001C70 00:9C60: C0        .byte $C0   ; 02 
- D 0 - - - 0x001C71 00:9C61: C0        .byte $C0   ; 03 
- D 0 - - - 0x001C72 00:9C62: 40        .byte $40   ; 04 
- D 0 - - - 0x001C73 00:9C63: 40        .byte $40   ; 05 
- D 0 - - - 0x001C74 00:9C64: 80        .byte $80   ; 06 
- D 0 - - - 0x001C75 00:9C65: C0        .byte $C0   ; 07 



tbl_9C66:
- D 0 - - - 0x001C76 00:9C66: 01        .byte $01   ; 00 
- D 0 - - - 0x001C77 00:9C67: 01        .byte $01   ; 01 
- D 0 - - - 0x001C78 00:9C68: 01        .byte $01   ; 02 
- D 0 - - - 0x001C79 00:9C69: 01        .byte $01   ; 03 
- D 0 - - - 0x001C7A 00:9C6A: 00        .byte $00   ; 04 
- D 0 - - - 0x001C7B 00:9C6B: 01        .byte $01   ; 05 
- D 0 - - - 0x001C7C 00:9C6C: 01        .byte $01   ; 06 
- D 0 - - - 0x001C7D 00:9C6D: 00        .byte $00   ; 07 



tbl_9C6E_вид:
; 00 = вид сбоку
; 01 = вид сверху
- D 0 - - - 0x001C7E 00:9C6E: 00        .byte $00   ; 00 
- D 0 - - - 0x001C7F 00:9C6F: 01        .byte $01   ; 01 
- D 0 - - - 0x001C80 00:9C70: 00        .byte $00   ; 02 
- D 0 - - - 0x001C81 00:9C71: 00        .byte $00   ; 03 
- D 0 - - - 0x001C82 00:9C72: 00        .byte $00   ; 04 
- D 0 - - - 0x001C83 00:9C73: 01        .byte $01   ; 05 
- D 0 - - - 0x001C84 00:9C74: 00        .byte $00   ; 06 
- D 0 - - - 0x001C85 00:9C75: 00        .byte $00   ; 07 



tbl_9C76:
- D 0 - - - 0x001C86 00:9C76: 80        .byte $80   ; 00 
- D 0 - - - 0x001C87 00:9C77: D0        .byte $D0   ; 01 
- D 0 - - - 0x001C88 00:9C78: A0        .byte $A0   ; 02 
- D 0 - - - 0x001C89 00:9C79: A0        .byte $A0   ; 03 
- D 0 - - - 0x001C8A 00:9C7A: 80        .byte $80   ; 04 
- D 0 - - - 0x001C8B 00:9C7B: D0        .byte $D0   ; 05 
- D 0 - - - 0x001C8C 00:9C7C: 80        .byte $80   ; 06 
- D 0 - - - 0x001C8D 00:9C7D: A0        .byte $A0   ; 07 



tbl_9C7E:
- D 0 - - - 0x001C8E 00:9C7E: 00        .byte $00   ; 00 
- D 0 - - - 0x001C8F 00:9C7F: 81        .byte $81   ; 01 
- D 0 - - - 0x001C90 00:9C80: 00        .byte $00   ; 02 
- D 0 - - - 0x001C91 00:9C81: 00        .byte $00   ; 03 
- D 0 - - - 0x001C92 00:9C82: 01        .byte $01   ; 04 
- D 0 - - - 0x001C93 00:9C83: 83        .byte $83   ; 05 
- D 0 - - - 0x001C94 00:9C84: 01        .byte $01   ; 06 
- D 0 - - - 0x001C95 00:9C85: 00        .byte $00   ; 07 



tbl_9C86:
- D 0 - - - 0x001C96 00:9C86: FF        .byte $FF   ; 00 
- D 0 - - - 0x001C97 00:9C87: FF        .byte $FF   ; 01 
- D 0 - - - 0x001C98 00:9C88: FF        .byte $FF   ; 02 
- D 0 - - - 0x001C99 00:9C89: FF        .byte $FF   ; 03 
- D 0 - - - 0x001C9A 00:9C8A: 00        .byte $00   ; 04 
- D 0 - - - 0x001C9B 00:9C8B: FF        .byte $FF   ; 05 
- D 0 - - - 0x001C9C 00:9C8C: FF        .byte $FF   ; 06 
- D 0 - - - 0x001C9D 00:9C8D: FF        .byte $FF   ; 07 



tbl_9C8E:
- D 0 - - - 0x001C9E 00:9C8E: 00        .byte $00   ; 00 
- D 0 - - - 0x001C9F 00:9C8F: 00        .byte $00   ; 01 
- D 0 - - - 0x001CA0 00:9C90: 00        .byte $00   ; 02 
- D 0 - - - 0x001CA1 00:9C91: 00        .byte $00   ; 03 
- D 0 - - - 0x001CA2 00:9C92: 00        .byte $00   ; 04 
- D 0 - - - 0x001CA3 00:9C93: 00        .byte $00   ; 05 
- D 0 - - - 0x001CA4 00:9C94: 00        .byte $00   ; 06 
- D 0 - - - 0x001CA5 00:9C95: 00        .byte $00   ; 07 


loc_0x001CA6:
C D 0 - - - 0x001CA6 00:9C96: 20 E8 9C  JSR sub_9CE8
C - - - - - 0x001CA9 00:9C99: A6 61     LDX ram_0061_конфиг_уровня
C - - - - - 0x001CAB 00:9C9B: F0 05     BEQ bra_9CA2
C - - - - - 0x001CAD 00:9C9D: CA        DEX
C - - - - - 0x001CAE 00:9C9E: F0 42     BEQ bra_9CE2_RTS
C - - - - - 0x001CB0 00:9CA0: D0 1B     BNE bra_9CBD    ; jmp
bra_9CA2:
C - - - - - 0x001CB2 00:9CA2: A6 85     LDX ram_0085_for_2006
C - - - - - 0x001CB4 00:9CA4: 30 17     BMI bra_9CBD
C - - - - - 0x001CB6 00:9CA6: A5 62     LDA ram_cam_spd_X
C - - - - - 0x001CB8 00:9CA8: F0 38     BEQ bra_9CE2_RTS
C - - - - - 0x001CBA 00:9CAA: 18        CLC
C - - - - - 0x001CBB 00:9CAB: 65 FD     ADC ram_scroll_X
C - - - - - 0x001CBD 00:9CAD: 85 FD     STA ram_scroll_X
C - - - - - 0x001CBF 00:9CAF: A6 85     LDX ram_0085_for_2006
C - - - - - 0x001CC1 00:9CB1: D0 2F     BNE bra_9CE2_RTS
C - - - - - 0x001CC3 00:9CB3: 90 08     BCC bra_9CBD
C - - - - - 0x001CC5 00:9CB5: A5 FF     LDA ram_for_2000
C - - - - - 0x001CC7 00:9CB7: 49 01     EOR #$01
C - - - - - 0x001CC9 00:9CB9: 85 FF     STA ram_for_2000
C - - - - - 0x001CCB 00:9CBB: E6 63     INC ram_0063
bra_9CBD:
C - - - - - 0x001CCD 00:9CBD: A4 89     LDY ram_0089_столбцы_данных_уровня
C - - - - - 0x001CCF 00:9CBF: 88        DEY
C - - - - - 0x001CD0 00:9CC0: 84 00     STY ram_0000
C - - - - - 0x001CD2 00:9CC2: A5 63     LDA ram_0063
C - - - - - 0x001CD4 00:9CC4: C5 00     CMP ram_0000
C - - - - - 0x001CD6 00:9CC6: B0 1B     BCS bra_9CE3
C - - - - - 0x001CD8 00:9CC8: C5 6C     CMP ram_006C
C - - - - - 0x001CDA 00:9CCA: F0 08     BEQ bra_9CD4
C - - - - - 0x001CDC 00:9CCC: B0 0C     BCS bra_9CDA
; C = 0
C - - - - - 0x001CDE 00:9CCE: A5 6C     LDA ram_006C
C - - - - - 0x001CE0 00:9CD0: 30 08     BMI bra_9CDA
C - - - - - 0x001CE2 00:9CD2: 90 0E     BCC bra_9CE2_RTS    ; jmp
bra_9CD4:
C - - - - - 0x001CE4 00:9CD4: A5 FD     LDA ram_scroll_X
C - - - - - 0x001CE6 00:9CD6: C5 6B     CMP ram_006B
C - - - - - 0x001CE8 00:9CD8: 90 08     BCC bra_9CE2_RTS
bra_9CDA:
C - - - - - 0x001CEA 00:9CDA: A5 60     LDA ram_0060_unk
C - - - - - 0x001CEC 00:9CDC: D0 04     BNE bra_9CE2_RTS
C - - - - - 0x001CEE 00:9CDE: A9 02     LDA #$02
C - - - - - 0x001CF0 00:9CE0: 85 60     STA ram_0060_unk
bra_9CE2_RTS:
C - - - - - 0x001CF2 00:9CE2: 60        RTS
bra_9CE3:
- - - - - - 0x001CF3 00:9CE3: A9 01     LDA #$01
- - - - - - 0x001CF5 00:9CE5: 85 61     STA ram_0061_конфиг_уровня
bra_9CE7_RTS:
C - - - - - 0x001CF7 00:9CE7: 60        RTS



sub_9CE8:
C - - - - - 0x001CF8 00:9CE8: A5 FC     LDA ram_scroll_Y
C - - - - - 0x001CFA 00:9CEA: 29 0F     AND #$0F
C - - - - - 0x001CFC 00:9CEC: 85 00     STA ram_0000
C - - - - - 0x001CFE 00:9CEE: A5 72     LDA ram_cam_spd_Y
C - - - - - 0x001D00 00:9CF0: F0 F5     BEQ bra_9CE7_RTS
C - - - - - 0x001D02 00:9CF2: 30 57     BMI bra_9D4B
C - - - - - 0x001D04 00:9CF4: 18        CLC
C - - - - - 0x001D05 00:9CF5: 65 FC     ADC ram_scroll_Y
C - - - - - 0x001D07 00:9CF7: 85 FC     STA ram_scroll_Y
C - - - - - 0x001D09 00:9CF9: B0 04     BCS bra_9CFF
C - - - - - 0x001D0B 00:9CFB: C9 F0     CMP #$F0
C - - - - - 0x001D0D 00:9CFD: 90 07     BCC bra_9D06
bra_9CFF:
C - - - - - 0x001D0F 00:9CFF: 18        CLC
C - - - - - 0x001D10 00:9D00: 69 10     ADC #$10
C - - - - - 0x001D12 00:9D02: 85 FC     STA ram_scroll_Y
C - - - - - 0x001D14 00:9D04: E6 82     INC ram_0082_конфиг_уровня
bra_9D06:
C - - - - - 0x001D16 00:9D06: A5 00     LDA ram_0000
C - - - - - 0x001D18 00:9D08: C9 07     CMP #$07
C - - - - - 0x001D1A 00:9D0A: B0 37     BCS bra_9D43
C - - - - - 0x001D1C 00:9D0C: A5 FC     LDA ram_scroll_Y
C - - - - - 0x001D1E 00:9D0E: 29 0F     AND #$0F
C - - - - - 0x001D20 00:9D10: C9 07     CMP #$07
C - - - - - 0x001D22 00:9D12: 90 2F     BCC bra_9D43
C - - - - - 0x001D24 00:9D14: A0 00     LDY #$00
C - - - - - 0x001D26 00:9D16: A5 77     LDA ram_0077
C - - - - - 0x001D28 00:9D18: F0 21     BEQ bra_9D3B
C - - - - - 0x001D2A 00:9D1A: A5 73     LDA ram_0073
C - - - - - 0x001D2C 00:9D1C: 69 01     ADC #$01
C - - - - - 0x001D2E 00:9D1E: C9 1E     CMP #$1E
C - - - - - 0x001D30 00:9D20: 90 04     BCC bra_9D26
C - - - - - 0x001D32 00:9D22: E6 74     INC ram_0074_конфиг_уровня
C - - - - - 0x001D34 00:9D24: A9 00     LDA #$00
bra_9D26:
C - - - - - 0x001D36 00:9D26: 85 73     STA ram_0073
C - - - - - 0x001D38 00:9D28: A0 00     LDY #$00
C - - - - - 0x001D3A 00:9D2A: A5 74     LDA ram_0074_конфиг_уровня
C - - - - - 0x001D3C 00:9D2C: 18        CLC
C - - - - - 0x001D3D 00:9D2D: 69 02     ADC #$02
C - - - - - 0x001D3F 00:9D2F: C5 88     CMP ram_0088_строки_данных_уровня
C - - - - - 0x001D41 00:9D31: D0 08     BNE bra_9D3B
C - - - - - 0x001D43 00:9D33: A5 73     LDA ram_0073
C - - - - - 0x001D45 00:9D35: C9 1C     CMP #$1C
C - - - - - 0x001D47 00:9D37: 90 02     BCC bra_9D3B
- - - - - - 0x001D49 00:9D39: A0 40     LDY #$40
bra_9D3B:
C - - - - - 0x001D4B 00:9D3B: 20 45 9D  JSR sub_9D45
C - - - - - 0x001D4E 00:9D3E: A0 01     LDY #$01
C - - - - - 0x001D50 00:9D40: 4C 8D 9D  JMP loc_9D8D
bra_9D43:
C - - - - - 0x001D53 00:9D43: A0 00     LDY #$00
sub_9D45:
C - - - - - 0x001D55 00:9D45: 98        TYA
C - - - - - 0x001D56 00:9D46: 05 7D     ORA ram_007D_тип_скролла
C - - - - - 0x001D58 00:9D48: 85 71     STA ram_0071_тип_скролла
C - - - - - 0x001D5A 00:9D4A: 60        RTS
bra_9D4B:
C - - - - - 0x001D5B 00:9D4B: 18        CLC
C - - - - - 0x001D5C 00:9D4C: 65 FC     ADC ram_scroll_Y
C - - - - - 0x001D5E 00:9D4E: 85 FC     STA ram_scroll_Y
C - - - - - 0x001D60 00:9D50: 90 04     BCC bra_9D56
C - - - - - 0x001D62 00:9D52: C9 F0     CMP #$F0
C - - - - - 0x001D64 00:9D54: 90 07     BCC bra_9D5D
bra_9D56:
C - - - - - 0x001D66 00:9D56: 38        SEC
C - - - - - 0x001D67 00:9D57: E9 10     SBC #$10
C - - - - - 0x001D69 00:9D59: 85 FC     STA ram_scroll_Y
C - - - - - 0x001D6B 00:9D5B: C6 82     DEC ram_0082_конфиг_уровня
bra_9D5D:
C - - - - - 0x001D6D 00:9D5D: A5 00     LDA ram_0000
C - - - - - 0x001D6F 00:9D5F: C9 07     CMP #$07
C - - - - - 0x001D71 00:9D61: 90 E0     BCC bra_9D43
C - - - - - 0x001D73 00:9D63: A5 FC     LDA ram_scroll_Y
C - - - - - 0x001D75 00:9D65: 29 0F     AND #$0F
C - - - - - 0x001D77 00:9D67: C9 07     CMP #$07
C - - - - - 0x001D79 00:9D69: B0 D8     BCS bra_9D43
C - - - - - 0x001D7B 00:9D6B: A0 00     LDY #$00
C - - - - - 0x001D7D 00:9D6D: A5 77     LDA ram_0077
C - - - - - 0x001D7F 00:9D6F: D0 17     BNE bra_9D88
C - - - - - 0x001D81 00:9D71: A5 73     LDA ram_0073
C - - - - - 0x001D83 00:9D73: 38        SEC
C - - - - - 0x001D84 00:9D74: E9 02     SBC #$02
C - - - - - 0x001D86 00:9D76: 10 04     BPL bra_9D7C
C - - - - - 0x001D88 00:9D78: A9 1C     LDA #$1C
C - - - - - 0x001D8A 00:9D7A: C6 74     DEC ram_0074_конфиг_уровня
bra_9D7C:
C - - - - - 0x001D8C 00:9D7C: 85 73     STA ram_0073
C - - - - - 0x001D8E 00:9D7E: A0 00     LDY #$00
C - - - - - 0x001D90 00:9D80: A5 74     LDA ram_0074_конфиг_уровня
C - - - - - 0x001D92 00:9D82: 05 73     ORA ram_0073
C - - - - - 0x001D94 00:9D84: D0 02     BNE bra_9D88
C - - - - - 0x001D96 00:9D86: A0 80     LDY #$80
bra_9D88:
C - - - - - 0x001D98 00:9D88: 20 45 9D  JSR sub_9D45
C - - - - - 0x001D9B 00:9D8B: A0 00     LDY #$00
loc_9D8D:
C D 0 - - - 0x001D9D 00:9D8D: 84 77     STY ram_0077
C - - - - - 0x001D9F 00:9D8F: A9 01     LDA #$01
C - - - - - 0x001DA1 00:9D91: 85 70     STA ram_0070
C - - - - - 0x001DA3 00:9D93: 60        RTS


loc_0x002178_stage_complete_handler:
; leon опт
                                        LDY ram_0040
                                        LDA tbl_A16D_lo,y
                                        STA ram_0000
                                        LDA tbl_A16D_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_A16D_lo:
- D 1 - I - 0x00217D 00:A16D: 71 A1     .byte < ofs_007_A171_00
- D 1 - I - 0x00217F 00:A16F: B5 A1     .byte < ofs_007_A1B5_01
tbl_A16D_hi:
- D 1 - I - 0x00217D 00:A16D: 71 A1     .byte > ofs_007_A171_00
- D 1 - I - 0x00217F 00:A16F: B5 A1     .byte > ofs_007_A1B5_01


ofs_007_A171_00:
C - - J - - 0x002181 00:A171: 20 77 A1  JSR sub_A177
C - - - - - 0x002184 00:A174: E6 40     INC ram_0040
C - - - - - 0x002186 00:A176: 60        RTS



sub_A177:
; leon опт
                                        LDY ram_номер_уровня
                                        LDA tbl_A17C_lo,y
                                        STA ram_0000
                                        LDA tbl_A17C_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_A17C_lo:
- D 1 - I - 0x00218C 00:A17C: 8C A1     .byte < ofs_008_A18C_00_area_1
- D 1 - I - 0x00218E 00:A17E: 95 A1     .byte < ofs_008_A195_01_area_2
- D 1 - I - 0x002190 00:A180: A0 A1     .byte < ofs_008_A1A0_02_area_3
- D 1 - I - 0x002192 00:A182: 8C A1     .byte < ofs_008_A18C_03_area_4
- D 1 - I - 0x002194 00:A184: 8C A1     .byte < ofs_008_A18C_04_area_5
- D 1 - I - 0x002196 00:A186: A5 A1     .byte < ofs_008_A1A5_05_area_6
- D 1 - I - 0x002198 00:A188: A0 A1     .byte < ofs_008_A1A0_06_area_7
- D 1 - I - 0x00219A 00:A18A: B0 A1     .byte < ofs_008_A1B0_07_area_8
tbl_A17C_hi:
- D 1 - I - 0x00218C 00:A17C: 8C A1     .byte > ofs_008_A18C_00_area_1
- D 1 - I - 0x00218E 00:A17E: 95 A1     .byte > ofs_008_A195_01_area_2
- D 1 - I - 0x002190 00:A180: A0 A1     .byte > ofs_008_A1A0_02_area_3
- D 1 - I - 0x002192 00:A182: 8C A1     .byte > ofs_008_A18C_03_area_4
- D 1 - I - 0x002194 00:A184: 8C A1     .byte > ofs_008_A18C_04_area_5
- D 1 - I - 0x002196 00:A186: A5 A1     .byte > ofs_008_A1A5_05_area_6
- D 1 - I - 0x002198 00:A188: A0 A1     .byte > ofs_008_A1A0_06_area_7
- D 1 - I - 0x00219A 00:A18A: B0 A1     .byte > ofs_008_A1B0_07_area_8


ofs_008_A18C_00_area_1:
ofs_008_A18C_03_area_4:
ofs_008_A18C_04_area_5:
C - - J - - 0x00219C 00:A18C: A9 02     LDA #$02
C - - - - - 0x00219E 00:A18E: 85 6F     STA ram_006F
C - - - - - 0x0021A0 00:A190: A9 00     LDA #$00
C - - - - - 0x0021A2 00:A192: 85 61     STA ram_0061_конфиг_уровня
C - - - - - 0x0021A4 00:A194: 60        RTS



ofs_008_A195_01_area_2:
C - - J - - 0x0021A5 00:A195: A9 01     LDA #$01
C - - - - - 0x0021A7 00:A197: 85 84     STA ram_0083 + $01
C - - - - - 0x0021A9 00:A199: A9 40     LDA #$40
C - - - - - 0x0021AB 00:A19B: 85 71     STA ram_0071_тип_скролла
C - - - - - 0x0021AD 00:A19D: 85 7D     STA ram_007D_тип_скролла
C - - - - - 0x0021AF 00:A19F: 60        RTS



ofs_008_A1A0_02_area_3:
ofs_008_A1A0_06_area_7:
C - - J - - 0x0021B0 00:A1A0: A9 90     LDA #$90
C - - - - - 0x0021B2 00:A1A2: 85 9B     STA ram_009B
C - - - - - 0x0021B4 00:A1A4: 60        RTS



ofs_008_A1A5_05_area_6:
C - - J - - 0x0021B5 00:A1A5: A0 1F     LDY #$1F
C - - - - - 0x0021B7 00:A1A7: A9 00     LDA #$00
bra_A1A9_loop:
C - - - - - 0x0021B9 00:A1A9: 99 80 04  STA ram_0480,Y
C - - - - - 0x0021BC 00:A1AC: 88        DEY
C - - - - - 0x0021BD 00:A1AD: 10 FA     BPL bra_A1A9_loop
C - - - - - 0x0021BF 00:A1AF: 60        RTS



ofs_008_A1B0_07_area_8:
C - - J - - 0x0021C0 00:A1B0: A9 C0     LDA #$C0
C - - - - - 0x0021C2 00:A1B2: 85 9B     STA ram_009B
C - - - - - 0x0021C4 00:A1B4: 60        RTS



ofs_007_A1B5_01:
C - - J - - 0x0021C5 00:A1B5: A2 01     LDX #$01
bra_A1B7_loop:
C - - - - - 0x0021C7 00:A1B7: B5 CA     LDA ram_plr_game_over,X
C - - - - - 0x0021C9 00:A1B9: D0 03     BNE bra_A1BE
C - - - - - 0x0021CB 00:A1BB: 20 C2 A1  JSR sub_A1C2
bra_A1BE:
C - - - - - 0x0021CE 00:A1BE: CA        DEX
C - - - - - 0x0021CF 00:A1BF: 10 F6     BPL bra_A1B7_loop
C - - - - - 0x0021D1 00:A1C1: 60        RTS



sub_A1C2:
; leon опт
                                        LDY ram_номер_уровня
                                        LDA tbl_A1C7_lo,y
                                        STA ram_0000
                                        LDA tbl_A1C7_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_A1C7_lo:
- D 1 - I - 0x0021D7 00:A1C7: D7 A1     .byte < ofs_009_A1D7_00_area_1
- D 1 - I - 0x0021D9 00:A1C9: FA A1     .byte < ofs_009_A1FA_01_area_2
- D 1 - I - 0x0021DB 00:A1CB: 2F A2     .byte < ofs_009_A22F_02_area_3
- D 1 - I - 0x0021DD 00:A1CD: 3F A2     .byte < ofs_009_A23F_03_area_4
- D 1 - I - 0x0021DF 00:A1CF: 48 A2     .byte < ofs_009_A248_04_area_5
- D 1 - I - 0x0021E1 00:A1D1: E2 A1     .byte < ofs_009_A1E2_05_area_6
- D 1 - I - 0x0021E3 00:A1D3: 2F A2     .byte < ofs_009_A22F_06_area_7
- D 1 - I - 0x0021E5 00:A1D5: 53 A2     .byte < ofs_009_A253_07_area_8
tbl_A1C7_hi:
- D 1 - I - 0x0021D7 00:A1C7: D7 A1     .byte > ofs_009_A1D7_00_area_1
- D 1 - I - 0x0021D9 00:A1C9: FA A1     .byte > ofs_009_A1FA_01_area_2
- D 1 - I - 0x0021DB 00:A1CB: 2F A2     .byte > ofs_009_A22F_02_area_3
- D 1 - I - 0x0021DD 00:A1CD: 3F A2     .byte > ofs_009_A23F_03_area_4
- D 1 - I - 0x0021DF 00:A1CF: 48 A2     .byte > ofs_009_A248_04_area_5
- D 1 - I - 0x0021E1 00:A1D1: E2 A1     .byte > ofs_009_A1E2_05_area_6
- D 1 - I - 0x0021E3 00:A1D3: 2F A2     .byte > ofs_009_A22F_06_area_7
- D 1 - I - 0x0021E5 00:A1D5: 53 A2     .byte > ofs_009_A253_07_area_8


ofs_009_A1D7_00_area_1:
C - - J - - 0x0021E7 00:A1D7: A9 90     LDA #$90
C - - - - - 0x0021E9 00:A1D9: 85 00     STA ram_0000
C - - - - - 0x0021EB 00:A1DB: A9 B8     LDA #$B8
C - - - - - 0x0021ED 00:A1DD: 85 01     STA ram_0001
C - - - - - 0x0021EF 00:A1DF: 4C 69 A2  JMP loc_A269



ofs_009_A1E2_05_area_6:
C - - J - - 0x0021F2 00:A1E2: A0 00     LDY #$00
C - - - - - 0x0021F4 00:A1E4: A5 84     LDA ram_0083 + $01
C - - - - - 0x0021F6 00:A1E6: D0 3F     BNE bra_A227
C - - - - - 0x0021F8 00:A1E8: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0021FB 00:A1EB: C9 08     CMP #$08
C - - - - - 0x0021FD 00:A1ED: 90 3B     BCC bra_A22A
C - - - - - 0x0021FF 00:A1EF: C9 50     CMP #$50
C - - - - - 0x002201 00:A1F1: B0 04     BCS bra_A1F7
C - - - - - 0x002203 00:A1F3: A9 01     LDA #$01
C - - - - - 0x002205 00:A1F5: 95 D2     STA ram_00D2_коллизии_игрока,X
bra_A1F7:
C - - - - - 0x002207 00:A1F7: 4C 17 A2  JMP loc_A217



ofs_009_A1FA_01_area_2:
C - - J - - 0x00220A 00:A1FA: A0 00     LDY #$00
C - - - - - 0x00220C 00:A1FC: A5 84     LDA ram_0083 + $01
C - - - - - 0x00220E 00:A1FE: D0 27     BNE bra_A227
C - - - - - 0x002210 00:A200: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x002213 00:A203: C9 08     CMP #$08
C - - - - - 0x002215 00:A205: 90 23     BCC bra_A22A
C - - - - - 0x002217 00:A207: C9 40     CMP #$40
C - - - - - 0x002219 00:A209: B0 0C     BCS bra_A217
C - - - - - 0x00221B 00:A20B: A9 01     LDA #$01
C - - - - - 0x00221D 00:A20D: 95 D2     STA ram_00D2_коллизии_игрока,X
C - - - - - 0x00221F 00:A20F: BD 66 05  LDA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x002222 00:A212: 09 20     ORA #$20
C - - - - - 0x002224 00:A214: 9D 66 05  STA ram_атрибуты_спрайта_игрока,X
bra_A217:
loc_A217:
C D 1 - - - 0x002227 00:A217: A0 08     LDY #$08
C - - - - - 0x002229 00:A219: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x00222C 00:A21C: DD 2D A2  CMP tbl_A22D,X
C - - - - - 0x00222F 00:A21F: F0 06     BEQ bra_A227
C - - - - - 0x002231 00:A221: A0 09     LDY #con_btn_Up + con_btn_Right
C - - - - - 0x002233 00:A223: 90 02     BCC bra_A227
C - - - - - 0x002235 00:A225: A0 0A     LDY #con_btn_Up + con_btn_Left
bra_A227:
C - - - - - 0x002237 00:A227: 94 F3     STY ram_удержанная_кнопка,X
C - - - - - 0x002239 00:A229: 60        RTS
bra_A22A:
C - - - - - 0x00223A 00:A22A: 4C 97 A2  JMP loc_A297



tbl_A22D:
- D 1 - - - 0x00223D 00:A22D: 90        .byte $90   ; 00 
- D 1 - - - 0x00223E 00:A22E: 70        .byte $70   ; 01 



ofs_009_A22F_02_area_3:
ofs_009_A22F_06_area_7:
C - - J - - 0x00223F 00:A22F: A5 9B     LDA ram_009B
C - - - - - 0x002241 00:A231: F0 03     BEQ bra_A236
C - - - - - 0x002243 00:A233: C6 9B     DEC ram_009B
C - - - - - 0x002245 00:A235: 60        RTS
bra_A236:
C - - - - - 0x002246 00:A236: A9 FF     LDA #$FF
C - - - - - 0x002248 00:A238: 85 00     STA ram_0000
C - - - - - 0x00224A 00:A23A: 85 01     STA ram_0001
C - - - - - 0x00224C 00:A23C: 4C 77 A2  JMP loc_A277



ofs_009_A23F_03_area_4:
C - - J - - 0x00224F 00:A23F: A9 C8     LDA #$C8
C - - - - - 0x002251 00:A241: 85 00     STA ram_0000
C - - - - - 0x002253 00:A243: 85 01     STA ram_0001
C - - - - - 0x002255 00:A245: 4C 69 A2  JMP loc_A269



ofs_009_A248_04_area_5:
C - - J - - 0x002258 00:A248: A9 90     LDA #$90
C - - - - - 0x00225A 00:A24A: 85 00     STA ram_0000
C - - - - - 0x00225C 00:A24C: A9 A8     LDA #$A8
C - - - - - 0x00225E 00:A24E: 85 01     STA ram_0001
C - - - - - 0x002260 00:A250: 4C 69 A2  JMP loc_A269



ofs_009_A253_07_area_8:
C - - J - - 0x002263 00:A253: A9 00     LDA #$00
C - - - - - 0x002265 00:A255: 95 F3     STA ram_удержанная_кнопка,X
C - - - - - 0x002267 00:A257: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x002269 00:A259: 4A        LSR
C - - - - - 0x00226A 00:A25A: B0 0C     BCS bra_A268_RTS
C - - - - - 0x00226C 00:A25C: A5 9B     LDA ram_009B
C - - - - - 0x00226E 00:A25E: F0 08     BEQ bra_A268_RTS
C - - - - - 0x002270 00:A260: C6 9B     DEC ram_009B
C - - - - - 0x002272 00:A262: D0 04     BNE bra_A268_RTS
C - - - - - 0x002274 00:A264: A9 01     LDA #$01
C - - - - - 0x002276 00:A266: 85 3F     STA ram_таймер_экрана
bra_A268_RTS:
C - - - - - 0x002278 00:A268: 60        RTS



loc_A269:
C D 1 - - - 0x002279 00:A269: A9 00     LDA #$00
C - - - - - 0x00227B 00:A26B: A4 6F     LDY ram_006F
C - - - - - 0x00227D 00:A26D: D0 25     BNE bra_A294
C - - - - - 0x00227F 00:A26F: B5 CC     LDA ram_копия_позиция_x_спрайта_игрока,X
C - - - - - 0x002281 00:A271: D0 04     BNE bra_A277
C - - - - - 0x002283 00:A273: A9 80     LDA #con_btn_A
C - - - - - 0x002285 00:A275: 95 F1     STA ram_нажатая_кнопка,X
bra_A277:
loc_A277:
C D 1 - - - 0x002287 00:A277: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x00228A 00:A27A: C9 E8     CMP #$E8
C - - - - - 0x00228C 00:A27C: B0 19     BCS bra_A297
C - - - - - 0x00228E 00:A27E: C5 00     CMP ram_0000
C - - - - - 0x002290 00:A280: 90 04     BCC bra_A286
C - - - - - 0x002292 00:A282: A0 01     LDY #$01
C - - - - - 0x002294 00:A284: 94 D2     STY ram_00D2_коллизии_игрока,X
bra_A286:
C - - - - - 0x002296 00:A286: C5 01     CMP ram_0001
C - - - - - 0x002298 00:A288: 90 08     BCC bra_A292
C - - - - - 0x00229A 00:A28A: BD 66 05  LDA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x00229D 00:A28D: 09 20     ORA #$20
C - - - - - 0x00229F 00:A28F: 9D 66 05  STA ram_атрибуты_спрайта_игрока,X
bra_A292:
C - - - - - 0x0022A2 00:A292: A9 01     LDA #con_btn_Right
bra_A294:   ; A = 00
C - - - - - 0x0022A4 00:A294: 95 F3     STA ram_удержанная_кнопка,X
C - - - - - 0x0022A6 00:A296: 60        RTS
bra_A297:
loc_A297:
C D 1 - - - 0x0022A7 00:A297: A9 08     LDA #con_plr_status_добежал_до_выхода
C - - - - - 0x0022A9 00:A299: 95 A0     STA ram_статус_игрока,X
C - - - - - 0x0022AB 00:A29B: 60        RTS


loc_0x0023C7_credits_handler:
; leon опт
                                        LDY ram_0061_конфиг_уровня
                                        LDA tbl_A3BC_lo,y
                                        STA ram_0000
                                        LDA tbl_A3BC_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_A3BC_lo:
- D 1 - I - 0x0023CC 00:A3BC: C6 A3     .byte < ofs_011_A3C6_00
- D 1 - I - 0x0023CE 00:A3BE: EF A3     .byte < ofs_011_A3EF_01
- D 1 - I - 0x0023D0 00:A3C0: 02 A4     .byte < ofs_011_A402_02
- D 1 - I - 0x0023D2 00:A3C2: 16 A4     .byte < ofs_011_A416_03
- D 1 - I - 0x0023D4 00:A3C4: 26 A4     .byte < ofs_011_A426_04
tbl_A3BC_hi:
- D 1 - I - 0x0023CC 00:A3BC: C6 A3     .byte > ofs_011_A3C6_00
- D 1 - I - 0x0023CE 00:A3BE: EF A3     .byte > ofs_011_A3EF_01
- D 1 - I - 0x0023D0 00:A3C0: 02 A4     .byte > ofs_011_A402_02
- D 1 - I - 0x0023D2 00:A3C2: 16 A4     .byte > ofs_011_A416_03
- D 1 - I - 0x0023D4 00:A3C4: 26 A4     .byte > ofs_011_A426_04


ofs_011_A3C6_00:
C - - J - - 0x0023D6 00:A3C6: A0 0F     LDY #$0F
C - - - - - 0x0023D8 00:A3C8: A9 00     LDA #$00
bra_A3CA_loop:
; 0070-007F
C - - - - - 0x0023DA 00:A3CA: 99 70 00  STA $70,Y
C - - - - - 0x0023DD 00:A3CD: 88        DEY
C - - - - - 0x0023DE 00:A3CE: 10 FA     BPL bra_A3CA_loop
C - - - - - 0x0023E0 00:A3D0: 20 C0 E7  JSR sub_0x01E7D0_выбор_банков_графики
C - - - - - 0x0023E3 00:A3D3: A9 18     LDA #con_chr_bank + $18
C - - - - - 0x0023E5 00:A3D5: 8D F1 07  STA ram_bg_bank_2
C - - - - - 0x0023E8 00:A3D8: A9 69     LDA #con_chr_bank + $69
C - - - - - 0x0023EA 00:A3DA: 8D F5 07  STA ram_spr_bank_4
C - - - - - 0x0023ED 00:A3DD: A9 03     LDA #con_irq_credits
C - - - - - 0x0023EF 00:A3DF: 85 27     STA ram_irq_handler_hi
C - - - - - 0x0023F1 00:A3E1: 20 03 A6  JSR sub_A603
C - - - - - 0x0023F4 00:A3E4: A9 01     LDA #con_mirroring_H
C - - - - - 0x0023F6 00:A3E6: 85 26     STA ram_mirroring
C - - - - - 0x0023F8 00:A3E8: A9 02     LDA #$02
loc_A3EA:
C D 1 - - - 0x0023FA 00:A3EA: 85 70     STA ram_0070
loc_A3EC:
C D 1 - - - 0x0023FC 00:A3EC: E6 61     INC ram_0061_конфиг_уровня
bra_A3EE_RTS:
C - - - - - 0x0023FE 00:A3EE: 60        RTS



ofs_011_A3EF_01:
C - - J - - 0x0023FF 00:A3EF: 20 03 A6  JSR sub_A603
C - - - - - 0x002402 00:A3F2: 20 6A A4  JSR sub_A46A
C - - - - - 0x002405 00:A3F5: C6 70     DEC ram_0070
C - - - - - 0x002407 00:A3F7: D0 F5     BNE bra_A3EE_RTS
C - - - - - 0x002409 00:A3F9: A9 00     LDA #$00
C - - - - - 0x00240B 00:A3FB: 85 71     STA ram_0071_тип_скролла
C - - - - - 0x00240D 00:A3FD: 85 72     STA ram_cam_spd_Y
C - - - - - 0x00240F 00:A3FF: 4C EC A3  JMP loc_A3EC



ofs_011_A402_02:
C - - J - - 0x002412 00:A402: 20 03 A6  JSR sub_A603
C - - - - - 0x002415 00:A405: 20 6A A4  JSR sub_A46A
C - - - - - 0x002418 00:A408: 20 38 A4  JSR sub_A438_helicopter_handler
C - - - - - 0x00241B 00:A40B: 20 95 A4  JSR sub_A495
C - - - - - 0x00241E 00:A40E: 90 05     BCC bra_A415_RTS
C - - - - - 0x002420 00:A410: A9 20     LDA #$20
C - - - - - 0x002422 00:A412: 4C EA A3  JMP loc_A3EA
bra_A415_RTS:
C - - - - - 0x002425 00:A415: 60        RTS



ofs_011_A416_03:
C - - J - - 0x002426 00:A416: 20 03 A6  JSR sub_A603
C - - - - - 0x002429 00:A419: 20 6A A4  JSR sub_A46A
C - - - - - 0x00242C 00:A41C: 20 38 A4  JSR sub_A438_helicopter_handler
C - - - - - 0x00242F 00:A41F: C6 70     DEC ram_0070
C - - - - - 0x002431 00:A421: D0 14     BNE bra_A437_RTS
C - - - - - 0x002433 00:A423: 4C EC A3  JMP loc_A3EC



ofs_011_A426_04:
C - - J - - 0x002436 00:A426: 20 03 A6  JSR sub_A603
C - - - - - 0x002439 00:A429: 20 6A A4  JSR sub_A46A
C - - - - - 0x00243C 00:A42C: 20 38 A4  JSR sub_A438_helicopter_handler
C - - - - - 0x00243F 00:A42F: A5 F1     LDA ram_нажатая_кнопка
C - - - - - 0x002441 00:A431: 29 10     AND #con_btn_Start
C - - - - - 0x002443 00:A433: F0 02     BEQ bra_A437_RTS
C - - - - - 0x002445 00:A435: E6 60     INC ram_0060_unk
bra_A437_RTS:
C - - - - - 0x002447 00:A437: 60        RTS



sub_A438_helicopter_handler:
; during credits
; leon опт
                                        LDY ram_состояние_объектов_для_обработчика
                                        LDA tbl_A43E_lo,y
                                        STA ram_0000
                                        LDA tbl_A43E_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_A43E_lo:
- D 1 - I - 0x00244E 00:A43E: 42 A4     .byte < ofs_012_A442_00
- D 1 - I - 0x002450 00:A440: 4B A4     .byte < ofs_012_A44B_01
tbl_A43E_hi:
- D 1 - I - 0x00244E 00:A43E: 42 A4     .byte > ofs_012_A442_00
- D 1 - I - 0x002450 00:A440: 4B A4     .byte > ofs_012_A44B_01


ofs_012_A442_00:
C - - J - - 0x002452 00:A442: A9 48     LDA #$48
C - - - - - 0x002454 00:A444: 8D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули
C - - - - - 0x002457 00:A447: EE 68 06  INC ram_состояние_объектов_для_обработчика
C - - - - - 0x00245A 00:A44A: 60        RTS



ofs_012_A44B_01:
C - - J - - 0x00245B 00:A44B: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x00245D 00:A44D: 4A        LSR
C - - - - - 0x00245E 00:A44E: A9 38     LDA #$38
C - - - - - 0x002460 00:A450: 90 02     BCC bra_A454
C - - - - - 0x002462 00:A452: A9 39     LDA #$39
bra_A454:
C - - - - - 0x002464 00:A454: 8D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули
C - - - - - 0x002467 00:A457: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x002469 00:A459: 4A        LSR
C - - - - - 0x00246A 00:A45A: 4A        LSR
C - - - - - 0x00246B 00:A45B: A9 BA     LDA #$BA
C - - - - - 0x00246D 00:A45D: 90 02     BCC bra_A461
C - - - - - 0x00246F 00:A45F: A9 BB     LDA #$BB
bra_A461:
C - - - - - 0x002471 00:A461: 8D 08 05  STA ram_кадр_объекта_или_пули
C - - - - - 0x002474 00:A464: A9 03     LDA #$03
C - - - - - 0x002476 00:A466: 8D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули
C - - - - - 0x002479 00:A469: 60        RTS



sub_A46A:
C - - - - - 0x00247A 00:A46A: E6 75     INC ram_0075
C - - - - - 0x00247C 00:A46C: A5 75     LDA ram_0075
C - - - - - 0x00247E 00:A46E: C9 04     CMP #$04
C - - - - - 0x002480 00:A470: 90 06     BCC bra_A478
C - - - - - 0x002482 00:A472: A9 00     LDA #$00
C - - - - - 0x002484 00:A474: 85 75     STA ram_0075
C - - - - - 0x002486 00:A476: E6 FD     INC ram_scroll_X
bra_A478:
C - - - - - 0x002488 00:A478: E6 76     INC ram_0076
C - - - - - 0x00248A 00:A47A: A5 76     LDA ram_0076
C - - - - - 0x00248C 00:A47C: C9 08     CMP #$08
C - - - - - 0x00248E 00:A47E: 90 06     BCC bra_A486
C - - - - - 0x002490 00:A480: A9 00     LDA #$00
C - - - - - 0x002492 00:A482: 85 76     STA ram_0076
C - - - - - 0x002494 00:A484: E6 73     INC ram_0073
bra_A486:
C - - - - - 0x002496 00:A486: E6 77     INC ram_0077
C - - - - - 0x002498 00:A488: A5 77     LDA ram_0077
C - - - - - 0x00249A 00:A48A: C9 16     CMP #$16
C - - - - - 0x00249C 00:A48C: 90 06     BCC bra_A494_RTS
C - - - - - 0x00249E 00:A48E: A9 00     LDA #$00
C - - - - - 0x0024A0 00:A490: 85 77     STA ram_0077
C - - - - - 0x0024A2 00:A492: E6 74     INC ram_0074_конфиг_уровня
bra_A494_RTS:
C - - - - - 0x0024A4 00:A494: 60        RTS



sub_A495:
C - - - - - 0x0024A5 00:A495: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x0024A7 00:A497: 29 03     AND #$03
C - - - - - 0x0024A9 00:A499: F0 03     BEQ bra_A49E
C - - - - - 0x0024AB 00:A49B: 4C 25 A5  JMP loc_A525
bra_A49E:
C - - - - - 0x0024AE 00:A49E: A5 F9     LDA ram_00F9
C - - - - - 0x0024B0 00:A4A0: 18        CLC
C - - - - - 0x0024B1 00:A4A1: 69 01     ADC #$01
C - - - - - 0x0024B3 00:A4A3: C9 F0     CMP #$F0
C - - - - - 0x0024B5 00:A4A5: 90 02     BCC bra_A4A9
C - - - - - 0x0024B7 00:A4A7: 69 0F     ADC #$0F
bra_A4A9:
C - - - - - 0x0024B9 00:A4A9: 85 F9     STA ram_00F9
C - - - - - 0x0024BB 00:A4AB: 29 07     AND #$07
C - - - - - 0x0024BD 00:A4AD: D0 76     BNE bra_A525
C - - - - - 0x0024BF 00:A4AF: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x0024C1 00:A4B1: A9 06     LDA #con_buf_mode_06
C - - - - - 0x0024C3 00:A4B3: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0024C6 00:A4B6: E8        INX
C - - - - - 0x0024C7 00:A4B7: A5 F9     LDA ram_00F9
C - - - - - 0x0024C9 00:A4B9: 18        CLC
C - - - - - 0x0024CA 00:A4BA: 69 60     ADC #$60
C - - - - - 0x0024CC 00:A4BC: B0 04     BCS bra_A4C2
C - - - - - 0x0024CE 00:A4BE: C9 F0     CMP #$F0
C - - - - - 0x0024D0 00:A4C0: 90 02     BCC bra_A4C4
bra_A4C2:
C - - - - - 0x0024D2 00:A4C2: 69 0F     ADC #$0F
bra_A4C4:
C - - - - - 0x0024D4 00:A4C4: 29 F8     AND #$F8
C - - - - - 0x0024D6 00:A4C6: 85 00     STA ram_0000
C - - - - - 0x0024D8 00:A4C8: A9 09     LDA #$09
C - - - - - 0x0024DA 00:A4CA: 06 00     ASL ram_0000
C - - - - - 0x0024DC 00:A4CC: 2A        ROL
C - - - - - 0x0024DD 00:A4CD: 06 00     ASL ram_0000
C - - - - - 0x0024DF 00:A4CF: 2A        ROL
C - - - - - 0x0024E0 00:A4D0: 9D 00 03  STA ram_nmt_buffer,X    ; ppu hi
C - - - - - 0x0024E3 00:A4D3: E8        INX
C - - - - - 0x0024E4 00:A4D4: A5 00     LDA ram_0000
C - - - - - 0x0024E6 00:A4D6: 18        CLC
C - - - - - 0x0024E7 00:A4D7: 69 08     ADC #$08
C - - - - - 0x0024E9 00:A4D9: 9D 00 03  STA ram_nmt_buffer,X    ; ppu lo
C - - - - - 0x0024EC 00:A4DC: E8        INX
C - - - - - 0x0024ED 00:A4DD: A9 10     LDA #$10
C - - - - - 0x0024EF 00:A4DF: 9D 00 03  STA ram_nmt_buffer,X    ; counter
C - - - - - 0x0024F2 00:A4E2: E8        INX
C - - - - - 0x0024F3 00:A4E3: A9 00     LDA #$00
C - - - - - 0x0024F5 00:A4E5: A0 10     LDY #$10
bra_A4E7_loop:
C - - - - - 0x0024F7 00:A4E7: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0024FA 00:A4EA: E8        INX
C - - - - - 0x0024FB 00:A4EB: 88        DEY
C - - - - - 0x0024FC 00:A4EC: D0 F9     BNE bra_A4E7_loop
C - - - - - 0x0024FE 00:A4EE: A9 FF     LDA #$FF
C - - - - - 0x002500 00:A4F0: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x002503 00:A4F3: E8        INX
C - - - - - 0x002504 00:A4F4: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x002506 00:A4F6: E6 72     INC ram_cam_spd_Y
C - - - - - 0x002508 00:A4F8: A4 71     LDY ram_0071_тип_скролла
C - - - - - 0x00250A 00:A4FA: B9 3B A5  LDA tbl_A53B_credits,Y
C - - - - - 0x00250D 00:A4FD: C5 72     CMP ram_cam_spd_Y
C - - - - - 0x00250F 00:A4FF: D0 24     BNE bra_A525
C - - - - - 0x002511 00:A501: C8        INY
C - - - - - 0x002512 00:A502: B9 3B A5  LDA tbl_A53B_credits,Y
C - - - - - 0x002515 00:A505: 30 20     BMI bra_A527_FE_FF
C - - - - - 0x002517 00:A507: 8A        TXA
C - - - - - 0x002518 00:A508: 38        SEC
C - - - - - 0x002519 00:A509: E9 11     SBC #$11
C - - - - - 0x00251B 00:A50B: 18        CLC
C - - - - - 0x00251C 00:A50C: 79 3B A5  ADC tbl_A53B_credits,Y
C - - - - - 0x00251F 00:A50F: AA        TAX
C - - - - - 0x002520 00:A510: C8        INY
C - - - - - 0x002521 00:A511: B9 3B A5  LDA tbl_A53B_credits,Y
C - - - - - 0x002524 00:A514: 85 00     STA ram_0000
C - - - - - 0x002526 00:A516: C8        INY
bra_A517_loop:
C - - - - - 0x002527 00:A517: B9 3B A5  LDA tbl_A53B_credits,Y
C - - - - - 0x00252A 00:A51A: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x00252D 00:A51D: E8        INX
C - - - - - 0x00252E 00:A51E: C8        INY
C - - - - - 0x00252F 00:A51F: C6 00     DEC ram_0000
C - - - - - 0x002531 00:A521: D0 F4     BNE bra_A517_loop
C - - - - - 0x002533 00:A523: 84 71     STY ram_0071_тип_скролла
bra_A525:
loc_A525:
C D 1 - - - 0x002535 00:A525: 18        CLC
C - - - - - 0x002536 00:A526: 60        RTS
bra_A527_FE_FF:
C - - - - - 0x002537 00:A527: C9 FE     CMP #$FE
C - - - - - 0x002539 00:A529: D0 0E     BNE bra_A539_FF
; FE
C - - - - - 0x00253B 00:A52B: A9 10     LDA #$10
C - - - - - 0x00253D 00:A52D: 8D E1 03  STA ram_pal_buffer + $01
C - - - - - 0x002540 00:A530: 20 B8 F7  JSR sub_0x01F7C8
C - - - - - 0x002543 00:A533: E6 71     INC ram_0071_тип_скролла
C - - - - - 0x002545 00:A535: E6 71     INC ram_0071_тип_скролла
C - - - - - 0x002547 00:A537: 18        CLC
C - - - - - 0x002548 00:A538: 60        RTS
bra_A539_FF:
C - - - - - 0x002549 00:A539: 38        SEC
C - - - - - 0x00254A 00:A53A: 60        RTS



tbl_A53B_credits:
- D 1 - - - 0x00254B 00:A53B: 02        .byte $02   ; 
- D 1 - - - 0x00254C 00:A53C: 05        .byte $05   ; 

- D 1 - - - 0x00254D 00:A53D: 05        .byte $05   ; counter
- D 1 - - - 0x00254E 00:A53E: 1D        .byte $1D, $1E, $0B, $10, $10   ; "STAFF"

- D 1 - - - 0x002553 00:A543: 0A        .byte $0A   ; 
- D 1 - - - 0x002554 00:A544: 03        .byte $03   ; 

- D 1 - - - 0x002555 00:A545: 0A        .byte $0A   ; counter
- D 1 - - - 0x002556 00:A546: 1A        .byte $1A, $1C, $19, $11, $1C, $0B, $17, $17, $0F, $1C   ; "PROGRAMMER"

- D 1 - - - 0x002560 00:A550: 0E        .byte $0E   ; 
- D 1 - - - 0x002561 00:A551: 03        .byte $03   ; 

- D 1 - - - 0x002562 00:A552: 09        .byte $09   ; counter
- D 1 - - - 0x002563 00:A553: 1D        .byte $1D, $26, $1F, $17, $0F, $24, $0B, $15, $13   ; "S.UMEZAKI"

- D 1 - - - 0x00256C 00:A55C: 16        .byte $16   ; 
- D 1 - - - 0x00256D 00:A55D: 01        .byte $01   ; 

- D 1 - - - 0x00256E 00:A55E: 0E        .byte $0E   ; counter
- D 1 - - - 0x00256F 00:A55F: 11        .byte $11, $1C, $0B, $1A, $12, $13, $0D, $00, $0E, $0F, $1D, $13, $11, $18   ; "GRAPHIC DESIGN"

- D 1 - - - 0x00257D 00:A56D: 1A        .byte $1A   ; 
- D 1 - - - 0x00257E 00:A56E: 04        .byte $04   ; 

- D 1 - - - 0x00257F 00:A56F: 08        .byte $08   ; counter
- D 1 - - - 0x002580 00:A570: 1D        .byte $1D, $26, $17, $1F, $1C, $0B, $15, $13   ; "S.MURAKI"

- D 1 - - - 0x002588 00:A578: 22        .byte $22   ; 
- D 1 - - - 0x002589 00:A579: 02        .byte $02   ; 

- D 1 - - - 0x00258A 00:A57A: 0C        .byte $0C   ; counter
- D 1 - - - 0x00258B 00:A57B: 1D        .byte $1D, $19, $1F, $18, $0E, $00, $0E, $0F, $1D, $13, $11, $18   ; "SOUND DESIGN"

- D 1 - - - 0x002597 00:A587: 26        .byte $26   ; 
- D 1 - - - 0x002598 00:A588: 03        .byte $03   ; 

- D 1 - - - 0x002599 00:A589: 09        .byte $09   ; counter
- D 1 - - - 0x00259A 00:A58A: 12        .byte $12, $26, $17, $0B, $0F, $24, $0B, $21, $0B   ; "H.MAEZAWA"

- D 1 - - - 0x0025A3 00:A593: 2E        .byte $2E   ; 
- D 1 - - - 0x0025A4 00:A594: 01        .byte $01   ; 

- D 1 - - - 0x0025A5 00:A595: 0E        .byte $0E   ; counter
- D 1 - - - 0x0025A6 00:A596: 1D        .byte $1D, $1A, $0F, $0D, $13, $0B, $16, $00, $1E, $12, $0B, $18, $15, $1D   ; "SPECIAL THANKS"

- D 1 - - - 0x0025B4 00:A5A4: 32        .byte $32   ; 
- D 1 - - - 0x0025B5 00:A5A5: 03        .byte $03   ; 

- D 1 - - - 0x0025B6 00:A5A6: 0A        .byte $0A   ; counter
- D 1 - - - 0x0025B7 00:A5A7: 15        .byte $15, $26, $1D, $12, $13, $17, $19, $13, $0E, $0F   ; "K.SHIMOIDE"

- D 1 - - - 0x0025C1 00:A5B1: 35        .byte $35   ; 
- D 1 - - - 0x0025C2 00:A5B2: 02        .byte $02   ; 

- D 1 - - - 0x0025C3 00:A5B3: 0C        .byte $0C   ; counter
- D 1 - - - 0x0025C4 00:A5B4: 1D        .byte $1D, $1F, $1A, $0F, $1C, $00, $0D, $00, $1E, $0F, $0B, $17   ; "SUPER C TEAM"

- D 1 - - - 0x0025D0 00:A5C0: 3D        .byte $3D   ; 
- D 1 - - - 0x0025D1 00:A5C1: 02        .byte $02   ; 

- D 1 - - - 0x0025D2 00:A5C2: 0B        .byte $0B   ; counter
- D 1 - - - 0x0025D3 00:A5C3: 0E        .byte $0E, $13, $1C, $0F, $0D, $1E, $0F, $0E, $00, $0C, $23   ; "DIRECTED BY"

- D 1 - - - 0x0025DE 00:A5CE: 41        .byte $41   ; 
- D 1 - - - 0x0025DF 00:A5CF: 02        .byte $02   ; 

- D 1 - - - 0x0025E0 00:A5D0: 0C        .byte $0C   ; counter
- D 1 - - - 0x0025E1 00:A5D1: 1F        .byte $1F, $17, $0F, $0D, $12, $0B, $18, $00, $1E, $0F, $0B, $17   ; "UMECHAN TEAM"

- D 1 - - - 0x0025ED 00:A5DD: 50        .byte $50   ; 

- D 1 - - - 0x0025EE 00:A5DE: FE        .byte $FE   ; FE

- D 1 - - - 0x0025EF 00:A5DF: 51        .byte $51   ; 
- D 1 - - - 0x0025F0 00:A5E0: 03        .byte $03   ; 

- D 1 - - - 0x0025F1 00:A5E1: 0B        .byte $0B   ; counter
- D 1 - - - 0x0025F2 00:A5E2: 2E        .byte $2E, $2F, $35, $36, $37, $38, $39, $3A, $3B, $3C, $3D   ; konami logo (upper part)

- D 1 - - - 0x0025FD 00:A5ED: 52        .byte $52   ; 
- D 1 - - - 0x0025FE 00:A5EE: 02        .byte $02   ; 

- D 1 - - - 0x0025FF 00:A5EF: 0C        .byte $0C   ; counter
- D 1 - - - 0x002600 00:A5F0: 30        .byte $30, $31, $32, $3E, $3F, $40, $41, $42, $43, $44, $45, $46   ; konami logo (middle part)

- D 1 - - - 0x00260C 00:A5FC: 53        .byte $53   ; 
- D 1 - - - 0x00260D 00:A5FD: 02        .byte $02   ; 

- D 1 - - - 0x00260E 00:A5FE: 02        .byte $02   ; counter
- D 1 - - - 0x00260F 00:A5FF: 33        .byte $33, $34   ; konami logo (bottom part)

- D 1 - - - 0x002611 00:A601: 59        .byte $59   ; 

- D 1 - - - 0x002612 00:A602: FF        .byte $FF   ; end token



sub_A603:
C - - - - - 0x002613 00:A603: A9 00     LDA #$00
C - - - - - 0x002615 00:A605: 85 FA     STA ram_00FA
C - - - - - 0x002617 00:A607: A9 38     LDA #$38
C - - - - - 0x002619 00:A609: 85 45     STA ram_номер_сканлинии
C - - - - - 0x00261B 00:A60B: A5 F9     LDA ram_00F9
C - - - - - 0x00261D 00:A60D: 29 07     AND #$07
C - - - - - 0x00261F 00:A60F: 85 47     STA ram_0047
C - - - - - 0x002621 00:A611: A9 27     LDA #$27
C - - - - - 0x002623 00:A613: 38        SEC
C - - - - - 0x002624 00:A614: E5 47     SBC ram_0047
C - - - - - 0x002626 00:A616: 85 46     STA ram_0046
C - - - - - 0x002628 00:A618: E6 47     INC ram_0047
C - - - - - 0x00262A 00:A61A: E6 47     INC ram_0047
C - - - - - 0x00262C 00:A61C: E6 47     INC ram_0047
C - - - - - 0x00262E 00:A61E: A0 0B     LDY #$0B
C - - - - - 0x002630 00:A620: 84 4B     STY ram_004B
C - - - - - 0x002632 00:A622: A5 F9     LDA ram_00F9
C - - - - - 0x002634 00:A624: 29 F8     AND #$F8
C - - - - - 0x002636 00:A626: 0A        ASL
C - - - - - 0x002637 00:A627: 26 4B     ROL ram_004B
C - - - - - 0x002639 00:A629: 0A        ASL
C - - - - - 0x00263A 00:A62A: 26 4B     ROL ram_004B
C - - - - - 0x00263C 00:A62C: 85 4A     STA ram_004A
C - - - - - 0x00263E 00:A62E: 60        RTS











; bzk this byte must be placed at 8000
    .byte con_prg_bank + $28   ; 
















.out .sprintf("Free bytes in bank 28: %Xh [%d]", ($BFFF - *), ($BFFF - *))

.segment "BANK_28b"
    .byte con_prg_bank + $29   ; 
