.segment "BANK_2E"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000 ; for listing file
; 0x01C010-0x01E00F

; БОССЫ 4-6 уровень
; автоспавн шипов на 6м уровне

.export _off001_0x015602_32_босс_4_лазерная_установка
.export _off001_0x0152DB_33_босс_4_лазерный_ствол
.export _off001_0x01541F_34_босс_4_лазерная_пуля

.export _off001_0x01043B_44_босс_5_летающий_аппарат_череп
.export _off001_0x01030C_45_босс_5_ползающий_черепок
.export _off001_0x0103B9_26_босс_5_летающие_шипы

.export _off001_0x0111B7_4B_красный_шип_автоспавн

.export _off001_0x0112FC_4C_босс_6_шип_с_автонаводкой
.export _off001_0x0113B2_5A_босс_6_дыра_автоспавнер_шипов
.export _off001_0x011838_4F_босс_6_фаза_1_пасть
.export _off001_0x011424_50_босс_6_фаза_2_череп
.export _off001_0x011B42_51_босс_6_фаза_2_змея
.export _off001_0x011802_52_босс_6_фаза_2_пуля_с_автонаводкой

; bzk this byte must be placed at 8000
    .byte con_prg_bank + $2E   ; 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x015602_32_босс_4_лазерная_установка:
- D 0 - I - 0x015602 05:95F2: 06 96     .word ofs_038_32_9606_01_активация_объекта ; 
- D 0 - I - 0x015604 05:95F4: 0F 96     .word ofs_038_32_960F_02 ; 
- D 0 - I - 0x015606 05:95F6: 25 96     .word ofs_038_32_9625_03 ; 
- D 0 - I - 0x015608 05:95F8: 8F 96     .word ofs_038_32_968F_04 ; 
- D 0 - I - 0x01560A 05:95FA: BE 96     .word ofs_038_32_96BE_05 ; 
- D 0 - I - 0x01560C 05:95FC: B8 A3     .word ofs_038_32_0x0063C8_06_установить_статус_уничтожения_босса_и_убить_все_объекты ; 
- D 0 - I - 0x01560E 05:95FE: D8 A3     .word ofs_038_32_0x0063E8_07_большие_взрывы_для_боссов ; 
- D 0 - I - 0x015610 05:9600: A2 A2     .word ofs_038_32_0x0062B2_08_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x015612 05:9602: F6 A2     .word ofs_038_32_0x006306_09 ; 
- D 0 - I - 0x015614 05:9604: CC 96     .word ofs_038_32_96CC_0A ; 

; ******************************************************************************************************************

ofs_038_32_9606_01_активация_объекта:
C - - J - - 0x015616 05:9606: A9 10     LDA #$10
C - - - - - 0x015618 05:9608: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x01561B 05:960B: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_960E_RTS:
C - - - - - 0x01561E 05:960E: 60        RTS

; ******************************************************************************************************************

ofs_038_32_960F_02:
C - - J - - 0x01561F 05:960F: A5 7E     LDA ram_007E
C - - - - - 0x015621 05:9611: 05 60     ORA ram_0060_unk
C - - - - - 0x015623 05:9613: 05 70     ORA ram_0070
C - - - - - 0x015625 05:9615: 05 80     ORA ram_номер_анимации_логотипа
C - - - - - 0x015627 05:9617: D0 F5     BNE bra_960E_RTS
C - - - - - 0x015629 05:9619: A9 C8     LDA #$C8
C - - - - - 0x01562B 05:961B: 85 98     STA ram_0098
C - - - - - 0x01562D 05:961D: A9 31     LDA #con_sound_31   ; музыка 4й босс
C - - - - - 0x01562F 05:961F: 20 DE FD  JSR sub_0x01FDEE_play_music
C - - - - - 0x015632 05:9622: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_32_9625_03:
C - - J - - 0x015635 05:9625: A5 98     LDA ram_0098
C - - - - - 0x015637 05:9627: D0 E5     BNE bra_960E_RTS
C - - - - - 0x015639 05:9629: A9 C0     LDA #$C0
C - - - - - 0x01563B 05:962B: 85 7D     STA ram_007D_тип_скролла
C - - - - - 0x01563D 05:962D: A9 7C     LDA #$7C
C - - - - - 0x01563F 05:962F: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x015642 05:9632: A9 38     LDA #$38
C - - - - - 0x015644 05:9634: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x015647 05:9637: A9 00     LDA #$00
C - - - - - 0x015649 05:9639: 9D 8E 07  STA ram_позиция_объектов_Y_старш,X
C - - - - - 0x01564C 05:963C: A9 01     LDA #$01
C - - - - - 0x01564E 05:963E: 9D 9C 07  STA ram_позиция_объектов_X_старш,X
C - - - - - 0x015651 05:9641: 20 7F FC  JSR sub_0x01FC8F_copy_reg_values
C - - - - - 0x015654 05:9644: A9 05     LDA #con_irq_area_4_boss
C - - - - - 0x015656 05:9646: 85 27     STA ram_irq_handler_hi
C - - - - - 0x015658 05:9648: A9 18     LDA #$18
C - - - - - 0x01565A 05:964A: 85 45     STA ram_номер_сканлинии
C - - - - - 0x01565C 05:964C: A9 01     LDA #$01
C - - - - - 0x01565E 05:964E: 85 46     STA ram_0046
C - - - - - 0x015660 05:9650: A9 AB     LDA #$AB
C - - - - - 0x015662 05:9652: 85 47     STA ram_0047
C - - - - - 0x015664 05:9654: A9 00     LDA #$00
C - - - - - 0x015666 05:9656: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x015669 05:9659: A0 08     LDY #$08
bra_965B_loop:
C - - - - - 0x01566B 05:965B: 84 08     STY ram_0008
C - - - - - 0x01566D 05:965D: A9 43     LDY #con_obj_id_33  ; ствол лазера
C - - - - - 0x015670 05:9660: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x015673 05:9663: 90 13     BCC bra_9678
C - - - - - 0x015675 05:9665: FE 64 07  INC ram_0764_obj,X
C - - - - - 0x015678 05:9668: A4 11     LDY ram_0011
C - - - - - 0x01567A 05:966A: A5 08     LDA ram_0008
C - - - - - 0x01567C 05:966C: 99 1E 07  STA ram_флаги_объектов,Y
C - - - - - 0x01567F 05:966F: 8A        TXA
C - - - - - 0x015680 05:9670: 99 80 07  STA ram_0780_obj,Y
C - - - - - 0x015683 05:9673: A4 08     LDY ram_0008
C - - - - - 0x015685 05:9675: 88        DEY
C - - - - - 0x015686 05:9676: 10 E3     BPL bra_965B_loop
bra_9678:
C - - - - - 0x015688 05:9678: A9 FF     LDA #$FF
C - - - - - 0x01568A 05:967A: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01568D 05:967D: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x015690 05:9680: A9 02     LDA #$02
C - - - - - 0x015692 05:9682: 85 61     STA ram_0061_конфиг_уровня
C - - - - - 0x015694 05:9684: 20 90 F1  JSR sub_0x01F1A0
C - - - - - 0x015697 05:9687: A9 08     LDA #$08
C - - - - - 0x015699 05:9689: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x01569C 05:968C: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_32_968F_04:
C - - J - - 0x01569F 05:968F: A5 60     LDA ram_0060_unk
C - - - - - 0x0156A1 05:9691: 05 70     ORA ram_0070
C - - - - - 0x0156A3 05:9693: D0 09     BNE bra_969E_RTS
C - - - - - 0x0156A5 05:9695: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x0156A8 05:9698: F0 05     BEQ bra_969F
C - - - - - 0x0156AA 05:969A: A9 00     LDA #$00
C - - - - - 0x0156AC 05:969C: 85 6B     STA ram_006B
bra_969E_RTS:
C - - - - - 0x0156AE 05:969E: 60        RTS
bra_969F:
C - - - - - 0x0156AF 05:969F: 20 10 BD  JSR sub_0x007D20_очистить_0400_047F
C - - - - - 0x0156B2 05:96A2: A9 00     LDA #$00
C - - - - - 0x0156B4 05:96A4: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0156B7 05:96A7: A9 09     LDA #$09
C - - - - - 0x0156B9 05:96A9: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0156BC 05:96AC: A9 40     LDA #$40
C - - - - - 0x0156BE 05:96AE: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0156C1 05:96B1: A9 00     LDA #< $F900
C - - - - - 0x0156C3 05:96B3: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0156C6 05:96B6: A9 F9     LDA #> $F900
C - - - - - 0x0156C8 05:96B8: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x0156CB 05:96BB: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_32_96BE_05:
C - - J - - 0x0156CE 05:96BE: 20 FE 96  JSR sub_96FE
C - - - - - 0x0156D1 05:96C1: 20 00 98  JSR sub_9800
C - - - - - 0x0156D4 05:96C4: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x0156D7 05:96C7: D0 D5     BNE bra_969E_RTS
C - - - - - 0x0156D9 05:96C9: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_32_96CC_0A:
                                        INC ram_002B
C - - - - - 0x0156DF 05:96CF: 20 88 F1  JSR sub_0x01F198
C - - - - - 0x0156E2 05:96D2: E6 65     INC ram_0065
C - - - - - 0x0156E4 05:96D4: A9 08     LDA #con_chr_bank + $08
C - - - - - 0x0156E6 05:96D6: 8D F0 07  STA ram_bg_bank_1
C - - - - - 0x0156E9 05:96D9: A9 0A     LDA #con_chr_bank + $0A
C - - - - - 0x0156EB 05:96DB: 8D F1 07  STA ram_bg_bank_2
C - - - - - 0x0156EE 05:96DE: 4C 37 A3  JMP loc_0x006347_удалить_объект_босс

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_96E1:
C - - - - - 0x0156F1 05:96E1: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x0156F4 05:96E4: 29 0E     AND #$0E
C - - - - - 0x0156F6 05:96E6: A8        TAY
C - - - - - 0x0156F7 05:96E7: B9 F4 96  LDA tbl_96F4_скороcть_X,Y
C - - - - - 0x0156FA 05:96EA: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0156FD 05:96ED: B9 F5 96  LDA tbl_96F4_скороcть_X + $01,Y
C - - - - - 0x015700 05:96F0: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x015703 05:96F3: 60        RTS

tbl_96F4_скороcть_X:
- D 0 - - - 0x015704 05:96F4: C0 00     .word $00C0 ; 00 
- D 0 - - - 0x015706 05:96F6: A0 00     .word $00A0 ; 02 
- D 0 - - - 0x015708 05:96F8: 80 00     .word $0080 ; 04 
- D 0 - - - 0x01570A 05:96FA: 60 00     .word $0060 ; 06 
- D 0 - - - 0x01570C 05:96FC: 40 00     .word $0040 ; 08 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_96FE:
                                        LDY ram_скролл_объекта_Y,X
                                        LDA tbl_9704_lo,y
                                        STA ram_0000
                                        LDA tbl_9705_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_9704_lo:
- D 0 - I - 0x015714 05:9704: 0E 97     .byte < ofs_031_970E_00
- D 0 - I - 0x015716 05:9706: 25 97     .byte < ofs_031_9725_01
- D 0 - I - 0x015718 05:9708: 31 97     .byte < ofs_031_9731_02
- D 0 - I - 0x01571A 05:970A: 25 97     .byte < ofs_031_9725_03
- D 0 - I - 0x01571C 05:970C: 62 97     .byte < ofs_031_9762_04
tbl_9705_hi:
- D 0 - I - 0x015714 05:9704: 0E 97     .byte > ofs_031_970E_00
- D 0 - I - 0x015716 05:9706: 25 97     .byte > ofs_031_9725_01
- D 0 - I - 0x015718 05:9708: 31 97     .byte > ofs_031_9731_02
- D 0 - I - 0x01571A 05:970A: 25 97     .byte > ofs_031_9725_03
- D 0 - I - 0x01571C 05:970C: 62 97     .byte > ofs_031_9762_04

; _________________________________________________________________________________________________________________

ofs_031_970E_00:
C - - J - - 0x01571E 05:970E: BD BC 06  LDA ram_скорость_объектов_x_младш,X
C - - - - - 0x015721 05:9711: 18        CLC
C - - - - - 0x015722 05:9712: 69 16     ADC #< $0016
C - - - - - 0x015724 05:9714: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x015727 05:9717: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x01572A 05:971A: 69 00     ADC #> $0016
C - - - - - 0x01572C 05:971C: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x01572F 05:971F: 30 0F     BMI bra_9730_RTS
C - - - - - 0x015731 05:9721: A9 08     LDA #$08
C - - - - - 0x015733 05:9723: D0 36     BNE bra_975B    ; jmp

; _________________________________________________________________________________________________________________

ofs_031_9725_01:
ofs_031_9725_03:
C - - J - - 0x015735 05:9725: 20 C7 A7  JSR sub_0x0067D7_очистить_скорость_X_Y
C - - - - - 0x015738 05:9728: 20 B7 97  JSR sub_97B7
C - - - - - 0x01573B 05:972B: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x01573E 05:972E: F0 2E     BEQ bra_975E
bra_9730_RTS:
C - - - - - 0x015740 05:9730: 60        RTS

; _________________________________________________________________________________________________________________

ofs_031_9731_02:
C - - J - - 0x015741 05:9731: 20 B7 97  JSR sub_97B7
C - - - - - 0x015744 05:9734: 20 E1 96  JSR sub_96E1
C - - - - - 0x015747 05:9737: A0 00     LDY #$00
C - - - - - 0x015749 05:9739: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01574C 05:973C: D0 0B     BNE bra_9749
C - - - - - 0x01574E 05:973E: BD 02 07  LDA ram_счетчик_анимации_объектов,X
bra_9741_loop:
C - - - - - 0x015751 05:9741: C8        INY
C - - - - - 0x015752 05:9742: C0 08     CPY #$08
C - - - - - 0x015754 05:9744: B0 03     BCS bra_9749
C - - - - - 0x015756 05:9746: 4A        LSR
C - - - - - 0x015757 05:9747: 90 F8     BCC bra_9741_loop
bra_9749:
C - - - - - 0x015759 05:9749: BD 9C 07  LDA ram_позиция_объектов_X_старш,X
C - - - - - 0x01575C 05:974C: D9 93 97  CMP tbl_9793_позиция_объекта_X,Y
C - - - - - 0x01575F 05:974F: D0 DF     BNE bra_9730_RTS
C - - - - - 0x015761 05:9751: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x015764 05:9754: D9 9C 97  CMP tbl_979C_позиция_спрайта_объекта_X,Y
C - - - - - 0x015767 05:9757: 90 D7     BCC bra_9730_RTS
C - - - - - 0x015769 05:9759: A9 30     LDA #$30
bra_975B:
C - - - - - 0x01576B 05:975B: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_975E:
C - - - - - 0x01576E 05:975E: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x015771 05:9761: 60        RTS

tbl_9793_позиция_объекта_X:
- D 0 - - - 0x0157A3 05:9793: 00        .byte $00   ; 00 
- D 0 - - - 0x0157A4 05:9794: 00        .byte $00   ; 01 
- D 0 - - - 0x0157A5 05:9795: 00        .byte $00   ; 02 
- D 0 - - - 0x0157A6 05:9796: 00        .byte $00   ; 03 
- - - - - - 0x0157A7 05:9797: 00        .byte $00   ; 04 
- - - - - - 0x0157A8 05:9798: 01        .byte $01   ; 05 
- - - - - - 0x0157A9 05:9799: 01        .byte $01   ; 06 
- - - - - - 0x0157AA 05:979A: 01        .byte $01   ; 07 
- D 0 - - - 0x0157AB 05:979B: 01        .byte $01   ; 08 

tbl_979C_позиция_спрайта_объекта_X:
- D 0 - - - 0x0157AC 05:979C: B0        .byte $B0   ; 00 
- D 0 - - - 0x0157AD 05:979D: C0        .byte $C0   ; 01 
- - - - - - 0x0157AE 05:979E: D0        .byte $D0   ; 02 
- D 0 - - - 0x0157AF 05:979F: E0        .byte $E0   ; 03 
- - - - - - 0x0157B0 05:97A0: F0        .byte $F0   ; 04 
- - - - - - 0x0157B1 05:97A1: 00        .byte $00   ; 05 
- - - - - - 0x0157B2 05:97A2: 10        .byte $10   ; 06 
- - - - - - 0x0157B3 05:97A3: 20        .byte $20   ; 07 
- D 0 - - - 0x0157B4 05:97A4: 30        .byte $30   ; 08 

; _________________________________________________________________________________________________________________

ofs_031_9762_04:
C - - J - - 0x015772 05:9762: 20 B7 97  JSR sub_97B7
C - - - - - 0x015775 05:9765: 20 E1 96  JSR sub_96E1
C - - - - - 0x015778 05:9768: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
C - - - - - 0x01577B 05:976B: A0 FF     LDY #$FF
C - - - - - 0x01577D 05:976D: BD 02 07  LDA ram_счетчик_анимации_объектов,X
bra_9770_loop:
C - - - - - 0x015780 05:9770: C8        INY
C - - - - - 0x015781 05:9771: C0 08     CPY #$08
C - - - - - 0x015783 05:9773: B0 03     BCS bra_9778
C - - - - - 0x015785 05:9775: 0A        ASL
C - - - - - 0x015786 05:9776: 90 F8     BCC bra_9770_loop
bra_9778:
C - - - - - 0x015788 05:9778: BD 9C 07  LDA ram_позиция_объектов_X_старш,X
C - - - - - 0x01578B 05:977B: D9 A5 97  CMP tbl_97A5_позиция_объекта_X,Y
C - - - - - 0x01578E 05:977E: D0 B0     BNE bra_9730_RTS
C - - - - - 0x015790 05:9780: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x015793 05:9783: D9 AE 97  CMP tbl_97AE_позиция_спрайта_объекта_X,Y
C - - - - - 0x015796 05:9786: B0 A8     BCS bra_9730_RTS
C - - - - - 0x015798 05:9788: A9 30     LDA #$30
C - - - - - 0x01579A 05:978A: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x01579D 05:978D: A9 01     LDA #$01
C - - - - - 0x01579F 05:978F: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0157A2 05:9792: 60        RTS

tbl_97A5_позиция_объекта_X:
- D 0 - - - 0x0157B5 05:97A5: 00        .byte $00   ; 00 
- - - - - - 0x0157B6 05:97A6: 00        .byte $00   ; 01 
- - - - - - 0x0157B7 05:97A7: 00        .byte $00   ; 02 
- D 0 - - - 0x0157B8 05:97A8: 00        .byte $00   ; 03 
- D 0 - - - 0x0157B9 05:97A9: 00        .byte $00   ; 04 
- D 0 - - - 0x0157BA 05:97AA: FF        .byte $FF   ; 05 
- D 0 - - - 0x0157BB 05:97AB: FF        .byte $FF   ; 06 
- D 0 - - - 0x0157BC 05:97AC: FF        .byte $FF   ; 07 
- D 0 - - - 0x0157BD 05:97AD: FF        .byte $FF   ; 08 

tbl_97AE_позиция_спрайта_объекта_X:
- D 0 - - - 0x0157BE 05:97AE: 50        .byte $50   ; 00 
- - - - - - 0x0157BF 05:97AF: 40        .byte $40   ; 01 
- - - - - - 0x0157C0 05:97B0: 30        .byte $30   ; 02 
- D 0 - - - 0x0157C1 05:97B1: 20        .byte $20   ; 03 
- D 0 - - - 0x0157C2 05:97B2: 10        .byte $10   ; 04 
- - - - - - 0x0157C3 05:97B3: FF        .byte $FF   ; 05 
- D 0 - - - 0x0157C4 05:97B4: F0        .byte $F0   ; 06 
- D 0 - - - 0x0157C5 05:97B5: E0        .byte $E0   ; 07 
- - - - - - 0x0157C6 05:97B6: D0        .byte $D0   ; 08 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_97B7:
C - - - - - 0x0157C7 05:97B7: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x0157CA 05:97BA: D0 43     BNE bra_97FF_RTS
C - - - - - 0x0157CC 05:97BC: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x0157CF 05:97BF: C9 FF     CMP #$FF
C - - - - - 0x0157D1 05:97C1: F0 02     BEQ bra_97C5
C - - - - - 0x0157D3 05:97C3: 29 7F     AND #$7F
bra_97C5:
C - - - - - 0x0157D5 05:97C5: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0157D8 05:97C8: A9 14     LDA #$14
C - - - - - 0x0157DA 05:97CA: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x0157DD 05:97CD: C0 06     CPY #$06
C - - - - - 0x0157DF 05:97CF: B0 02     BCS bra_97D3
C - - - - - 0x0157E1 05:97D1: A9 10     LDA #$10
bra_97D3:
C - - - - - 0x0157E3 05:97D3: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0157E6 05:97D6: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0157E9 05:97D9: 4A        LSR
C - - - - - 0x0157EA 05:97DA: A9 FF     LDA #$FF
C - - - - - 0x0157EC 05:97DC: 90 02     BCC bra_97E0
C - - - - - 0x0157EE 05:97DE: A9 01     LDA #$01
bra_97E0:
C - - - - - 0x0157F0 05:97E0: 18        CLC
C - - - - - 0x0157F1 05:97E1: 7D 72 07  ADC ram_0772_obj,X
C - - - - - 0x0157F4 05:97E4: C9 09     CMP #$09
C - - - - - 0x0157F6 05:97E6: 90 12     BCC bra_97FA
C - - - - - 0x0157F8 05:97E8: A8        TAY
C - - - - - 0x0157F9 05:97E9: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0157FC 05:97EC: 49 01     EOR #$01
C - - - - - 0x0157FE 05:97EE: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x015801 05:97F1: A9 30     LDA #$30
C - - - - - 0x015803 05:97F3: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x015806 05:97F6: 98        TYA
C - - - - - 0x015807 05:97F7: 4C FC 97  JMP loc_97FC
bra_97FA:
C - - - - - 0x01580A 05:97FA: 09 80     ORA #$80
loc_97FC:
C D 0 - - - 0x01580C 05:97FC: 9D 72 07  STA ram_0772_obj,X
bra_97FF_RTS:
C - - - - - 0x01580F 05:97FF: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9800:
C - - - - - 0x015810 05:9800: 20 5D A7  JSR sub_0x00676D
C - - - - - 0x015813 05:9803: A9 7C     LDA #$7C
C - - - - - 0x015815 05:9805: 38        SEC
C - - - - - 0x015816 05:9806: FD 3C 05  SBC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x015819 05:9809: 85 FA     STA ram_00FA
C - - - - - 0x01581B 05:980B: 2A        ROL
C - - - - - 0x01581C 05:980C: 5D 9C 07  EOR ram_позиция_объектов_X_старш,X
C - - - - - 0x01581F 05:980F: 4A        LSR
C - - - - - 0x015820 05:9810: A9 A8     LDA #$A8
C - - - - - 0x015822 05:9812: B0 02     BCS bra_9816
C - - - - - 0x015824 05:9814: A9 A9     LDA #$A9
bra_9816:
C - - - - - 0x015826 05:9816: 85 FB     STA ram_00FB
C - - - - - 0x015828 05:9818: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0152DB_33_босс_4_лазерный_ствол:
- D 0 - I - 0x0152DB 05:92CB: DB 92     .word ofs_038_33_92DB_01_активация_объекта ; 
- D 0 - I - 0x0152DD 05:92CD: EA 92     .word ofs_038_33_92EA_02 ; 
- D 0 - I - 0x0152DF 05:92CF: 09 93     .word ofs_038_33_9309_03 ; 
- D 0 - I - 0x0152E1 05:92D1: 33 93     .word ofs_038_33_9333_04 ; 
- D 0 - I - 0x0152E3 05:92D3: 44 93     .word ofs_038_33_9344_05 ; 
- D 0 - I - 0x0152E5 05:92D5: 51 93     .word ofs_038_33_9351_06 ; 
- D 0 - I - 0x0152E7 05:92D7: 88 93     .word ofs_038_33_9388_07 ; 
- D 0 - I - 0x0152E9 05:92D9: 8E 93     .word ofs_038_33_938E_08 ; 

; ******************************************************************************************************************

ofs_038_33_92DB_01_активация_объекта:
C - - J - - 0x0152EB 05:92DB: A9 03     LDA #$03
C - - - - - 0x0152ED 05:92DD: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0152F0 05:92E0: A9 10     LDA #$10
C - - - - - 0x0152F2 05:92E2: A0 06     LDY #$06
C - - - - - 0x0152F4 05:92E4: 20 9B AB  JSR sub_0x006BAB_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x0152F7 05:92E7: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_33_92EA_02:
C - - J - - 0x0152FA 05:92EA: A9 01     LDA #$01
C - - - - - 0x0152FC 05:92EC: 20 96 93  JSR sub_9396
C - - - - - 0x0152FF 05:92EF: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x015302 05:92F2: B9 72 07  LDA ram_0772_obj,Y
C - - - - - 0x015305 05:92F5: 10 11     BPL bra_9308_RTS
C - - - - - 0x015307 05:92F7: C9 FF     CMP #$FF
C - - - - - 0x015309 05:92F9: F0 0D     BEQ bra_9308_RTS
C - - - - - 0x01530B 05:92FB: 29 7F     AND #$7F
C - - - - - 0x01530D 05:92FD: DD 1E 07  CMP ram_флаги_объектов,X
C - - - - - 0x015310 05:9300: D0 06     BNE bra_9308_RTS
C - - - - - 0x015312 05:9302: 99 72 07  STA ram_0772_obj,Y
C - - - - - 0x015315 05:9305: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_9308_RTS:
C - - - - - 0x015318 05:9308: 60        RTS

; ******************************************************************************************************************

ofs_038_33_9309_03:
C - - J - - 0x015319 05:9309: 20 94 93  JSR sub_9394
C - - - - - 0x01531C 05:930C: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x01531F 05:930F: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x015322 05:9312: C9 0F     CMP #$0F
C - - - - - 0x015324 05:9314: 90 F2     BCC bra_9308_RTS
C - - - - - 0x015326 05:9316: A0 44     LDY #con_obj_id_34  ; лазерная пуля
C - - - - - 0x015328 05:9318: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x01532B 05:931B: 90 06     BCC bra_9323
C - - - - - 0x01532D 05:931D: A4 11     LDY ram_0011
C - - - - - 0x01532F 05:931F: 8A        TXA
C - - - - - 0x015330 05:9320: 99 80 07  STA ram_0780_obj,Y
bra_9323:
C - - - - - 0x015333 05:9323: BD 76 06  LDA ram_жизни_объектов_32bit,X
C - - - - - 0x015336 05:9326: 9D 56 07  STA ram_скролл_объекта_X,X  ; отложить 32bit HP
C - - - - - 0x015339 05:9329: A9 F0     LDA #con_HP_F0  ; выключить урон
C - - - - - 0x01533B 05:932B: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x01533E 05:932E: A9 10     LDA #$10    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_33_9333_04:
C - - J - - 0x015343 05:9333: 20 94 93  JSR sub_9394
C - - - - - 0x015346 05:9336: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x015349 05:9339: D0 CD     BNE bra_9308_RTS
C - - - - - 0x01534B 05:933B: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x01534E 05:933E: 9D 76 06  STA ram_жизни_объектов_32bit,X  ; вернуть 32bit HP и разрешить урон
C - - - - - 0x015351 05:9341: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_33_9344_05:
C - - J - - 0x015354 05:9344: 20 94 93  JSR sub_9394
C - - - - - 0x015357 05:9347: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x01535A 05:934A: D0 BC     BNE bra_9308_RTS
C - - - - - 0x01535C 05:934C: A9 02     LDA #$02
C - - - - - 0x01535E 05:934E: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

; ******************************************************************************************************************

ofs_038_33_9351_06:
C - - J - - 0x015361 05:9351: BD 80 07  LDA ram_0780_obj,X
C - - - - - 0x015364 05:9354: AA        TAX
C - - - - - 0x015365 05:9355: DE 64 07  DEC ram_0764_obj,X
C - - - - - 0x015368 05:9358: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x01536A 05:935A: BC 1E 07  LDY ram_флаги_объектов,X
C - - - - - 0x01536D 05:935D: C0 08     CPY #$08
C - - - - - 0x01536F 05:935F: D0 0A     BNE bra_936B
; 08
C - - - - - 0x015371 05:9361: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x015374 05:9364: A9 00     LDA #$00
C - - - - - 0x015376 05:9366: 99 10 07  STA ram_счетчик_анимации_взрыва_объекта,Y
C - - - - - 0x015379 05:9369: F0 0C     BEQ bra_9377    ; jmp
bra_936B:
C - - - - - 0x01537B 05:936B: B9 80 93  LDA tbl_9380_счетчики,Y
C - - - - - 0x01537E 05:936E: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x015381 05:9371: 39 02 07  AND ram_счетчик_анимации_объектов,Y
C - - - - - 0x015384 05:9374: 99 02 07  STA ram_счетчик_анимации_объектов,Y
bra_9377:
C - - - - - 0x015387 05:9377: 20 99 93  JSR sub_9399
C - - - - - 0x01538A 05:937A: 20 E4 93  JSR sub_93E4
C - - - - - 0x01538D 05:937D: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта

tbl_9380_счетчики:
- D 0 - - - 0x015390 05:9380: 7F        .byte $7F   ; 00 
- D 0 - - - 0x015391 05:9381: BF        .byte $BF   ; 01 
- D 0 - - - 0x015392 05:9382: DF        .byte $DF   ; 02 
- D 0 - - - 0x015393 05:9383: EF        .byte $EF   ; 03 
- D 0 - - - 0x015394 05:9384: F7        .byte $F7   ; 04 
- D 0 - - - 0x015395 05:9385: FB        .byte $FB   ; 05 
- D 0 - - - 0x015396 05:9386: FD        .byte $FD   ; 06 
- D 0 - - - 0x015397 05:9387: FE        .byte $FE   ; 07 

; ******************************************************************************************************************

ofs_038_33_9388_07:
C - - J - - 0x015398 05:9388: 20 99 93  JSR sub_9399
C - - - - - 0x01539B 05:938B: 4C FD A2  JMP loc_0x00630D_обработка_анимации_взрыва_объекта

; ******************************************************************************************************************

ofs_038_33_938E_08:
C - - J - - 0x01539E 05:938E: 20 99 93  JSR sub_9399
C - - - - - 0x0153A1 05:9391: 4C 3D A3  JMP loc_0x00628A_удалить_объект

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9394:
C - - - - - 0x0153A4 05:9394: A9 63     LDA #$63
sub_9396:
C - - - - - 0x0153A6 05:9396: 9D 08 05  STA ram_кадр_объекта_или_пули,X
sub_9399:
C - - - - - 0x0153A9 05:9399: BC 1E 07  LDY ram_флаги_объектов,X
C - - - - - 0x0153AC 05:939C: B9 DB 93  LDA tbl_93DB_добавочная_позиция_X_спрайта_объекта,Y
C - - - - - 0x0153AF 05:939F: 85 09     STA ram_0009
C - - - - - 0x0153B1 05:93A1: 0A        ASL
C - - - - - 0x0153B2 05:93A2: A9 00     LDA #$00
C - - - - - 0x0153B4 05:93A4: 90 02     BCC bra_93A8
C - - - - - 0x0153B6 05:93A6: A9 FF     LDA #$FF
bra_93A8:
C - - - - - 0x0153B8 05:93A8: 85 0B     STA ram_000B
C - - - - - 0x0153BA 05:93AA: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x0153BD 05:93AD: A5 09     LDA ram_0009
C - - - - - 0x0153BF 05:93AF: 18        CLC
C - - - - - 0x0153C0 05:93B0: 79 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x0153C3 05:93B3: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0153C6 05:93B6: A5 0B     LDA ram_000B
C - - - - - 0x0153C8 05:93B8: 79 9C 07  ADC ram_позиция_объектов_X_старш,Y
C - - - - - 0x0153CB 05:93BB: 9D 9C 07  STA ram_позиция_объектов_X_старш,X
C - - - - - 0x0153CE 05:93BE: D0 18     BNE bra_93D8
C - - - - - 0x0153D0 05:93C0: A9 18     LDA #$18
C - - - - - 0x0153D2 05:93C2: 18        CLC
C - - - - - 0x0153D3 05:93C3: 7D 48 07  ADC ram_скролл_объекта_Y,X
C - - - - - 0x0153D6 05:93C6: 18        CLC
C - - - - - 0x0153D7 05:93C7: 79 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x0153DA 05:93CA: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0153DD 05:93CD: A9 00     LDA #$00
C - - - - - 0x0153DF 05:93CF: 79 8E 07  ADC ram_позиция_объектов_Y_старш,Y
C - - - - - 0x0153E2 05:93D2: 9D 8E 07  STA ram_позиция_объектов_Y_старш,X
C - - - - - 0x0153E5 05:93D5: D0 01     BNE bra_93D8
C - - - - - 0x0153E7 05:93D7: 60        RTS
bra_93D8:
C - - - - - 0x0153E8 05:93D8: 4C 7D A2  JMP loc_0x00628D_очистить_кадр_анимации

tbl_93DB_добавочная_позиция_X_спрайта_объекта:
- D 0 - - - 0x0153EB 05:93DB: C0        .byte $C0   ; 00 
- D 0 - - - 0x0153EC 05:93DC: D0        .byte $D0   ; 01 
- D 0 - - - 0x0153ED 05:93DD: E0        .byte $E0   ; 02 
- D 0 - - - 0x0153EE 05:93DE: F0        .byte $F0   ; 03 
- D 0 - - - 0x0153EF 05:93DF: 00        .byte $00   ; 04 
- D 0 - - - 0x0153F0 05:93E0: 10        .byte $10   ; 05 
- D 0 - - - 0x0153F1 05:93E1: 20        .byte $20   ; 06 
- D 0 - - - 0x0153F2 05:93E2: 30        .byte $30   ; 07 
- D 0 - - - 0x0153F3 05:93E3: 40        .byte $40   ; 08 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_93E4:
C - - - - - 0x0153F4 05:93E4: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0153F7 05:93E7: 0A        ASL
C - - - - - 0x0153F8 05:93E8: 85 08     STA ram_0008
C - - - - - 0x0153FA 05:93EA: A0 00     LDY #$00
C - - - - - 0x0153FC 05:93EC: A6 1E     LDX ram_index_ppu_buffer
bra_93EE_loop:
C - - - - - 0x0153FE 05:93EE: B9 08 94  LDA tbl_9408,Y
C - - - - - 0x015401 05:93F1: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x015404 05:93F4: E8        INX
C - - - - - 0x015405 05:93F5: C8        INY
C - - - - - 0x015406 05:93F6: C9 FF     CMP #$FF
C - - - - - 0x015408 05:93F8: D0 F4     BNE bra_93EE_loop
C - - - - - 0x01540A 05:93FA: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x01540C 05:93FC: BD FB 02  LDA ram_nmt_buffer - $05,X
C - - - - - 0x01540F 05:93FF: 18        CLC
C - - - - - 0x015410 05:9400: 65 08     ADC ram_0008
C - - - - - 0x015412 05:9402: 9D FB 02  STA ram_nmt_buffer - $05,X
C - - - - - 0x015415 05:9405: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x015417 05:9407: 60        RTS

tbl_9408:
- D 0 - - - 0x015418 05:9408: 07        .byte con_buf_mode_07   ; 

- D 0 - - - 0x015419 05:9409: 20 87     .dbyt $2087 ; ppu
- D 0 - - - 0x01541B 05:940B: 02        .byte $02   ; counter
- D 0 - - - 0x01541C 05:940C: FE        .byte $FE, $00   ; tiles

- D 0 - - - 0x01541E 05:940E: FF        .byte $FF   ; end token

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x01541F_34_босс_4_лазерная_пуля:
- D 0 - I - 0x01541F 05:940F: 15 94     .word ofs_038_34_9415_01_активация_объекта ; 
- D 0 - I - 0x015421 05:9411: 38 94     .word ofs_038_34_9438_02 ; 
- D 0 - I - 0x015423 05:9413: 58 94     .word ofs_038_34_9458_03 ; 

; ******************************************************************************************************************

ofs_038_34_9415_01_активация_объекта:
C - - J - - 0x015425 05:9415: A9 80     LDA #$80
C - - - - - 0x015427 05:9417: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x01542A 05:941A: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01542D 05:941D: 18        CLC
C - - - - - 0x01542E 05:941E: 69 08     ADC #$08
C - - - - - 0x015430 05:9420: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x015433 05:9423: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x015436 05:9426: A9 00     LDA #< $0800
C - - - - - 0x015438 05:9428: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x01543B 05:942B: A9 08     LDA #> $0800
C - - - - - 0x01543D 05:942D: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x015440 05:9430: A9 10     LDA #con_sound_10
C - - - - - 0x015442 05:9432: 20 DE FD  JSR sub_0x01FDEE_play_sound
C - - - - - 0x015445 05:9435: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_34_9438_02:
C - - J - - 0x015448 05:9438: 20 6A 94  JSR sub_946A
C - - - - - 0x01544B 05:943B: A9 D2     LDA #$D2
C - - - - - 0x01544D 05:943D: 20 7C 94  JSR sub_947C
C - - - - - 0x015450 05:9440: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x015453 05:9443: C9 E0     CMP #$E0
C - - - - - 0x015455 05:9445: B0 07     BCS bra_944E
C - - - - - 0x015457 05:9447: A9 00     LDA #$00
C - - - - - 0x015459 05:9449: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x01545C 05:944C: F0 09     BEQ bra_9457_RTS
bra_944E:
C - - - - - 0x01545E 05:944E: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x015461 05:9451: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x015464 05:9454: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_9457_RTS:
C - - - - - 0x015467 05:9457: 60        RTS

; ******************************************************************************************************************

ofs_038_34_9458_03:
C - - J - - 0x015468 05:9458: 20 6A 94  JSR sub_946A
C - - - - - 0x01546B 05:945B: A9 00     LDA #$00
C - - - - - 0x01546D 05:945D: 20 7C 94  JSR sub_947C
C - - - - - 0x015470 05:9460: A9 00     LDA #$00
C - - - - - 0x015472 05:9462: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x015475 05:9465: F0 F0     BEQ bra_9457_RTS
C - - - - - 0x015477 05:9467: 4C 75 A2  JMP loc_0x00628A_удалить_объект

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_946A:
C - - - - - 0x01547A 05:946A: A9 01     LDA #$01
C - - - - - 0x01547C 05:946C: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x01547F 05:946F: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x015482 05:9472: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x015485 05:9475: B9 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x015488 05:9478: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01548B 05:947B: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_947C:
C - - - - - 0x01548C 05:947C: 85 08     STA ram_0008
C - - - - - 0x01548E 05:947E: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x015491 05:9481: 18        CLC
C - - - - - 0x015492 05:9482: 65 FA     ADC ram_00FA
C - - - - - 0x015494 05:9484: 4A        LSR
C - - - - - 0x015495 05:9485: 4A        LSR
C - - - - - 0x015496 05:9486: 4A        LSR
C - - - - - 0x015497 05:9487: 85 00     STA ram_0000
C - - - - - 0x015499 05:9489: A5 FB     LDA ram_00FB
C - - - - - 0x01549B 05:948B: 4A        LSR
C - - - - - 0x01549C 05:948C: 4A        LSR
C - - - - - 0x01549D 05:948D: A9 08     LDA #$08
C - - - - - 0x01549F 05:948F: 90 02     BCC bra_9493
- - - - - - 0x0154A1 05:9491: A9 0A     LDA #$0A
bra_9493:
C - - - - - 0x0154A3 05:9493: 85 01     STA ram_0001
C - - - - - 0x0154A5 05:9495: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0154A8 05:9498: 18        CLC
C - - - - - 0x0154A9 05:9499: 65 F9     ADC ram_00F9
C - - - - - 0x0154AB 05:949B: B0 04     BCS bra_94A1
- - - - - - 0x0154AD 05:949D: C9 F0     CMP #$F0
- - - - - - 0x0154AF 05:949F: 90 0A     BCC bra_94AB
bra_94A1:
C - - - - - 0x0154B1 05:94A1: 69 0F     ADC #$0F
C - - - - - 0x0154B3 05:94A3: A8        TAY
C - - - - - 0x0154B4 05:94A4: A5 01     LDA ram_0001
C - - - - - 0x0154B6 05:94A6: 49 02     EOR #$02
C - - - - - 0x0154B8 05:94A8: 85 01     STA ram_0001
C - - - - - 0x0154BA 05:94AA: 98        TYA
bra_94AB:
C - - - - - 0x0154BB 05:94AB: 29 F8     AND #$F8
C - - - - - 0x0154BD 05:94AD: 0A        ASL
C - - - - - 0x0154BE 05:94AE: 26 01     ROL ram_0001
C - - - - - 0x0154C0 05:94B0: 0A        ASL
C - - - - - 0x0154C1 05:94B1: 26 01     ROL ram_0001
C - - - - - 0x0154C3 05:94B3: 18        CLC
C - - - - - 0x0154C4 05:94B4: 65 00     ADC ram_0000
C - - - - - 0x0154C6 05:94B6: 85 00     STA ram_0000
C - - - - - 0x0154C8 05:94B8: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x0154CA 05:94BA: A9 06     LDA #con_buf_mode_06
C - - - - - 0x0154CC 05:94BC: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0154CF 05:94BF: E8        INX
C - - - - - 0x0154D0 05:94C0: A5 01     LDA ram_0001    ; ppu hi
C - - - - - 0x0154D2 05:94C2: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0154D5 05:94C5: E8        INX
C - - - - - 0x0154D6 05:94C6: A5 00     LDA ram_0000    ; ppu lo
C - - - - - 0x0154D8 05:94C8: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0154DB 05:94CB: E8        INX
C - - - - - 0x0154DC 05:94CC: A9 01     LDA #$01    ; counter
C - - - - - 0x0154DE 05:94CE: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0154E1 05:94D1: E8        INX
C - - - - - 0x0154E2 05:94D2: A5 08     LDA ram_0008    ; tile
C - - - - - 0x0154E4 05:94D4: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0154E7 05:94D7: E8        INX
C - - - - - 0x0154E8 05:94D8: A9 FF     LDA #$FF    ; close buffer
C - - - - - 0x0154EA 05:94DA: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0154ED 05:94DD: E8        INX
C - - - - - 0x0154EE 05:94DE: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x0154F0 05:94E0: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x0154F2 05:94E2: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x01043B_44_босс_5_летающий_аппарат_череп:
- D 0 - I - 0x01043B 04:842B: 3F 84     .word ofs_038_44_843F_01_активация_объекта ; 
- D 0 - I - 0x01043D 04:842D: 4C 84     .word ofs_038_44_844C_02 ; 
- D 0 - I - 0x01043F 04:842F: 69 84     .word ofs_038_44_8469_03 ; 
- D 0 - I - 0x010441 04:8431: 7B 84     .word ofs_038_44_847B_04 ; 
- D 0 - I - 0x010443 04:8433: 0A 85     .word ofs_038_44_850A_05 ; 
- D 0 - I - 0x010445 04:8435: 2E 85     .word ofs_038_44_852E_06 ; 
- D 0 - I - 0x010447 04:8437: 3C 85     .word ofs_038_44_853C_07 ; 
- D 0 - I - 0x010449 04:8439: 42 85     .word ofs_038_44_8542_08 ; 
- D 0 - I - 0x01044B 04:843B: 48 85     .word ofs_038_44_8548_09 ; 
- D 0 - I - 0x01044D 04:843D: 4E 85     .word ofs_038_44_854E_0A ; 

; ******************************************************************************************************************

ofs_038_44_843F_01_активация_объекта:
C - - J - - 0x01044F 04:843F: A9 10     LDA #$10
C - - - - - 0x010451 04:8441: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x010454 04:8444: A9 F0     LDA #con_HP_F0
C - - - - - 0x010456 04:8446: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x010459 04:8449: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_44_844C_02:
C - - J - - 0x01045C 04:844C: A5 61     LDA ram_0061_конфиг_уровня
C - - - - - 0x01045E 04:844E: F0 18     BEQ bra_8468_RTS
C - - - - - 0x010460 04:8450: A5 60     LDA ram_0060_unk
C - - - - - 0x010462 04:8452: 05 70     ORA ram_0070
C - - - - - 0x010464 04:8454: D0 12     BNE bra_8468_RTS
C - - - - - 0x010466 04:8456: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x010468 04:8458: 09 40     ORA #$40
C - - - - - 0x01046A 04:845A: 85 94     STA ram_0094_конфиг_уровня
C - - - - - 0x01046C 04:845C: A9 B8     LDA #$B8
C - - - - - 0x01046E 04:845E: 85 98     STA ram_0098
C - - - - - 0x010470 04:8460: A9 31     LDA #con_sound_31   ; музыка 5й босс
C - - - - - 0x010472 04:8462: 20 DE FD  JSR sub_0x01FDEE_play_music
C - - - - - 0x010475 04:8465: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8468_RTS:
C - - - - - 0x010478 04:8468: 60        RTS

; ******************************************************************************************************************

ofs_038_44_8469_03:
C - - J - - 0x010479 04:8469: A5 98     LDA ram_0098
C - - - - - 0x01047B 04:846B: D0 FB     BNE bra_8468_RTS
C - - - - - 0x01047D 04:846D: 20 94 AA  JSR sub_0x006AA4_save_reg_values
C - - - - - 0x010480 04:8470: 20 90 F1  JSR sub_0x01F1A0
C - - - - - 0x010483 04:8473: A9 08     LDA #$08
C - - - - - 0x010485 04:8475: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x010488 04:8478: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_44_847B_04:
C - - J - - 0x01048B 04:847B: A5 60     LDA ram_0060_unk
C - - - - - 0x01048D 04:847D: 05 70     ORA ram_0070
C - - - - - 0x01048F 04:847F: D0 E7     BNE bra_8468_RTS
C - - - - - 0x010491 04:8481: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x010494 04:8484: F0 05     BEQ bra_848B
C - - - - - 0x010496 04:8486: A9 00     LDA #$00
C - - - - - 0x010498 04:8488: 85 6B     STA ram_006B
C - - - - - 0x01049A 04:848A: 60        RTS
bra_848B:
C - - - - - 0x01049B 04:848B: A9 01     LDA #$01
C - - - - - 0x01049D 04:848D: 85 61     STA ram_0061_конфиг_уровня
C - - - - - 0x01049F 04:848F: A9 01     LDA #con_mirroring_H
C - - - - - 0x0104A1 04:8491: 85 26     STA ram_mirroring
C - - - - - 0x0104A3 04:8493: A9 80     LDA #$80
C - - - - - 0x0104A5 04:8495: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0104A8 04:8498: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0104AB 04:849B: A9 C4     LDA #$C4
C - - - - - 0x0104AD 04:849D: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0104B0 04:84A0: A9 FF     LDA #$FF
C - - - - - 0x0104B2 04:84A2: 9D 8E 07  STA ram_позиция_объектов_Y_старш,X
C - - - - - 0x0104B5 04:84A5: A9 00     LDA #$00
C - - - - - 0x0104B7 04:84A7: 9D 9C 07  STA ram_позиция_объектов_X_старш,X
C - - - - - 0x0104BA 04:84AA: A9 A8     LDA #$A8
C - - - - - 0x0104BC 04:84AC: 85 FF     STA ram_for_2000
C - - - - - 0x0104BE 04:84AE: 20 7F FC  JSR sub_0x01FC8F_copy_reg_values
C - - - - - 0x0104C1 04:84B1: 20 CE A9  JSR sub_0x0069DE
C - - - - - 0x0104C4 04:84B4: A9 0B     LDA #con_irq_area_5_boss
C - - - - - 0x0104C6 04:84B6: 85 27     STA ram_irq_handler_hi
C - - - - - 0x0104C8 04:84B8: A9 C1     LDA #$C1
C - - - - - 0x0104CA 04:84BA: 85 45     STA ram_номер_сканлинии
C - - - - - 0x0104CC 04:84BC: A9 00     LDA #$00
C - - - - - 0x0104CE 04:84BE: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0104D1 04:84C1: A9 E0     LDA #< $00E0
C - - - - - 0x0104D3 04:84C3: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0104D6 04:84C6: A9 00     LDA #> $00E0
C - - - - - 0x0104D8 04:84C8: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x0104DB 04:84CB: A0 00     LDY #$00
C - - - - - 0x0104DD 04:84CD: 20 F9 84  JSR sub_84F9
C - - - - - 0x0104E0 04:84D0: 20 10 BD  JSR sub_0x007D20_очистить_0400_047F
C - - - - - 0x0104E3 04:84D3: A9 F0     LDA #$F0
C - - - - - 0x0104E5 04:84D5: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x0104E8 04:84D8: A9 00     LDA #$00
C - - - - - 0x0104EA 04:84DA: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0104ED 04:84DD: A9 10     LDA #$10
C - - - - - 0x0104EF 04:84DF: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0104F2 04:84E2: A9 00     LDA #$00
C - - - - - 0x0104F4 04:84E4: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x0104F7 04:84E7: A9 20     LDA #$20
C - - - - - 0x0104F9 04:84E9: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0104FC 04:84EC: A9 5A     LDA #con_chr_bank + $5A
C - - - - - 0x0104FE 04:84EE: 8D F0 07  STA ram_bg_bank_1
C - - - - - 0x010501 04:84F1: A9 06     LDA #con_chr_bank + $06
C - - - - - 0x010503 04:84F3: 8D F1 07  STA ram_bg_bank_2
C - - - - - 0x010506 04:84F6: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_84F9:
loc_84F9:
C D 0 - - - 0x010509 04:84F9: B9 06 85  LDA tbl_8506_скорость_Y,Y
C - - - - - 0x01050C 04:84FC: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x01050F 04:84FF: B9 07 85  LDA tbl_8506_скорость_Y + $01,Y
C - - - - - 0x010512 04:8502: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x010515 04:8505: 60        RTS

tbl_8506_скорость_Y:
- D 0 - - - 0x010516 04:8506: 40 00     .word $0040 ; 00 
- D 0 - - - 0x010518 04:8508: 80 00     .word $0080 ; 02 

; ******************************************************************************************************************

ofs_038_44_850A_05:
C - - J - - 0x01051A 04:850A: A9 01     LDA #$01
C - - - - - 0x01051C 04:850C: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x01051F 04:850F: 20 B6 87  JSR sub_87B6
C - - - - - 0x010522 04:8512: A0 FC     LDY #$FC
C - - - - - 0x010524 04:8514: 20 8E A9  JSR sub_0x00699E
C - - - - - 0x010527 04:8517: BD 80 07  LDA ram_0780_obj,X
C - - - - - 0x01052A 04:851A: F0 05     BEQ bra_8521
C - - - - - 0x01052C 04:851C: A0 01     LDY #$01
C - - - - - 0x01052E 04:851E: 20 6E A9  JSR sub_0x00697E
bra_8521:
C - - - - - 0x010531 04:8521: 20 39 88  JSR sub_8839
C - - - - - 0x010534 04:8524: 20 66 85  JSR sub_8566
C - - - - - 0x010537 04:8527: 20 A0 86  JSR sub_86A0
C - - - - - 0x01053A 04:852A: 20 E7 86  JSR sub_86E7
C - - - - - 0x01053D 04:852D: 60        RTS

; ******************************************************************************************************************

ofs_038_44_852E_06:
C - - J - - 0x01053E 04:852E: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
C - - - - - 0x010541 04:8531: A0 02     LDY #$02
C - - - - - 0x010543 04:8533: 20 F9 84  JSR sub_84F9
C - - - - - 0x010546 04:8536: 20 32 88  JSR sub_8832
C - - - - - 0x010549 04:8539: 4C B8 A3  JMP loc_0x0063C8_установить_статус_уничтожения_босса_и_убить_все_объекты

; ******************************************************************************************************************

ofs_038_44_853C_07:
C - - J - - 0x01054C 04:853C: 20 32 88  JSR sub_8832
C - - - - - 0x01054F 04:853F: 4C D8 A3  JMP loc_0x0063E8_большие_взрывы_для_боссов

; ******************************************************************************************************************

ofs_038_44_8542_08:
C - - J - - 0x010552 04:8542: 20 32 88  JSR sub_8832
C - - - - - 0x010555 04:8545: 4C A2 A2  JMP loc_0x0062B2_обработка_состояния_смерти_объекта

; ******************************************************************************************************************

ofs_038_44_8548_09:
C - - J - - 0x010558 04:8548: 20 32 88  JSR sub_8832
C - - - - - 0x01055B 04:854B: 4C F6 A2  JMP loc_0x006306

; ******************************************************************************************************************

ofs_038_44_854E_0A:
                                        INC ram_002B
C - - - - - 0x010561 04:8551: 20 88 F1  JSR sub_0x01F198
C - - - - - 0x010564 04:8554: E6 65     INC ram_0065
C - - - - - 0x010566 04:8556: 20 A1 AA  JSR sub_0x006AB1_restore_reg_values
C - - - - - 0x010569 04:8559: A9 20     LDA #con_chr_bank + $20
C - - - - - 0x01056B 04:855B: 8D F0 07  STA ram_bg_bank_1
C - - - - - 0x01056E 04:855E: A9 22     LDA #con_chr_bank + $22
C - - - - - 0x010570 04:8560: 8D F1 07  STA ram_bg_bank_2
C - - - - - 0x010573 04:8563: 4C 37 A3  JMP loc_0x006347_удалить_объект_босс

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8566:
C - - - - - 0x010576 04:8566: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x010579 04:8569: C9 02     CMP #$02
C - - - - - 0x01057B 04:856B: D0 15     BNE bra_8582
C - - - - - 0x01057D 04:856D: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x010580 04:8570: B9 DD 86  LDA tbl_86DD_флаги,Y
C - - - - - 0x010583 04:8573: 0A        ASL
C - - - - - 0x010584 04:8574: 30 47     BMI bra_85BD_RTS
- - - - - - 0x010586 04:8576: BD 02 07  LDA ram_счетчик_анимации_объектов,X
- - - - - - 0x010589 04:8579: C9 0C     CMP #$0C
- - - - - - 0x01058B 04:857B: 90 05     BCC bra_8582
- - - - - - 0x01058D 04:857D: A9 0C     LDA #$0C
- - - - - - 0x01058F 04:857F: 9D 02 07  STA ram_счетчик_анимации_объектов,X
bra_8582:
C - - - - - 0x010592 04:8582: DE 02 07  DEC ram_счетчик_анимации_объектов,X
C - - - - - 0x010595 04:8585: D0 36     BNE bra_85BD_RTS
C - - - - - 0x010597 04:8587: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01059A 04:858A: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01059D 04:858D: C9 08     CMP #$08
C - - - - - 0x01059F 04:858F: 90 02     BCC bra_8593_not_overflow
C - - - - - 0x0105A1 04:8591: A9 00     LDA #$00
bra_8593_not_overflow:
C - - - - - 0x0105A3 04:8593: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0105A6 04:8596: A8        TAY
C - - - - - 0x0105A7 04:8597: B9 BE 85  LDA tbl_85BE_счетчики_анимации,Y
C - - - - - 0x0105AA 04:859A: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x0105AD 04:859D: 98        TYA
C - - - - - 0x0105AE 04:859E: 0A        ASL
C - - - - - 0x0105AF 04:859F: A8        TAY
C - - - - - 0x0105B0 04:85A0: B9 C6 85  LDA tbl_85C6,Y
C - - - - - 0x0105B3 04:85A3: 85 08     STA ram_0008
C - - - - - 0x0105B5 04:85A5: B9 C7 85  LDA tbl_85C6 + $01,Y
sub_85A8:
C - - - - - 0x0105B8 04:85A8: 85 09     STA ram_0009
C - - - - - 0x0105BA 04:85AA: A0 00     LDY #$00
C - - - - - 0x0105BC 04:85AC: A6 1E     LDX ram_index_ppu_buffer
bra_85AE_loop:
C - - - - - 0x0105BE 04:85AE: B1 08     LDA (ram_0008),Y
C - - - - - 0x0105C0 04:85B0: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0105C3 04:85B3: C8        INY
C - - - - - 0x0105C4 04:85B4: E8        INX
C - - - - - 0x0105C5 04:85B5: C9 FF     CMP #$FF
C - - - - - 0x0105C7 04:85B7: D0 F5     BNE bra_85AE_loop
C - - - - - 0x0105C9 04:85B9: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x0105CB 04:85BB: A6 10     LDX ram_0010    ; загрузить индекс объекта
bra_85BD_RTS:
C - - - - - 0x0105CD 04:85BD: 60        RTS

tbl_85BE_счетчики_анимации:
- D 0 - - - 0x0105CE 04:85BE: 0C        .byte $0C   ; 00 
- D 0 - - - 0x0105CF 04:85BF: 50        .byte $50   ; 01 
- D 0 - - - 0x0105D0 04:85C0: 0C        .byte $0C   ; 02 
- D 0 - - - 0x0105D1 04:85C1: 10        .byte $10   ; 03 
- D 0 - - - 0x0105D2 04:85C2: 0C        .byte $0C   ; 04 
- D 0 - - - 0x0105D3 04:85C3: 50        .byte $50   ; 05 
- D 0 - - - 0x0105D4 04:85C4: 0C        .byte $0C   ; 06 
- D 0 - - - 0x0105D5 04:85C5: 10        .byte $10   ; 07 

tbl_85C6:
- D 0 - - - 0x0105D6 04:85C6: F4 85     .word _off022_85F4_00
- D 0 - - - 0x0105D8 04:85C8: 1A 86     .word _off022_861A_01
- D 0 - - - 0x0105DA 04:85CA: F4 85     .word _off022_85F4_02
- D 0 - - - 0x0105DC 04:85CC: D6 85     .word _off022_85D6_03
- D 0 - - - 0x0105DE 04:85CE: 59 86     .word _off022_8659_04
- D 0 - - - 0x0105E0 04:85D0: 7F 86     .word _off022_867F_05
- D 0 - - - 0x0105E2 04:85D2: 59 86     .word _off022_8659_06
- D 0 - - - 0x0105E4 04:85D4: 3B 86     .word _off022_863B_07

; _________________________________________________________________________________________________________________

_off022_85D6_03:
- D 0 - I - 0x0105E6 04:85D6: 07        .byte con_buf_mode_07   ; 

- D 0 - I - 0x0105E7 04:85D7: 21 D3     .dbyt $21D3 ; ppu address
- D 0 - I - 0x0105E9 04:85D9: 02        .byte $02   ; counter
- D 0 - I - 0x0105EA 04:85DA: 18        .byte $18, $24   ; tiles

- D 0 - I - 0x0105EC 04:85DC: 21 B4     .dbyt $21B4 ; ppu address
- D 0 - I - 0x0105EE 04:85DE: 05        .byte $05   ; counter
- D 0 - I - 0x0105EF 04:85DF: 10        .byte $10, $19, $25, $32, $3D   ; tiles

- D 0 - I - 0x0105F4 04:85E4: 21 B5     .dbyt $21B5 ; ppu address
- D 0 - I - 0x0105F6 04:85E6: 05        .byte $05   ; counter
- D 0 - I - 0x0105F7 04:85E7: 00        .byte $00, $1A, $26, $33, $3E   ; tiles

- D 0 - I - 0x0105FC 04:85EC: 21 D6     .dbyt $21D6 ; ppu address
- D 0 - I - 0x0105FE 04:85EE: 04        .byte $04   ; counter
- D 0 - I - 0x0105FF 04:85EF: 00        .byte $00, $27, $34, $3F   ; tiles

- D 0 - I - 0x010603 04:85F3: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

_off022_85F4_00:
_off022_85F4_02:
- D 0 - I - 0x010604 04:85F4: 07        .byte con_buf_mode_07   ; 

- D 0 - I - 0x010605 04:85F5: 21 D3     .dbyt $21D3 ; ppu address
- D 0 - I - 0x010607 04:85F7: 02        .byte $02   ; counter
- D 0 - I - 0x010608 04:85F8: 7A        .byte $7A, $FE   ; tiles

- D 0 - I - 0x01060A 04:85FA: 21 B4     .dbyt $21B4 ; ppu address
- D 0 - I - 0x01060C 04:85FC: 05        .byte $05   ; counter
- D 0 - I - 0x01060D 04:85FD: 79        .byte $79, $25, $32, $7B, $7C   ; tiles

- D 0 - I - 0x010612 04:8602: 21 95     .dbyt $2195 ; ppu address
- D 0 - I - 0x010614 04:8604: 06        .byte $06   ; counter
- D 0 - I - 0x010615 04:8605: 00        .byte $00, $1A, $26, $33, $3E, $7D   ; tiles

- D 0 - I - 0x01061B 04:860B: 21 96     .dbyt $2196 ; ppu address
- D 0 - I - 0x01061D 04:860D: 06        .byte $06   ; counter
- D 0 - I - 0x01061E 04:860E: 00        .byte $00, $00, $27, $34, $3F, $7E   ; tiles

- D 0 - I - 0x010624 04:8614: 21 97     .dbyt $2197 ; ppu address
- D 0 - I - 0x010626 04:8616: 02        .byte $02   ; counter
- D 0 - I - 0x010627 04:8617: 00        .byte $00, $00   ; tiles

- D 0 - I - 0x010629 04:8619: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

_off022_861A_01:
- D 0 - I - 0x01062A 04:861A: 07        .byte con_buf_mode_07   ; 

- D 0 - I - 0x01062B 04:861B: 21 B4     .dbyt $21B4 ; ppu address
- D 0 - I - 0x01062D 04:861D: 05        .byte $05   ; counter
- D 0 - I - 0x01062E 04:861E: F3        .byte $F3, $F7, $FA, $FC, $7C   ; tiles

- D 0 - I - 0x010633 04:8623: 21 95     .dbyt $2195 ; ppu address
- D 0 - I - 0x010635 04:8625: 06        .byte $06   ; counter
- D 0 - I - 0x010636 04:8626: F0        .byte $F0, $F4, $F8, $FB, $00, $FD   ; tiles

- D 0 - I - 0x01063C 04:862C: 21 96     .dbyt $2196 ; ppu address
- D 0 - I - 0x01063E 04:862E: 06        .byte $06   ; counter
- D 0 - I - 0x01063F 04:862F: F1        .byte $F1, $F5, $F9, $00, $00, $00   ; tiles

- D 0 - I - 0x010645 04:8635: 21 97     .dbyt $2197 ; ppu address
- D 0 - I - 0x010647 04:8637: 02        .byte $02   ; counter
- D 0 - I - 0x010648 04:8638: F2        .byte $F2, $F6   ; tiles

- D 0 - I - 0x01064A 04:863A: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

_off022_863B_07:
- D 0 - I - 0x01064B 04:863B: 07        .byte con_buf_mode_07   ; 

- D 0 - I - 0x01064C 04:863C: 21 C9     .dbyt $21C9 ; ppu address
- D 0 - I - 0x01064E 04:863E: 04        .byte $04   ; counter
- D 0 - I - 0x01064F 04:863F: 00        .byte $00, $1B, $28, $35   ; tiles

- D 0 - I - 0x010653 04:8643: 21 AA     .dbyt $21AA ; ppu address
- D 0 - I - 0x010655 04:8645: 05        .byte $05   ; counter
- D 0 - I - 0x010656 04:8646: 00        .byte $00, $11, $1C, $29, $36   ; tiles

- D 0 - I - 0x01065B 04:864B: 21 AB     .dbyt $21AB ; ppu address
- D 0 - I - 0x01065D 04:864D: 05        .byte $05   ; counter
- D 0 - I - 0x01065E 04:864E: 07        .byte $07, $12, $1D, $2A, $37   ; tiles

- D 0 - I - 0x010663 04:8653: 21 CC     .dbyt $21CC ; ppu address
- D 0 - I - 0x010665 04:8655: 02        .byte $02   ; counter
- D 0 - I - 0x010666 04:8656: 13        .byte $13, $1E   ; tiles

- D 0 - I - 0x010668 04:8658: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

_off022_8659_04:
_off022_8659_06:
- D 0 - I - 0x010669 04:8659: 07        .byte con_buf_mode_07   ; 

- D 0 - I - 0x01066A 04:865A: 21 88     .dbyt $2188 ; ppu address
- D 0 - I - 0x01066C 04:865C: 02        .byte $02   ; counter
- D 0 - I - 0x01066D 04:865D: 00        .byte $00, $00   ; tiles

- D 0 - I - 0x01066F 04:865F: 21 89     .dbyt $2189 ; ppu address
- D 0 - I - 0x010671 04:8661: 06        .byte $06   ; counter
- D 0 - I - 0x010672 04:8662: 00        .byte $00, $00, $1B, $28, $35, $68   ; tiles

- D 0 - I - 0x010678 04:8668: 21 8A     .dbyt $218A ; ppu address
- D 0 - I - 0x01067A 04:866A: 06        .byte $06   ; counter
- D 0 - I - 0x01067B 04:866B: 00        .byte $00, $11, $1C, $29, $36, $69   ; tiles

- D 0 - I - 0x010681 04:8671: 21 AB     .dbyt $21AB ; ppu address
- D 0 - I - 0x010683 04:8673: 05        .byte $05   ; counter
- D 0 - I - 0x010684 04:8674: 65        .byte $65, $1D, $2A, $67, $6A   ; tiles

- D 0 - I - 0x010689 04:8679: 21 CC     .dbyt $21CC ; ppu address
- D 0 - I - 0x01068B 04:867B: 02        .byte $02   ; counter
- D 0 - I - 0x01068C 04:867C: 66        .byte $66, $7F   ; tiles

- D 0 - I - 0x01068E 04:867E: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

_off022_867F_05:
- D 0 - I - 0x01068F 04:867F: 07        .byte con_buf_mode_07   ; 

- D 0 - I - 0x010690 04:8680: 21 88     .dbyt $2188 ; ppu address
- D 0 - I - 0x010692 04:8682: 02        .byte $02   ; counter
- D 0 - I - 0x010693 04:8683: 6B        .byte $6B, $6E   ; tiles

- D 0 - I - 0x010695 04:8685: 21 89     .dbyt $2189 ; ppu address
- D 0 - I - 0x010697 04:8687: 06        .byte $06   ; counter
- D 0 - I - 0x010698 04:8688: 6C        .byte $6C, $6F, $72, $00, $00, $00   ; tiles

- D 0 - I - 0x01069E 04:868E: 21 8A     .dbyt $218A ; ppu address
- D 0 - I - 0x0106A0 04:8690: 06        .byte $06   ; counter
- D 0 - I - 0x0106A1 04:8691: 6D        .byte $6D, $70, $73, $75, $00, $78   ; tiles

- D 0 - I - 0x0106A7 04:8697: 21 AB     .dbyt $21AB ; ppu address
- D 0 - I - 0x0106A9 04:8699: 05        .byte $05   ; counter
- D 0 - I - 0x0106AA 04:869A: 71        .byte $71, $74, $76, $77, $6A   ; tiles

- D 0 - I - 0x0106AF 04:869F: FF        .byte $FF   ; end token

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_86A0:
C - - - - - 0x0106B0 04:86A0: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0106B3 04:86A3: B9 DD 86  LDA tbl_86DD_флаги,Y
C - - - - - 0x0106B6 04:86A6: 30 34     BMI bra_86DC_RTS
C - - - - - 0x0106B8 04:86A8: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x0106BB 04:86AB: D0 2F     BNE bra_86DC_RTS
C - - - - - 0x0106BD 04:86AD: A9 30     LDA #$30
C - - - - - 0x0106BF 04:86AF: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0106C2 04:86B2: A0 5A     LDY #con_obj_id_45  ; маленький череп
C - - - - - 0x0106C4 04:86B4: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0106C7 04:86B7: 90 23     BCC bra_86DC_RTS
C - - - - - 0x0106C9 04:86B9: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0106CC 04:86BC: B9 DD 86  LDA tbl_86DD_флаги,Y
C - - - - - 0x0106CF 04:86BF: 85 08     STA ram_0008
                                        AND #$01    ; на всякий
C - - - - - 0x0106D1 04:86C1: A8        TAY
C - - - - - 0x0106D2 04:86C2: B9 E5 86  LDA tbl_86E5_добавочная_позиция_X_спрайта_объекта,Y
C - - - - - 0x0106D5 04:86C5: 18        CLC
C - - - - - 0x0106D6 04:86C6: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0106D9 04:86C9: A4 11     LDY ram_0011    ; загрузить индекс нового объекта
C - - - - - 0x0106DB 04:86CB: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x0106DE 04:86CE: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0106E1 04:86D1: 38        SEC
C - - - - - 0x0106E2 04:86D2: E9 10     SBC #$10
C - - - - - 0x0106E4 04:86D4: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x0106E7 04:86D7: A5 08     LDA ram_0008
C - - - - - 0x0106E9 04:86D9: 99 1E 07  STA ram_флаги_объектов,Y
bra_86DC_RTS:
C - - - - - 0x0106EC 04:86DC: 60        RTS

tbl_86DD_флаги:
- D 0 - - - 0x0106ED 04:86DD: 80        .byte $80   ; 00 
- D 0 - - - 0x0106EE 04:86DE: 00        .byte $00   ; 01 
- D 0 - - - 0x0106EF 04:86DF: 80        .byte $80   ; 02 
- D 0 - - - 0x0106F0 04:86E0: C0        .byte $C0   ; 03 
- D 0 - - - 0x0106F1 04:86E1: 80        .byte $80   ; 04 
- D 0 - - - 0x0106F2 04:86E2: 01        .byte $01   ; 05 
- D 0 - - - 0x0106F3 04:86E3: 80        .byte $80   ; 06 
- D 0 - - - 0x0106F4 04:86E4: C0        .byte $C0   ; 07 

tbl_86E5_добавочная_позиция_X_спрайта_объекта:
; bzk fortunately 0x0106CC reads only correct indexes
- D 0 - - - 0x0106F5 04:86E5: 30        .byte $30   ; 00 
- D 0 - - - 0x0106F6 04:86E6: D0        .byte $D0   ; 01 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_86E7:
C - - - - - 0x0106F7 04:86E7: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x0106FA 04:86EA: C9 01     CMP #$01
C - - - - - 0x0106FC 04:86EC: F0 05     BEQ bra_86F3
C - - - - - 0x0106FE 04:86EE: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010701 04:86F1: F0 5D     BEQ bra_8750_RTS
bra_86F3:
C - - - - - 0x010703 04:86F3: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x010705 04:86F5: 4A        LSR
C - - - - - 0x010706 04:86F6: 90 58     BCC bra_8750_RTS
C - - - - - 0x010708 04:86F8: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x01070B 04:86FB: D0 53     BNE bra_8750_RTS
C - - - - - 0x01070D 04:86FD: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010710 04:8700: 0A        ASL
C - - - - - 0x010711 04:8701: A8        TAY
C - - - - - 0x010712 04:8702: B9 54 87  LDA tbl_8754,Y
C - - - - - 0x010715 04:8705: 85 08     STA ram_0008
C - - - - - 0x010717 04:8707: B9 55 87  LDA tbl_8754 + $01,Y
C - - - - - 0x01071A 04:870A: 20 A8 85  JSR sub_85A8
C - - - - - 0x01071D 04:870D: FE 1E 07  INC ram_флаги_объектов,X
C - - - - - 0x010720 04:8710: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010723 04:8713: C9 04     CMP #$04
C - - - - - 0x010725 04:8715: A9 06     LDA #$06
C - - - - - 0x010727 04:8717: 90 07     BCC bra_8720
C - - - - - 0x010729 04:8719: A9 00     LDA #$00
C - - - - - 0x01072B 04:871B: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x01072E 04:871E: A9 50     LDA #$50
bra_8720:
C - - - - - 0x010730 04:8720: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x010733 04:8723: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010736 04:8726: C9 02     CMP #$02
C - - - - - 0x010738 04:8728: D0 26     BNE bra_8750_RTS
C - - - - - 0x01073A 04:872A: A9 02     LDA #$02
C - - - - - 0x01073C 04:872C: 85 08     STA ram_0008
bra_872E_loop:
C - - - - - 0x01073E 04:872E: A0 35     LDY #con_obj_id_26  ; красный летающий шип
C - - - - - 0x010740 04:8730: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x010743 04:8733: 90 1B     BCC bra_8750_RTS
C - - - - - 0x010745 04:8735: A4 08     LDY ram_0008
C - - - - - 0x010747 04:8737: B9 51 87  LDA tbl_8751_позиция_X,Y
C - - - - - 0x01074A 04:873A: 18        CLC
C - - - - - 0x01074B 04:873B: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01074E 04:873E: A4 11     LDY ram_0011
C - - - - - 0x010750 04:8740: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x010753 04:8743: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010756 04:8746: 18        CLC
C - - - - - 0x010757 04:8747: 69 12     ADC #$12
C - - - - - 0x010759 04:8749: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x01075C 04:874C: C6 08     DEC ram_0008
C - - - - - 0x01075E 04:874E: 10 DE     BPL bra_872E_loop
bra_8750_RTS:
C - - - - - 0x010760 04:8750: 60        RTS

tbl_8751_позиция_X:
- D 0 - - - 0x010761 04:8751: E0        .byte $E0   ; 00 
- D 0 - - - 0x010762 04:8752: 00        .byte $00   ; 01 
- D 0 - - - 0x010763 04:8753: 20        .byte $20   ; 02

tbl_8754:
- D 0 - - - 0x010764 04:8754: 7A 87     .word off_877A_00
- D 0 - - - 0x010766 04:8756: 98 87     .word off_8798_01
- D 0 - - - 0x010768 04:8758: 7A 87     .word off_877A_02
- D 0 - - - 0x01076A 04:875A: 5C 87     .word off_875C_03

; _________________________________________________________________________________________________________________

off_875C_03:
- D 0 - I - 0x01076C 04:875C: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x01076D 04:875D: 22 8A     .dbyt $228A ; ppu address
- D 0 - I - 0x01076F 04:875F: 0C        .byte $0C   ; counter
- D 0 - I - 0x010770 04:8760: 53        .byte $53, $54, $55, $56, $53, $54, $55, $56, $53, $54, $55, $56   ; tiles

- D 0 - I - 0x01077C 04:876C: 22 AB     .dbyt $22AB ; ppu address
- D 0 - I - 0x01077E 04:876E: 0A        .byte $0A   ; counter
- D 0 - I - 0x01077F 04:876F: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00   ; tiles

- D 0 - I - 0x010789 04:8779: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_877A_00:
off_877A_02:
- D 0 - I - 0x01078A 04:877A: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x01078B 04:877B: 22 8A     .dbyt $228A ; ppu address
- D 0 - I - 0x01078D 04:877D: 0C        .byte $0C   ; counter
- D 0 - I - 0x01078E 04:877E: 57        .byte $57, $58, $59, $5A, $57, $58, $59, $5A, $57, $58, $59, $5A   ; tiles

- D 0 - I - 0x01079A 04:878A: 22 AB     .dbyt $22AB ; ppu address
- D 0 - I - 0x01079C 04:878C: 0A        .byte $0A   ; counter
- D 0 - I - 0x01079D 04:878D: 5B        .byte $5B, $5C, $00, $00, $5B, $5C, $00, $00, $5B, $5C   ; tiles

- D 0 - I - 0x0107A7 04:8797: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_8798_01:
- D 0 - I - 0x0107A8 04:8798: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x0107A9 04:8799: 22 8A     .dbyt $228A ; ppu address
- D 0 - I - 0x0107AB 04:879B: 0C        .byte $0C   ; counter
- D 0 - I - 0x0107AC 04:879C: 5D        .byte $5D, $5E, $5F, $60, $5D, $5E, $5F, $60, $5E, $5D, $5F, $60   ; tiles

- D 0 - I - 0x0107B8 04:87A8: 22 AB     .dbyt $22AB ; ppu address
- D 0 - I - 0x0107BA 04:87AA: 0A        .byte $0A   ; counter
- D 0 - I - 0x0107BB 04:87AB: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00   ; tiles

- D 0 - I - 0x0107C5 04:87B5: FF        .byte $FF   ; end token

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_87B6:
                                        LDY ram_0764_obj,X
                                        LDA tbl_87BC_lo,y
                                        STA ram_0000
                                        LDA tbl_87BD_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_87BC_lo:
- D 0 - I - 0x0107CC 04:87BC: C4 87     .byte < ofs_028_87C4_00
- D 0 - I - 0x0107CE 04:87BE: E8 87     .byte < ofs_028_87E8_01
- D 0 - I - 0x0107D0 04:87C0: F3 87     .byte < ofs_028_87F3_02
- D 0 - I - 0x0107D2 04:87C2: 06 88     .byte < ofs_028_8806_03
tbl_87BD_hi:
- D 0 - I - 0x0107CC 04:87BC: C4 87     .byte > ofs_028_87C4_00
- D 0 - I - 0x0107CE 04:87BE: E8 87     .byte > ofs_028_87E8_01
- D 0 - I - 0x0107D0 04:87C0: F3 87     .byte > ofs_028_87F3_02
- D 0 - I - 0x0107D2 04:87C2: 06 88     .byte > ofs_028_8806_03

; _________________________________________________________________________________________________________________

ofs_028_87C4_00:
C - - J - - 0x0107D4 04:87C4: BD 8E 07  LDA ram_позиция_объектов_Y_старш,X
C - - - - - 0x0107D7 04:87C7: D0 29     BNE bra_87F2_RTS
C - - - - - 0x0107D9 04:87C9: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0107DC 04:87CC: C9 48     CMP #$48
C - - - - - 0x0107DE 04:87CE: 90 22     BCC bra_87F2_RTS
C - - - - - 0x0107E0 04:87D0: A9 F0     LDA #$F0
C - - - - - 0x0107E2 04:87D2: 20 FF 87  JSR sub_87FF
C - - - - - 0x0107E5 04:87D5: A9 20     LDA #$20
C - - - - - 0x0107E7 04:87D7: 20 99 AB  JSR sub_0x006BA9_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x0107EA 04:87DA: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0107ED 04:87DD: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0107F0 04:87E0: FE 80 07  INC ram_0780_obj,X
C - - - - - 0x0107F3 04:87E3: A0 02     LDY #$02
C - - - - - 0x0107F5 04:87E5: 4C F9 84  JMP loc_84F9

; _________________________________________________________________________________________________________________

ofs_028_87E8_01:
C - - J - - 0x0107F8 04:87E8: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x0107FA 04:87EA: 4A        LSR
C - - - - - 0x0107FB 04:87EB: B0 05     BCS bra_87F2_RTS
C - - - - - 0x0107FD 04:87ED: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x010800 04:87F0: F0 10     BEQ bra_8802
bra_87F2_RTS:
C - - - - - 0x010802 04:87F2: 60        RTS

; _________________________________________________________________________________________________________________

ofs_028_87F3_02:
C - - J - - 0x010803 04:87F3: A9 01     LDA #$01
C - - - - - 0x010805 04:87F5: 20 1D 88  JSR sub_881D
C - - - - - 0x010808 04:87F8: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01080B 04:87FB: C9 A4     CMP #$A4
C - - - - - 0x01080D 04:87FD: 90 F3     BCC bra_87F2_RTS
sub_87FF:
C - - - - - 0x01080F 04:87FF: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_8802:
C - - - - - 0x010812 04:8802: FE 64 07  INC ram_0764_obj,X
C - - - - - 0x010815 04:8805: 60        RTS

; _________________________________________________________________________________________________________________

ofs_028_8806_03:
C - - J - - 0x010816 04:8806: A9 FF     LDA #$FF
C - - - - - 0x010818 04:8808: 20 1D 88  JSR sub_881D
C - - - - - 0x01081B 04:880B: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01081E 04:880E: C9 48     CMP #$48
C - - - - - 0x010820 04:8810: B0 E0     BCS bra_87F2_RTS
C - - - - - 0x010822 04:8812: A9 F0     LDA #$F0
C - - - - - 0x010824 04:8814: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x010827 04:8817: A9 01     LDA #$01
C - - - - - 0x010829 04:8819: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x01082C 04:881C: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_881D:
C - - - - - 0x01082D 04:881D: 85 00     STA ram_0000
C - - - - - 0x01082F 04:881F: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x010832 04:8822: 18        CLC
C - - - - - 0x010833 04:8823: 65 00     ADC ram_0000
C - - - - - 0x010835 04:8825: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x010838 04:8828: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01083B 04:882B: 18        CLC
C - - - - - 0x01083C 04:882C: 65 00     ADC ram_0000
C - - - - - 0x01083E 04:882E: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
bra_8831_RTS:
C - - - - - 0x010841 04:8831: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8832:
C - - - - - 0x010842 04:8832: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010845 04:8835: C9 90     CMP #$90
C - - - - - 0x010847 04:8837: B0 F8     BCS bra_8831_RTS
sub_8839:
C - - - - - 0x010849 04:8839: 20 5D A7  JSR sub_0x00676D
C - - - - - 0x01084C 04:883C: 4C 0A AA  JMP loc_0x006A1A

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x01030C_45_босс_5_ползающий_черепок:
- D 0 - I - 0x01030C 04:82FC: 08 83     .word ofs_038_45_8308_01_активация_объекта ; 
- D 0 - I - 0x01030E 04:82FE: 39 83     .word ofs_038_45_8339_02 ; 
- D 0 - I - 0x010310 04:8300: 8C 83     .word ofs_038_45_838C_03 ; 
- D 0 - I - 0x010312 04:8302: 9A A2     .word ofs_038_45_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x010314 04:8304: FD A2     .word ofs_038_45_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x010316 04:8306: 3D A3     .word ofs_038_45_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_45_8308_01_активация_объекта:
C - - J - - 0x010318 04:8308: A9 02     LDA #$02
C - - - - - 0x01031A 04:830A: A0 06     LDY #$06
C - - - - - 0x01031C 04:830C: 20 9B AB  JSR sub_0x006BAB_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x01031F 04:830F: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010322 04:8312: 0A        ASL
C - - - - - 0x010323 04:8313: A8        TAY
C - - - - - 0x010324 04:8314: B9 35 83  LDA tbl_8335_скорость_X,Y
C - - - - - 0x010327 04:8317: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x01032A 04:831A: B9 36 83  LDA tbl_8335_скорость_X + $01,Y
C - - - - - 0x01032D 04:831D: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x010330 04:8320: A9 C0     LDA #< $FEC0
C - - - - - 0x010332 04:8322: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x010335 04:8325: A9 FE     LDA #> $FEC0
C - - - - - 0x010337 04:8327: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x01033A 04:832A: 20 94 83  JSR sub_8394
C - - - - - 0x01033D 04:832D: 09 20     ORA #$20
C - - - - - 0x01033F 04:832F: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x010342 04:8332: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_8335_скорость_X:
- D 0 - - - 0x010345 04:8335: 80 00     .word $0080 ; 00 
- D 0 - - - 0x010347 04:8337: 80 FF     .word $FF80 ; 01 

; ******************************************************************************************************************

ofs_038_45_8339_02:
C - - J - - 0x010349 04:8339: A0 0B     LDY #$0B
C - - - - - 0x01034B 04:833B: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x01034E 04:833E: A9 14     LDA #$14
C - - - - - 0x010350 04:8340: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_Y
C - - - - - 0x010353 04:8343: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x010356 04:8346: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010359 04:8349: C9 10     CMP #$10
C - - - - - 0x01035B 04:834B: 90 04     BCC bra_8351
C - - - - - 0x01035D 04:834D: C9 F0     CMP #$F0
C - - - - - 0x01035F 04:834F: 90 03     BCC bra_8354
bra_8351:
C - - - - - 0x010361 04:8351: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
bra_8354:
C - - - - - 0x010364 04:8354: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010367 04:8357: C9 A0     CMP #$A0
C - - - - - 0x010369 04:8359: 90 03     BCC bra_835E
C - - - - - 0x01036B 04:835B: 20 94 83  JSR sub_8394
bra_835E:
C - - - - - 0x01036E 04:835E: A9 08     LDA #$08
C - - - - - 0x010370 04:8360: 20 05 A8  JSR sub_0x006815_проверить_есть_или_нет_преграда_на_пути_если_объект_падает
C - - - - - 0x010373 04:8363: F0 22     BEQ bra_8387_RTS
C - - - - - 0x010375 04:8365: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
C - - - - - 0x010378 04:8368: 20 CA A7  JSR sub_0x0067DA_очистить_скорость_Y
C - - - - - 0x01037B 04:836B: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x01037E 04:836E: 0A        ASL
C - - - - - 0x01037F 04:836F: A8        TAY
C - - - - - 0x010380 04:8370: B9 88 83  LDA tbl_8388_скорость_X,Y
C - - - - - 0x010383 04:8373: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x010386 04:8376: B9 89 83  LDA tbl_8388_скорость_X + $01,Y
C - - - - - 0x010389 04:8379: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x01038C 04:837C: 20 94 83  JSR sub_8394
C - - - - - 0x01038F 04:837F: A9 01     LDA #$01
C - - - - - 0x010391 04:8381: 9D 76 06  STA ram_жизни_объектов_8bit,X
C - - - - - 0x010394 04:8384: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8387_RTS:
C - - - - - 0x010397 04:8387: 60        RTS

tbl_8388_скорость_X:
- D 0 - - - 0x010398 04:8388: C0 FE     .word $FEC0 ; 00 
- D 0 - - - 0x01039A 04:838A: 40 01     .word $0140 ; 01 

; ******************************************************************************************************************

ofs_038_45_838C_03:
C - - J - - 0x01039C 04:838C: A0 0B     LDY #$0B
C - - - - - 0x01039E 04:838E: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x0103A1 04:8391: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8394:
C - - - - - 0x0103A4 04:8394: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x0103A7 04:8397: 1D BC 06  ORA ram_скорость_объектов_x_младш,X
C - - - - - 0x0103AA 04:839A: F0 0C     BEQ bra_83A8_RTS
C - - - - - 0x0103AC 04:839C: A9 02     LDA #$02
C - - - - - 0x0103AE 04:839E: BC CA 06  LDY ram_скорость_объектов_X_старш,X
C - - - - - 0x0103B1 04:83A1: 30 02     BMI bra_83A5
C - - - - - 0x0103B3 04:83A3: A9 42     LDA #$42
bra_83A5:
C - - - - - 0x0103B5 04:83A5: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
bra_83A8_RTS:
C - - - - - 0x0103B8 04:83A8: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0103B9_26_босс_5_летающие_шипы:
- D 0 - I - 0x0103B9 04:83A9: B7 83     .word ofs_038_26_83B7_01_активация_объекта ; 
- D 0 - I - 0x0103BB 04:83AB: CB 83     .word ofs_038_26_83CB_02 ; 
- D 0 - I - 0x0103BD 04:83AD: F1 83     .word ofs_038_26_83F1_03 ; 
- D 0 - I - 0x0103BF 04:83AF: 06 84     .word ofs_038_26_8406_04 ; 
- D 0 - I - 0x0103C1 04:83B1: 9A A2     .word ofs_038_26_0x0062AA_05_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x0103C3 04:83B3: FD A2     .word ofs_038_26_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x0103C5 04:83B5: 3D A3     .word ofs_038_26_0x00628A_07_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_26_83B7_01_активация_объекта:
C - - J - - 0x0103C7 04:83B7: A9 22     LDA #$22
C - - - - - 0x0103C9 04:83B9: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0103CC 04:83BC: A9 00     LDA #< $0200
C - - - - - 0x0103CE 04:83BE: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0103D1 04:83C1: A9 02     LDA #> $0200
C - - - - - 0x0103D3 04:83C3: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0103D6 04:83C6: A9 0A     LDA #$0A    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_26_83CB_02:
C - - J - - 0x0103DB 04:83CB: A0 0A     LDY #$0A
C - - - - - 0x0103DD 04:83CD: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x0103E0 04:83D0: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x0103E3 04:83D3: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0103E6 04:83D6: D0 14     BNE bra_83EC_RTS
C - - - - - 0x0103E8 04:83D8: A9 02     LDA #$02
C - - - - - 0x0103EA 04:83DA: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0103ED 04:83DD: A5 23     LDA ram_рандом_байт
C - - - - - 0x0103EF 04:83DF: 65 1B     ADC ram_счетчик_кадров
C - - - - - 0x0103F1 04:83E1: 85 23     STA ram_рандом_байт
C - - - - - 0x0103F3 04:83E3: 29 03     AND #$03
C - - - - - 0x0103F5 04:83E5: A8        TAY
C - - - - - 0x0103F6 04:83E6: B9 ED 83  LDA tbl_83ED_счетчики,Y
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_83EC_RTS:
C - - - - - 0x0103FC 04:83EC: 60        RTS

tbl_83ED_счетчики:
- D 0 - - - 0x0103FD 04:83ED: 40        .byte $40   ; 00 
- D 0 - - - 0x0103FE 04:83EE: 60        .byte $60   ; 01 
- D 0 - - - 0x0103FF 04:83EF: 70        .byte $70   ; 02 
- D 0 - - - 0x010400 04:83F0: 50        .byte $50   ; 03 

; ******************************************************************************************************************

ofs_038_26_83F1_03:
C - - J - - 0x010401 04:83F1: A0 0A     LDY #$0A
C - - - - - 0x010403 04:83F3: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x010406 04:83F6: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x010409 04:83F9: D0 F1     BNE bra_83EC_RTS
C - - - - - 0x01040B 04:83FB: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x01040E 04:83FE: A0 02     LDY #$02
C - - - - - 0x010410 04:8400: 20 57 A9  JSR sub_0x006967
C - - - - - 0x010413 04:8403: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_26_8406_04:
C - - J - - 0x010416 04:8406: A0 0A     LDY #$0A
C - - - - - 0x010418 04:8408: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x01041B 04:840B: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x01041E 04:840E: A9 00     LDA #$00
C - - - - - 0x010420 04:8410: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x010423 04:8413: F0 D7     BEQ bra_83EC_RTS
C - - - - - 0x010425 04:8415: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0111B7_4B_красный_шип_автоспавн:
- D 0 - I - 0x0111B7 04:91A7: B5 91     .word ofs_038_4B_91B5_01_активация_объекта ; 
- D 0 - I - 0x0111B9 04:91A9: C9 91     .word ofs_038_4B_91C9_02 ; 
- D 0 - I - 0x0111BB 04:91AB: 05 92     .word ofs_038_4B_9205_03 ; 
- D 0 - I - 0x0111BD 04:91AD: 7A 92     .word ofs_038_4B_927A_04 ; 
- D 0 - I - 0x0111BF 04:91AF: 97 92     .word ofs_038_4B_9297_05 ; 
- D 0 - I - 0x0111C1 04:91B1: 9D 92     .word ofs_038_4B_929D_06 ; 
- D 0 - I - 0x0111C3 04:91B3: A3 92     .word ofs_038_4B_92A3_07 ; 

; ******************************************************************************************************************

ofs_038_4B_91B5_01_активация_объекта:
C - - J - - 0x0111C5 04:91B5: A9 81     LDA #$81
C - - - - - 0x0111C7 04:91B7: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0111CA 04:91BA: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0111CD 04:91BD: 18        CLC
C - - - - - 0x0111CE 04:91BE: 69 08     ADC #$08
C - - - - - 0x0111D0 04:91C0: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0111D3 04:91C3: 20 C5 92  JSR sub_92C5
C - - - - - 0x0111D6 04:91C6: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_4B_91C9_02:
C - - J - - 0x0111D9 04:91C9: A9 01     LDA #$01
C - - - - - 0x0111DB 04:91CB: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0111DE 04:91CE: 20 C5 92  JSR sub_92C5
C - - - - - 0x0111E1 04:91D1: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0111E4 04:91D4: C9 10     CMP #$10
C - - - - - 0x0111E6 04:91D6: 90 2A     BCC bra_9202_RTS
C - - - - - 0x0111E8 04:91D8: C9 FF     CMP #$FF
C - - - - - 0x0111EA 04:91DA: D0 03     BNE bra_91DF
C - - - - - 0x0111EC 04:91DC: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_91DF:
C - - - - - 0x0111EF 04:91DF: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0111F2 04:91E2: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0111F5 04:91E5: 29 01     AND #$01
C - - - - - 0x0111F7 04:91E7: A8        TAY
C - - - - - 0x0111F8 04:91E8: B9 03 92  LDA tbl_9203_позиция_X,Y
C - - - - - 0x0111FB 04:91EB: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
                                        LDA #$01    ; кол-во HP
                                        JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x0111FE 04:91EE: A9 00     LDA #$00
C - - - - - 0x011200 04:91F0: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x011203 04:91F3: A9 00     LDA #$00
C - - - - - 0x011205 04:91F5: 9D 3A 07  STA ram_хитбоксы_объектов,X
C - - - - - 0x011208 04:91F8: A0 0D     LDY #$0D
C - - - - - 0x01120A 04:91FA: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x01120D 04:91FD: A9 32     LDA #$32    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_9202_RTS:
C - - - - - 0x011212 04:9202: 60        RTS

tbl_9203_позиция_X:
- D 0 - - - 0x011213 04:9203: E0        .byte $E0   ; 00 справа
- D 0 - - - 0x011214 04:9204: 20        .byte $20   ; 01 слева

; ******************************************************************************************************************

ofs_038_4B_9205_03:
C - - J - - 0x011215 04:9205: A0 0D     LDY #$0D
C - - - - - 0x011217 04:9207: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x01121A 04:920A: 20 C5 92  JSR sub_92C5
C - - - - - 0x01121D 04:920D: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011220 04:9210: D0 F0     BNE bra_9202_RTS
C - - - - - 0x011222 04:9212: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x011225 04:9215: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011228 04:9218: 38        SEC
C - - - - - 0x011229 04:9219: F9 32 05  SBC ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x01122C 04:921C: A0 00     LDY #$00
C - - - - - 0x01122E 04:921E: 90 02     BCC bra_9222
C - - - - - 0x011230 04:9220: A0 04     LDY #$04
bra_9222:
C - - - - - 0x011232 04:9222: B0 04     BCS bra_9228
C - - - - - 0x011234 04:9224: 49 FF     EOR #$FF
C - - - - - 0x011236 04:9226: 69 01     ADC #$01
bra_9228:
C - - - - - 0x011238 04:9228: C9 20     CMP #$20
C - - - - - 0x01123A 04:922A: B0 02     BCS bra_922E
C - - - - - 0x01123C 04:922C: A0 02     LDY #$02
bra_922E:
C - - - - - 0x01123E 04:922E: A5 72     LDA ram_скорость_камеры_Y
C - - - - - 0x011240 04:9230: F0 02     BEQ bra_9234
C - - - - - 0x011242 04:9232: C8        INY
C - - - - - 0x011243 04:9233: C8        INY
bra_9234:
C - - - - - 0x011244 04:9234: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x011247 04:9237: 4A        LSR
C - - - - - 0x011248 04:9238: 90 01     BCC bra_923B
C - - - - - 0x01124A 04:923A: C8        INY
bra_923B:
C - - - - - 0x01124B 04:923B: 98        TYA
C - - - - - 0x01124C 04:923C: 0A        ASL
C - - - - - 0x01124D 04:923D: 0A        ASL
C - - - - - 0x01124E 04:923E: A8        TAY
C - - - - - 0x01124F 04:923F: B9 5A 92  LDA tbl_925A_скорость,Y
C - - - - - 0x011252 04:9242: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x011255 04:9245: B9 5B 92  LDA tbl_925A_скорость + $01,Y
C - - - - - 0x011258 04:9248: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x01125B 04:924B: B9 5C 92  LDA tbl_925A_скорость + $02,Y
C - - - - - 0x01125E 04:924E: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x011261 04:9251: B9 5D 92  LDA tbl_925A_скорость + $03,Y
C - - - - - 0x011264 04:9254: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x011267 04:9257: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_925A_скорость:
; 00 
- D 0 - - - 0x01126A 04:925A: 81 00     .word $0081 ; Y
- D 0 - - - 0x01126C 04:925C: A6 FE     .word $FEA6 ; X
; 01 
- D 0 - - - 0x01126E 04:925E: 81 00     .word $0081 ; Y
- D 0 - - - 0x011270 04:9260: 5A 01     .word $015A ; X
; 02 
- D 0 - - - 0x011272 04:9262: 00 00     .word $0000 ; Y
- D 0 - - - 0x011274 04:9264: 80 FE     .word $FE80 ; X
; 03 
- D 0 - - - 0x011276 04:9266: 00 00     .word $0000 ; Y
- D 0 - - - 0x011278 04:9268: 80 01     .word $0180 ; X
; 04 
- D 0 - - - 0x01127A 04:926A: 7F FF     .word $FF7F ; Y
- D 0 - - - 0x01127C 04:926C: A6 FE     .word $FEA6 ; X
; 05 
- D 0 - - - 0x01127E 04:926E: 7F FF     .word $FF7F ; Y
- D 0 - - - 0x011280 04:9270: 5A 01     .word $015A ; X
; 06 
- D 0 - - - 0x011282 04:9272: 7F FF     .word $FF7F ; Y
- D 0 - - - 0x011284 04:9274: A6 FE     .word $FEA6 ; X
; 07 
- D 0 - - - 0x011286 04:9276: 7F FF     .word $FF7F ; Y
- D 0 - - - 0x011288 04:9278: 5A 01     .word $015A ; X

; ******************************************************************************************************************

ofs_038_4B_927A_04:
C - - J - - 0x01128A 04:927A: A0 0D     LDY #$0D
C - - - - - 0x01128C 04:927C: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x01128F 04:927F: 20 AF 92  JSR sub_92AF
C - - - - - 0x011292 04:9282: 20 6F 93  JSR sub_936F
C - - - - - 0x011295 04:9285: 10 0F     BPL bra_9296_RTS
bra_9287:
sub_9287:
C - - - - - 0x011297 04:9287: A0 60     LDY #con_obj_id_4B
C - - - - - 0x011299 04:9289: 20 9E F7  JSR sub_0x01F7AE_записать_ID_объекта_и_его_хитбокс
C - - - - - 0x01129C 04:928C: A9 02     LDA #$02
C - - - - - 0x01129E 04:928E: 9D 68 06  STA ram_состояние_объектов_для_обработчика,X
C - - - - - 0x0112A1 04:9291: A9 00     LDA #$00
C - - - - - 0x0112A3 04:9293: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
bra_9296_RTS:
C - - - - - 0x0112A6 04:9296: 60        RTS

; ******************************************************************************************************************

ofs_038_4B_9297_05:
C - - J - - 0x0112A7 04:9297: 20 9A A2  JSR sub_0x0062AA_обработка_состояния_смерти_объекта
C - - - - - 0x0112AA 04:929A: 4C A6 92  JMP loc_92A6

; ******************************************************************************************************************

ofs_038_4B_929D_06:
C - - J - - 0x0112AD 04:929D: 20 FD A2  JSR sub_0x00630D_обработка_анимации_взрыва_объекта
C - - - - - 0x0112B0 04:92A0: 4C A6 92  JMP loc_92A6

; ******************************************************************************************************************

ofs_038_4B_92A3_07:
C - - J - - 0x0112B3 04:92A3: 20 3D A3  JSR sub_0x00628A_удалить_объект
loc_92A6:
C D 0 - - - 0x0112B6 04:92A6: 20 D5 92  JSR sub_92D5
C - - - - - 0x0112B9 04:92A9: BD 68 06  LDA ram_состояние_объектов_для_обработчика,X
C - - - - - 0x0112BC 04:92AC: F0 D9     BEQ bra_9287
C - - - - - 0x0112BE 04:92AE: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_92AF:
C - - - - - 0x0112BF 04:92AF: 20 ED A6  JSR sub_0x0066FD_обработка_позиции_X_объекта_от_скорости
C - - - - - 0x0112C2 04:92B2: BD 84 06  LDA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x0112C5 04:92B5: 18        CLC
C - - - - - 0x0112C6 04:92B6: 7D A0 06  ADC ram_скорость_объектов_y_младш,X
C - - - - - 0x0112C9 04:92B9: 9D 84 06  STA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x0112CC 04:92BC: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0112CF 04:92BF: 7D AE 06  ADC ram_скорость_объектов_Y_старш,X
C - - - - - 0x0112D2 04:92C2: 4C C8 92  JMP loc_92C8

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_92C5:
C - - - - - 0x0112D5 04:92C5: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
loc_92C8:
C D 0 - - - 0x0112D8 04:92C8: 38        SEC
C - - - - - 0x0112D9 04:92C9: E5 72     SBC ram_скорость_камеры_Y
C - - - - - 0x0112DB 04:92CB: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0112DE 04:92CE: C9 E8     CMP #$E8
C - - - - - 0x0112E0 04:92D0: 90 03     BCC bra_92D5
C - - - - - 0x0112E2 04:92D2: 20 87 92  JSR sub_9287
bra_92D5:
sub_92D5:
C - - - - - 0x0112E5 04:92D5: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0112E8 04:92D8: C9 FF     CMP #$FF
C - - - - - 0x0112EA 04:92DA: F0 BA     BEQ bra_9296_RTS
C - - - - - 0x0112EC 04:92DC: 38        SEC
C - - - - - 0x0112ED 04:92DD: E5 72     SBC ram_скорость_камеры_Y
C - - - - - 0x0112EF 04:92DF: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0112F2 04:92E2: C9 E0     CMP #$E0
C - - - - - 0x0112F4 04:92E4: 90 B0     BCC bra_9296_RTS
C - - - - - 0x0112F6 04:92E6: A9 FF     LDA #$FF
C - - - - - 0x0112F8 04:92E8: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0112FB 04:92EB: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0112FC_4C_босс_6_шип_с_автонаводкой:
- D 0 - I - 0x0112FC 04:92EC: F6 92     .word ofs_038_4C_92F6_01_активация_объекта ; 
- D 0 - I - 0x0112FE 04:92EE: 05 93     .word ofs_038_4C_9305_02 ; 
- D 0 - I - 0x011300 04:92F0: 9A A2     .word ofs_038_4C_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x011302 04:92F2: FD A2     .word ofs_038_4C_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x011304 04:92F4: 3D A3     .word ofs_038_4C_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_4C_92F6_01_активация_объекта:
C - - J - - 0x011306 04:92F6: A9 06     LDA #$06
C - - - - - 0x011308 04:92F8: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x01130B 04:92FB: A9 01     LDA #$01
C - - - - - 0x01130D 04:92FD: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x011310 04:9300: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_4C_9305_02:
C - - J - - 0x011315 04:9305: A0 0D     LDY #$0D
C - - - - - 0x011317 04:9307: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x01131A 04:930A: 20 23 93  JSR sub_9323
C - - - - - 0x01131D 04:930D: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x011320 04:9310: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011323 04:9313: D0 0D     BNE bra_9322_RTS
C - - - - - 0x011325 04:9315: A9 18     LDA #$18
C - - - - - 0x011327 04:9317: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x01132A 04:931A: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x01132D 04:931D: A0 01     LDY #$01
C - - - - - 0x01132F 04:931F: 4C 23 A9  JMP loc_0x006933
bra_9322_RTS:
C - - - - - 0x011332 04:9322: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9323:
C - - - - - 0x011333 04:9323: A9 08     LDA #$08
C - - - - - 0x011335 04:9325: BC CA 06  LDY ram_скорость_объектов_X_старш,X
C - - - - - 0x011338 04:9328: 10 02     BPL bra_932C
C - - - - - 0x01133A 04:932A: A9 F8     LDA #$F8
bra_932C:
C - - - - - 0x01133C 04:932C: 18        CLC
C - - - - - 0x01133D 04:932D: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011340 04:9330: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011343 04:9333: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x011346 04:9336: C9 02     CMP #$02
C - - - - - 0x011348 04:9338: B0 07     BCS bra_9341
C - - - - - 0x01134A 04:933A: A9 02     LDA #$02
C - - - - - 0x01134C 04:933C: 20 71 93  JSR sub_9371
C - - - - - 0x01134F 04:933F: 10 08     BPL bra_9349
bra_9341:
C - - - - - 0x011351 04:9341: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
C - - - - - 0x011354 04:9344: A9 01     LDA #$01
C - - - - - 0x011356 04:9346: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_9349:
C - - - - - 0x011359 04:9349: A9 08     LDA #$08
C - - - - - 0x01135B 04:934B: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x01135E 04:934E: 10 02     BPL bra_9352
C - - - - - 0x011360 04:9350: A9 F8     LDA #$F8
bra_9352:
C - - - - - 0x011362 04:9352: 18        CLC
C - - - - - 0x011363 04:9353: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011366 04:9356: A8        TAY
C - - - - - 0x011367 04:9357: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01136A 04:935A: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x01136D 04:935D: C9 02     CMP #$02
C - - - - - 0x01136F 04:935F: B0 05     BCS bra_9366
C - - - - - 0x011371 04:9361: 20 89 93  JSR sub_9389
C - - - - - 0x011374 04:9364: 10 08     BPL bra_936E_RTS
bra_9366:
C - - - - - 0x011376 04:9366: 20 CA A7  JSR sub_0x0067DA_очистить_скорость_Y
C - - - - - 0x011379 04:9369: A9 01     LDA #$01
C - - - - - 0x01137B 04:936B: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_936E_RTS:
C - - - - - 0x01137E 04:936E: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_936F:
C - - - - - 0x01137F 04:936F: A9 00     LDA #$00
sub_9371:
C - - - - - 0x011381 04:9371: 85 08     STA ram_0008
C - - - - - 0x011383 04:9373: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x011386 04:9376: 2A        ROL
C - - - - - 0x011387 04:9377: 2A        ROL
C - - - - - 0x011388 04:9378: 29 01     AND #$01
C - - - - - 0x01138A 04:937A: 18        CLC
C - - - - - 0x01138B 04:937B: 65 08     ADC ram_0008
C - - - - - 0x01138D 04:937D: A8        TAY
C - - - - - 0x01138E 04:937E: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011391 04:9381: D9 9C 93  CMP tbl_939C_позиция_X,Y
C - - - - - 0x011394 04:9384: 6A        ROR
C - - - - - 0x011395 04:9385: 5D CA 06  EOR ram_скорость_объектов_X_старш,X
C - - - - - 0x011398 04:9388: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9389:
C - - - - - 0x011399 04:9389: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x01139C 04:938C: 2A        ROL
C - - - - - 0x01139D 04:938D: 2A        ROL
C - - - - - 0x01139E 04:938E: 29 01     AND #$01
C - - - - - 0x0113A0 04:9390: A8        TAY
C - - - - - 0x0113A1 04:9391: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0113A4 04:9394: D9 A0 93  CMP tbl_93A0_позиция_Y,Y
C - - - - - 0x0113A7 04:9397: 6A        ROR
C - - - - - 0x0113A8 04:9398: 5D AE 06  EOR ram_скорость_объектов_Y_старш,X
C - - - - - 0x0113AB 04:939B: 60        RTS

tbl_939C_позиция_X:
;                                              +---------- 
;                                              |    +----- 
;                                              |    |
- D 0 - - - 0x0113AC 04:939C: E0        .byte $E0, $20   ; 00 
- D 0 - - - 0x0113AE 04:939E: F8        .byte $F8, $08   ; 02 

tbl_93A0_позиция_Y:
- D 0 - - - 0x0113B0 04:93A0: D0        .byte $D0   ; 00 
- D 0 - - - 0x0113B1 04:93A1: 18        .byte $18   ; 01 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0113B2_5A_босс_6_дыра_автоспавнер_шипов:
- D 0 - I - 0x0113B2 04:93A2: A8 93     .word ofs_038_5A_93A8_01_аткивация_объекта ; 
- D 0 - I - 0x0113B4 04:93A4: B0 93     .word ofs_038_5A_93B0_02 ; 
- D 0 - I - 0x0113B6 04:93A6: 75 A2     .word ofs_038_5A_0x00628A_03_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_5A_93A8_01_аткивация_объекта:
C - - J - - 0x0113B8 04:93A8: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0113BB 04:93AB: A9 70     LDA #$70    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_5A_93B0_02:
C - - J - - 0x0113C0 04:93B0: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0113C3 04:93B3: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0113C6 04:93B6: D0 11     BNE bra_93C9_RTS
C - - - - - 0x0113C8 04:93B8: A0 61     LDY #con_obj_id_4C  ; красный шип
C - - - - - 0x0113CA 04:93BA: 84 17     STY ram_0017
C - - - - - 0x0113CC 04:93BC: A2 05     LDX #$05
C - - - - - 0x0113CE 04:93BE: 20 08 F7  JSR sub_0x01F718_попытка_найти_свободный_слот_для_объекта_X_слотов
C - - - - - 0x0113D1 04:93C1: 20 CD AB  JSR sub_0x00ABCD_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0113D4 04:93C4: A9 F0     LDA #$F0
C - - - - - 0x0113D6 04:93C6: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_93C9_RTS:
C - - - - - 0x0113D9 04:93C9: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x011838_4F_босс_6_фаза_1_пасть:
- D 0 - I - 0x011838 04:9828: 3A 98     .word ofs_038_4F_983A_01_активация_объекта ; 
- D 0 - I - 0x01183A 04:982A: 4C 98     .word ofs_038_4F_984C_02 ; 
- D 0 - I - 0x01183C 04:982C: 6F 98     .word ofs_038_4F_986F_03 ; 
- D 0 - I - 0x01183E 04:982E: 7E 98     .word ofs_038_4F_987E_04 ; 
- D 0 - I - 0x011840 04:9830: D1 98     .word ofs_038_4F_A3B8_05_установить_статус_уничтожения_босса_и_убить_все_объекты ; 
- D 0 - I - 0x011842 04:9832: D4 98     .word ofs_038_4F_98D4_06 ; 
- D 0 - I - 0x011844 04:9834: DC 98     .word ofs_038_4F_98DC_07 ; 
- D 0 - I - 0x011846 04:9836: F6 A2     .word ofs_038_4F_0x006306_08 ; 
- D 0 - I - 0x011848 04:9838: EF 98     .word ofs_038_4F_98EF_09 ; 

; ******************************************************************************************************************

ofs_038_4F_983A_01_активация_объекта:
C - - J - - 0x01184A 04:983A: A9 F0     LDA #con_HP_F0
C - - - - - 0x01184C 04:983C: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x01184F 04:983F: A9 91     LDA #$91
C - - - - - 0x011851 04:9841: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x011854 04:9844: A9 01     LDA #$01
C - - - - - 0x011856 04:9846: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x011859 04:9849: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_4F_984C_02:
C - - J - - 0x01185C 04:984C: A5 71     LDA ram_0071_тип_скролла
C - - - - - 0x01185E 04:984E: 10 1E     BPL bra_986E_RTS
C - - - - - 0x011860 04:9850: A9 30     LDA #$30
C - - - - - 0x011862 04:9852: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011865 04:9855: A9 80     LDA #$80
C - - - - - 0x011867 04:9857: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01186A 04:985A: A9 32     LDA #con_sound_32   ; музыка 6й босс
C - - - - - 0x01186C 04:985C: 20 DE FD  JSR sub_0x01FDEE_play_music
C - - - - - 0x01186F 04:985F: A9 10     LDA #$10
C - - - - - 0x011871 04:9861: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x011874 04:9864: A9 01     LDA #$01
C - - - - - 0x011876 04:9866: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x011879 04:9869: A9 40     LDA #$40    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_986E_RTS:
C - - - - - 0x01187E 04:986E: 60        RTS

; ******************************************************************************************************************

ofs_038_4F_986F_03:
C - - J - - 0x01187F 04:986F: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011882 04:9872: D0 FA     BNE bra_986E_RTS
C - - - - - 0x011884 04:9874: A9 20     LDA #$20
C - - - - - 0x011886 04:9876: 20 99 AB  JSR sub_0x006BA9_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x011889 04:9879: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_4F_987E_04:
C - - J - - 0x01188E 04:987E: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011891 04:9881: D0 2F     BNE bra_98B2
C - - - - - 0x011893 04:9883: 20 FB 98  JSR sub_98FB
C - - - - - 0x011896 04:9886: A9 01     LDA #$01
C - - - - - 0x011898 04:9888: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x01189B 04:988B: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01189E 04:988E: B9 CE 98  LDA tbl_98CE_счетчики,Y
C - - - - - 0x0118A1 04:9891: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0118A4 04:9894: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0118A7 04:9897: 4A        LSR
C - - - - - 0x0118A8 04:9898: B0 05     BCS bra_989F
C - - - - - 0x0118AA 04:989A: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0118AD 04:989D: D0 03     BNE bra_98A2
bra_989F:
C - - - - - 0x0118AF 04:989F: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
bra_98A2:
C - - - - - 0x0118B2 04:98A2: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0118B5 04:98A5: C9 03     CMP #$03
C - - - - - 0x0118B7 04:98A7: 90 08     BCC bra_98B1_RTS
C - - - - - 0x0118B9 04:98A9: A9 01     LDA #$01
C - - - - - 0x0118BB 04:98AB: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0118BE 04:98AE: FE 56 07  INC ram_скролл_объекта_X,X
bra_98B1_RTS:
C - - - - - 0x0118C1 04:98B1: 60        RTS
bra_98B2:
C - - - - - 0x0118C2 04:98B2: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0118C5 04:98B5: 4A        LSR
C - - - - - 0x0118C6 04:98B6: 90 B6     BCC bra_986E_RTS
C - - - - - 0x0118C8 04:98B8: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x0118CB 04:98BB: D0 10     BNE bra_98CD_RTS
C - - - - - 0x0118CD 04:98BD: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x0118D0 04:98C0: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x0118D3 04:98C3: A0 05     LDY #$05
C - - - - - 0x0118D5 04:98C5: 20 E4 F2  JSR sub_0x01F2F4
C - - - - - 0x0118D8 04:98C8: A9 10     LDA #$10
C - - - - - 0x0118DA 04:98CA: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_98CD_RTS:
C - - - - - 0x0118DD 04:98CD: 60        RTS

tbl_98CE_счетчики:
- D 0 - - - 0x0118DE 04:98CE: 20        .byte $20   ; 00 
- D 0 - - - 0x0118DF 04:98CF: 0C        .byte $0C   ; 01 
- D 0 - - - 0x0118E0 04:98D0: 70        .byte $70   ; 02 

; ******************************************************************************************************************

ofs_038_4F_98D4_06:
C - - J - - 0x0118E4 04:98D4: A9 03     LDA #$03
C - - - - - 0x0118E6 04:98D6: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0118E9 04:98D9: 4C D8 A3  JMP loc_0x0063E8_большие_взрывы_для_боссов

; ******************************************************************************************************************

ofs_038_4F_98DC_07:
C - - J - - 0x0118EC 04:98DC: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0118EF 04:98DF: 20 FE 98  JSR sub_98FE
C - - - - - 0x0118F2 04:98E2: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0118F5 04:98E5: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0118F8 04:98E8: C9 05     CMP #$05
C - - - - - 0x0118FA 04:98EA: 90 E1     BCC bra_98CD_RTS
C - - - - - 0x0118FC 04:98EC: 4C A2 A2  JMP loc_0x0062B2_обработка_состояния_смерти_объекта

; ******************************************************************************************************************

ofs_038_4F_98EF_09:
C - - J - - 0x0118FF 04:98EF: 20 3D A3  JSR sub_0x00628A_удалить_объект
C - - - - - 0x011902 04:98F2: A9 00     LDA #$00
C - - - - - 0x011904 04:98F4: 85 5C     STA ram_статус_завершения_уровня
C - - - - - 0x011906 04:98F6: A0 65     LDY #con_obj_id_50  ; 2я фаза босса
C - - - - - 0x011908 04:98F8: 4C C8 AB  JMP loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_98FB:
C - - - - - 0x01190B 04:98FB: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
sub_98FE:
C - - - - - 0x01190E 04:98FE: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x011910 04:9900: 0A        ASL
C - - - - - 0x011911 04:9901: A8        TAY
C - - - - - 0x011912 04:9902: B9 23 99  LDA tbl_9923_поинтеры,Y
C - - - - - 0x011915 04:9905: 85 08     STA ram_0008
C - - - - - 0x011917 04:9907: B9 24 99  LDA tbl_9923_поинтеры + $01,Y
C - - - - - 0x01191A 04:990A: 85 09     STA ram_0009
C - - - - - 0x01191C 04:990C: A0 00     LDY #$00
bra_990E_loop:
C - - - - - 0x01191E 04:990E: B1 08     LDA (ram_0008),Y
C - - - - - 0x011920 04:9910: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x011923 04:9913: E8        INX
C - - - - - 0x011924 04:9914: C8        INY
C - - - - - 0x011925 04:9915: C9 FE     CMP #$FE
C - - - - - 0x011927 04:9917: D0 F5     BNE bra_990E_loop
; close buffer
C - - - - - 0x011929 04:9919: A9 FF     LDA #$FF
C - - - - - 0x01192B 04:991B: 9D FF 02  STA ram_nmt_buffer - $01,X
C - - - - - 0x01192E 04:991E: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x011930 04:9920: A6 10     LDX ram_0010
C - - - - - 0x011932 04:9922: 60        RTS

tbl_9923_поинтеры:
- D 0 - - - 0x011933 04:9923: 33 99     .word _off015_9933_00
- D 0 - - - 0x011935 04:9925: 8F 99     .word _off015_998F_01
- D 0 - - - 0x011937 04:9927: EB 99     .word _off015_99EB_02
- D 0 - - - 0x011939 04:9929: 29 9A     .word _off015_9A29_03
- D 0 - - - 0x01193B 04:992B: 59 9A     .word _off015_9A59_04
- D 0 - - - 0x01193D 04:992D: B5 9A     .word _off015_9AB5_05
- D 0 - - - 0x01193F 04:992F: CA 9A     .word _off015_9ACA_06
- D 0 - - - 0x011941 04:9931: FE 9A     .word _off015_9AFE_07

; _________________________________________________________________________________________________________________

_off015_9933_00:
- D 0 - I - 0x011943 04:9933: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x011944 04:9934: 20 6A     .dbyt $206A ; ppu address
- D 0 - I - 0x011946 04:9936: 0C        .byte $0C   ; counter
- D 0 - I - 0x011947 04:9937: 92        .byte $92, $93, $94, $95, $92, $93, $94, $95, $92, $93, $94, $95   ; 

- D 0 - I - 0x011953 04:9943: 20 88     .dbyt $2088 ; ppu address
- D 0 - I - 0x011955 04:9945: 10        .byte $10   ; counter
- D 0 - I - 0x011956 04:9946: 17        .byte $17, $97, $18, $98, $18, $98, $18, $98, $18, $98, $18, $98, $18, $98, $19, $99   ; 

- D 0 - I - 0x011966 04:9956: 20 A8     .dbyt $20A8 ; ppu address
- D 0 - I - 0x011968 04:9958: 10        .byte $10   ; counter
- D 0 - I - 0x011969 04:9959: 9A        .byte $9A, $9B, $9C, $9D, $9E, $9D, $9E, $9D, $9E, $9D, $9E, $9D, $9E, $9F, $A0, $A1   ; 

- D 0 - I - 0x011979 04:9969: 20 CA     .dbyt $20CA ; ppu address
- D 0 - I - 0x01197B 04:996B: 0C        .byte $0C   ; counter
- D 0 - I - 0x01197C 04:996C: 1A        .byte $1A, $A3, $1B, $A3, $1B, $A3, $1B, $A3, $1B, $A3, $1B, $A7   ; 

- D 0 - I - 0x011988 04:9978: 20 EA     .dbyt $20EA ; ppu address
- D 0 - I - 0x01198A 04:997A: 0C        .byte $0C   ; counter
- D 0 - I - 0x01198B 04:997B: 00        .byte $00, $A8, $A9, $A8, $A9, $A8, $A9, $A8, $A9, $A8, $A9, $00, $23, $CA, $04, $00, $00, $00, $00   ; 

- D 0 - I - 0x01199E 04:998E: FE        .byte $FE   ; end token

; _________________________________________________________________________________________________________________

_off015_998F_01:
- D 0 - I - 0x01199F 04:998F: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x0119A0 04:9990: 20 6A     .dbyt $206A ; ppu address
- D 0 - I - 0x0119A2 04:9992: 0C        .byte $0C   ; counter
- D 0 - I - 0x0119A3 04:9993: AA        .byte $AA, $AB, $AC, $AD, $AA, $AB, $AC, $AD, $AA, $AB, $AC, $AD   ; 

- D 0 - I - 0x0119AF 04:999F: 20 88     .dbyt $2088 ; ppu address
- D 0 - I - 0x0119B1 04:99A1: 10        .byte $10   ; counter
- D 0 - I - 0x0119B2 04:99A2: AE        .byte $AE, $B0, $B4, $B5, $B6, $B5, $B6, $B5, $B6, $B5, $B6, $B5, $B6, $B7, $B8, $B9   ; 

- D 0 - I - 0x0119C2 04:99B2: 20 A8     .dbyt $20A8 ; ppu address
- D 0 - I - 0x0119C4 04:99B4: 10        .byte $10   ; counter
- D 0 - I - 0x0119C5 04:99B5: BF        .byte $BF, $C0, $C1, $C2, $C3, $C2, $C3, $C2, $C3, $C2, $C3, $C2, $C3, $C4, $C5, $C6   ; 

- D 0 - I - 0x0119D5 04:99C5: 20 CA     .dbyt $20CA ; ppu address
- D 0 - I - 0x0119D7 04:99C7: 0C        .byte $0C   ; counter
- D 0 - I - 0x0119D8 04:99C8: C7        .byte $C7, $C8, $C9, $C8, $C9, $C8, $C9, $C8, $C9, $C8, $C9, $CA   ; 

- D 0 - I - 0x0119E4 04:99D4: 20 EA     .dbyt $20EA ; ppu address
- D 0 - I - 0x0119E6 04:99D6: 0C        .byte $0C   ; counter
- D 0 - I - 0x0119E7 04:99D7: 00        .byte $00, $CB, $CC, $CB, $CC, $CB, $CC, $CB, $CC, $CB, $CC, $00   ; 

- D 0 - I - 0x0119F3 04:99E3: 23 CA     .dbyt $23CA ; ppu address
- D 0 - I - 0x0119F5 04:99E5: 04        .byte $04   ; counter
- D 0 - I - 0x0119F6 04:99E6: 88        .byte $88, $AA, $AA, $22   ; 

- D 0 - I - 0x0119FA 04:99EA: FE        .byte $FE   ; end token

; _________________________________________________________________________________________________________________

_off015_99EB_02:
- D 0 - I - 0x0119FB 04:99EB: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x0119FC 04:99EC: 20 8A     .dbyt $208A ; ppu address
- D 0 - I - 0x0119FE 04:99EE: 0C        .byte $0C   ; counter
- D 0 - I - 0x0119FF 04:99EF: CD        .byte $CD, $CE, $CF, $CE, $CF, $CE, $CF, $CE, $CF, $CE, $CF, $D0   ; 

- D 0 - I - 0x011A0B 04:99FB: 20 AA     .dbyt $20AA ; ppu address
- D 0 - I - 0x011A0D 04:99FD: 0C        .byte $0C   ; counter
- D 0 - I - 0x011A0E 04:99FE: D1        .byte $D1, $D2, $D3, $D2, $D3, $D2, $D3, $D2, $D3, $D2, $D3, $D4   ; 

- D 0 - I - 0x011A1A 04:9A0A: 20 CA     .dbyt $20CA ; ppu address
- D 0 - I - 0x011A1C 04:9A0C: 0C        .byte $0C   ; counter
- D 0 - I - 0x011A1D 04:9A0D: D5        .byte $D5, $D6, $D7, $D6, $D7, $D6, $D7, $D6, $D7, $D6, $D7, $D8   ; 

- D 0 - I - 0x011A29 04:9A19: 20 EA     .dbyt $20EA ; ppu address
- D 0 - I - 0x011A2B 04:9A1B: 0C        .byte $0C   ; counter
- D 0 - I - 0x011A2C 04:9A1C: D9        .byte $D9, $DA, $DB, $DA, $DB, $DA, $DB, $DA, $DB, $DA, $DB, $DC   ; 

- D 0 - I - 0x011A38 04:9A28: FE        .byte $FE   ; end token

; _________________________________________________________________________________________________________________

_off015_9A29_03:
- D 0 - I - 0x011A39 04:9A29: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x011A3A 04:9A2A: 20 28     .dbyt $2028 ; ppu address
- D 0 - I - 0x011A3C 04:9A2C: 10        .byte $10, $00   ; counter + fill tile

- D 0 - I - 0x011A3E 04:9A2E: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x011A3F 04:9A2F: 20 48     .dbyt $2048 ; ppu address
- D 0 - I - 0x011A41 04:9A31: 10        .byte $10, $00   ; counter + fill tile

- D 0 - I - 0x011A43 04:9A33: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x011A44 04:9A34: 20 09     .dbyt $2009 ; ppu address
- D 0 - I - 0x011A46 04:9A36: 0E        .byte $0E   ; counter
- D 0 - I - 0x011A47 04:9A37: E0        .byte $E0, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $E1   ; 

- D 0 - I - 0x011A55 04:9A45: 20 68     .dbyt $2068 ; ppu address
- D 0 - I - 0x011A57 04:9A47: 10        .byte $10   ; counter
- D 0 - I - 0x011A58 04:9A48: 00        .byte $00, $00, $E2, $E4, $00, $00, $00, $00, $00, $00, $00, $00, $E5, $E3, $00, $00   ; 
- D 0 - I - 0x011A68 04:9A58: FE        .byte $FE   ; end token

; _________________________________________________________________________________________________________________

_off015_9A59_04:
- D 0 - I - 0x011A69 04:9A59: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x011A6A 04:9A5A: 20 88     .dbyt $2088 ; ppu address
- D 0 - I - 0x011A6C 04:9A5C: 10        .byte $10   ; counter
- D 0 - I - 0x011A6D 04:9A5D: 00        .byte $00, $E2, $E4, $E6, $E8, $EA, $EC, $EC, $EC, $EC, $EB, $E9, $E7, $E5, $E3, $00   ; 

- D 0 - I - 0x011A7D 04:9A6D: 20 A8     .dbyt $20A8 ; ppu address
- D 0 - I - 0x011A7F 04:9A6F: 10        .byte $10   ; counter
- D 0 - I - 0x011A80 04:9A70: EE        .byte $EE, $F0, $F2, $E8, $EA, $EC, $ED, $ED, $ED, $ED, $EC, $EB, $E9, $F3, $F1, $EF   ; 

- D 0 - I - 0x011A90 04:9A80: 20 C8     .dbyt $20C8 ; ppu address
- D 0 - I - 0x011A92 04:9A82: 10        .byte $10   ; counter
- D 0 - I - 0x011A93 04:9A83: 00        .byte $00, $F8, $F6, $EE, $F0, $F4, $DE, $DE, $DE, $DE, $F5, $F1, $EF, $F7, $1C, $00   ; 

- D 0 - I - 0x011AA3 04:9A93: 20 E8     .dbyt $20E8 ; ppu address
- D 0 - I - 0x011AA5 04:9A95: 10        .byte $10   ; counter
- D 0 - I - 0x011AA6 04:9A96: 00        .byte $00, $00, $00, $00, $F8, $F6, $DF, $DF, $DF, $DF, $F7, $1C, $00, $00, $00, $00   ; 

- D 0 - I - 0x011AB6 04:9AA6: 23 C2     .dbyt $23C2 ; ppu address
- D 0 - I - 0x011AB8 04:9AA8: 04        .byte $04   ; counter
- D 0 - I - 0x011AB9 04:9AA9: 00        .byte $00, $00, $00, $00   ; 

- D 0 - I - 0x011ABD 04:9AAD: 23 CA     .dbyt $23CA ; ppu address
- D 0 - I - 0x011ABF 04:9AAF: 04        .byte $04   ; counter
- D 0 - I - 0x011AC0 04:9AB0: 00        .byte $00, $00, $00, $00   ; 

- D 0 - I - 0x011AC4 04:9AB4: FE        .byte $FE   ; end token

; _________________________________________________________________________________________________________________

_off015_9AB5_05:
- D 0 - I - 0x011AC5 04:9AB5: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x011AC6 04:9AB6: 23 C2     .dbyt $23C2 ; ppu address
- D 0 - I - 0x011AC8 04:9AB8: 04        .byte $04   ; counter
- D 0 - I - 0x011AC9 04:9AB9: FF        .byte $FF, $33, $CC, $FF   ; 

- D 0 - I - 0x011ACD 04:9ABD: 23 CA     .dbyt $23CA ; ppu address
- D 0 - I - 0x011ACF 04:9ABF: 04        .byte $04   ; counter
- D 0 - I - 0x011AD0 04:9AC0: 0C        .byte $0C, $F0, $F0, $03   ; 

- D 0 - I - 0x011AD4 04:9AC4: 23 DB     .dbyt $23DB ; ppu address
- D 0 - I - 0x011AD6 04:9AC6: 02        .byte $02   ; counter
- D 0 - I - 0x011AD7 04:9AC7: 51        .byte $51, $54   ; 

- D 0 - I - 0x011AD9 04:9AC9: FE        .byte $FE   ; end token

; _________________________________________________________________________________________________________________

_off015_9ACA_06:
- D 0 - I - 0x011ADA 04:9ACA: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x011ADB 04:9ACB: 21 2C     .dbyt $212C ; ppu address
- D 0 - I - 0x011ADD 04:9ACD: 08        .byte $08   ; counter
- D 0 - I - 0x011ADE 04:9ACE: 00        .byte $00, $73, $74, $75, $76, $77, $78, $00   ; 

- D 0 - I - 0x011AE6 04:9AD6: 21 4D     .dbyt $214D ; ppu address
- D 0 - I - 0x011AE8 04:9AD8: 06        .byte $06   ; counter
- D 0 - I - 0x011AE9 04:9AD9: 79        .byte $79, $7A, $7A, $7A, $7A, $7B   ; 

- D 0 - I - 0x011AEF 04:9ADF: 21 6D     .dbyt $216D ; ppu address
- D 0 - I - 0x011AF1 04:9AE1: 06        .byte $06   ; counter
- D 0 - I - 0x011AF2 04:9AE2: 7C        .byte $7C, $7D, $7E, $7F, $88, $89   ; 

- D 0 - I - 0x011AF8 04:9AE8: 21 8D     .dbyt $218D ; ppu address
- D 0 - I - 0x011AFA 04:9AEA: 06        .byte $06   ; counter
- D 0 - I - 0x011AFB 04:9AEB: 00        .byte $00, $8A, $8B, $8C, $8D, $00   ; 

- D 0 - I - 0x011B01 04:9AF1: 21 AE     .dbyt $21AE ; ppu address
- D 0 - I - 0x011B03 04:9AF3: 04        .byte $04   ; counter
- D 0 - I - 0x011B04 04:9AF4: 00        .byte $00, $8E, $8F, $00   ; 

- D 0 - I - 0x011B08 04:9AF8: 23 DB     .dbyt $23DB ; ppu address
- D 0 - I - 0x011B0A 04:9AFA: 02        .byte $02   ; counter
- D 0 - I - 0x011B0B 04:9AFB: 51        .byte $51, $54   ; 

- D 0 - I - 0x011B0D 04:9AFD: FE        .byte $FE   ; end token

; _________________________________________________________________________________________________________________

_off015_9AFE_07:
- D 0 - I - 0x011B0E 04:9AFE: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x011B0F 04:9AFF: 21 2C     .dbyt $212C ; ppu address
- D 0 - I - 0x011B11 04:9B01: 08        .byte $08   ; counter
- D 0 - I - 0x011B12 04:9B02: 90        .byte $90, $7A, $74, $75, $76, $77, $7A, $91   ; 

- D 0 - I - 0x011B1A 04:9B0A: 21 4D     .dbyt $214D ; ppu address
- D 0 - I - 0x011B1C 04:9B0C: 06        .byte $06   ; counter
- D 0 - I - 0x011B1D 04:9B0D: 92        .byte $92, $7A, $7A, $7A, $7A, $93   ; 

- D 0 - I - 0x011B23 04:9B13: 21 6D     .dbyt $216D ; ppu address
- D 0 - I - 0x011B25 04:9B15: 06        .byte $06   ; counter
- D 0 - I - 0x011B26 04:9B16: 94        .byte $94, $95, $96, $97, $98, $99   ; 

- D 0 - I - 0x011B2C 04:9B1C: 21 8D     .dbyt $218D ; ppu address
- D 0 - I - 0x011B2E 04:9B1E: 06        .byte $06   ; counter
- D 0 - I - 0x011B2F 04:9B1F: 9A        .byte $9A, $9B, $9C, $9D, $9E, $9F   ; 

- D 0 - I - 0x011B35 04:9B25: 21 AE     .dbyt $21AE ; ppu address
- D 0 - I - 0x011B37 04:9B27: 04        .byte $04   ; counter
- D 0 - I - 0x011B38 04:9B28: A0        .byte $A0, $A1, $A3, $A7   ; 

- D 0 - I - 0x011B3C 04:9B2C: 23 DB     .dbyt $23DB ; ppu address
- D 0 - I - 0x011B3E 04:9B2E: 02        .byte $02   ; counter
- D 0 - I - 0x011B3F 04:9B2F: 59        .byte $59, $56   ; 

- D 0 - I - 0x011B41 04:9B31: FE        .byte $FE   ; end token

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x011424_50_босс_6_фаза_2_череп:
- D 0 - I - 0x011424 04:9414: 2E 94     .word ofs_038_50_942E_01_активация_объекта ; 
- D 0 - I - 0x011426 04:9416: 58 94     .word ofs_038_50_9458_02 ; 
- D 0 - I - 0x011428 04:9418: 72 94     .word ofs_038_50_9472_03 ; 
- D 0 - I - 0x01142A 04:941A: 91 94     .word ofs_038_50_9491_04 ; 
- D 0 - I - 0x01142C 04:941C: D3 94     .word ofs_038_50_94D3_05 ; 
- D 0 - I - 0x01142E 04:941E: 1E 95     .word ofs_038_50_951E_06 ; 
- D 0 - I - 0x011430 04:9420: 64 95     .word ofs_038_50_9564_07 ; 
- D 0 - I - 0x011432 04:9422: 73 95     .word ofs_038_50_9573_08 ; 
- D 0 - I - 0x011434 04:9424: C5 95     .word ofs_038_50_A3B8_09_установить_статус_уничтожения_босса_и_убить_все_объекты ; 
- D 0 - I - 0x011436 04:9426: C8 95     .word ofs_038_50_A3D8_0A_большие_взрывы_для_боссов ; 
- D 0 - I - 0x011438 04:9428: CB 95     .word ofs_038_50_95CB_0B ; 
- D 0 - I - 0x01143A 04:942A: F6 A2     .word ofs_038_50_0x006306_0C ; 
- D 0 - I - 0x01143C 04:942C: DF 95     .word ofs_038_50_0x006347_0D_удалить_объект_босс ; 

; ******************************************************************************************************************

ofs_038_50_942E_01_активация_объекта:
C - - J - - 0x01143E 04:942E: A9 10     LDA #$10
C - - - - - 0x011440 04:9430: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x011443 04:9433: A9 F0     LDA #con_HP_F0
C - - - - - 0x011445 04:9435: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x011448 04:9438: A9 58     LDA #con_chr_bank + $58
C - - - - - 0x01144A 04:943A: 8D F1 07  STA ram_bg_bank_2
C - - - - - 0x01144D 04:943D: A9 11     LDA #con_chr_bank + $11
C - - - - - 0x01144F 04:943F: 8D F5 07  STA ram_spr_bank_4
C - - - - - 0x011452 04:9442: A9 FF     LDA #$FF
C - - - - - 0x011454 04:9444: 8D CF 03  STA ram_03CF
C - - - - - 0x011457 04:9447: A0 9C     LDY #con_F97C_colors + $27 * $04
C - - - - - 0x011459 04:9449: 20 64 F9  JSR sub_0x01F974_запись_3х_цветов_с_условием
C - - - - - 0x01145C 04:944C: A0 A0     LDY #con_F97C_colors + $28 * $04
C - - - - - 0x01145E 04:944E: 20 64 F9  JSR sub_0x01F974_запись_3х_цветов_с_условием
C - - - - - 0x011461 04:9451: A6 10     LDX ram_0010
C - - - - - 0x011463 04:9453: A9 70     LDA #$70    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_50_9458_02:
C - - J - - 0x011468 04:9458: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x01146A 04:945A: 4A        LSR
C - - - - - 0x01146B 04:945B: 90 6C     BCC bra_94C9_RTS
C - - - - - 0x01146D 04:945D: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011470 04:9460: D0 67     BNE bra_94C9_RTS
C - - - - - 0x011472 04:9462: A9 00     LDA #$00
C - - - - - 0x011474 04:9464: 85 64     STA ram_0064
C - - - - - 0x011476 04:9466: A9 02     LDA #$02
C - - - - - 0x011478 04:9468: 85 61     STA ram_0061_конфиг_уровня
C - - - - - 0x01147A 04:946A: A9 08     LDA #$08
C - - - - - 0x01147C 04:946C: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x01147F 04:946F: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_50_9472_03:
C - - J - - 0x011482 04:9472: A5 60     LDA ram_0060_unk
C - - - - - 0x011484 04:9474: 05 70     ORA ram_0070
C - - - - - 0x011486 04:9476: D0 09     BNE bra_9481_RTS
C - - - - - 0x011488 04:9478: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x01148B 04:947B: F0 05     BEQ bra_9482
C - - - - - 0x01148D 04:947D: A9 00     LDA #$00
C - - - - - 0x01148F 04:947F: 85 6B     STA ram_006B
bra_9481_RTS:
C - - - - - 0x011491 04:9481: 60        RTS
bra_9482:
C - - - - - 0x011492 04:9482: A9 01     LDA #$01
C - - - - - 0x011494 04:9484: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x011497 04:9487: A5 45     LDA ram_номер_сканлинии
C - - - - - 0x011499 04:9489: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x01149C 04:948C: A9 B0     LDA #$B0    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_50_9491_04:
C - - J - - 0x0114A1 04:9491: 20 6B AB  JSR sub_0x006B7B
C - - - - - 0x0114A4 04:9494: 20 CA 94  JSR sub_94CA
C - - - - - 0x0114A7 04:9497: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x0114A9 04:9499: 4A        LSR
C - - - - - 0x0114AA 04:949A: 90 2D     BCC bra_94C9_RTS
C - - - - - 0x0114AC 04:949C: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x0114AF 04:949F: C9 60     CMP #$60
C - - - - - 0x0114B1 04:94A1: D0 05     BNE bra_94A8
C - - - - - 0x0114B3 04:94A3: A9 30     LDA #con_sound_30   ; музыка 6й босс, 2я фаза
C - - - - - 0x0114B5 04:94A5: 20 DE FD  JSR sub_0x01FDEE_play_music
bra_94A8:
C - - - - - 0x0114B8 04:94A8: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0114BB 04:94AB: D0 1C     BNE bra_94C9_RTS
C - - - - - 0x0114BD 04:94AD: A9 38     LDA #$38
C - - - - - 0x0114BF 04:94AF: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0114C2 04:94B2: A9 80     LDA #$80
C - - - - - 0x0114C4 04:94B4: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0114C7 04:94B7: A9 00     LDA #$00
C - - - - - 0x0114C9 04:94B9: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0114CC 04:94BC: A9 01     LDA #$01
C - - - - - 0x0114CE 04:94BE: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0114D1 04:94C1: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x0114D4 04:94C4: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_94C9_RTS:
C - - - - - 0x0114D9 04:94C9: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_94CA:
C - - - - - 0x0114DA 04:94CA: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0114DD 04:94CD: 38        SEC
C - - - - - 0x0114DE 04:94CE: E5 FC     SBC ram_scroll_Y
C - - - - - 0x0114E0 04:94D0: 85 45     STA ram_номер_сканлинии
C - - - - - 0x0114E2 04:94D2: 60        RTS

; ******************************************************************************************************************

ofs_038_50_94D3_05:
C - - J - - 0x0114E3 04:94D3: 20 6B AB  JSR sub_0x006B7B
C - - - - - 0x0114E6 04:94D6: 20 CA 94  JSR sub_94CA
C - - - - - 0x0114E9 04:94D9: 20 8C 96  JSR sub_968C
C - - - - - 0x0114EC 04:94DC: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0114EF 04:94DF: D0 E8     BNE bra_94C9_RTS
C - - - - - 0x0114F1 04:94E1: A9 00     LDA #$00
C - - - - - 0x0114F3 04:94E3: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0114F6 04:94E6: A9 06     LDA #$06
C - - - - - 0x0114F8 04:94E8: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0114FB 04:94EB: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0114FE 04:94EE: 49 01     EOR #$01
C - - - - - 0x011500 04:94F0: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x011503 04:94F3: A5 FF     LDA ram_for_2000
C - - - - - 0x011505 04:94F5: 29 FE     AND #$FE
C - - - - - 0x011507 04:94F7: 1D 56 07  ORA ram_скролл_объекта_X,X
C - - - - - 0x01150A 04:94FA: 85 FF     STA ram_for_2000
C - - - - - 0x01150C 04:94FC: FE 64 07  INC ram_0764_obj,X
C - - - - - 0x01150F 04:94FF: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x011512 04:9502: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x011515 04:9505: C9 0F     CMP #$0F
C - - - - - 0x011517 04:9507: 90 C0     BCC bra_94C9_RTS
C - - - - - 0x011519 04:9509: A9 05     LDA #$05
C - - - - - 0x01151B 04:950B: 20 FE 98  JSR sub_98FE
C - - - - - 0x01151E 04:950E: A9 00     LDA #$00
C - - - - - 0x011520 04:9510: 85 64     STA ram_0064
C - - - - - 0x011522 04:9512: A9 01     LDA #$01
C - - - - - 0x011524 04:9514: 85 65     STA ram_0065
C - - - - - 0x011526 04:9516: A9 08     LDA #$08
C - - - - - 0x011528 04:9518: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x01152B 04:951B: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_50_951E_06:
C - - J - - 0x01152E 04:951E: 20 6B AB  JSR sub_0x006B7B
C - - - - - 0x011531 04:9521: 20 CA 94  JSR sub_94CA
C - - - - - 0x011534 04:9524: A5 60     LDA ram_0060_unk
C - - - - - 0x011536 04:9526: 05 70     ORA ram_0070
C - - - - - 0x011538 04:9528: D0 09     BNE bra_9533_RTS
C - - - - - 0x01153A 04:952A: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x01153D 04:952D: F0 05     BEQ bra_9534
C - - - - - 0x01153F 04:952F: A9 00     LDA #$00
C - - - - - 0x011541 04:9531: 85 6B     STA ram_006B
bra_9533_RTS:
C - - - - - 0x011543 04:9533: 60        RTS
bra_9534:
C - - - - - 0x011544 04:9534: A9 01     LDA #$01
C - - - - - 0x011546 04:9536: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x011549 04:9539: A0 66     LDY #con_obj_id_51  ; змея
C - - - - - 0x01154B 04:953B: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x01154E 04:953E: A0 00     LDY #$00
C - - - - - 0x011550 04:9540: 84 FC     STY ram_scroll_Y
C - - - - - 0x011552 04:9542: 84 FD     STY ram_scroll_X
C - - - - - 0x011554 04:9544: 88        DEY
C - - - - - 0x011555 04:9545: 84 F9     STY ram_00F9
C - - - - - 0x011557 04:9547: 20 CA 94  JSR sub_94CA
C - - - - - 0x01155A 04:954A: A9 00     LDA #$00
C - - - - - 0x01155C 04:954C: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x01155F 04:954F: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x011562 04:9552: A9 01     LDA #$01
C - - - - - 0x011564 04:9554: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x011567 04:9557: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x01156A 04:955A: A9 20     LDA #$20
C - - - - - 0x01156C 04:955C: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x01156F 04:955F: A9 80     LDA #$80    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_50_9564_07:
C - - J - - 0x011574 04:9564: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011577 04:9567: D0 CA     BNE bra_9533_RTS
C - - - - - 0x011579 04:9569: A9 40     LDA #$40
C - - - - - 0x01157B 04:956B: 20 99 AB  JSR sub_0x006BA9_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x01157E 04:956E: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_50_9573_08:
C - - J - - 0x011583 04:9573: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011586 04:9576: D0 1B     BNE bra_9593
C - - - - - 0x011588 04:9578: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x01158B 04:957B: 49 01     EOR #$01
C - - - - - 0x01158D 04:957D: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x011590 04:9580: 4A        LSR
C - - - - - 0x011591 04:9581: A9 30     LDA #$30
C - - - - - 0x011593 04:9583: B0 02     BCS bra_9587
C - - - - - 0x011595 04:9585: A9 20     LDA #$20
bra_9587:
C - - - - - 0x011597 04:9587: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x01159A 04:958A: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x01159D 04:958D: 18        CLC
C - - - - - 0x01159E 04:958E: 69 06     ADC #$06
C - - - - - 0x0115A0 04:9590: 20 FE 98  JSR sub_98FE
bra_9593:
C - - - - - 0x0115A3 04:9593: 20 E2 95  JSR sub_95E2
C - - - - - 0x0115A6 04:9596: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0115A9 04:9599: F0 29     BEQ bra_95C4_RTS
C - - - - - 0x0115AB 04:959B: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x0115AE 04:959E: D0 24     BNE bra_95C4_RTS
C - - - - - 0x0115B0 04:95A0: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x0115B3 04:95A3: A0 70     LDY #$70
C - - - - - 0x0115B5 04:95A5: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0115B8 04:95A8: 29 03     AND #$03
C - - - - - 0x0115BA 04:95AA: F0 02     BEQ bra_95AE
C - - - - - 0x0115BC 04:95AC: A0 10     LDY #$10
bra_95AE:
C - - - - - 0x0115BE 04:95AE: 98        TYA
C - - - - - 0x0115BF 04:95AF: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0115C2 04:95B2: A0 68     LDY #con_obj_id_52  ; круглая пуля босса
C - - - - - 0x0115C4 04:95B4: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0115C7 04:95B7: 90 0B     BCC bra_95C4_RTS
C - - - - - 0x0115C9 04:95B9: A4 11     LDY ram_0011
C - - - - - 0x0115CB 04:95BB: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0115CE 04:95BE: 18        CLC
C - - - - - 0x0115CF 04:95BF: 69 18     ADC #$18
C - - - - - 0x0115D1 04:95C1: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
bra_95C4_RTS:
C - - - - - 0x0115D4 04:95C4: 60        RTS

; ******************************************************************************************************************

ofs_038_50_95CB_0B:
C - - J - - 0x0115DB 04:95CB: A0 7F     LDY #$7F
bra_95CD_loop:
C - - - - - 0x0115DD 04:95CD: B9 00 04  LDA ram_0400,Y
C - - - - - 0x0115E0 04:95D0: 99 80 04  STA ram_0480,Y
C - - - - - 0x0115E3 04:95D3: 88        DEY
C - - - - - 0x0115E4 04:95D4: 10 F7     BPL bra_95CD_loop
C - - - - - 0x0115E6 04:95D6: A5 FF     LDA ram_for_2000
C - - - - - 0x0115E8 04:95D8: 09 01     ORA #$01
C - - - - - 0x0115EA 04:95DA: 85 FF     STA ram_for_2000
C - - - - - 0x0115EC 04:95DC: 4C A2 A2  JMP loc_0x0062B2_обработка_состояния_смерти_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_95E2:
C - - - - - 0x0115F2 04:95E2: DE 64 07  DEC ram_0764_obj,X
C - - - - - 0x0115F5 04:95E5: D0 53     BNE bra_963A_RTS
C - - - - - 0x0115F7 04:95E7: A9 01     LDA #$01
C - - - - - 0x0115F9 04:95E9: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0115FC 04:95EC: 20 24 AB  JSR sub_0x006B34_выбрать_ближайшего_игрока_по_оси_y
C - - - - - 0x0115FF 04:95EF: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x011602 04:95F2: A0 00     LDY #$00
C - - - - - 0x011604 04:95F4: C9 60     CMP #$60
C - - - - - 0x011606 04:95F6: 90 06     BCC bra_95FE
C - - - - - 0x011608 04:95F8: C8        INY
C - - - - - 0x011609 04:95F9: C9 A0     CMP #$A0
C - - - - - 0x01160B 04:95FB: 90 01     BCC bra_95FE
C - - - - - 0x01160D 04:95FD: C8        INY
bra_95FE:
C - - - - - 0x01160E 04:95FE: 98        TYA
C - - - - - 0x01160F 04:95FF: DD 72 07  CMP ram_0772_obj,X
C - - - - - 0x011612 04:9602: F0 36     BEQ bra_963A_RTS
C - - - - - 0x011614 04:9604: A9 FF     LDA #$FF
C - - - - - 0x011616 04:9606: 90 02     BCC bra_960A
C - - - - - 0x011618 04:9608: A9 00     LDA #$00
bra_960A:
C - - - - - 0x01161A 04:960A: 7D 72 07  ADC ram_0772_obj,X
C - - - - - 0x01161D 04:960D: C9 03     CMP #$03
C - - - - - 0x01161F 04:960F: B0 03     BCS bra_9614
C - - - - - 0x011621 04:9611: 9D 72 07  STA ram_0772_obj,X
bra_9614:
C - - - - - 0x011635 04:9625: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x011637 04:9627: E0 20     CPX #$20
C - - - - - 0x011639 04:9629: B0 10     BCS bra_963B
C - - - - - 0x011624 04:9614: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x011627 04:9617: 0A        ASL
C - - - - - 0x011628 04:9618: A8        TAY
C - - - - - 0x011629 04:9619: B9 43 96  LDA tbl_9643_поинтеры,Y
C - - - - - 0x01162C 04:961C: 85 08     STA ram_0008
C - - - - - 0x01162E 04:961E: B9 44 96  LDA tbl_9643_поинтеры + $01,Y
C - - - - - 0x011631 04:9621: 85 09     STA ram_0009
C - - - - - 0x011633 04:9623: A0 00     LDY #$00
; if buffer is not too loaded
bra_962B_loop:
C - - - - - 0x01163B 04:962B: B1 08     LDA (ram_0008),Y
C - - - - - 0x01163D 04:962D: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x011640 04:9630: E8        INX
C - - - - - 0x011641 04:9631: C8        INY
C - - - - - 0x011642 04:9632: C9 FF     CMP #$FF
C - - - - - 0x011644 04:9634: D0 F5     BNE bra_962B_loop
C - - - - - 0x011646 04:9636: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x011648 04:9638: A6 10     LDX ram_0010
bra_963A_RTS:
C - - - - - 0x01164A 04:963A: 60        RTS
bra_963B:
C - - - - - 0x01164B 04:963B: A6 10     LDX ram_0010
C - - - - - 0x01164D 04:963D: A9 01     LDA #$01
C - - - - - 0x01164F 04:963F: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x011652 04:9642: 60        RTS

tbl_9643_поинтеры:
- D 0 - - - 0x011653 04:9643: 49 96     .word off_9649_00
- D 0 - - - 0x011655 04:9645: 5F 96     .word off_965F_01
- D 0 - - - 0x011657 04:9647: 75 96     .word off_9675_02

; _________________________________________________________________________________________________________________

off_9649_00:
- D 0 - I - 0x011659 04:9649: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x01165A 04:964A: 20 AD     .dbyt $20AD ; ppu address
- D 0 - I - 0x01165C 04:964C: 02        .byte $02   ; counter
- D 0 - I - 0x01165D 04:964D: A9        .byte $A9, $56   ; tiles

- D 0 - I - 0x01165F 04:964F: 20 CD     .dbyt $20CD ; ppu address
- D 0 - I - 0x011661 04:9651: 02        .byte $02   ; counter
- D 0 - I - 0x011662 04:9652: AC        .byte $AC, $AD   ; tiles

- D 0 - I - 0x011664 04:9654: 20 B1     .dbyt $20B1 ; ppu address
- D 0 - I - 0x011666 04:9656: 02        .byte $02   ; counter
- D 0 - I - 0x011667 04:9657: 55        .byte $55, $B6   ; tiles

- D 0 - I - 0x011669 04:9659: 20 D1     .dbyt $20D1 ; ppu address
- D 0 - I - 0x01166B 04:965B: 02        .byte $02   ; counter
- D 0 - I - 0x01166C 04:965C: B7        .byte $B7, $B8   ; tiles

- D 0 - I - 0x01166E 04:965E: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_965F_01:
- D 0 - I - 0x01166F 04:965F: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x011670 04:9660: 20 AD     .dbyt $20AD ; ppu address
- D 0 - I - 0x011672 04:9662: 02        .byte $02   ; counter
- D 0 - I - 0x011673 04:9663: 55        .byte $55, $56   ; tiles

- D 0 - I - 0x011675 04:9665: 20 CD     .dbyt $20CD ; ppu address
- D 0 - I - 0x011677 04:9667: 02        .byte $02   ; counter
- D 0 - I - 0x011678 04:9668: 5B        .byte $5B, $5C   ; tiles

- D 0 - I - 0x01167A 04:966A: 20 B1     .dbyt $20B1 ; ppu address
- D 0 - I - 0x01167C 04:966C: 02        .byte $02   ; counter
- D 0 - I - 0x01167D 04:966D: 55        .byte $55, $56   ; tiles

- D 0 - I - 0x01167F 04:966F: 20 D1     .dbyt $20D1 ; ppu address
- D 0 - I - 0x011681 04:9671: 02        .byte $02   ; counter
- D 0 - I - 0x011682 04:9672: 5F        .byte $5F, $60   ; tiles

- D 0 - I - 0x011684 04:9674: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_9675_02:
- D 0 - I - 0x011685 04:9675: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x011686 04:9676: 20 AD     .dbyt $20AD ; ppu address
- D 0 - I - 0x011688 04:9678: 02        .byte $02   ; counter
- D 0 - I - 0x011689 04:9679: A9        .byte $A9, $56   ; tiles

- D 0 - I - 0x01168B 04:967B: 20 CD     .dbyt $20CD ; ppu address
- D 0 - I - 0x01168D 04:967D: 02        .byte $02   ; counter
- D 0 - I - 0x01168E 04:967E: AE        .byte $AE, $B0   ; tiles

- D 0 - I - 0x011690 04:9680: 20 B1     .dbyt $20B1 ; ppu address
- D 0 - I - 0x011692 04:9682: 02        .byte $02   ; counter
- D 0 - I - 0x011693 04:9683: 55        .byte $55, $B6   ; tiles

- D 0 - I - 0x011695 04:9685: 20 D1     .dbyt $20D1 ; ppu address
- D 0 - I - 0x011697 04:9687: 02        .byte $02   ; counter
- D 0 - I - 0x011698 04:9688: B9        .byte $B9, $BF   ; tiles

- D 0 - I - 0x01169A 04:968A: FF        .byte $FF   ; end token

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_968C:
C - - - - - 0x01169C 04:968C: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x01169F 04:968F: 30 FA     BMI bra_96D7_RTS
C - - - - - 0x0116A1 04:9691: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0116A4 04:9694: 4A        LSR
C - - - - - 0x0116A5 04:9695: A9 08     LDA #$08
C - - - - - 0x0116A7 04:9697: B0 02     BCS bra_969B
C - - - - - 0x0116A9 04:9699: A9 0B     LDA #$0B
bra_969B:
C - - - - - 0x0116AB 04:969B: 85 01     STA ram_0001
C - - - - - 0x0116AD 04:969D: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x0116B0 04:96A0: 88        DEY
C - - - - - 0x0116B1 04:96A1: 98        TYA
C - - - - - 0x0116B2 04:96A2: 38        SEC
C - - - - - 0x0116B3 04:96A3: FD 72 07  SBC ram_0772_obj,X
C - - - - - 0x0116B6 04:96A6: 0A        ASL
C - - - - - 0x0116B7 04:96A7: 0A        ASL
C - - - - - 0x0116B8 04:96A8: 0A        ASL
C - - - - - 0x0116B9 04:96A9: 0A        ASL
C - - - - - 0x0116BA 04:96AA: 26 01     ROL ram_0001
C - - - - - 0x0116BC 04:96AC: 0A        ASL
C - - - - - 0x0116BD 04:96AD: 26 01     ROL ram_0001
C - - - - - 0x0116BF 04:96AF: 85 00     STA ram_0000
C - - - - - 0x0116C1 04:96B1: A0 00     LDY #$00
C - - - - - 0x0116C3 04:96B3: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x0116C6 04:96B6: 85 0A     STA ram_000A
C - - - - - 0x0116C8 04:96B8: F0 10     BEQ bra_96CA
bra_96BA_loop:
C - - - - - 0x0116CA 04:96BA: C8        INY
C - - - - - 0x0116CB 04:96BB: B9 49 97  LDA tbl_9749,Y
C - - - - - 0x0116CE 04:96BE: 85 0B     STA ram_000B
C - - - - - 0x0116D0 04:96C0: C8        INY
C - - - - - 0x0116D1 04:96C1: 98        TYA
C - - - - - 0x0116D2 04:96C2: 18        CLC
C - - - - - 0x0116D3 04:96C3: 65 0B     ADC ram_000B
C - - - - - 0x0116D5 04:96C5: A8        TAY
C - - - - - 0x0116D6 04:96C6: C6 0A     DEC ram_000A
C - - - - - 0x0116D8 04:96C8: D0 F0     BNE bra_96BA_loop
bra_96CA:
C - - - - - 0x0116DA 04:96CA: B9 49 97  LDA tbl_9749,Y
C - - - - - 0x0116DD 04:96CD: C9 80     CMP #$80
C - - - - - 0x0116DF 04:96CF: F0 03     BEQ bra_96D4_80
C - - - - - 0x0116E1 04:96D1: 4C D8 96  JMP loc_96D8
bra_96D4_80:
- - - - - - 0x0116E4 04:96D4: 9D 72 07  STA ram_0772_obj,X
bra_96D7_RTS:
- - - - - - 0x0116E7 04:96D7: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

loc_96D8:
C D 0 - - - 0x0116E8 04:96D8: A9 04     LDA #$04
C - - - - - 0x0116EA 04:96DA: 85 08     STA ram_0008
C - - - - - 0x0116EC 04:96DC: BD 80 07  LDA ram_0780_obj,X
C - - - - - 0x0116EF 04:96DF: 85 09     STA ram_0009
C - - - - - 0x0116F1 04:96E1: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x0116F4 04:96E4: 85 0A     STA ram_000A
C - - - - - 0x0116F6 04:96E6: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x0116F8 04:96E8: A9 06     LDA #con_buf_mode_06
C - - - - - 0x0116FA 04:96EA: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0116FD 04:96ED: E8        INX
bra_96EE_loop:
C - - - - - 0x0116FE 04:96EE: B9 49 97  LDA tbl_9749,Y
C - - - - - 0x011701 04:96F1: C9 80     CMP #$80
C - - - - - 0x011703 04:96F3: F0 49     BEQ bra_973E_80
; ppu hi
C - - - - - 0x011705 04:96F5: 18        CLC
C - - - - - 0x011706 04:96F6: 65 00     ADC ram_0000
C - - - - - 0x011708 04:96F8: 9D 01 03  STA ram_nmt_buffer + $01,X
; ppu lo
C - - - - - 0x01170B 04:96FB: A5 01     LDA ram_0001
C - - - - - 0x01170D 04:96FD: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x011710 04:9700: E8        INX
C - - - - - 0x011711 04:9701: E8        INX
C - - - - - 0x011712 04:9702: C8        INY
; counter
C - - - - - 0x011713 04:9703: B9 49 97  LDA tbl_9749,Y
C - - - - - 0x011716 04:9706: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x011719 04:9709: 85 0B     STA ram_000B
C - - - - - 0x01171B 04:970B: E8        INX
C - - - - - 0x01171C 04:970C: C8        INY
bra_970D_loop:
C - - - - - 0x01171D 04:970D: B9 49 97  LDA tbl_9749,Y
C - - - - - 0x011720 04:9710: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x011723 04:9713: E8        INX
C - - - - - 0x011724 04:9714: C8        INY
C - - - - - 0x011725 04:9715: C6 0B     DEC ram_000B
C - - - - - 0x011727 04:9717: D0 F4     BNE bra_970D_loop
C - - - - - 0x011729 04:9719: E6 0A     INC ram_000A
C - - - - - 0x01172B 04:971B: C6 09     DEC ram_0009
C - - - - - 0x01172D 04:971D: F0 11     BEQ bra_9730
C - - - - - 0x01172F 04:971F: A5 00     LDA ram_0000
C - - - - - 0x011731 04:9721: 38        SEC
C - - - - - 0x011732 04:9722: E9 20     SBC #$20
C - - - - - 0x011734 04:9724: 85 00     STA ram_0000
C - - - - - 0x011736 04:9726: B0 02     BCS bra_972A_not_underflow
C - - - - - 0x011738 04:9728: C6 01     DEC ram_0001
bra_972A_not_underflow:
C - - - - - 0x01173A 04:972A: C6 08     DEC ram_0008
C - - - - - 0x01173C 04:972C: D0 C0     BNE bra_96EE_loop
C - - - - - 0x01173E 04:972E: F0 04     BEQ bra_9734    ; jmp
bra_9730:
C - - - - - 0x011740 04:9730: A9 FF     LDA #$FF
C - - - - - 0x011742 04:9732: 85 0A     STA ram_000A
bra_9734:
; close buffer
C - - - - - 0x011744 04:9734: A9 FF     LDA #$FF
C - - - - - 0x011746 04:9736: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x011749 04:9739: E8        INX
C - - - - - 0x01174A 04:973A: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x01174C 04:973C: A5 0A     LDA ram_000A
bra_973E_80:
C - - - - - 0x01174E 04:973E: A6 10     LDX ram_0010
C - - - - - 0x011750 04:9740: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x011753 04:9743: A5 09     LDA ram_0009
C - - - - - 0x011755 04:9745: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x011758 04:9748: 60        RTS

tbl_9749:
- D 0 - - - 0x011759 04:9749: 0E        .byte $0E   ; ppu address offset
- D 0 - - - 0x01175A 04:974A: 04        .byte $04   ; counter
- D 0 - - - 0x01175B 04:974B: 00        .byte $00, $8E, $8F, $00   ; tiles

- D 0 - - - 0x01175F 04:974F: 0D        .byte $0D   ; ppu address offset
- D 0 - - - 0x011760 04:9750: 06        .byte $06   ; counter
- D 0 - - - 0x011761 04:9751: 00        .byte $00, $8A, $8B, $8C, $8D, $00   ; tiles

- D 0 - - - 0x011767 04:9757: 0D        .byte $0D   ; ppu address offset
- D 0 - - - 0x011768 04:9758: 06        .byte $06   ; counter
- D 0 - - - 0x011769 04:9759: 7C        .byte $7C, $7D, $7E, $7F, $88, $89   ; tiles

- D 0 - - - 0x01176F 04:975F: 0D        .byte $0D   ; ppu address offset
- D 0 - - - 0x011770 04:9760: 06        .byte $06   ; counter
- D 0 - - - 0x011771 04:9761: 79        .byte $79, $7A, $7A, $7A, $7A, $7B   ; tiles

- D 0 - - - 0x011777 04:9767: 0C        .byte $0C   ; ppu address offset
- D 0 - - - 0x011778 04:9768: 08        .byte $08   ; counter
- D 0 - - - 0x011779 04:9769: 00        .byte $00, $73, $74, $75, $76, $77, $78, $00   ; tiles

- D 0 - - - 0x011781 04:9771: 0C        .byte $0C   ; ppu address offset
- D 0 - - - 0x011782 04:9772: 08        .byte $08   ; counter
- D 0 - - - 0x011783 04:9773: 6B        .byte $6B, $6C, $6D, $6E, $6F, $70, $71, $72   ; tiles

- D 0 - - - 0x01178B 04:977B: 0B        .byte $0B   ; ppu address offset
- D 0 - - - 0x01178C 04:977C: 0A        .byte $0A   ; counter
- D 0 - - - 0x01178D 04:977D: 62        .byte $62, $63, $64, $65, $66, $67, $65, $68, $69, $6A   ; tiles

- D 0 - - - 0x011797 04:9787: 0B        .byte $0B   ; ppu address offset
- D 0 - - - 0x011798 04:9788: 0A        .byte $0A   ; counter
- D 0 - - - 0x011799 04:9789: 5A        .byte $5A, $54, $5B, $5C, $5D, $5E, $5F, $60, $59, $61   ; tiles

- D 0 - - - 0x0117A3 04:9793: 0A        .byte $0A   ; ppu address offset
- D 0 - - - 0x0117A4 04:9794: 0C        .byte $0C   ; counter
- D 0 - - - 0x0117A5 04:9795: 00        .byte $00, $00, $54, $55, $56, $57, $58, $55, $56, $59, $00, $00   ; tiles

- D 0 - - - 0x0117B1 04:97A1: 09        .byte $09   ; ppu address offset
- D 0 - - - 0x0117B2 04:97A2: 0E        .byte $0E   ; counter
- D 0 - - - 0x0117B3 04:97A3: 00        .byte $00, $3C, $A8, $4C, $4D, $4E, $4F, $50, $51, $52, $53, $3B, $49, $00   ; tiles

- D 0 - - - 0x0117C1 04:97B1: 09        .byte $09   ; ppu address offset
- D 0 - - - 0x0117C2 04:97B2: 0E        .byte $0E   ; counter
- D 0 - - - 0x0117C3 04:97B3: 00        .byte $00, $A8, $42, $3D, $0B, $4A, $0E, $1D, $4B, $20, $48, $47, $3B, $00   ; tiles

- D 0 - - - 0x0117D1 04:97C1: 09        .byte $09   ; ppu address offset
- D 0 - - - 0x0117D2 04:97C2: 0E        .byte $0E   ; counter
- D 0 - - - 0x0117D3 04:97C3: 3C        .byte $3C, $0A, $3D, $42, $43, $44, $0E, $1D, $45, $46, $47, $48, $22, $49   ; tiles

- D 0 - - - 0x0117E1 04:97D1: 09        .byte $09   ; ppu address offset
- D 0 - - - 0x0117E2 04:97D2: 0E        .byte $0E   ; counter
- D 0 - - - 0x0117E3 04:97D3: A8        .byte $A8, $0A, $09, $39, $0C, $0D, $0E, $1D, $1E, $1F, $3A, $21, $22, $3B   ; tiles

- D 0 - - - 0x0117F1 04:97E1: 09        .byte $09   ; ppu address offset
- D 0 - - - 0x0117F2 04:97E2: 0E        .byte $0E   ; counter
- D 0 - - - 0x0117F3 04:97E3: 09        .byte $09, $0A, $09, $0B, $0C, $0D, $0E, $1D, $1E, $1F, $20, $21, $22, $21   ; tiles

- - - - - - 0x011801 04:97F1: 80        .byte $80   ; end token

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x011B42_51_босс_6_фаза_2_змея:
- D 0 - I - 0x011B42 04:9B32: 3C 9B     .word ofs_038_51_9B3C_01_активация_объекта ; 
- D 0 - I - 0x011B44 04:9B34: 95 9B     .word ofs_038_51_9B95_02 ; 
- D 0 - I - 0x011B46 04:9B36: 11 9C     .word ofs_038_51_9C11_03 ; 
- D 0 - I - 0x011B48 04:9B38: FD A2     .word ofs_038_51_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x011B4A 04:9B3A: 3D A3     .word ofs_038_51_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_51_9B3C_01_активация_объекта:
C - - J - - 0x011B4C 04:9B3C: A9 18     LDA #$18
C - - - - - 0x011B4E 04:9B3E: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x011B51 04:9B41: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x011B54 04:9B44: F0 02     BEQ bra_9B48
C - - - - - 0x011B56 04:9B46: A9 F1     LDA #con_HP_F1
bra_9B48:
C - - - - - 0x011B58 04:9B48: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x011B5B 04:9B4B: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x011B5E 04:9B4E: D0 40     BNE bra_9B90
C - - - - - 0x011B60 04:9B50: A9 F0     LDA #$F0
C - - - - - 0x011B62 04:9B52: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011B65 04:9B55: A0 00     LDY #$00
bra_9B57_loop:
C - - - - - 0x011B67 04:9B57: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011B6A 04:9B5A: 99 40 04  STA ram_0440,Y  ; 0440-049B
C - - - - - 0x011B6D 04:9B5D: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011B70 04:9B60: 99 A0 04  STA ram_04A0,Y  ; 04A0-04FB
C - - - - - 0x011B73 04:9B63: C8        INY
C - - - - - 0x011B74 04:9B64: C0 5C     CPY #$5C
C - - - - - 0x011B76 04:9B66: 90 EF     BCC bra_9B57_loop
C - - - - - 0x011B78 04:9B68: 86 12     STX ram_0012
C - - - - - 0x011B7A 04:9B6A: A9 01     LDA #$01
C - - - - - 0x011B7C 04:9B6C: 85 08     STA ram_0008
bra_9B6E_loop:
C - - - - - 0x011B7E 04:9B6E: 86 10     STX ram_0010
C - - - - - 0x011B80 04:9B70: A0 66     LDY #con_obj_id_51  ; часть от змеи
C - - - - - 0x011B82 04:9B72: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x011B85 04:9B75: 90 12     BCC bra_9B89
C - - - - - 0x011B87 04:9B77: A4 11     LDY ram_0011
C - - - - - 0x011B89 04:9B79: A5 08     LDA ram_0008
C - - - - - 0x011B8B 04:9B7B: 99 64 07  STA ram_0764_obj,Y
C - - - - - 0x011B8E 04:9B7E: E6 08     INC ram_0008
C - - - - - 0x011B90 04:9B80: C9 06     CMP #$06
C - - - - - 0x011B92 04:9B82: 98        TYA
C - - - - - 0x011B93 04:9B83: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x011B96 04:9B86: AA        TAX
C - - - - - 0x011B97 04:9B87: 90 E5     BCC bra_9B6E_loop
bra_9B89:
C - - - - - 0x011B99 04:9B89: A9 FF     LDA #$FF
C - - - - - 0x011B9B 04:9B8B: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x011B9E 04:9B8E: A6 12     LDX ram_0012
bra_9B90:
C - - - - - 0x011BA0 04:9B90: A9 08     LDA #$08    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_51_9B95_02:
C - - J - - 0x011BA5 04:9B95: 20 22 9C  JSR sub_9C22
C - - - - - 0x011BA8 04:9B98: BC 3C 05  LDY ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011BAB 04:9B9B: C0 14     CPY #$14
C - - - - - 0x011BAD 04:9B9D: 90 17     BCC bra_9BB6
C - - - - - 0x011BAF 04:9B9F: C0 24     CPY #$24
C - - - - - 0x011BB1 04:9BA1: 90 08     BCC bra_9BAB
C - - - - - 0x011BB3 04:9BA3: C0 EA     CPY #$EA
C - - - - - 0x011BB5 04:9BA5: B0 0F     BCS bra_9BB6
C - - - - - 0x011BB7 04:9BA7: C0 DC     CPY #$DC
C - - - - - 0x011BB9 04:9BA9: 90 10     BCC bra_9BBB
bra_9BAB:
C - - - - - 0x011BBB 04:9BAB: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x011BBE 04:9BAE: 09 20     ORA #$20
C - - - - - 0x011BC0 04:9BB0: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x011BC3 04:9BB3: 4C BB 9B  BNE bra_9BBB
bra_9BB6:
C - - - - - 0x011BC6 04:9BB6: A9 00     LDA #$00
C - - - - - 0x011BC8 04:9BB8: 9D 08 05  STA ram_кадр_объекта_или_пули,X
bra_9BBB:
C D 0 - - - 0x011BCB 04:9BBB: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x011BCE 04:9BBE: F0 01     BEQ bra_9BC1
C - - - - - 0x011BD0 04:9BC0: 60        RTS
bra_9BC1:
C - - - - - 0x011BD1 04:9BC1: 20 4F 9C  JSR sub_9C4F
C - - - - - 0x011BD4 04:9BC4: AD FF 04  LDA ram_04FF
C - - - - - 0x011BD7 04:9BC7: 38        SEC
C - - - - - 0x011BD8 04:9BC8: E9 01     SBC #$01
C - - - - - 0x011BDA 04:9BCA: C9 5C     CMP #$5C
C - - - - - 0x011BDC 04:9BCC: 90 02     BCC bra_9BD0
C - - - - - 0x011BDE 04:9BCE: 69 5B     ADC #$5B
bra_9BD0:
C - - - - - 0x011BE0 04:9BD0: 8D FF 04  STA ram_04FF
C - - - - - 0x011BE3 04:9BD3: A8        TAY
C - - - - - 0x011BE4 04:9BD4: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011BE7 04:9BD7: 99 40 04  STA ram_0440,Y
C - - - - - 0x011BEA 04:9BDA: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011BED 04:9BDD: 99 A0 04  STA ram_04A0,Y
loc_9BE0:
C D 0 - - - 0x011BF0 04:9BE0: BD 80 07  LDA ram_0780_obj,X
C - - - - - 0x011BF3 04:9BE3: 30 23     BMI bra_9C08
C - - - - - 0x011BF5 04:9BE5: AA        TAX
C - - - - - 0x011BF6 04:9BE6: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x011BF9 04:9BE9: B9 0A 9C  LDA tbl_9C0B - $01,Y
C - - - - - 0x011BFC 04:9BEC: 18        CLC
C - - - - - 0x011BFD 04:9BED: 6D FF 04  ADC ram_04FF
C - - - - - 0x011C00 04:9BF0: B0 04     BCS bra_9BF6
C - - - - - 0x011C02 04:9BF2: C9 5C     CMP #$5C
C - - - - - 0x011C04 04:9BF4: 90 02     BCC bra_9BF8
bra_9BF6:
C - - - - - 0x011C06 04:9BF6: E9 5C     SBC #$5C
bra_9BF8:
C - - - - - 0x011C08 04:9BF8: A8        TAY
C - - - - - 0x011C09 04:9BF9: B9 40 04  LDA ram_0440,Y
C - - - - - 0x011C0C 04:9BFC: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011C0F 04:9BFF: B9 A0 04  LDA ram_04A0,Y
C - - - - - 0x011C12 04:9C02: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011C15 04:9C05: 4C E0 9B  JMP loc_9BE0
bra_9C08:
C - - - - - 0x011C18 04:9C08: A6 10     LDX ram_0010
C - - - - - 0x011C1A 04:9C0A: 60        RTS

tbl_9C0B:
- D 0 - - - 0x011C1B 04:9C0B: 0F        .byte $0F   ; 01 
- D 0 - - - 0x011C1C 04:9C0C: 1E        .byte $1E   ; 02 
- D 0 - - - 0x011C1D 04:9C0D: 2D        .byte $2D   ; 03 
- D 0 - - - 0x011C1E 04:9C0E: 3C        .byte $3C   ; 04 
- D 0 - - - 0x011C1F 04:9C0F: 4B        .byte $4B   ; 05 
- D 0 - - - 0x011C20 04:9C10: 5A        .byte $5A   ; 06 

; ******************************************************************************************************************

ofs_038_51_9C11_03:
C - - J - - 0x011C21 04:9C11: BD 80 07  LDA ram_0780_obj,X
C - - - - - 0x011C24 04:9C14: C9 FF     CMP #$FF
C - - - - - 0x011C26 04:9C16: F0 06     BEQ bra_9C1E_FF
C - - - - - 0x011C28 04:9C18: AA        TAX
C - - - - - 0x011C29 04:9C19: 20 75 A4  JSR sub_0x006485_установить_состояние_смерти_объекту
C - - - - - 0x011C2C 04:9C1C: A6 10     LDX ram_0010
bra_9C1E_FF:
C - - - - - 0x011C2E 04:9C1E: 20 9A A2  JSR sub_0x0062AA_обработка_состояния_смерти_объекта
C - - - - - 0x011C31 04:9C21: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9C22:
C - - - - - 0x011C32 04:9C22: A0 08     LDY #$08
C - - - - - 0x011C34 04:9C24: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x011C37 04:9C27: D0 07     BNE bra_9C30
C - - - - - 0x011C39 04:9C29: BC 48 07  LDY ram_скролл_объекта_Y,X
C - - - - - 0x011C3C 04:9C2C: B9 D4 F4  LDA tbl_0x01F4E4,Y
C - - - - - 0x011C3F 04:9C2F: A8        TAY
bra_9C30:
C - - - - - 0x011C40 04:9C30: B9 3D 9C  LDA tbl_9C3D_кадры_анимации,Y
C - - - - - 0x011C43 04:9C33: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x011C46 04:9C36: B9 46 9C  LDA tbl_9C46_аттрибуты_спрайта,Y
C - - - - - 0x011C49 04:9C39: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x011C4C 04:9C3C: 60        RTS

tbl_9C3D_кадры_анимации:
- D 0 - - - 0x011C4D 04:9C3D: 8B        .byte $8B   ; 00 
- D 0 - - - 0x011C4E 04:9C3E: 8A        .byte $8A   ; 01 
- D 0 - - - 0x011C4F 04:9C3F: 89        .byte $89   ; 02 
- D 0 - - - 0x011C50 04:9C40: 8A        .byte $8A   ; 03 
- D 0 - - - 0x011C51 04:9C41: 8B        .byte $8B   ; 04 
- D 0 - - - 0x011C52 04:9C42: 8C        .byte $8C   ; 05 
- D 0 - - - 0x011C53 04:9C43: 8D        .byte $8D   ; 06 
- D 0 - - - 0x011C54 04:9C44: 8C        .byte $8C   ; 07 
- D 0 - - - 0x011C55 04:9C45: 8E        .byte $8E   ; 08 

tbl_9C46_аттрибуты_спрайта:
- D 0 - - - 0x011C56 04:9C46: 43        .byte $43   ; 00 
- D 0 - - - 0x011C57 04:9C47: 43        .byte $43   ; 01 
- D 0 - - - 0x011C58 04:9C48: 03        .byte $03   ; 02 
- D 0 - - - 0x011C59 04:9C49: 03        .byte $03   ; 03 
- D 0 - - - 0x011C5A 04:9C4A: 03        .byte $03   ; 04 
- D 0 - - - 0x011C5B 04:9C4B: 03        .byte $03   ; 05 
- D 0 - - - 0x011C5C 04:9C4C: 03        .byte $03   ; 06 
- D 0 - - - 0x011C5D 04:9C4D: 43        .byte $43   ; 07 
- D 0 - - - 0x011C5E 04:9C4E: 03        .byte $03   ; 08 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9C4F:
                                        LDY ram_скролл_объекта_X,X
                                        LDA tbl_9C55_lo,y
                                        STA ram_0000
                                        LDA tbl_9C56_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_9C55_lo:
- D 0 - I - 0x011C65 04:9C55: 5B 9C     .byte < ofs_029_9C5B_00
- D 0 - I - 0x011C67 04:9C57: 79 9C     .byte < ofs_029_9C79_01
- D 0 - I - 0x011C69 04:9C59: 9E 9C     .byte < ofs_029_9C9E_02
tbl_9C56_hi:
- D 0 - I - 0x011C65 04:9C55: 5B 9C     .byte > ofs_029_9C5B_00
- D 0 - I - 0x011C67 04:9C57: 79 9C     .byte > ofs_029_9C79_01
- D 0 - I - 0x011C69 04:9C59: 9E 9C     .byte > ofs_029_9C9E_02

; _________________________________________________________________________________________________________________

ofs_029_9C5B_00:
C - - J - - 0x011C6B 04:9C5B: BC 72 07  LDY ram_0772_obj,X
C - - - - - 0x011C6E 04:9C5E: B9 DA 9C  LDA tbl_9CDA_индекс,Y
C - - - - - 0x011C71 04:9C61: A8        TAY
C - - - - - 0x011C72 04:9C62: B9 DE 9C  LDA tbl_9CDE_позиция_Y,Y
C - - - - - 0x011C75 04:9C65: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011C78 04:9C68: B9 E2 9C  LDA tbl_9CE2_позиция_X,Y
C - - - - - 0x011C7B 04:9C6B: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011C7E 04:9C6E: A9 FF     LDA #$FF
C - - - - - 0x011C80 04:9C70: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x011C83 04:9C73: 20 A9 9C  JSR sub_9CA9
C - - - - - 0x011C86 04:9C76: 4C 9A 9C  JMP loc_9C9A

; _________________________________________________________________________________________________________________

ofs_029_9C79_01:
C - - J - - 0x011C89 04:9C79: 20 BA 9D  JSR sub_9DBA_движение_объекта
C - - - - - 0x011C8C 04:9C7C: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011C8F 04:9C7F: D0 1C     BNE bra_9C9D_RTS
C - - - - - 0x011C91 04:9C81: 20 A9 9C  JSR sub_9CA9
C - - - - - 0x011C94 04:9C84: 10 17     BPL bra_9C9D_RTS
C - - - - - 0x011C96 04:9C86: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x011C99 04:9C89: 18        CLC
C - - - - - 0x011C9A 04:9C8A: 69 01     ADC #$01
C - - - - - 0x011C9C 04:9C8C: C9 04     CMP #$04
C - - - - - 0x011C9E 04:9C8E: 90 02     BCC bra_9C92
- - - - - - 0x011CA0 04:9C90: A9 00     LDA #$00
bra_9C92:
C - - - - - 0x011CA2 04:9C92: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x011CA5 04:9C95: A9 80     LDA #$80
C - - - - - 0x011CA7 04:9C97: 9D E6 06  STA ram_счетчики_для_объектов,X
loc_9C9A:
C D 0 - - - 0x011CAA 04:9C9A: FE 56 07  INC ram_скролл_объекта_X,X
bra_9C9D_RTS:
C - - - - - 0x011CAD 04:9C9D: 60        RTS

; _________________________________________________________________________________________________________________

ofs_029_9C9E_02:
C - - J - - 0x011CAE 04:9C9E: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011CB1 04:9CA1: D0 FA     BNE bra_9C9D_RTS
C - - - - - 0x011CB3 04:9CA3: A9 00     LDA #$00
C - - - - - 0x011CB5 04:9CA5: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x011CB8 04:9CA8: 60        RTS



sub_9CA9:
C - - - - - 0x011CB9 04:9CA9: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x011CBC 04:9CAC: BC 72 07  LDY ram_0772_obj,X
C - - - - - 0x011CBF 04:9CAF: B9 DA 9C  LDA tbl_9CDA_индекс,Y
C - - - - - 0x011CC2 04:9CB2: 0A        ASL
C - - - - - 0x011CC3 04:9CB3: A8        TAY
C - - - - - 0x011CC4 04:9CB4: B9 E6 9C  LDA tbl_9CE6_поинтеры,Y
C - - - - - 0x011CC7 04:9CB7: 85 00     STA ram_0000
C - - - - - 0x011CC9 04:9CB9: B9 E7 9C  LDA tbl_9CE6_поинтеры + $01,Y
C - - - - - 0x011CCC 04:9CBC: 85 01     STA ram_0001
C - - - - - 0x011CCE 04:9CBE: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x011CD1 04:9CC1: 0A        ASL
C - - - - - 0x011CD2 04:9CC2: A8        TAY
C - - - - - 0x011CD3 04:9CC3: B1 00     LDA (ram_0000),Y
C - - - - - 0x011CD5 04:9CC5: 30 12     BMI bra_9CD9_RTS
C - - - - - 0x011CD7 04:9CC7: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x011CDA 04:9CCA: C8        INY
C - - - - - 0x011CDB 04:9CCB: B1 00     LDA (ram_0000),Y
C - - - - - 0x011CDD 04:9CCD: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x011CE0 04:9CD0: A0 03     LDY #$03
C - - - - - 0x011CE2 04:9CD2: 84 06     STY ram_0006
C - - - - - 0x011CE4 04:9CD4: 20 2B A9  JSR sub_0x00693B
C - - - - - 0x011CE7 04:9CD7: A9 00     LDA #$00
bra_9CD9_RTS:
C - - - - - 0x011CE9 04:9CD9: 60        RTS

tbl_9CDA_индекс:
- D 0 - - - 0x011CEA 04:9CDA: 02        .byte $00   ; 00 
- D 0 - - - 0x011CEB 04:9CDB: 03        .byte $01   ; 01 
- D 0 - - - 0x011CEC 04:9CDC: 02        .byte $00   ; 02 
- - - - - - 0x011CED 04:9CDD: 03        .byte $01   ; 03 

tbl_9CDE_позиция_Y:
- D 0 - - - 0x011CF0 04:9CE0: 48        .byte $48   ; 02 
- D 0 - - - 0x011CF1 04:9CE1: 48        .byte $48   ; 03 

tbl_9CE2_позиция_X:
- D 0 - - - 0x011CF4 04:9CE4: F0        .byte $F0   ; 02 
- D 0 - - - 0x011CF5 04:9CE5: 10        .byte $10   ; 03 

tbl_9CE6_поинтеры:
- D 0 - - - 0x011CFA 04:9CEA: 24 9D     .word _off024_9D24_02
- D 0 - - - 0x011CFC 04:9CEC: 6F 9D     .word _off024_9D6F_03

; _________________________________________________________________________________________________________________

_off024_9D24_02:
;                                              +---------- 
;                                              |    +----- 
;                                              |    |
- D 0 - I - 0x011D34 04:9D24: 09        .byte $09, $16   ; 00 
- D 0 - I - 0x011D36 04:9D26: 07        .byte $07, $40   ; 01 
- D 0 - I - 0x011D38 04:9D28: 08        .byte $08, $10   ; 02 
- D 0 - I - 0x011D3A 04:9D2A: 09        .byte $09, $10   ; 03 
- D 0 - I - 0x011D3C 04:9D2C: 0A        .byte $0A, $10   ; 04 
- D 0 - I - 0x011D3E 04:9D2E: 0B        .byte $0B, $10   ; 05 
- D 0 - I - 0x011D40 04:9D30: 0C        .byte $0C, $10   ; 06 
- D 0 - I - 0x011D42 04:9D32: 0D        .byte $0D, $0A   ; 07 
- D 0 - I - 0x011D44 04:9D34: 0E        .byte $0E, $0A   ; 08 
- D 0 - I - 0x011D46 04:9D36: 0F        .byte $0F, $0A   ; 09 
- D 0 - I - 0x011D48 04:9D38: 10        .byte $10, $0A   ; 0A 
- D 0 - I - 0x011D4A 04:9D3A: 11        .byte $11, $0A   ; 0B 
- D 0 - I - 0x011D4C 04:9D3C: 12        .byte $12, $0A   ; 0C 
- D 0 - I - 0x011D4E 04:9D3E: 13        .byte $13, $0A   ; 0D 
- D 0 - I - 0x011D50 04:9D40: 14        .byte $14, $0A   ; 0E 
- D 0 - I - 0x011D52 04:9D42: 15        .byte $15, $0A   ; 0F 
- D 0 - I - 0x011D54 04:9D44: 16        .byte $16, $0A   ; 10 
- D 0 - I - 0x011D56 04:9D46: 17        .byte $17, $0A   ; 11 
- D 0 - I - 0x011D58 04:9D48: 00        .byte $00, $10   ; 12 
- D 0 - I - 0x011D5A 04:9D4A: 01        .byte $01, $0A   ; 13 
- D 0 - I - 0x011D5C 04:9D4C: 02        .byte $02, $0A   ; 14 
- D 0 - I - 0x011D5E 04:9D4E: 03        .byte $03, $0A   ; 15 
- D 0 - I - 0x011D60 04:9D50: 04        .byte $04, $0A   ; 16 
- D 0 - I - 0x011D62 04:9D52: 05        .byte $05, $0A   ; 17 
- D 0 - I - 0x011D64 04:9D54: 06        .byte $06, $0A   ; 18 
- D 0 - I - 0x011D66 04:9D56: 07        .byte $07, $0A   ; 19 
- D 0 - I - 0x011D68 04:9D58: 08        .byte $08, $0A   ; 1A 
- D 0 - I - 0x011D6A 04:9D5A: 09        .byte $09, $0A   ; 1B 
- D 0 - I - 0x011D6C 04:9D5C: 0A        .byte $0A, $0A   ; 1C 
- D 0 - I - 0x011D6E 04:9D5E: 0B        .byte $0B, $0A   ; 1D 
- D 0 - I - 0x011D70 04:9D60: 0C        .byte $0C, $10   ; 1E 
- D 0 - I - 0x011D72 04:9D62: 0D        .byte $0D, $10   ; 1F 
- D 0 - I - 0x011D74 04:9D64: 0E        .byte $0E, $10   ; 20 
- D 0 - I - 0x011D76 04:9D66: 0F        .byte $0F, $10   ; 21 
- D 0 - I - 0x011D78 04:9D68: 10        .byte $10, $10   ; 22 
- D 0 - I - 0x011D7A 04:9D6A: 11        .byte $11, $40   ; 23 
- D 0 - I - 0x011D7C 04:9D6C: 0F        .byte $0F, $16   ; 24 
- D 0 - I - 0x011D7E 04:9D6E: FF        .byte $FF   ; 25 final

; _________________________________________________________________________________________________________________

_off024_9D6F_03:
;                                              +---------- 
;                                              |    +----- 
;                                              |    |
- D 0 - I - 0x011D7F 04:9D6F: 03        .byte $03, $16   ; 00 
- D 0 - I - 0x011D81 04:9D71: 05        .byte $05, $40   ; 01 
- D 0 - I - 0x011D83 04:9D73: 04        .byte $04, $10   ; 02 
- D 0 - I - 0x011D85 04:9D75: 03        .byte $03, $10   ; 03 
- D 0 - I - 0x011D87 04:9D77: 02        .byte $02, $10   ; 04 
- D 0 - I - 0x011D89 04:9D79: 01        .byte $01, $10   ; 05 
- D 0 - I - 0x011D8B 04:9D7B: 00        .byte $00, $10   ; 06 
- D 0 - I - 0x011D8D 04:9D7D: 17        .byte $17, $0A   ; 07 
- D 0 - I - 0x011D8F 04:9D7F: 16        .byte $16, $0A   ; 08 
- D 0 - I - 0x011D91 04:9D81: 15        .byte $15, $0A   ; 09 
- D 0 - I - 0x011D93 04:9D83: 14        .byte $14, $0A   ; 0A 
- D 0 - I - 0x011D95 04:9D85: 13        .byte $13, $0A   ; 0B 
- D 0 - I - 0x011D97 04:9D87: 12        .byte $12, $0A   ; 0C 
- D 0 - I - 0x011D99 04:9D89: 11        .byte $11, $0A   ; 0D 
- D 0 - I - 0x011D9B 04:9D8B: 10        .byte $10, $0A   ; 0E 
- D 0 - I - 0x011D9D 04:9D8D: 0F        .byte $0F, $0A   ; 0F 
- D 0 - I - 0x011D9F 04:9D8F: 0E        .byte $0E, $0A   ; 10 
- D 0 - I - 0x011DA1 04:9D91: 0D        .byte $0D, $0A   ; 11 
- D 0 - I - 0x011DA3 04:9D93: 0C        .byte $0C, $10   ; 12 
- D 0 - I - 0x011DA5 04:9D95: 0B        .byte $0B, $0A   ; 13 
- D 0 - I - 0x011DA7 04:9D97: 0A        .byte $0A, $0A   ; 14 
- D 0 - I - 0x011DA9 04:9D99: 09        .byte $09, $0A   ; 15 
- D 0 - I - 0x011DAB 04:9D9B: 08        .byte $08, $0A   ; 16 
- D 0 - I - 0x011DAD 04:9D9D: 07        .byte $07, $0A   ; 17 
- D 0 - I - 0x011DAF 04:9D9F: 06        .byte $06, $0A   ; 18 
- D 0 - I - 0x011DB1 04:9DA1: 05        .byte $05, $0A   ; 19 
- D 0 - I - 0x011DB3 04:9DA3: 04        .byte $04, $0A   ; 1A 
- D 0 - I - 0x011DB5 04:9DA5: 03        .byte $03, $0A   ; 1B 
- D 0 - I - 0x011DB7 04:9DA7: 02        .byte $02, $0A   ; 1C 
- D 0 - I - 0x011DB9 04:9DA9: 01        .byte $01, $0A   ; 1D 
- D 0 - I - 0x011DBB 04:9DAB: 00        .byte $00, $10   ; 1E 
- D 0 - I - 0x011DBD 04:9DAD: 17        .byte $17, $10   ; 1F 
- D 0 - I - 0x011DBF 04:9DAF: 16        .byte $16, $10   ; 20 
- D 0 - I - 0x011DC1 04:9DB1: 15        .byte $15, $10   ; 21 
- D 0 - I - 0x011DC3 04:9DB3: 14        .byte $14, $10   ; 22 
- D 0 - I - 0x011DC5 04:9DB5: 13        .byte $13, $40   ; 23 
- D 0 - I - 0x011DC7 04:9DB7: 15        .byte $15, $16   ; 24 
- D 0 - I - 0x011DC9 04:9DB9: FF        .byte $FF   ; 25 final

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9DBA_движение_объекта:
C - - - - - 0x011DCA 04:9DBA: BD 84 06  LDA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x011DCD 04:9DBD: 18        CLC
C - - - - - 0x011DCE 04:9DBE: 7D A0 06  ADC ram_скорость_объектов_y_младш,X
C - - - - - 0x011DD1 04:9DC1: 9D 84 06  STA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x011DD4 04:9DC4: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011DD7 04:9DC7: 7D AE 06  ADC ram_скорость_объектов_Y_старш,X
C - - - - - 0x011DDA 04:9DCA: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011DDD 04:9DCD: BD 92 06  LDA ram_дробная_скорость_объекта_x_младш,X
C - - - - - 0x011DE0 04:9DD0: 18        CLC
C - - - - - 0x011DE1 04:9DD1: 7D BC 06  ADC ram_скорость_объектов_x_младш,X
C - - - - - 0x011DE4 04:9DD4: 9D 92 06  STA ram_дробная_скорость_объекта_x_младш,X
C - - - - - 0x011DE7 04:9DD7: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011DEA 04:9DDA: 7D CA 06  ADC ram_скорость_объектов_X_старш,X
C - - - - - 0x011DED 04:9DDD: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x011DF0 04:9DE0: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x011802_52_босс_6_фаза_2_пуля_с_автонаводкой:
- D 0 - I - 0x011802 04:97F2: FC 97     .word ofs_038_52_97FC_01_активация_объекта ; 
- D 0 - I - 0x011804 04:97F4: 13 98     .word ofs_038_52_9813_02 ; 
- D 0 - I - 0x011806 04:97F6: 9A A2     .word ofs_038_52_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x011808 04:97F8: FD A2     .word ofs_038_52_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x01180A 04:97FA: 3D A3     .word ofs_038_52_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_52_97FC_01_активация_объекта:
C - - J - - 0x01180C 04:97FC: A9 8F     LDA #$8F
C - - - - - 0x01180E 04:97FE: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x011811 04:9801: A9 02     LDA #$02
C - - - - - 0x011813 04:9803: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x011816 04:9806: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x011819 04:9809: A0 03     LDY #$03
C - - - - - 0x01181B 04:980B: 20 57 A9  JSR sub_0x006967
C - - - - - 0x01181E 04:980E: A9 08     LDA #$08    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_52_9813_02:
C - - J - - 0x011823 04:9813: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011826 04:9816: D0 0D     BNE bra_9825
C - - - - - 0x011828 04:9818: A9 0C     LDA #$0C
C - - - - - 0x01182A 04:981A: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x01182D 04:981D: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x011830 04:9820: A0 03     LDY #$03
C - - - - - 0x011832 04:9822: 20 23 A9  JSR sub_0x006933
bra_9825:
C - - - - - 0x011835 04:9825: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================








; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
















.out .sprintf("Free bytes in bank 2E: %Xh [%d]", ($A000 - *), ($A000 - *))
