.segment "BANK_26"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000 ; for listing file
; 0x00C010-0x01000F



.export _off001_0x004011_20_cannon_hidden_1
.export _off001_0x004506_21_boss_area_1_helicopter
.export _off001_0x0040E9_22_boss_area_1_gun
.export _off001_0x004250_23_boss_area_1_door
.export _off001_0x0043E0_62_helicopter_rotor_blade
.export _off001_0x00448A_6F_thunder



; bzk this byte must be placed at 8000
    .byte con_prg_bank + $26   ; 




_off001_0x004011_20_cannon_hidden_1:
- D 0 - I - 0x004011 01:8001: 13 80     .word ofs_038_20_8013_01_initialize_object ; 
- D 0 - I - 0x004013 01:8003: 3A 80     .word ofs_038_20_803A_02 ; 
- D 0 - I - 0x004015 01:8005: 49 80     .word ofs_038_20_8049_03 ; 
- D 0 - I - 0x004017 01:8007: 6C 80     .word ofs_038_20_806C_04 ; 
- D 0 - I - 0x004019 01:8009: 54 A3     .word ofs_038_20_0x006364_05_удалить_объект_06 ; 
- D 0 - I - 0x00401B 01:800B: 6B A3     .word ofs_038_20_0x00637B_06_удалить_объект_07 ; 
- D 0 - I - 0x00401D 01:800D: B3 80     .word ofs_038_20_80B3_07 ; 
- D 0 - I - 0x00401F 01:800F: FD A2     .word ofs_038_20_0x00630D_08 ; 
- D 0 - I - 0x004021 01:8011: 3D A3     .word ofs_038_20_0x00634D_09_удалить_объект_04 ; 


ofs_038_20_8013_01_initialize_object:
C - - J - - 0x004023 01:8013: A9 01     LDA #$01
C - - - - - 0x004025 01:8015: 9D 08 05  STA ram_кадр_врага_и_пуль,X
C - - - - - 0x004028 01:8018: A9 81     LDA #$81
C - - - - - 0x00402A 01:801A: 9D 2C 07  STA ram_параметры_объектов,X
C - - - - - 0x00402D 01:801D: A9 0C     LDA #$0C
C - - - - - 0x00402F 01:801F: 20 95 AB  JSR sub_0x006BA5_set_dynamic_hp_to_enemy
C - - - - - 0x004032 01:8022: BD 22 05  LDA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x004035 01:8025: 18        CLC
C - - - - - 0x004036 01:8026: 69 08     ADC #$08
C - - - - - 0x004038 01:8028: 9D 22 05  STA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x00403B 01:802B: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x00403E 01:802E: 38        SEC
C - - - - - 0x00403F 01:802F: E9 08     SBC #$08
C - - - - - 0x004041 01:8031: 9D 3C 05  STA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x004044 01:8034: 20 B7 A6  JSR sub_0x0066C7_удалить_объект_03
C - - - - - 0x004047 01:8037: 4C D7 A2  JMP loc_0x0062E7_increase_obj_state



ofs_038_20_803A_02:
C - - J - - 0x00404A 01:803A: 20 B7 A6  JSR sub_0x0066C7_удалить_объект_03
C - - - - - 0x00404D 01:803D: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x004050 01:8040: C9 E8     CMP #$E8
C - - - - - 0x004052 01:8042: B0 6E     BCS bra_80B2_RTS
C - - - - - 0x004054 01:8044: A9 01     LDA #$01
C - - - - - 0x004056 01:8046: 4C E0 A2  JMP loc_0x0062F0



ofs_038_20_8049_03:
C - - J - - 0x004059 01:8049: 20 B7 A6  JSR sub_0x0066C7_удалить_объект_03
C - - - - - 0x00405C 01:804C: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x00405F 01:804F: D0 61     BNE bra_80B2_RTS
C - - - - - 0x004061 01:8051: 20 C0 80  JSR sub_80C0
C - - - - - 0x004064 01:8054: B0 59     BCS bra_80AF
C - - - - - 0x004066 01:8056: FE 10 07  INC ram_0710_obj,X
C - - - - - 0x004069 01:8059: BD 10 07  LDA ram_0710_obj,X
C - - - - - 0x00406C 01:805C: C9 02     CMP #$02
C - - - - - 0x00406E 01:805E: A9 0C     LDA #$0C
C - - - - - 0x004070 01:8060: 90 4D     BCC bra_80AF
C - - - - - 0x004072 01:8062: A9 00     LDA #$00
C - - - - - 0x004074 01:8064: 9D 2C 07  STA ram_параметры_объектов,X
C - - - - - 0x004077 01:8067: A9 20     LDA #$20
C - - - - - 0x004079 01:8069: 4C E0 A2  JMP loc_0x0062F0


ofs_038_20_806C_04:
C - - J - - 0x00407C 01:806C: 20 B7 A6  JSR sub_0x0066C7_удалить_объект_03
C - - - - - 0x00407F 01:806F: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x004082 01:8072: D0 3E     BNE bra_80B2_RTS
; 1путин: удалено чтение кругов
; if 1st loop
C - - - - - 0x004088 01:8078: BD 1E 07  LDA ram_obj_flags,X
C - - - - - 0x00408B 01:807B: 4A        LSR
C - - - - - 0x00408C 01:807C: B0 34     BCS bra_80B2_RTS
; 2+ loop
C - - - - - 0x00408E 01:807E: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x004091 01:8081: C9 30     CMP #$30
C - - - - - 0x004093 01:8083: 90 2D     BCC bra_80B2_RTS
C - - - - - 0x004095 01:8085: A0 02     LDY #$02
C - - - - - 0x004097 01:8087: 20 C8 AB  JSR sub_0x006BD8
C - - - - - 0x00409A 01:808A: 90 26     BCC bra_80B2_RTS
; C = 1
C - - - - - 0x00409C 01:808C: A4 11     LDY ram_0011
C - - - - - 0x00409E 01:808E: A9 00     LDA #< $FD00
C - - - - - 0x0040A0 01:8090: 99 BC 06  STA ram_скорость_объектов_x_младш,Y
C - - - - - 0x0040A3 01:8093: A9 FD     LDA #> $FD00
C - - - - - 0x0040A5 01:8095: 99 CA 06  STA ram_скорость_объектов_x_старш,Y
C - - - - - 0x0040A8 01:8098: A9 01     LDA #$01
C - - - - - 0x0040AA 01:809A: 99 48 07  STA ram_0748_obj,Y
C - - - - - 0x0040AD 01:809D: B9 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,Y
C - - - - - 0x0040B0 01:80A0: E9 10     SBC #$10
C - - - - - 0x0040B2 01:80A2: 99 3C 05  STA ram_позиция_x_спрайта_врага_и_пуль,Y
C - - - - - 0x0040B5 01:80A5: B9 22 05  LDA ram_позиция_y_спрайта_врага_и_пуль,Y
C - - - - - 0x0040B8 01:80A8: 69 02     ADC #$02
C - - - - - 0x0040BA 01:80AA: 99 22 05  STA ram_позиция_y_спрайта_врага_и_пуль,Y
C - - - - - 0x0040BD 01:80AD: A9 60     LDA #$60
bra_80AF:
C - - - - - 0x0040BF 01:80AF: 9D E6 06  STA ram_счетчкики_для_объектов,X
bra_80B2_RTS:
C - - - - - 0x0040C2 01:80B2: 60        RTS


ofs_038_20_80B3_07:
C - - J - - 0x0040C3 01:80B3: A0 02     LDY #$02
C - - - - - 0x0040C5 01:80B5: 20 C3 80  JSR sub_80C3
C - - - - - 0x0040C8 01:80B8: B0 03     BCS bra_80BD
C - - - - - 0x0040CA 01:80BA: 4C 9A A2  JMP loc_0x0062AA
bra_80BD:
- - - - - - 0x0040CD 01:80BD: 4C B7 A6  JMP loc_0x0066C7_удалить_объект_03


sub_80C0:
C - - - - - 0x0040D0 01:80C0: BC 10 07  LDY ram_0710_obj,X
sub_80C3:
C - - - - - 0x0040D3 01:80C3: B9 D6 80  LDA tbl_80D6,Y
C - - - - - 0x0040D6 01:80C6: 85 0C     STA ram_000C
C - - - - - 0x0040D8 01:80C8: B9 D3 80  LDA tbl_80D3,Y
C - - - - - 0x0040DB 01:80CB: A0 10     LDY #$10
C - - - - - 0x0040DD 01:80CD: 20 A8 A8  JSR sub_0x0068B8
C - - - - - 0x0040E0 01:80D0: A9 01     LDA #$01
C - - - - - 0x0040E2 01:80D2: 60        RTS


tbl_80D3:
- D 0 - - - 0x0040E3 01:80D3: F2        .byte $F2   ; 00 
- D 0 - - - 0x0040E4 01:80D4: F3        .byte $F3   ; 01 
- D 0 - - - 0x0040E5 01:80D5: 01        .byte $01   ; 02 

tbl_80D6:
- D 0 - - - 0x0040E6 01:80D6: F1        .byte $F1   ; 00 
- D 0 - - - 0x0040E7 01:80D7: F0        .byte $F0   ; 01 
- D 0 - - - 0x0040E8 01:80D8: 03        .byte $03   ; 02 



_off001_0x004506_21_boss_area_1_helicopter:
- D 0 - I - 0x004506 01:84F6: 0A 85     .word ofs_038_21_850A_01_initialize_object ; 
- D 0 - I - 0x004508 01:84F8: 18 85     .word ofs_038_21_8518_02 ; 
- D 0 - I - 0x00450A 01:84FA: CD 85     .word ofs_038_21_85CD_03 ; 
- D 0 - I - 0x00450C 01:84FC: D9 85     .word ofs_038_21_85D9_04 ; 
- D 0 - I - 0x00450E 01:84FE: EB 85     .word ofs_038_21_85EB_05 ; 
- D 0 - I - 0x004510 01:8500: 1A 86     .word ofs_038_21_861A_06 ; 
- D 0 - I - 0x004512 01:8502: 28 86     .word ofs_038_21_8628_07 ; 
- D 0 - I - 0x004514 01:8504: 38 86     .word ofs_038_21_8638_08 ; 
- D 0 - I - 0x004516 01:8506: F6 A2     .word ofs_038_21_0x006306_09 ; 
- D 0 - I - 0x004518 01:8508: 3B 86     .word ofs_038_21_863B_0A ; 



ofs_038_21_850A_01_initialize_object:
C - - J - - 0x00451A 01:850A: A9 11     LDA #$11
C - - - - - 0x00451C 01:850C: 9D 2C 07  STA ram_параметры_объектов,X
C - - - - - 0x00451F 01:850F: A9 20     LDA #$20
C - - - - - 0x004521 01:8511: 20 99 AB  JSR sub_0x006BA9_set_dynamic_hp_to_boss
C - - - - - 0x004524 01:8514: 4C D7 A2  JMP loc_0x0062E7_increase_obj_state
bra_8517_RTS:
C - - - - - 0x004527 01:8517: 60        RTS


ofs_038_21_8518_02:
C - - J - - 0x004528 01:8518: A5 61     LDA ram_0061_конфиг_уровня
C - - - - - 0x00452A 01:851A: F0 FB     BEQ bra_8517_RTS
C - - - - - 0x00452C 01:851C: A5 60     LDA ram_0060_unk
C - - - - - 0x00452E 01:851E: 05 70     ORA ram_0070
C - - - - - 0x004530 01:8520: D0 F5     BNE bra_8517_RTS
C - - - - - 0x004532 01:8522: A9 A0     LDA #$A0
C - - - - - 0x004534 01:8524: 9D 3C 05  STA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x004537 01:8527: A9 B8     LDA #$B8
C - - - - - 0x004539 01:8529: 9D 22 05  STA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x00453C 01:852C: A9 FF     LDA #$FF
C - - - - - 0x00453E 01:852E: 9D 8E 07  STA ram_позиция_объектов_y_старш,X
C - - - - - 0x004541 01:8531: 9D 9C 07  STA ram_позиция_объектов_x_старш,X
C - - - - - 0x004544 01:8534: A9 E0     LDA #$E0
C - - - - - 0x004546 01:8536: 85 FC     STA ram_scroll_Y
C - - - - - 0x004548 01:8538: A9 00     LDA #$00
C - - - - - 0x00454A 01:853A: 85 FD     STA ram_scroll_X
C - - - - - 0x00454C 01:853C: A9 AB     LDA #$AB
C - - - - - 0x00454E 01:853E: 85 FF     STA ram_for_2000
C - - - - - 0x004550 01:8540: A5 FE     LDA ram_for_2001
C - - - - - 0x004552 01:8542: 29 FD     AND #$FD
C - - - - - 0x004554 01:8544: 85 FE     STA ram_for_2001
C - - - - - 0x004556 01:8546: 20 1B BD  JSR sub_0x007D2B_clear_0480_04FF
; 1путин: 1й босс - выбор банка фона вертолета
                                        LDY ram_option_регион
C - - - - - 0x004559 01:8549: A9 04     LDA tbl_85C6_bg_bank,Y
C - - - - - 0x00455B 01:854B: 8D F0 07  STA ram_bg_bank_1
C - - - - - 0x00455E 01:854E: A9 06     LDA tbl_85C6_bg_bank + $02,Y
C - - - - - 0x004560 01:8550: 8D F1 07  STA ram_bg_bank_2
C - - - - - 0x004563 01:8553: A0 04     LDY #$04
bra_8555_loop:
C - - - - - 0x004565 01:8555: 84 08     STY ram_0008
C - - - - - 0x004567 01:8557: B9 C8 85  LDA tbl_85C8,Y
C - - - - - 0x00456A 01:855A: A8        TAY
C - - - - - 0x00456B 01:855B: 20 C8 AB  JSR sub_0x006BD8
C - - - - - 0x00456E 01:855E: 90 1B     BCC bra_857B
C - - - - - 0x004570 01:8560: A4 08     LDY ram_0008
C - - - - - 0x004572 01:8562: B9 C8 85  LDA tbl_85C8,Y
C - - - - - 0x004575 01:8565: C9 22     CMP #$22
C - - - - - 0x004577 01:8567: D0 03     BNE bra_856C_23
; 22
C - - - - - 0x004579 01:8569: FE 64 07  INC ram_0764_obj,X
bra_856C_23:
C - - - - - 0x00457C 01:856C: 98        TYA
C - - - - - 0x00457D 01:856D: A4 11     LDY ram_0011
C - - - - - 0x00457F 01:856F: 99 1E 07  STA ram_obj_flags,Y
C - - - - - 0x004582 01:8572: 8A        TXA
C - - - - - 0x004583 01:8573: 99 80 07  STA ram_0780_obj,Y
C - - - - - 0x004586 01:8576: A4 08     LDY ram_0008
C - - - - - 0x004588 01:8578: 88        DEY
C - - - - - 0x004589 01:8579: 10 DA     BPL bra_8555_loop
bra_857B:
C - - - - - 0x00458B 01:857B: 20 CE A9  JSR sub_0x0069DE
C - - - - - 0x00458E 01:857E: A9 01     LDA #con_mirroring_H
C - - - - - 0x004590 01:8580: 85 26     STA ram_mirroring
C - - - - - 0x004592 01:8582: A9 01     LDA #con_irq_area_1_boss
C - - - - - 0x004594 01:8584: 85 27     STA ram_irq_handler_hi
C - - - - - 0x004596 01:8586: A9 A2     LDA #$A2
C - - - - - 0x004598 01:8588: 85 45     STA ram_номер_сканлинии
C - - - - - 0x00459A 01:858A: A5 FC     LDA ram_scroll_Y
C - - - - - 0x00459C 01:858C: 85 F9     STA ram_00F9
C - - - - - 0x00459E 01:858E: A5 FD     LDA ram_scroll_X
C - - - - - 0x0045A0 01:8590: 85 FA     STA ram_00FA
C - - - - - 0x0045A2 01:8592: A5 FF     LDA ram_for_2000
C - - - - - 0x0045A4 01:8594: 29 FE     AND #$FE
C - - - - - 0x0045A6 01:8596: 85 FB     STA ram_00FB
C - - - - - 0x0045A8 01:8598: A9 10     LDA #$10
C - - - - - 0x0045AA 01:859A: 9D 22 05  STA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x0045AD 01:859D: A9 00     LDA #$00
C - - - - - 0x0045AF 01:859F: 9D 8E 07  STA ram_позиция_объектов_y_старш,X
C - - - - - 0x0045B2 01:85A2: A9 28     LDA #$28
C - - - - - 0x0045B4 01:85A4: 9D 48 07  STA ram_0748_obj,X
C - - - - - 0x0045B7 01:85A7: A9 00     LDA #$00
C - - - - - 0x0045B9 01:85A9: 9D 56 07  STA ram_scroll_X_obj,X
C - - - - - 0x0045BC 01:85AC: A9 1E     LDA #$1E
C - - - - - 0x0045BE 01:85AE: 9D 72 07  STA ram_0772_obj,X
; 1путин: палитра для европейки
                                        LDX ram_option_регион
C - - - - - 0x0045C1 01:85B1: A0 00     LDY tbl_85C7_color,X
C - - - - - 0x0045C3 01:85B3: 20 64 F9  JSR sub_0x01F974_запись_3х_цветов_с_условием
                                        LDX ram_option_регион
C - - - - - 0x0045C6 01:85B6: A0 04     LDY tbl_85C7_color + $02,X
C - - - - - 0x0045C8 01:85B8: 20 64 F9  JSR sub_0x01F974_запись_3х_цветов_с_условием
C - - - - - 0x0045CB 01:85BB: 20 B8 F7  JSR sub_0x01F7C8
C - - - - - 0x0045CE 01:85BE: A6 10     LDX ram_0010
C - - - - - 0x0045D0 01:85C0: A9 30     LDA #con_sound_30   ; музыка 1го босса вертолета
C - - - - - 0x0045D2 01:85C2: 20 DE FD  JSR sub_0x01FDEE_play_music
C - - - - - 0x0045D5 01:85C5: 4C D7 A2  JMP loc_0x0062E7_increase_obj_state


tbl_85C6_bg_bank:
                                        .byte con_chr_bank + $04    ; 00 US
                                        .byte con_chr_bank + $AD    ; 01 EU
                                        .byte con_chr_bank + $06    ; 00 US
                                        .byte con_chr_bank + $AF    ; 01 EU

tbl_85C7_color:
                                        .byte con_F97C_colors + $00 * $04   ; 00 US
                                        .byte con_F97C_colors + $2D * $04   ; 01 EU
                                        .byte con_F97C_colors + $01 * $04   ; 00 US
                                        .byte con_F97C_colors + $2E * $04   ; 01 EU

tbl_85C8:
- D 0 - - - 0x0045D8 01:85C8: 22        .byte $22   ; 00 
- D 0 - - - 0x0045D9 01:85C9: 22        .byte $22   ; 01 
- D 0 - - - 0x0045DA 01:85CA: 22        .byte $22   ; 02 
- D 0 - - - 0x0045DB 01:85CB: 22        .byte $22   ; 03 
- D 0 - - - 0x0045DC 01:85CC: 23        .byte $23   ; 04 


ofs_038_21_85CD_03:
C - - J - - 0x0045DD 01:85CD: 20 EC A8  JSR sub_0x0068FC
C - - - - - 0x0045E0 01:85D0: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x0045E3 01:85D3: 10 03     BPL bra_85D8_RTS
C - - - - - 0x0045E5 01:85D5: 4C D7 A2  JMP loc_0x0062E7_increase_obj_state
bra_85D8_RTS:
C - - - - - 0x0045E8 01:85D8: 60        RTS


ofs_038_21_85D9_04:
; 1путин
                                        BIT ram_регион
                                        BVC bra_85D9_US
; EU
                                        JSR sub_8789_EU
                                        JMP loc_85DC
bra_85D9_US:
C - - J - - 0x0045E9 01:85D9: 20 99 87  JSR sub_8799_US
loc_85DC:
C - - - - - 0x0045EC 01:85DC: B0 3B     BCS bra_8619_RTS
C - - - - - 0x0045EE 01:85DE: A6 10     LDX ram_0010
C - - - - - 0x0045F0 01:85E0: A9 00     LDA #$00
C - - - - - 0x0045F2 01:85E2: 9D 48 07  STA ram_0748_obj,X
C - - - - - 0x0045F5 01:85E5: 20 68 86  JSR sub_8668
C - - - - - 0x0045F8 01:85E8: 4C E0 A2  JMP loc_0x0062F0





ofs_038_21_85EB_05:
C - - J - - 0x0045FB 01:85EB: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x0045FE 01:85EE: D0 0A     BNE bra_85FA
C - - - - - 0x004600 01:85F0: A9 04     LDA #$04
C - - - - - 0x004602 01:85F2: 9D E6 06  STA ram_счетчкики_для_объектов,X
C - - - - - 0x004605 01:85F5: A9 09     LDA #con_sound_09
C - - - - - 0x004607 01:85F7: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_85FA:
C - - - - - 0x00460A 01:85FA: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x00460D 01:85FD: D0 0B     BNE bra_860A
C - - - - - 0x00460F 01:85FF: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x004611 01:8601: 29 BF     AND #$BF
C - - - - - 0x004613 01:8603: 85 94     STA ram_0094_конфиг_уровня
C - - - - - 0x004615 01:8605: A9 A7     LDA #$A7
C - - - - - 0x004617 01:8607: 9D 08 05  STA ram_кадр_врага_и_пуль,X
bra_860A:
C - - - - - 0x00461A 01:860A: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x00461C 01:860C: 4A        LSR
C - - - - - 0x00461D 01:860D: 4A        LSR
C - - - - - 0x00461E 01:860E: 29 03     AND #$03
C - - - - - 0x004620 01:8610: 9D 56 05  STA ram_атрибуты_спрайта_врага_и_пуль,X
C - - - - - 0x004623 01:8613: 20 B7 86  JSR sub_86B7
C - - - - - 0x004626 01:8616: 4C 5C 86  JMP loc_865C_босс_вертолет
bra_8619_RTS:
- - - - - - 0x004629 01:8619: 60        RTS


ofs_038_21_861A_06:
C - - J - - 0x00462A 01:861A: A9 0B     LDA #$0B
C - - - - - 0x00462C 01:861C: 9D 48 07  STA ram_0748_obj,X
C - - - - - 0x00462F 01:861F: 20 68 86  JSR sub_8668
C - - - - - 0x004632 01:8622: 20 5C 86  JSR sub_865C_босс_вертолет
C - - - - - 0x004635 01:8625: 4C B8 A3  JMP loc_0x0063C8


ofs_038_21_8628_07:
C - - J - - 0x004638 01:8628: BD 22 05  LDA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x00463B 01:862B: C9 A0     CMP #$A0
C - - - - - 0x00463D 01:862D: B0 03     BCS bra_8632
C - - - - - 0x00463F 01:862F: 20 4F A7  JSR sub_0x00675F
bra_8632:
C - - - - - 0x004642 01:8632: 20 5F 86  JSR sub_865F_босс_вертолет
C - - - - - 0x004645 01:8635: 4C D8 A3  JMP loc_0x0063E8


ofs_038_21_8638_08: ; bzk optimize
C - - J - - 0x004648 01:8638: 4C A2 A2  JMP loc_0x0062B2


ofs_038_21_863B_0A:
; 1путин опт
                                        INC ram_002B
C - - - - - 0x00464E 01:863E: A9 AA     LDA #$AA
C - - - - - 0x004650 01:8640: 85 FF     STA ram_for_2000
C - - - - - 0x004652 01:8642: A5 FE     LDA ram_for_2001
C - - - - - 0x004654 01:8644: 09 02     ORA #$02
C - - - - - 0x004656 01:8646: 85 FE     STA ram_for_2001
C - - - - - 0x004658 01:8648: A9 E0     LDA #$E0
C - - - - - 0x00465A 01:864A: 85 FC     STA ram_scroll_Y
C - - - - - 0x00465C 01:864C: 20 88 F1  JSR sub_0x01F198
C - - - - - 0x00465F 01:864F: A9 38     LDA #con_chr_bank + $38
C - - - - - 0x004661 01:8651: 8D F0 07  STA ram_bg_bank_1
C - - - - - 0x004664 01:8654: A9 3A     LDA #con_chr_bank + $3A
C - - - - - 0x004666 01:8656: 8D F1 07  STA ram_bg_bank_2
C - - - - - 0x004669 01:8659: 4C 37 A3  JMP loc_0x006347_удалить_объект_босс


sub_8789_EU:
; US 0x0047A9

- - - - - - 0x00479F 01:878F: A6 1E     LDX ram_index_ppu_buffer
- - - - - - 0x0047A1 01:8791: E0 40     CPX #$40
- - - - - - 0x0047A3 01:8793: B0 0F     BCS bra_87A4_skip
- - - - - - 0x004799 01:8789: A9 21     LDA #$21    ; колво байтов в таблице
- - - - - - 0x00479B 01:878B: 85 08     STA ram_0008
- - - - - - 0x00479D 01:878D: A0 00     LDY #$00
bra_8795_loop:
- - - - - - 0x0047A5 01:8795: B9 A7 87  LDA tbl_87A7,Y
- - - - - - 0x0047A8 01:8798: 9D 00 03  STA ram_nmt_buffer,X
- - - - - - 0x0047AB 01:879B: E8        INX
- - - - - - 0x0047AC 01:879C: C8        INY
- - - - - - 0x0047AD 01:879D: C6 08     DEC ram_0008
- - - - - - 0x0047AF 01:879F: D0 F4     BNE bra_8795_loop
- - - - - - 0x0047B1 01:87A1: 86 1E     STX ram_index_ppu_buffer
- - - - - - 0x0047B3 01:87A3: 18        CLC
bra_87A4_skip:
- - - - - - 0x0047B4 01:87A4: A6 10     LDX ram_0010
- - - - - - 0x0047B6 01:87A6: 60        RTS



tbl_87A7:
- - - - - - 0x0047B7 01:87A7: 03        .byte con_buf_mode_03   ; 

- - - - - - 0x0047B8 01:87A8: 2B D8     .dbyt $2BD8 ; ppu address
- - - - - - 0x0047BA 01:87AA: 09        .byte $09, $AA   ; counter + fill tile

- - - - - - 0x0047BC 01:87AC: 06        .byte con_buf_mode_06   ; 

- - - - - - 0x0047BD 01:87AD: 2B E1     .dbyt $2BE1 ; ppu address
- - - - - - 0x0047BF 01:87AF: 17        .byte $17   ; counter
- - - - - - 0x0047C0 01:87B0: EA        .byte $EA, $FA, $EA, $FA, $FA, $BA, $EA, $FB, $FB, $0F, $EB, $FA, $AA, $EA, $FB, $00   ; 
- - - - - - 0x0047D0 01:87C0: 00        .byte $00, $00, $EF, $AA, $AA, $AA, $AA   ; 

- - - - - - 0x0047D7 01:87C7: FF        .byte $FF   ; close buffer


sub_8799_US:
; 1путин опт
                                        LDX ram_index_ppu_buffer
                                        CPX #$40    ; колво байтов в таблице
                                        BCS bra_87B4_skip
C - - - - - 0x0047A9 01:8799: A9 14     LDA #$14
C - - - - - 0x0047AB 01:879B: 85 08     STA ram_0008
C - - - - - 0x0047AD 01:879D: A0 00     LDY #$00
; if buffer is not too loaded
bra_87A5_loop:
C - - - - - 0x0047B5 01:87A5: B9 B7 87  LDA tbl_87B7,Y
C - - - - - 0x0047B8 01:87A8: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0047BB 01:87AB: E8        INX
C - - - - - 0x0047BC 01:87AC: C8        INY
C - - - - - 0x0047BD 01:87AD: C6 08     DEC ram_0008
C - - - - - 0x0047BF 01:87AF: D0 F4     BNE bra_87A5_loop
C - - - - - 0x0047C1 01:87B1: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x0047C3 01:87B3: 18        CLC
bra_87B4_skip:
C - - - - - 0x0047C4 01:87B4: A6 10     LDX ram_0010
C - - - - - 0x0047C6 01:87B6: 60        RTS


sub_8668:
loc_8668:
C D 0 - - - 0x004678 01:8668: BD 48 07  LDA ram_0748_obj,X
C - - - - - 0x00467B 01:866B: 0A        ASL
C - - - - - 0x00467C 01:866C: 0A        ASL
C - - - - - 0x00467D 01:866D: A8        TAY
C - - - - - 0x00467E 01:866E: B9 87 86  LDA tbl_8687_speed,Y
C - - - - - 0x004681 01:8671: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x004684 01:8674: B9 88 86  LDA tbl_8687_speed + $01,Y
C - - - - - 0x004687 01:8677: 9D AE 06  STA ram_скорость_объектов_y_старш,X
C - - - - - 0x00468A 01:867A: B9 89 86  LDA tbl_8687_speed + $02,Y
C - - - - - 0x00468D 01:867D: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x004690 01:8680: B9 8A 86  LDA tbl_8687_speed + $03,Y
C - - - - - 0x004693 01:8683: 9D CA 06  STA ram_скорость_объектов_x_старш,X
C - - - - - 0x004696 01:8686: 60        RTS


tbl_8687_speed:
; 00 
- D 0 - - - 0x004697 01:8687: 00 00     .word $0000 ; Y
- D 0 - - - 0x004699 01:8689: 50 00     .word $0050 ; X
; 01 
- D 0 - - - 0x00469B 01:868B: 50 00     .word $0050 ; Y
- D 0 - - - 0x00469D 01:868D: 50 00     .word $0050 ; X
; 02 
- D 0 - - - 0x00469F 01:868F: 00 00     .word $0000 ; Y
- D 0 - - - 0x0046A1 01:8691: 50 00     .word $0050 ; X
; 03 
- D 0 - - - 0x0046A3 01:8693: 50 00     .word $0050 ; Y
- D 0 - - - 0x0046A5 01:8695: 50 00     .word $0050 ; X
; 04 
- D 0 - - - 0x0046A7 01:8697: 00 00     .word $0000 ; Y
- D 0 - - - 0x0046A9 01:8699: 50 00     .word $0050 ; X
; 05 
- D 0 - - - 0x0046AB 01:869B: 00 00     .word $0000 ; Y
- D 0 - - - 0x0046AD 01:869D: B0 FF     .word $FFB0 ; X
; 06 
- D 0 - - - 0x0046AF 01:869F: B0 FF     .word $FFB0 ; Y
- D 0 - - - 0x0046B1 01:86A1: B0 FF     .word $FFB0 ; X
; 07 
- D 0 - - - 0x0046B3 01:86A3: 00 00     .word $0000 ; Y
- D 0 - - - 0x0046B5 01:86A5: B0 FF     .word $FFB0 ; X
; 08 
- D 0 - - - 0x0046B7 01:86A7: 50 00     .word $0050 ; Y
- D 0 - - - 0x0046B9 01:86A9: 50 00     .word $0050 ; X
; 09 
- D 0 - - - 0x0046BB 01:86AB: 00 00     .word $0000 ; Y
- D 0 - - - 0x0046BD 01:86AD: 50 00     .word $0050 ; X
; 0A 
- D 0 - - - 0x0046BF 01:86AF: B0 FF     .word $FFB0 ; Y
- D 0 - - - 0x0046C1 01:86B1: B0 FF     .word $FFB0 ; X
; 0B 
- D 0 - - - 0x0046C3 01:86B3: 50 00     .word $0050 ; Y
- D 0 - - - 0x0046C5 01:86B5: 00 00     .word $0000 ; X


loc_865C_босс_вертолет:
sub_865C_босс_вертолет:
C D 0 - - - 0x00466C 01:865C: 20 4F A7  JSR sub_0x00675F
sub_865F_босс_вертолет:
C - - - - - 0x00466F 01:865F: 20 0A AA  JSR sub_0x006A1A
; 1путин: вертолет EU/US
                                        BIT ram_регион
                                        BVC bra_8660_US
; EU
                                        JSR sub_87C9_отрисовка_босса_вертолета_EU
                                        JMP loc_8999_анимация_винтов_вертолет_US_EU
bra_8660_US:
C - - - - - 0x004672 01:8662: 20 CC 87  JSR sub_87CC_отрисовка_босса_вертолета_US
C - - - - - 0x004675 01:8665: 4C 90 89  JMP loc_8999_анимация_винтов_вертолет_US_EU

bra_87C8_RTS:
- - - - - - 0x0047D8 01:87C8: 60        RTS

sub_87C9_отрисовка_босса_вертолета_EU:
; 1й босс вертолет
- - - - - - 0x0047D9 01:87C9: A5 FD     LDA ram_scroll_X
- - - - - - 0x0047DB 01:87CB: 29 07     AND #$07
- - - - - - 0x0047DD 01:87CD: DD 56 07  CMP ram_scroll_X_obj,X
- - - - - - 0x0047E0 01:87D0: F0 F6     BEQ bra_87C8_RTS
- - - - - - 0x0047E2 01:87D2: 9D 56 07  STA ram_scroll_X_obj,X
- - - - - - 0x0047E5 01:87D5: BD CA 06  LDA ram_скорость_объектов_x_старш,X
- - - - - - 0x0047E8 01:87D8: 2A        ROL
- - - - - - 0x0047E9 01:87D9: 2A        ROL
- - - - - - 0x0047EA 01:87DA: 29 01     AND #$01
- - - - - - 0x0047EC 01:87DC: DD 56 07  CMP ram_scroll_X_obj,X
- - - - - - 0x0047EF 01:87DF: D0 E7     BNE bra_87C8_RTS
- - - - - - 0x0047F1 01:87E1: A5 FD     LDA ram_scroll_X
- - - - - - 0x0047F3 01:87E3: 4A        LSR
- - - - - - 0x0047F4 01:87E4: 4A        LSR
- - - - - - 0x0047F5 01:87E5: 4A        LSR
- - - - - - 0x0047F6 01:87E6: 85 0B     STA ram_000B
- - - - - - 0x0047F8 01:87E8: BD CA 06  LDA ram_скорость_объектов_x_старш,X
- - - - - - 0x0047FB 01:87EB: 0A        ASL
- - - - - - 0x0047FC 01:87EC: A5 FF     LDA ram_for_2000
- - - - - - 0x0047FE 01:87EE: 90 02     BCC bra_87F2
- - - - - - 0x004800 01:87F0: 49 01     EOR #$01
bra_87F2:
- - - - - - 0x004802 01:87F2: 4A        LSR
- - - - - - 0x004803 01:87F3: A0 00     LDY #$00
- - - - - - 0x004805 01:87F5: A5 0B     LDA ram_000B
- - - - - - 0x004807 01:87F7: 90 0A     BCC bra_8803
- - - - - - 0x004809 01:87F9: C9 01     CMP #$01
- - - - - - 0x00480B 01:87FB: B0 11     BCS bra_880E
- - - - - - 0x00480D 01:87FD: 69 20     ADC #$20
- - - - - - 0x00480F 01:87FF: 18        CLC
- - - - - - 0x004810 01:8800: 4C 0B 88  JMP loc_880B
bra_8803:
- - - - - - 0x004813 01:8803: C9 03     CMP #$03
- - - - - - 0x004815 01:8805: 90 07     BCC bra_880E
- - - - - - 0x004817 01:8807: C9 20     CMP #$20
- - - - - - 0x004819 01:8809: B0 03     BCS bra_880E
loc_880B:
- - - - - - 0x00481B 01:880B: E9 02     SBC #$02
- - - - - - 0x00481D 01:880D: A8        TAY
bra_880E:
- - - - - - 0x00481E 01:880E: 98        TYA
- - - - - - 0x00481F 01:880F: 18        CLC
- - - - - - 0x004820 01:8810: 6D 61 88  ADC tbl_8861
- - - - - - 0x004823 01:8813: 85 08     STA ram_0008
- - - - - - 0x004825 01:8815: A9 00     LDA #$00
- - - - - - 0x004827 01:8817: 6D 62 88  ADC tbl_8861 + $01
- - - - - - 0x00482A 01:881A: 85 09     STA ram_0009
- - - - - - 0x00482C 01:881C: A6 1E     LDX ram_index_ppu_buffer
- - - - - - 0x00482E 01:881E: A9 07     LDA #con_buf_mode_07
- - - - - - 0x004830 01:8820: 9D 00 03  STA ram_nmt_buffer,X
- - - - - - 0x004833 01:8823: E8        INX
- - - - - - 0x004834 01:8824: A5 0B     LDA ram_000B
- - - - - - 0x004836 01:8826: 18        CLC
- - - - - - 0x004837 01:8827: 69 E0     ADC #< $29E0
- - - - - - 0x004839 01:8829: 9D 01 03  STA ram_nmt_buffer + $01,X
- - - - - - 0x00483C 01:882C: A9 00     LDA #$00
- - - - - - 0x00483E 01:882E: 69 29     ADC #> $29E0
- - - - - - 0x004840 01:8830: 9D 00 03  STA ram_nmt_buffer,X
- - - - - - 0x004843 01:8833: E8        INX
- - - - - - 0x004844 01:8834: E8        INX
- - - - - - 0x004845 01:8835: A9 0A     LDA #$0A    ; counter
- - - - - - 0x004847 01:8837: 9D 00 03  STA ram_nmt_buffer,X
- - - - - - 0x00484A 01:883A: 85 0A     STA ram_000A
- - - - - - 0x00484C 01:883C: E8        INX
- - - - - - 0x00484D 01:883D: A0 00     LDY #$00
bra_883F_loop:
- - - - - - 0x00484F 01:883F: B1 08     LDA (ram_0008),Y
- - - - - - 0x004851 01:8841: 9D 00 03  STA ram_nmt_buffer,X
- - - - - - 0x004854 01:8844: E8        INX
- - - - - - 0x004855 01:8845: A5 08     LDA ram_0008
- - - - - - 0x004857 01:8847: 18        CLC
- - - - - - 0x004858 01:8848: 69 1E     ADC #< $001E
- - - - - - 0x00485A 01:884A: 85 08     STA ram_0008
- - - - - - 0x00485C 01:884C: A5 09     LDA ram_0009
- - - - - - 0x00485E 01:884E: 69 00     ADC #> $001E
- - - - - - 0x004860 01:8850: 85 09     STA ram_0009
- - - - - - 0x004862 01:8852: C6 0A     DEC ram_000A
- - - - - - 0x004864 01:8854: D0 E9     BNE bra_883F_loop
- - - - - - 0x004866 01:8856: A9 FF     LDA #$FF
- - - - - - 0x004868 01:8858: 9D 00 03  STA ram_nmt_buffer,X
- - - - - - 0x00486B 01:885B: E8        INX
- - - - - - 0x00486C 01:885C: 86 1E     STX ram_index_ppu_buffer
- - - - - - 0x00486E 01:885E: A6 10     LDX ram_0010
- - - - - - 0x004870 01:8860: 60        RTS



tbl_8861:
                                        .word off_8861_00
; 1E bytes in a row, 0A columns
; 00
off_8861_00:
- - - - - - 0x004873 01:8863: 00        .byte $00   ; 
- - - - - - 0x004874 01:8864: 00        .byte $00   ; 
- - - - - - 0x004875 01:8865: 00        .byte $00   ; 
- - - - - - 0x004876 01:8866: 00        .byte $00   ; 
- - - - - - 0x004877 01:8867: 00        .byte $00   ; 
- - - - - - 0x004878 01:8868: 00        .byte $00   ; 
- - - - - - 0x004879 01:8869: 00        .byte $00   ; 
- - - - - - 0x00487A 01:886A: 00        .byte $00   ; 
- - - - - - 0x00487B 01:886B: 00        .byte $00   ; 
- - - - - - 0x00487C 01:886C: 00        .byte $00   ; 
- - - - - - 0x00487D 01:886D: 00        .byte $00   ; 
- - - - - - 0x00487E 01:886E: 00        .byte $00   ; 
- - - - - - 0x00487F 01:886F: 00        .byte $00   ; 
- - - - - - 0x004880 01:8870: 00        .byte $00   ; 
- - - - - - 0x004881 01:8871: 00        .byte $00   ; 
- - - - - - 0x004882 01:8872: 00        .byte $00   ; 
- - - - - - 0x004883 01:8873: 00        .byte $00   ; 
- - - - - - 0x004884 01:8874: 3C        .byte $3C   ; 
- - - - - - 0x004885 01:8875: 3D        .byte $3D   ; 
- - - - - - 0x004886 01:8876: 00        .byte $00   ; 
- - - - - - 0x004887 01:8877: 00        .byte $00   ; 
- - - - - - 0x004888 01:8878: 00        .byte $00   ; 
- - - - - - 0x004889 01:8879: 00        .byte $00   ; 
- - - - - - 0x00488A 01:887A: 00        .byte $00   ; 
- - - - - - 0x00488B 01:887B: 00        .byte $00   ; 
- - - - - - 0x00488C 01:887C: 00        .byte $00   ; 
- - - - - - 0x00488D 01:887D: 00        .byte $00   ; 
- - - - - - 0x00488E 01:887E: 00        .byte $00   ; 
; 01 
- - - - - - 0x00488F 01:887F: 00        .byte $00   ; 
- - - - - - 0x004890 01:8880: 00        .byte $00   ; 
- - - - - - 0x004891 01:8881: 00        .byte $00   ; 
- - - - - - 0x004892 01:8882: 00        .byte $00   ; 
- - - - - - 0x004893 01:8883: 00        .byte $00   ; 
- - - - - - 0x004894 01:8884: 00        .byte $00   ; 
- - - - - - 0x004895 01:8885: 00        .byte $00   ; 
- - - - - - 0x004896 01:8886: 00        .byte $00   ; 
- - - - - - 0x004897 01:8887: 00        .byte $00   ; 
- - - - - - 0x004898 01:8888: 00        .byte $00   ; 
- - - - - - 0x004899 01:8889: 00        .byte $00   ; 
- - - - - - 0x00489A 01:888A: 00        .byte $00   ; 
- - - - - - 0x00489B 01:888B: 00        .byte $00   ; 
- - - - - - 0x00489C 01:888C: 00        .byte $00   ; 
- - - - - - 0x00489D 01:888D: 00        .byte $00   ; 
- - - - - - 0x00489E 01:888E: 00        .byte $00   ; 
- - - - - - 0x00489F 01:888F: 00        .byte $00   ; 
- - - - - - 0x0048A0 01:8890: 00        .byte $00   ; 
- - - - - - 0x0048A1 01:8891: 00        .byte $00   ; 
- - - - - - 0x0048A2 01:8892: 3E        .byte $3E   ; 
- - - - - - 0x0048A3 01:8893: 3F        .byte $3F   ; 
- - - - - - 0x0048A4 01:8894: 00        .byte $00   ; 
- - - - - - 0x0048A5 01:8895: 00        .byte $00   ; 
- - - - - - 0x0048A6 01:8896: 00        .byte $00   ; 
- - - - - - 0x0048A7 01:8897: 00        .byte $00   ; 
- - - - - - 0x0048A8 01:8898: 00        .byte $00   ; 
- - - - - - 0x0048A9 01:8899: 00        .byte $00   ; 
- - - - - - 0x0048AA 01:889A: 00        .byte $00   ; 
- - - - - - 0x0048AB 01:889B: 00        .byte $00   ; 
- - - - - - 0x0048AC 01:889C: 00        .byte $00   ; 
; 02 
- - - - - - 0x0048AD 01:889D: 00        .byte $00   ; 
- - - - - - 0x0048AE 01:889E: 00        .byte $00   ; 
- - - - - - 0x0048AF 01:889F: 00        .byte $00   ; 
- - - - - - 0x0048B0 01:88A0: 08        .byte $08   ; 
- - - - - - 0x0048B1 01:88A1: 00        .byte $00   ; 
- - - - - - 0x0048B2 01:88A2: 00        .byte $00   ; 
- - - - - - 0x0048B3 01:88A3: 00        .byte $00   ; 
- - - - - - 0x0048B4 01:88A4: 00        .byte $00   ; 
- - - - - - 0x0048B5 01:88A5: 00        .byte $00   ; 
- - - - - - 0x0048B6 01:88A6: 00        .byte $00   ; 
- - - - - - 0x0048B7 01:88A7: 00        .byte $00   ; 
- - - - - - 0x0048B8 01:88A8: 00        .byte $00   ; 
- - - - - - 0x0048B9 01:88A9: 00        .byte $00   ; 
- - - - - - 0x0048BA 01:88AA: 00        .byte $00   ; 
- - - - - - 0x0048BB 01:88AB: 00        .byte $00   ; 
- - - - - - 0x0048BC 01:88AC: 00        .byte $00   ; 
- - - - - - 0x0048BD 01:88AD: 40        .byte $40   ; 
- - - - - - 0x0048BE 01:88AE: 41        .byte $41   ; 
- - - - - - 0x0048BF 01:88AF: 42        .byte $42   ; 
- - - - - - 0x0048C0 01:88B0: 42        .byte $42   ; 
- - - - - - 0x0048C1 01:88B1: 42        .byte $42   ; 
- - - - - - 0x0048C2 01:88B2: 42        .byte $42   ; 
- - - - - - 0x0048C3 01:88B3: 43        .byte $43   ; 
- - - - - - 0x0048C4 01:88B4: 44        .byte $44   ; 
- - - - - - 0x0048C5 01:88B5: 45        .byte $45   ; 
- - - - - - 0x0048C6 01:88B6: 46        .byte $46   ; 
- - - - - - 0x0048C7 01:88B7: 00        .byte $00   ; 
- - - - - - 0x0048C8 01:88B8: 00        .byte $00   ; 
- - - - - - 0x0048C9 01:88B9: 00        .byte $00   ; 
- - - - - - 0x0048CA 01:88BA: 00        .byte $00   ; 
; 03 
- - - - - - 0x0048CB 01:88BB: 00        .byte $00   ; 
- - - - - - 0x0048CC 01:88BC: 00        .byte $00   ; 
- - - - - - 0x0048CD 01:88BD: 00        .byte $00   ; 
- - - - - - 0x0048CE 01:88BE: 0B        .byte $0B   ; 
- - - - - - 0x0048CF 01:88BF: 08        .byte $08   ; 
- - - - - - 0x0048D0 01:88C0: 00        .byte $00   ; 
- - - - - - 0x0048D1 01:88C1: 00        .byte $00   ; 
- - - - - - 0x0048D2 01:88C2: 00        .byte $00   ; 
- - - - - - 0x0048D3 01:88C3: 00        .byte $00   ; 
- - - - - - 0x0048D4 01:88C4: 00        .byte $00   ; 
- - - - - - 0x0048D5 01:88C5: 00        .byte $00   ; 
- - - - - - 0x0048D6 01:88C6: 00        .byte $00   ; 
- - - - - - 0x0048D7 01:88C7: 00        .byte $00   ; 
- - - - - - 0x0048D8 01:88C8: 0C        .byte $0C   ; 
- - - - - - 0x0048D9 01:88C9: 0D        .byte $0D   ; 
- - - - - - 0x0048DA 01:88CA: 0E        .byte $0E   ; 
- - - - - - 0x0048DB 01:88CB: 47        .byte $47   ; 
- - - - - - 0x0048DC 01:88CC: 48        .byte $48   ; 
- - - - - - 0x0048DD 01:88CD: 49        .byte $49   ; 
- - - - - - 0x0048DE 01:88CE: 49        .byte $49   ; 
- - - - - - 0x0048DF 01:88CF: 49        .byte $49   ; 
- - - - - - 0x0048E0 01:88D0: 4A        .byte $4A   ; 
- - - - - - 0x0048E1 01:88D1: 4B        .byte $4B   ; 
- - - - - - 0x0048E2 01:88D2: 4C        .byte $4C   ; 
- - - - - - 0x0048E3 01:88D3: 4D        .byte $4D   ; 
- - - - - - 0x0048E4 01:88D4: 4E        .byte $4E   ; 
- - - - - - 0x0048E5 01:88D5: 4F        .byte $4F   ; 
- - - - - - 0x0048E6 01:88D6: 50        .byte $50   ; 
- - - - - - 0x0048E7 01:88D7: 51        .byte $51   ; 
- - - - - - 0x0048E8 01:88D8: 00        .byte $00   ; 
; 04 
- - - - - - 0x0048E9 01:88D9: 00        .byte $00   ; 
- - - - - - 0x0048EA 01:88DA: 00        .byte $00   ; 
- - - - - - 0x0048EB 01:88DB: 00        .byte $00   ; 
- - - - - - 0x0048EC 01:88DC: 10        .byte $10   ; 
- - - - - - 0x0048ED 01:88DD: 11        .byte $11   ; 
- - - - - - 0x0048EE 01:88DE: 12        .byte $12   ; 
- - - - - - 0x0048EF 01:88DF: 12        .byte $12   ; 
- - - - - - 0x0048F0 01:88E0: 12        .byte $12   ; 
- - - - - - 0x0048F1 01:88E1: 12        .byte $12   ; 
- - - - - - 0x0048F2 01:88E2: 12        .byte $12   ; 
- - - - - - 0x0048F3 01:88E3: 13        .byte $13   ; 
- - - - - - 0x0048F4 01:88E4: 14        .byte $14   ; 
- - - - - - 0x0048F5 01:88E5: 15        .byte $15   ; 
- - - - - - 0x0048F6 01:88E6: 16        .byte $16   ; 
- - - - - - 0x0048F7 01:88E7: 16        .byte $16   ; 
- - - - - - 0x0048F8 01:88E8: 17        .byte $17   ; 
- - - - - - 0x0048F9 01:88E9: 52        .byte $52   ; 
- - - - - - 0x0048FA 01:88EA: 53        .byte $53   ; 
- - - - - - 0x0048FB 01:88EB: 53        .byte $53   ; 
- - - - - - 0x0048FC 01:88EC: 53        .byte $53   ; 
- - - - - - 0x0048FD 01:88ED: 53        .byte $53   ; 
- - - - - - 0x0048FE 01:88EE: 54        .byte $54   ; 
- - - - - - 0x0048FF 01:88EF: 55        .byte $55   ; 
- - - - - - 0x004900 01:88F0: 56        .byte $56   ; 
- - - - - - 0x004901 01:88F1: 57        .byte $57   ; 
- - - - - - 0x004902 01:88F2: 58        .byte $58   ; 
- - - - - - 0x004903 01:88F3: 59        .byte $59   ; 
- - - - - - 0x004904 01:88F4: 5A        .byte $5A   ; 
- - - - - - 0x004905 01:88F5: 5B        .byte $5B   ; 
- - - - - - 0x004906 01:88F6: 5C        .byte $5C   ; 
; 05 
- - - - - - 0x004907 01:88F7: 00        .byte $00   ; 
- - - - - - 0x004908 01:88F8: 00        .byte $00   ; 
- - - - - - 0x004909 01:88F9: 00        .byte $00   ; 
- - - - - - 0x00490A 01:88FA: 18        .byte $18   ; 
- - - - - - 0x00490B 01:88FB: 19        .byte $19   ; 
- - - - - - 0x00490C 01:88FC: 1A        .byte $1A   ; 
- - - - - - 0x00490D 01:88FD: 1B        .byte $1B   ; 
- - - - - - 0x00490E 01:88FE: 1C        .byte $1C   ; 
- - - - - - 0x00490F 01:88FF: 1D        .byte $1D   ; 
- - - - - - 0x004910 01:8900: 1D        .byte $1D   ; 
- - - - - - 0x004911 01:8901: 1E        .byte $1E   ; 
- - - - - - 0x004912 01:8902: 1E        .byte $1E   ; 
- - - - - - 0x004913 01:8903: 1F        .byte $1F   ; 
- - - - - - 0x004914 01:8904: 1E        .byte $1E   ; 
- - - - - - 0x004915 01:8905: 34        .byte $34   ; 
- - - - - - 0x004916 01:8906: 35        .byte $35   ; 
- - - - - - 0x004917 01:8907: 5D        .byte $5D   ; 
- - - - - - 0x004918 01:8908: 34        .byte $34   ; 
- - - - - - 0x004919 01:8909: 35        .byte $35   ; 
- - - - - - 0x00491A 01:890A: 5D        .byte $5D   ; 
- - - - - - 0x00491B 01:890B: 34        .byte $34   ; 
- - - - - - 0x00491C 01:890C: 35        .byte $35   ; 
- - - - - - 0x00491D 01:890D: 5D        .byte $5D   ; 
- - - - - - 0x00491E 01:890E: 34        .byte $34   ; 
- - - - - - 0x00491F 01:890F: 35        .byte $35   ; 
- - - - - - 0x004920 01:8910: 5E        .byte $5E   ; 
- - - - - - 0x004921 01:8911: 5F        .byte $5F   ; 
- - - - - - 0x004922 01:8912: 60        .byte $60   ; 
- - - - - - 0x004923 01:8913: 61        .byte $61   ; 
- - - - - - 0x004924 01:8914: 62        .byte $62   ; 
; 06 
- - - - - - 0x004925 01:8915: 63        .byte $63   ; 
- - - - - - 0x004926 01:8916: 64        .byte $64   ; 
- - - - - - 0x004927 01:8917: 00        .byte $00   ; 
- - - - - - 0x004928 01:8918: 00        .byte $00   ; 
- - - - - - 0x004929 01:8919: 22        .byte $22   ; 
- - - - - - 0x00492A 01:891A: 23        .byte $23   ; 
- - - - - - 0x00492B 01:891B: 23        .byte $23   ; 
- - - - - - 0x00492C 01:891C: 24        .byte $24   ; 
- - - - - - 0x00492D 01:891D: 25        .byte $25   ; 
- - - - - - 0x00492E 01:891E: 25        .byte $25   ; 
- - - - - - 0x00492F 01:891F: 26        .byte $26   ; 
- - - - - - 0x004930 01:8920: 26        .byte $26   ; 
- - - - - - 0x004931 01:8921: 27        .byte $27   ; 
- - - - - - 0x004932 01:8922: 28        .byte $28   ; 
- - - - - - 0x004933 01:8923: 3A        .byte $3A   ; 
- - - - - - 0x004934 01:8924: 3B        .byte $3B   ; 
- - - - - - 0x004935 01:8925: 65        .byte $65   ; 
- - - - - - 0x004936 01:8926: 3A        .byte $3A   ; 
- - - - - - 0x004937 01:8927: 3B        .byte $3B   ; 
- - - - - - 0x004938 01:8928: 65        .byte $65   ; 
- - - - - - 0x004939 01:8929: 3A        .byte $3A   ; 
- - - - - - 0x00493A 01:892A: 3B        .byte $3B   ; 
- - - - - - 0x00493B 01:892B: 65        .byte $65   ; 
- - - - - - 0x00493C 01:892C: 3A        .byte $3A   ; 
- - - - - - 0x00493D 01:892D: 3B        .byte $3B   ; 
- - - - - - 0x00493E 01:892E: 66        .byte $66   ; 
- - - - - - 0x00493F 01:892F: 1A        .byte $1A   ; 
- - - - - - 0x004940 01:8930: 67        .byte $67   ; 
- - - - - - 0x004941 01:8931: 68        .byte $68   ; 
- - - - - - 0x004942 01:8932: 69        .byte $69   ; 
; 07 
- - - - - - 0x004943 01:8933: 6A        .byte $6A   ; 
- - - - - - 0x004944 01:8934: 6B        .byte $6B   ; 
- - - - - - 0x004945 01:8935: 00        .byte $00   ; 
- - - - - - 0x004946 01:8936: 00        .byte $00   ; 
- - - - - - 0x004947 01:8937: 00        .byte $00   ; 
- - - - - - 0x004948 01:8938: 00        .byte $00   ; 
- - - - - - 0x004949 01:8939: 00        .byte $00   ; 
- - - - - - 0x00494A 01:893A: 00        .byte $00   ; 
- - - - - - 0x00494B 01:893B: 00        .byte $00   ; 
- - - - - - 0x00494C 01:893C: 00        .byte $00   ; 
- - - - - - 0x00494D 01:893D: 00        .byte $00   ; 
- - - - - - 0x00494E 01:893E: 00        .byte $00   ; 
- - - - - - 0x00494F 01:893F: 00        .byte $00   ; 
- - - - - - 0x004950 01:8940: 2B        .byte $2B   ; 
- - - - - - 0x004951 01:8941: 2C        .byte $2C   ; 
- - - - - - 0x004952 01:8942: 2D        .byte $2D   ; 
- - - - - - 0x004953 01:8943: 6C        .byte $6C   ; 
- - - - - - 0x004954 01:8944: 2D        .byte $2D   ; 
- - - - - - 0x004955 01:8945: 6D        .byte $6D   ; 
- - - - - - 0x004956 01:8946: 6E        .byte $6E   ; 
- - - - - - 0x004957 01:8947: 6F        .byte $6F   ; 
- - - - - - 0x004958 01:8948: 70        .byte $70   ; 
- - - - - - 0x004959 01:8949: 71        .byte $71   ; 
- - - - - - 0x00495A 01:894A: 70        .byte $70   ; 
- - - - - - 0x00495B 01:894B: 72        .byte $72   ; 
- - - - - - 0x00495C 01:894C: 73        .byte $73   ; 
- - - - - - 0x00495D 01:894D: 74        .byte $74   ; 
- - - - - - 0x00495E 01:894E: 75        .byte $75   ; 
- - - - - - 0x00495F 01:894F: 76        .byte $76   ; 
- - - - - - 0x004960 01:8950: 77        .byte $77   ; 
; 08 
- - - - - - 0x004961 01:8951: 78        .byte $78   ; 
- - - - - - 0x004962 01:8952: 79        .byte $79   ; 
- - - - - - 0x004963 01:8953: 00        .byte $00   ; 
- - - - - - 0x004964 01:8954: 00        .byte $00   ; 
- - - - - - 0x004965 01:8955: 00        .byte $00   ; 
- - - - - - 0x004966 01:8956: 00        .byte $00   ; 
- - - - - - 0x004967 01:8957: 00        .byte $00   ; 
- - - - - - 0x004968 01:8958: 00        .byte $00   ; 
- - - - - - 0x004969 01:8959: 00        .byte $00   ; 
- - - - - - 0x00496A 01:895A: 00        .byte $00   ; 
- - - - - - 0x00496B 01:895B: 00        .byte $00   ; 
- - - - - - 0x00496C 01:895C: 00        .byte $00   ; 
- - - - - - 0x00496D 01:895D: 00        .byte $00   ; 
- - - - - - 0x00496E 01:895E: 00        .byte $00   ; 
- - - - - - 0x00496F 01:895F: 2E        .byte $2E   ; 
- - - - - - 0x004970 01:8960: 2F        .byte $2F   ; 
- - - - - - 0x004971 01:8961: 7A        .byte $7A   ; 
- - - - - - 0x004972 01:8962: 7B        .byte $7B   ; 
- - - - - - 0x004973 01:8963: 7C        .byte $7C   ; 
- - - - - - 0x004974 01:8964: 7D        .byte $7D   ; 
- - - - - - 0x004975 01:8965: 7E        .byte $7E   ; 
- - - - - - 0x004976 01:8966: 7E        .byte $7E   ; 
- - - - - - 0x004977 01:8967: 7E        .byte $7E   ; 
- - - - - - 0x004978 01:8968: 7F        .byte $7F   ; 
- - - - - - 0x004979 01:8969: 80        .byte $80   ; 
- - - - - - 0x00497A 01:896A: 81        .byte $81   ; 
- - - - - - 0x00497B 01:896B: 82        .byte $82   ; 
- - - - - - 0x00497C 01:896C: 83        .byte $83   ; 
- - - - - - 0x00497D 01:896D: 84        .byte $84   ; 
- - - - - - 0x00497E 01:896E: 85        .byte $85   ; 
; 09 
- - - - - - 0x00497F 01:896F: 86        .byte $86   ; 
- - - - - - 0x004980 01:8970: 00        .byte $00   ; 
- - - - - - 0x004981 01:8971: 00        .byte $00   ; 
- - - - - - 0x004982 01:8972: 00        .byte $00   ; 
- - - - - - 0x004983 01:8973: 00        .byte $00   ; 
- - - - - - 0x004984 01:8974: 00        .byte $00   ; 
- - - - - - 0x004985 01:8975: 00        .byte $00   ; 
- - - - - - 0x004986 01:8976: 00        .byte $00   ; 
- - - - - - 0x004987 01:8977: 00        .byte $00   ; 
- - - - - - 0x004988 01:8978: 00        .byte $00   ; 
- - - - - - 0x004989 01:8979: 00        .byte $00   ; 
- - - - - - 0x00498A 01:897A: 00        .byte $00   ; 
- - - - - - 0x00498B 01:897B: 00        .byte $00   ; 
- - - - - - 0x00498C 01:897C: 00        .byte $00   ; 
- - - - - - 0x00498D 01:897D: 00        .byte $00   ; 
- - - - - - 0x00498E 01:897E: 87        .byte $87   ; 
- - - - - - 0x00498F 01:897F: 87        .byte $87   ; 
- - - - - - 0x004990 01:8980: 87        .byte $87   ; 
- - - - - - 0x004991 01:8981: 88        .byte $88   ; 
- - - - - - 0x004992 01:8982: 87        .byte $87   ; 
- - - - - - 0x004993 01:8983: 87        .byte $87   ; 
- - - - - - 0x004994 01:8984: 87        .byte $87   ; 
- - - - - - 0x004995 01:8985: 87        .byte $87   ; 
- - - - - - 0x004996 01:8986: 87        .byte $87   ; 
- - - - - - 0x004997 01:8987: 89        .byte $89   ; 
- - - - - - 0x004998 01:8988: 87        .byte $87   ; 
- - - - - - 0x004999 01:8989: 87        .byte $87   ; 
- - - - - - 0x00499A 01:898A: 8A        .byte $8A   ; 
- - - - - - 0x00499B 01:898B: 00        .byte $00   ; 
- - - - - - 0x00499C 01:898C: 00        .byte $00   ; 
- - - - - - 0x00499B 01:898D: 00        .byte $00   ; 
- - - - - - 0x00499C 01:898E: 00        .byte $00   ; 



bra_87CB_RTS:
C - - - - - 0x0047DB 01:87CB: 60        RTS

sub_87CC_отрисовка_босса_вертолета_US:
; 1й босс вертолет
C - - - - - 0x0047DC 01:87CC: A5 FD     LDA ram_scroll_X
C - - - - - 0x0047DE 01:87CE: 29 07     AND #$07
C - - - - - 0x0047E0 01:87D0: DD 56 07  CMP ram_scroll_X_obj,X
C - - - - - 0x0047E3 01:87D3: F0 F6     BEQ bra_87CB_RTS
C - - - - - 0x0047E5 01:87D5: 9D 56 07  STA ram_scroll_X_obj,X
C - - - - - 0x0047E8 01:87D8: BD CA 06  LDA ram_скорость_объектов_x_старш,X
C - - - - - 0x0047EB 01:87DB: 2A        ROL
C - - - - - 0x0047EC 01:87DC: 2A        ROL
C - - - - - 0x0047ED 01:87DD: 29 01     AND #$01
C - - - - - 0x0047EF 01:87DF: DD 56 07  CMP ram_scroll_X_obj,X
C - - - - - 0x0047F2 01:87E2: D0 E7     BNE bra_87CB_RTS
C - - - - - 0x0047F4 01:87E4: A5 FD     LDA ram_scroll_X
C - - - - - 0x0047F6 01:87E6: 4A        LSR
C - - - - - 0x0047F7 01:87E7: 4A        LSR
C - - - - - 0x0047F8 01:87E8: 4A        LSR
C - - - - - 0x0047F9 01:87E9: 85 0B     STA ram_000B
C - - - - - 0x0047FB 01:87EB: BD CA 06  LDA ram_скорость_объектов_x_старш,X
C - - - - - 0x0047FE 01:87EE: 0A        ASL
C - - - - - 0x0047FF 01:87EF: A5 FF     LDA ram_for_2000
C - - - - - 0x004801 01:87F1: 90 02     BCC bra_87F5
C - - - - - 0x004803 01:87F3: 49 01     EOR #$01
bra_87F5:
C - - - - - 0x004805 01:87F5: 4A        LSR
C - - - - - 0x004806 01:87F6: A0 00     LDY #$00
C - - - - - 0x004808 01:87F8: B0 0D     BCS bra_8807
C - - - - - 0x00480A 01:87FA: A5 0B     LDA ram_000B
C - - - - - 0x00480C 01:87FC: C9 03     CMP #$03
C - - - - - 0x00480E 01:87FE: 90 07     BCC bra_8807
C - - - - - 0x004810 01:8800: C9 1F     CMP #$1F
C - - - - - 0x004812 01:8802: B0 03     BCS bra_8807
C - - - - - 0x004814 01:8804: E9 02     SBC #$02
C - - - - - 0x004816 01:8806: A8        TAY
bra_8807:
C - - - - - 0x004817 01:8807: 98        TYA
; A = 00-1B
C - - - - - 0x004818 01:8808: 18        CLC
C - - - - - 0x004819 01:8809: 6D 5A 88  ADC #< tbl_885C
C - - - - - 0x00481C 01:880C: 85 08     STA ram_0008
C - - - - - 0x00481E 01:880E: A9 00     LDA #$00
C - - - - - 0x004820 01:8810: 6D 5B 88  ADC #> tbl_885C
C - - - - - 0x004823 01:8813: 85 09     STA ram_0009
C - - - - - 0x004825 01:8815: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x004827 01:8817: A9 07     LDA #con_buf_mode_07
C - - - - - 0x004829 01:8819: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x00482C 01:881C: E8        INX
C - - - - - 0x00482D 01:881D: A5 0B     LDA ram_000B
C - - - - - 0x00482F 01:881F: 18        CLC
C - - - - - 0x004830 01:8820: 69 E0     ADC #< $29E0
C - - - - - 0x004832 01:8822: 9D 01 03  STA ram_nmt_buffer + $01,X  ; ppu lo
C - - - - - 0x004835 01:8825: A9 00     LDA #$00
C - - - - - 0x004837 01:8827: 69 29     ADC #> $29E0
C - - - - - 0x004839 01:8829: 9D 00 03  STA ram_nmt_buffer,X    ; ppu hi
C - - - - - 0x00483C 01:882C: E8        INX
C - - - - - 0x00483D 01:882D: E8        INX
C - - - - - 0x00483E 01:882E: A9 0B     LDA #$0B    ; counter
C - - - - - 0x004840 01:8830: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004843 01:8833: 85 0A     STA ram_000A
C - - - - - 0x004845 01:8835: E8        INX
C - - - - - 0x004846 01:8836: A0 00     LDY #$00
bra_8838_loop:
C - - - - - 0x004848 01:8838: B1 08     LDA (ram_0008),Y
C - - - - - 0x00484A 01:883A: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x00484D 01:883D: E8        INX
C - - - - - 0x00484E 01:883E: A5 08     LDA ram_0008
C - - - - - 0x004850 01:8840: 18        CLC
C - - - - - 0x004851 01:8841: 69 1C     ADC #< $001C
C - - - - - 0x004853 01:8843: 85 08     STA ram_0008
C - - - - - 0x004855 01:8845: A5 09     LDA ram_0009
C - - - - - 0x004857 01:8847: 69 00     ADC #> $001C
C - - - - - 0x004859 01:8849: 85 09     STA ram_0009
C - - - - - 0x00485B 01:884B: C6 0A     DEC ram_000A
C - - - - - 0x00485D 01:884D: D0 E9     BNE bra_8838_loop
; close buffer
C - - - - - 0x00485F 01:884F: A9 FF     LDA #$FF
C - - - - - 0x004861 01:8851: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004864 01:8854: E8        INX
C - - - - - 0x004865 01:8855: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x004867 01:8857: A6 10     LDX ram_0010
C - - - - - 0x004869 01:8859: 60        RTS



tbl_885C:
; 1C bytes in a row, 0B columns
; 00 
- D 0 - I - 0x00486C 01:885C: 00        .byte $00   ; 
- D 0 - I - 0x00486D 01:885D: 00        .byte $00   ; 
- D 0 - I - 0x00486E 01:885E: 00        .byte $00   ; 
- D 0 - I - 0x00486F 01:885F: 00        .byte $00   ; 
- D 0 - I - 0x004870 01:8860: 00        .byte $00   ; 
- D 0 - I - 0x004871 01:8861: 00        .byte $00   ; 
- D 0 - I - 0x004872 01:8862: 00        .byte $00   ; 
- D 0 - I - 0x004873 01:8863: 00        .byte $00   ; 
- D 0 - I - 0x004874 01:8864: 00        .byte $00   ; 
- D 0 - I - 0x004875 01:8865: 00        .byte $00   ; 
- D 0 - I - 0x004876 01:8866: 00        .byte $00   ; 
- D 0 - I - 0x004877 01:8867: 00        .byte $00   ; 
- D 0 - I - 0x004878 01:8868: 00        .byte $00   ; 
- D 0 - I - 0x004879 01:8869: 00        .byte $00   ; 
- D 0 - I - 0x00487A 01:886A: 00        .byte $00   ; 
- D 0 - I - 0x00487B 01:886B: 00        .byte $00   ; 
- D 0 - I - 0x00487C 01:886C: 04        .byte $04   ; 
- D 0 - I - 0x00487D 01:886D: 05        .byte $05   ; 
- D 0 - I - 0x00487E 01:886E: 00        .byte $00   ; 
- D 0 - I - 0x00487F 01:886F: 00        .byte $00   ; 
- D 0 - I - 0x004880 01:8870: 00        .byte $00   ; 
- D 0 - I - 0x004881 01:8871: 00        .byte $00   ; 
- D 0 - I - 0x004882 01:8872: 00        .byte $00   ; 
- D 0 - I - 0x004883 01:8873: 00        .byte $00   ; 
- D 0 - I - 0x004884 01:8874: 00        .byte $00   ; 
- D 0 - I - 0x004885 01:8875: 00        .byte $00   ; 
- D 0 - I - 0x004886 01:8876: 00        .byte $00   ; 
- D 0 - I - 0x004887 01:8877: 00        .byte $00   ; 
; 01 
- D 0 - I - 0x004888 01:8878: 00        .byte $00   ; 
- D 0 - I - 0x004889 01:8879: 08        .byte $08   ; 
- D 0 - I - 0x00488A 01:887A: 00        .byte $00   ; 
- D 0 - I - 0x00488B 01:887B: 00        .byte $00   ; 
- D 0 - I - 0x00488C 01:887C: 00        .byte $00   ; 
- D 0 - I - 0x00488D 01:887D: 00        .byte $00   ; 
- D 0 - I - 0x00488E 01:887E: 00        .byte $00   ; 
- D 0 - I - 0x00488F 01:887F: 00        .byte $00   ; 
- D 0 - I - 0x004890 01:8880: 00        .byte $00   ; 
- D 0 - I - 0x004891 01:8881: 00        .byte $00   ; 
- D 0 - I - 0x004892 01:8882: 00        .byte $00   ; 
- D 0 - I - 0x004893 01:8883: 00        .byte $00   ; 
- D 0 - I - 0x004894 01:8884: 00        .byte $00   ; 
- D 0 - I - 0x004895 01:8885: 00        .byte $00   ; 
- D 0 - I - 0x004896 01:8886: 00        .byte $00   ; 
- D 0 - I - 0x004897 01:8887: 00        .byte $00   ; 
- D 0 - I - 0x004898 01:8888: 0B        .byte $0B   ; 
- D 0 - I - 0x004899 01:8889: 0C        .byte $0C   ; 
- D 0 - I - 0x00489A 01:888A: 00        .byte $00   ; 
- D 0 - I - 0x00489B 01:888B: 00        .byte $00   ; 
- D 0 - I - 0x00489C 01:888C: 00        .byte $00   ; 
- D 0 - I - 0x00489D 01:888D: 00        .byte $00   ; 
- D 0 - I - 0x00489E 01:888E: 00        .byte $00   ; 
- D 0 - I - 0x00489F 01:888F: 00        .byte $00   ; 
- D 0 - I - 0x0048A0 01:8890: 00        .byte $00   ; 
- D 0 - I - 0x0048A1 01:8891: 00        .byte $00   ; 
- D 0 - I - 0x0048A2 01:8892: 00        .byte $00   ; 
- D 0 - I - 0x0048A3 01:8893: 00        .byte $00   ; 
; 02 
- D 0 - I - 0x0048A4 01:8894: 00        .byte $00   ; 
- D 0 - I - 0x0048A5 01:8895: 0F        .byte $0F   ; 
- D 0 - I - 0x0048A6 01:8896: 08        .byte $08   ; 
- D 0 - I - 0x0048A7 01:8897: 00        .byte $00   ; 
- D 0 - I - 0x0048A8 01:8898: 00        .byte $00   ; 
- D 0 - I - 0x0048A9 01:8899: 00        .byte $00   ; 
- D 0 - I - 0x0048AA 01:889A: 00        .byte $00   ; 
- D 0 - I - 0x0048AB 01:889B: 00        .byte $00   ; 
- D 0 - I - 0x0048AC 01:889C: 00        .byte $00   ; 
- D 0 - I - 0x0048AD 01:889D: 00        .byte $00   ; 
- D 0 - I - 0x0048AE 01:889E: 00        .byte $00   ; 
- D 0 - I - 0x0048AF 01:889F: 00        .byte $00   ; 
- D 0 - I - 0x0048B0 01:88A0: 10        .byte $10   ; 
- D 0 - I - 0x0048B1 01:88A1: 11        .byte $11   ; 
- D 0 - I - 0x0048B2 01:88A2: 12        .byte $12   ; 
- D 0 - I - 0x0048B3 01:88A3: 13        .byte $13   ; 
- D 0 - I - 0x0048B4 01:88A4: 14        .byte $14   ; 
- D 0 - I - 0x0048B5 01:88A5: 15        .byte $15   ; 
- D 0 - I - 0x0048B6 01:88A6: 16        .byte $16   ; 
- D 0 - I - 0x0048B7 01:88A7: 17        .byte $17   ; 
- D 0 - I - 0x0048B8 01:88A8: 18        .byte $18   ; 
- D 0 - I - 0x0048B9 01:88A9: 19        .byte $19   ; 
- D 0 - I - 0x0048BA 01:88AA: 1A        .byte $1A   ; 
- D 0 - I - 0x0048BB 01:88AB: 00        .byte $00   ; 
- D 0 - I - 0x0048BC 01:88AC: 00        .byte $00   ; 
- D 0 - I - 0x0048BD 01:88AD: 00        .byte $00   ; 
- D 0 - I - 0x0048BE 01:88AE: 00        .byte $00   ; 
- D 0 - I - 0x0048BF 01:88AF: 00        .byte $00   ; 
; 03 
- D 0 - I - 0x0048C0 01:88B0: 00        .byte $00   ; 
- D 0 - I - 0x0048C1 01:88B1: 1C        .byte $1C   ; 
- D 0 - I - 0x0048C2 01:88B2: 1D        .byte $1D   ; 
- D 0 - I - 0x0048C3 01:88B3: 1E        .byte $1E   ; 
- D 0 - I - 0x0048C4 01:88B4: 1F        .byte $1F   ; 
- D 0 - I - 0x0048C5 01:88B5: 20        .byte $20   ; 
- D 0 - I - 0x0048C6 01:88B6: 21        .byte $21   ; 
- D 0 - I - 0x0048C7 01:88B7: 22        .byte $22   ; 
- D 0 - I - 0x0048C8 01:88B8: 23        .byte $23   ; 
- D 0 - I - 0x0048C9 01:88B9: 23        .byte $23   ; 
- D 0 - I - 0x0048CA 01:88BA: 24        .byte $24   ; 
- D 0 - I - 0x0048CB 01:88BB: 25        .byte $25   ; 
- D 0 - I - 0x0048CC 01:88BC: 26        .byte $26   ; 
- D 0 - I - 0x0048CD 01:88BD: 27        .byte $27   ; 
- D 0 - I - 0x0048CE 01:88BE: 28        .byte $28   ; 
- D 0 - I - 0x0048CF 01:88BF: 29        .byte $29   ; 
- D 0 - I - 0x0048D0 01:88C0: 2A        .byte $2A   ; 
- D 0 - I - 0x0048D1 01:88C1: 2B        .byte $2B   ; 
- D 0 - I - 0x0048D2 01:88C2: 2C        .byte $2C   ; 
- D 0 - I - 0x0048D3 01:88C3: 2D        .byte $2D   ; 
- D 0 - I - 0x0048D4 01:88C4: 2E        .byte $2E   ; 
- D 0 - I - 0x0048D5 01:88C5: 2F        .byte $2F   ; 
- D 0 - I - 0x0048D6 01:88C6: 30        .byte $30   ; 
- D 0 - I - 0x0048D7 01:88C7: 31        .byte $31   ; 
- D 0 - I - 0x0048D8 01:88C8: 32        .byte $32   ; 
- D 0 - I - 0x0048D9 01:88C9: 00        .byte $00   ; 
- D 0 - I - 0x0048DA 01:88CA: 00        .byte $00   ; 
- D 0 - I - 0x0048DB 01:88CB: 00        .byte $00   ; 
; 04 
- D 0 - I - 0x0048DC 01:88CC: 00        .byte $00   ; 
- D 0 - I - 0x0048DD 01:88CD: 33        .byte $33   ; 
- D 0 - I - 0x0048DE 01:88CE: 34        .byte $34   ; 
- D 0 - I - 0x0048DF 01:88CF: 35        .byte $35   ; 
- D 0 - I - 0x0048E0 01:88D0: 36        .byte $36   ; 
- D 0 - I - 0x0048E1 01:88D1: 37        .byte $37   ; 
- D 0 - I - 0x0048E2 01:88D2: 38        .byte $38   ; 
- D 0 - I - 0x0048E3 01:88D3: 39        .byte $39   ; 
- D 0 - I - 0x0048E4 01:88D4: 3A        .byte $3A   ; 
- D 0 - I - 0x0048E5 01:88D5: 3A        .byte $3A   ; 
- D 0 - I - 0x0048E6 01:88D6: 3A        .byte $3A   ; 
- D 0 - I - 0x0048E7 01:88D7: 3B        .byte $3B   ; 
- D 0 - I - 0x0048E8 01:88D8: 3C        .byte $3C   ; 
- D 0 - I - 0x0048E9 01:88D9: 3D        .byte $3D   ; 
- D 0 - I - 0x0048EA 01:88DA: 3E        .byte $3E   ; 
- D 0 - I - 0x0048EB 01:88DB: 3F        .byte $3F   ; 
- D 0 - I - 0x0048EC 01:88DC: 40        .byte $40   ; 
- D 0 - I - 0x0048ED 01:88DD: 41        .byte $41   ; 
- D 0 - I - 0x0048EE 01:88DE: 42        .byte $42   ; 
- D 0 - I - 0x0048EF 01:88DF: 43        .byte $43   ; 
- D 0 - I - 0x0048F0 01:88E0: 44        .byte $44   ; 
- D 0 - I - 0x0048F1 01:88E1: 45        .byte $45   ; 
- D 0 - I - 0x0048F2 01:88E2: 46        .byte $46   ; 
- D 0 - I - 0x0048F3 01:88E3: 47        .byte $47   ; 
- D 0 - I - 0x0048F4 01:88E4: 48        .byte $48   ; 
- D 0 - I - 0x0048F5 01:88E5: 49        .byte $49   ; 
- D 0 - I - 0x0048F6 01:88E6: 00        .byte $00   ; 
- D 0 - I - 0x0048F7 01:88E7: 00        .byte $00   ; 
; 05 
- D 0 - I - 0x0048F8 01:88E8: 00        .byte $00   ; 
- D 0 - I - 0x0048F9 01:88E9: 00        .byte $00   ; 
- D 0 - I - 0x0048FA 01:88EA: 4A        .byte $4A   ; 
- D 0 - I - 0x0048FB 01:88EB: 4B        .byte $4B   ; 
- D 0 - I - 0x0048FC 01:88EC: 4C        .byte $4C   ; 
- D 0 - I - 0x0048FD 01:88ED: 4D        .byte $4D   ; 
- D 0 - I - 0x0048FE 01:88EE: 4E        .byte $4E   ; 
- D 0 - I - 0x0048FF 01:88EF: 4F        .byte $4F   ; 
- D 0 - I - 0x004900 01:88F0: 50        .byte $50   ; 
- D 0 - I - 0x004901 01:88F1: 51        .byte $51   ; 
- D 0 - I - 0x004902 01:88F2: C2        .byte $C2   ; 
- D 0 - I - 0x004903 01:88F3: C3        .byte $C3   ; 
- D 0 - I - 0x004904 01:88F4: 51        .byte $51   ; 
- D 0 - I - 0x004905 01:88F5: C2        .byte $C2   ; 
- D 0 - I - 0x004906 01:88F6: C3        .byte $C3   ; 
- D 0 - I - 0x004907 01:88F7: 51        .byte $51   ; 
- D 0 - I - 0x004908 01:88F8: C2        .byte $C2   ; 
- D 0 - I - 0x004909 01:88F9: C3        .byte $C3   ; 
- D 0 - I - 0x00490A 01:88FA: 51        .byte $51   ; 
- D 0 - I - 0x00490B 01:88FB: C2        .byte $C2   ; 
- D 0 - I - 0x00490C 01:88FC: C3        .byte $C3   ; 
- D 0 - I - 0x00490D 01:88FD: 54        .byte $54   ; 
- D 0 - I - 0x00490E 01:88FE: 55        .byte $55   ; 
- D 0 - I - 0x00490F 01:88FF: 56        .byte $56   ; 
- D 0 - I - 0x004910 01:8900: 57        .byte $57   ; 
- D 0 - I - 0x004911 01:8901: 58        .byte $58   ; 
- D 0 - I - 0x004912 01:8902: 59        .byte $59   ; 
- D 0 - I - 0x004913 01:8903: 5A        .byte $5A   ; 
; 06 
- D 0 - I - 0x004914 01:8904: 00        .byte $00   ; 
- D 0 - I - 0x004915 01:8905: 00        .byte $00   ; 
- D 0 - I - 0x004916 01:8906: 00        .byte $00   ; 
- D 0 - I - 0x004917 01:8907: 00        .byte $00   ; 
- D 0 - I - 0x004918 01:8908: 00        .byte $00   ; 
- D 0 - I - 0x004919 01:8909: 00        .byte $00   ; 
- D 0 - I - 0x00491A 01:890A: 00        .byte $00   ; 
- D 0 - I - 0x00491B 01:890B: 5B        .byte $5B   ; 
- D 0 - I - 0x00491C 01:890C: 5C        .byte $5C   ; 
- D 0 - I - 0x00491D 01:890D: 5D        .byte $5D   ; 
- D 0 - I - 0x00491E 01:890E: C4        .byte $C4   ; 
- D 0 - I - 0x00491F 01:890F: C5        .byte $C5   ; 
- D 0 - I - 0x004920 01:8910: 60        .byte $60   ; 
- D 0 - I - 0x004921 01:8911: C4        .byte $C4   ; 
- D 0 - I - 0x004922 01:8912: C5        .byte $C5   ; 
- D 0 - I - 0x004923 01:8913: 60        .byte $60   ; 
- D 0 - I - 0x004924 01:8914: C4        .byte $C4   ; 
- D 0 - I - 0x004925 01:8915: C5        .byte $C5   ; 
- D 0 - I - 0x004926 01:8916: 60        .byte $60   ; 
- D 0 - I - 0x004927 01:8917: C4        .byte $C4   ; 
- D 0 - I - 0x004928 01:8918: C5        .byte $C5   ; 
- D 0 - I - 0x004929 01:8919: 61        .byte $61   ; 
- D 0 - I - 0x00492A 01:891A: 62        .byte $62   ; 
- D 0 - I - 0x00492B 01:891B: 63        .byte $63   ; 
- D 0 - I - 0x00492C 01:891C: 64        .byte $64   ; 
- D 0 - I - 0x00492D 01:891D: 65        .byte $65   ; 
- D 0 - I - 0x00492E 01:891E: 66        .byte $66   ; 
- D 0 - I - 0x00492F 01:891F: 67        .byte $67   ; 
; 07 
- D 0 - I - 0x004930 01:8920: 00        .byte $00   ; 
- D 0 - I - 0x004931 01:8921: 00        .byte $00   ; 
- D 0 - I - 0x004932 01:8922: 00        .byte $00   ; 
- D 0 - I - 0x004933 01:8923: 00        .byte $00   ; 
- D 0 - I - 0x004934 01:8924: 00        .byte $00   ; 
- D 0 - I - 0x004935 01:8925: 00        .byte $00   ; 
- D 0 - I - 0x004936 01:8926: 00        .byte $00   ; 
- D 0 - I - 0x004937 01:8927: 00        .byte $00   ; 
- D 0 - I - 0x004938 01:8928: 68        .byte $68   ; 
- D 0 - I - 0x004939 01:8929: 69        .byte $69   ; 
- D 0 - I - 0x00493A 01:892A: 6A        .byte $6A   ; 
- D 0 - I - 0x00493B 01:892B: 6B        .byte $6B   ; 
- D 0 - I - 0x00493C 01:892C: 6C        .byte $6C   ; 
- D 0 - I - 0x00493D 01:892D: 6D        .byte $6D   ; 
- D 0 - I - 0x00493E 01:892E: 6E        .byte $6E   ; 
- D 0 - I - 0x00493F 01:892F: 6F        .byte $6F   ; 
- D 0 - I - 0x004940 01:8930: 70        .byte $70   ; 
- D 0 - I - 0x004941 01:8931: 71        .byte $71   ; 
- D 0 - I - 0x004942 01:8932: 72        .byte $72   ; 
- D 0 - I - 0x004943 01:8933: 73        .byte $73   ; 
- D 0 - I - 0x004944 01:8934: 74        .byte $74   ; 
- D 0 - I - 0x004945 01:8935: 75        .byte $75   ; 
- D 0 - I - 0x004946 01:8936: 76        .byte $76   ; 
- D 0 - I - 0x004947 01:8937: 77        .byte $77   ; 
- D 0 - I - 0x004948 01:8938: 78        .byte $78   ; 
- D 0 - I - 0x004949 01:8939: 79        .byte $79   ; 
- D 0 - I - 0x00494A 01:893A: 7A        .byte $7A   ; 
- D 0 - I - 0x00494B 01:893B: 7B        .byte $7B   ; 
; 08 
- D 0 - I - 0x00494C 01:893C: 00        .byte $00   ; 
- D 0 - I - 0x00494D 01:893D: 00        .byte $00   ; 
- D 0 - I - 0x00494E 01:893E: 00        .byte $00   ; 
- D 0 - I - 0x00494F 01:893F: 00        .byte $00   ; 
- D 0 - I - 0x004950 01:8940: 00        .byte $00   ; 
- D 0 - I - 0x004951 01:8941: 00        .byte $00   ; 
- D 0 - I - 0x004952 01:8942: 00        .byte $00   ; 
- D 0 - I - 0x004953 01:8943: 00        .byte $00   ; 
- D 0 - I - 0x004954 01:8944: 00        .byte $00   ; 
- D 0 - I - 0x004955 01:8945: 7C        .byte $7C   ; 
- D 0 - I - 0x004956 01:8946: 7D        .byte $7D   ; 
- D 0 - I - 0x004957 01:8947: 7E        .byte $7E   ; 
- D 0 - I - 0x004958 01:8948: 7F        .byte $7F   ; 
- D 0 - I - 0x004959 01:8949: 80        .byte $80   ; 
- D 0 - I - 0x00495A 01:894A: 81        .byte $81   ; 
- D 0 - I - 0x00495B 01:894B: 82        .byte $82   ; 
- D 0 - I - 0x00495C 01:894C: 83        .byte $83   ; 
- D 0 - I - 0x00495D 01:894D: 84        .byte $84   ; 
- D 0 - I - 0x00495E 01:894E: 85        .byte $85   ; 
- D 0 - I - 0x00495F 01:894F: 86        .byte $86   ; 
- D 0 - I - 0x004960 01:8950: 87        .byte $87   ; 
- D 0 - I - 0x004961 01:8951: 88        .byte $88   ; 
- D 0 - I - 0x004962 01:8952: 89        .byte $89   ; 
- D 0 - I - 0x004963 01:8953: 8A        .byte $8A   ; 
- D 0 - I - 0x004964 01:8954: 8B        .byte $8B   ; 
- D 0 - I - 0x004965 01:8955: 8C        .byte $8C   ; 
- D 0 - I - 0x004966 01:8956: 00        .byte $00   ; 
- D 0 - I - 0x004967 01:8957: 00        .byte $00   ; 
; 09 
- D 0 - I - 0x004968 01:8958: 00        .byte $00   ; 
- D 0 - I - 0x004969 01:8959: 00        .byte $00   ; 
- D 0 - I - 0x00496A 01:895A: 00        .byte $00   ; 
- D 0 - I - 0x00496B 01:895B: 00        .byte $00   ; 
- D 0 - I - 0x00496C 01:895C: 00        .byte $00   ; 
- D 0 - I - 0x00496D 01:895D: 00        .byte $00   ; 
- D 0 - I - 0x00496E 01:895E: 00        .byte $00   ; 
- D 0 - I - 0x00496F 01:895F: 00        .byte $00   ; 
- D 0 - I - 0x004970 01:8960: 00        .byte $00   ; 
- D 0 - I - 0x004971 01:8961: 00        .byte $00   ; 
- D 0 - I - 0x004972 01:8962: 00        .byte $00   ; 
- D 0 - I - 0x004973 01:8963: 00        .byte $00   ; 
- D 0 - I - 0x004974 01:8964: 00        .byte $00   ; 
- D 0 - I - 0x004975 01:8965: 00        .byte $00   ; 
- D 0 - I - 0x004976 01:8966: 8D        .byte $8D   ; 
- D 0 - I - 0x004977 01:8967: 8E        .byte $8E   ; 
- D 0 - I - 0x004978 01:8968: 00        .byte $00   ; 
- D 0 - I - 0x004979 01:8969: 00        .byte $00   ; 
- D 0 - I - 0x00497A 01:896A: 00        .byte $00   ; 
- D 0 - I - 0x00497B 01:896B: 00        .byte $00   ; 
- D 0 - I - 0x00497C 01:896C: 00        .byte $00   ; 
- D 0 - I - 0x00497D 01:896D: 00        .byte $00   ; 
- D 0 - I - 0x00497E 01:896E: 00        .byte $00   ; 
- D 0 - I - 0x00497F 01:896F: 8F        .byte $8F   ; 
- D 0 - I - 0x004980 01:8970: 90        .byte $90   ; 
- D 0 - I - 0x004981 01:8971: 00        .byte $00   ; 
- D 0 - I - 0x004982 01:8972: 00        .byte $00   ; 
- D 0 - I - 0x004983 01:8973: 00        .byte $00   ; 
; 0A 
- D 0 - I - 0x004984 01:8974: 00        .byte $00   ; 
- D 0 - I - 0x004985 01:8975: 00        .byte $00   ; 
- D 0 - I - 0x004986 01:8976: 00        .byte $00   ; 
- D 0 - I - 0x004987 01:8977: 00        .byte $00   ; 
- D 0 - I - 0x004988 01:8978: 00        .byte $00   ; 
- D 0 - I - 0x004989 01:8979: 00        .byte $00   ; 
- D 0 - I - 0x00498A 01:897A: 00        .byte $00   ; 
- D 0 - I - 0x00498B 01:897B: 00        .byte $00   ; 
- D 0 - I - 0x00498C 01:897C: 00        .byte $00   ; 
- D 0 - I - 0x00498D 01:897D: 00        .byte $00   ; 
- D 0 - I - 0x00498E 01:897E: 00        .byte $00   ; 
- D 0 - I - 0x00498F 01:897F: 00        .byte $00   ; 
- D 0 - I - 0x004990 01:8980: 00        .byte $00   ; 
- D 0 - I - 0x004991 01:8981: 00        .byte $00   ; 
- D 0 - I - 0x004992 01:8982: 91        .byte $91   ; 
- D 0 - I - 0x004993 01:8983: 92        .byte $92   ; 
- D 0 - I - 0x004994 01:8984: 00        .byte $00   ; 
- D 0 - I - 0x004995 01:8985: 00        .byte $00   ; 
- D 0 - I - 0x004996 01:8986: 00        .byte $00   ; 
- D 0 - I - 0x004997 01:8987: 00        .byte $00   ; 
- D 0 - I - 0x004998 01:8988: 00        .byte $00   ; 
- D 0 - I - 0x004999 01:8989: 00        .byte $00   ; 
- D 0 - I - 0x00499A 01:898A: 00        .byte $00   ; 
- D 0 - I - 0x00499B 01:898B: 00        .byte $00   ; 
- D 0 - I - 0x00499C 01:898C: 00        .byte $00   ; 
- D 0 - I - 0x00499D 01:898D: 00        .byte $00   ; 
- D 0 - I - 0x00499E 01:898E: 00        .byte $00   ; 
- D 0 - I - 0x00499F 01:898F: 00        .byte $00   ; 



loc_8999_анимация_винтов_вертолет_US_EU:
; путин опт
C - - - - - 0x0049A9 01:8999: BD 10 07  LDA ram_0710_obj,X
C - - - - - 0x0049AC 01:899C: 0A        ASL
                                        LDY ram_option_регион
                                        BEQ bra_899D_US
; европейка
                                        ADC #$0C
bra_899D_US:
C - - - - - 0x0049AD 01:899D: A8        TAY
C - - - - - 0x0049AE 01:899E: B9 88 8A  LDA tbl_8A88,Y
C - - - - - 0x0049B1 01:89A1: 85 08     STA ram_0008
C - - - - - 0x0049B3 01:89A3: B9 89 8A  LDA tbl_8A88 + $01,Y
C - - - - - 0x0049B6 01:89A6: 85 09     STA ram_0009
C - - - - - 0x0049B8 01:89A8: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x0049BA 01:89AA: A9 06     LDA #con_buf_mode_06
C - - - - - 0x0049BC 01:89AC: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0049BF 01:89AF: E8        INX
C - - - - - 0x0049C0 01:89B0: A0 00     LDY #$00
C - - - - - 0x0049C2 01:89B2: 84 06     STY ram_0006
loc_89B4:
C D 0 - - - 0x0049C4 01:89B4: 84 07     STY ram_0007
C - - - - - 0x0049C6 01:89B6: B1 08     LDA (ram_0008),Y    ; ppu hi
C - - - - - 0x0049C8 01:89B8: 10 03     BPL bra_89BD
; FF
C - - - - - 0x0049CA 01:89BA: 4C 69 8A  JMP loc_8A69_FF
bra_89BD:
C - - - - - 0x0049CD 01:89BD: 29 1F     AND #$1F
C - - - - - 0x0049CF 01:89BF: 85 05     STA ram_0005
C - - - - - 0x0049D1 01:89C1: A5 FF     LDA ram_for_2000
C - - - - - 0x0049D3 01:89C3: 6A        ROR
C - - - - - 0x0049D4 01:89C4: 6A        ROR
C - - - - - 0x0049D5 01:89C5: 6A        ROR
C - - - - - 0x0049D6 01:89C6: 6A        ROR
C - - - - - 0x0049D7 01:89C7: 29 20     AND #$20
C - - - - - 0x0049D9 01:89C9: 09 01     ORA #$01
C - - - - - 0x0049DB 01:89CB: 85 00     STA ram_0000
C - - - - - 0x0049DD 01:89CD: A5 FD     LDA ram_scroll_X
C - - - - - 0x0049DF 01:89CF: 4A        LSR
C - - - - - 0x0049E0 01:89D0: 4A        LSR
C - - - - - 0x0049E1 01:89D1: 4A        LSR
C - - - - - 0x0049E2 01:89D2: 18        CLC
C - - - - - 0x0049E3 01:89D3: 65 00     ADC ram_0000
C - - - - - 0x0049E5 01:89D5: 29 3F     AND #$3F
C - - - - - 0x0049E7 01:89D7: 85 00     STA ram_0000
C - - - - - 0x0049E9 01:89D9: 51 08     EOR (ram_0008),Y    ; ppu hi
C - - - - - 0x0049EB 01:89DB: C8        INY
C - - - - - 0x0049EC 01:89DC: C8        INY
C - - - - - 0x0049ED 01:89DD: 29 20     AND #$20
C - - - - - 0x0049EF 01:89DF: D0 1C     BNE bra_89FD
C - - - - - 0x0049F1 01:89E1: A5 00     LDA ram_0000
C - - - - - 0x0049F3 01:89E3: 29 1F     AND #$1F
C - - - - - 0x0049F5 01:89E5: 38        SEC
C - - - - - 0x0049F6 01:89E6: E5 05     SBC ram_0005
C - - - - - 0x0049F8 01:89E8: B0 02     BCS bra_89EC
C - - - - - 0x0049FA 01:89EA: A9 00     LDA #$00
bra_89EC:
C - - - - - 0x0049FC 01:89EC: 85 02     STA ram_0002
C - - - - - 0x0049FE 01:89EE: 18        CLC
C - - - - - 0x0049FF 01:89EF: 65 05     ADC ram_0005
C - - - - - 0x004A01 01:89F1: 85 03     STA ram_0003
C - - - - - 0x004A03 01:89F3: B1 08     LDA (ram_0008),Y    ; counter
C - - - - - 0x004A05 01:89F5: 38        SEC
C - - - - - 0x004A06 01:89F6: E5 02     SBC ram_0002
C - - - - - 0x004A08 01:89F8: 85 04     STA ram_0004
C - - - - - 0x004A0A 01:89FA: 4C 1C 8A  JMP loc_8A1C
bra_89FD:
C - - - - - 0x004A0D 01:89FD: A9 FF     LDA #$FF
C - - - - - 0x004A0F 01:89FF: 85 04     STA ram_0004
C - - - - - 0x004A11 01:8A01: A5 00     LDA ram_0000
C - - - - - 0x004A13 01:8A03: 29 1F     AND #$1F
C - - - - - 0x004A15 01:8A05: 38        SEC
C - - - - - 0x004A16 01:8A06: E5 05     SBC ram_0005
C - - - - - 0x004A18 01:8A08: F0 0A     BEQ bra_8A14
C - - - - - 0x004A1A 01:8A0A: 90 08     BCC bra_8A14
C - - - - - 0x004A1C 01:8A0C: D1 08     CMP (ram_0008),Y    ; counter
C - - - - - 0x004A1E 01:8A0E: 90 02     BCC bra_8A12
C - - - - - 0x004A20 01:8A10: B1 08     LDA (ram_0008),Y    ; counter
bra_8A12:
C - - - - - 0x004A22 01:8A12: 85 04     STA ram_0004
bra_8A14:
C - - - - - 0x004A24 01:8A14: A5 05     LDA ram_0005
C - - - - - 0x004A26 01:8A16: 85 03     STA ram_0003
C - - - - - 0x004A28 01:8A18: A9 00     LDA #$00
C - - - - - 0x004A2A 01:8A1A: 85 02     STA ram_0002
loc_8A1C:
C D 0 - - - 0x004A2C 01:8A1C: 88        DEY
C - - - - - 0x004A2D 01:8A1D: A9 00     LDA #$00
C - - - - - 0x004A2F 01:8A1F: 85 00     STA ram_0000
C - - - - - 0x004A31 01:8A21: B1 08     LDA (ram_0008),Y    ; ppu lo
C - - - - - 0x004A33 01:8A23: 0A        ASL
C - - - - - 0x004A34 01:8A24: 0A        ASL
C - - - - - 0x004A35 01:8A25: 0A        ASL
C - - - - - 0x004A36 01:8A26: 0A        ASL
C - - - - - 0x004A37 01:8A27: 26 00     ROL ram_0000
C - - - - - 0x004A39 01:8A29: 0A        ASL
C - - - - - 0x004A3A 01:8A2A: 26 00     ROL ram_0000
C - - - - - 0x004A3C 01:8A2C: 18        CLC
C - - - - - 0x004A3D 01:8A2D: 65 03     ADC ram_0003
C - - - - - 0x004A3F 01:8A2F: 9D 01 03  STA ram_nmt_buffer + $01,X  ; ppu hi
C - - - - - 0x004A42 01:8A32: A5 00     LDA ram_0000
C - - - - - 0x004A44 01:8A34: 09 28     ORA #$28
C - - - - - 0x004A46 01:8A36: 9D 00 03  STA ram_nmt_buffer,X    ; ppu lo
C - - - - - 0x004A49 01:8A39: C8        INY
C - - - - - 0x004A4A 01:8A3A: A5 04     LDA ram_0004
C - - - - - 0x004A4C 01:8A3C: F0 1B     BEQ bra_8A59
C - - - - - 0x004A4E 01:8A3E: 30 19     BMI bra_8A59
C - - - - - 0x004A50 01:8A40: E8        INX
C - - - - - 0x004A51 01:8A41: E8        INX
C - - - - - 0x004A52 01:8A42: 9D 00 03  STA ram_nmt_buffer,X    ; counter
C - - - - - 0x004A55 01:8A45: E8        INX
C - - - - - 0x004A56 01:8A46: C8        INY
C - - - - - 0x004A57 01:8A47: 98        TYA
C - - - - - 0x004A58 01:8A48: 18        CLC
C - - - - - 0x004A59 01:8A49: 65 02     ADC ram_0002
C - - - - - 0x004A5B 01:8A4B: A8        TAY
bra_8A4C_loop:
C - - - - - 0x004A5C 01:8A4C: B1 08     LDA (ram_0008),Y    ; tiles
C - - - - - 0x004A5E 01:8A4E: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004A61 01:8A51: C8        INY
C - - - - - 0x004A62 01:8A52: E8        INX
C - - - - - 0x004A63 01:8A53: C6 04     DEC ram_0004
C - - - - - 0x004A65 01:8A55: D0 F5     BNE bra_8A4C_loop
C - - - - - 0x004A67 01:8A57: E6 06     INC ram_0006
bra_8A59:
C - - - - - 0x004A69 01:8A59: A4 07     LDY ram_0007
C - - - - - 0x004A6B 01:8A5B: C8        INY
C - - - - - 0x004A6C 01:8A5C: C8        INY
C - - - - - 0x004A6D 01:8A5D: 84 07     STY ram_0007
C - - - - - 0x004A6F 01:8A5F: B1 08     LDA (ram_0008),Y    ; counter
C - - - - - 0x004A71 01:8A61: 18        CLC
C - - - - - 0x004A72 01:8A62: 65 07     ADC ram_0007
C - - - - - 0x004A74 01:8A64: A8        TAY
C - - - - - 0x004A75 01:8A65: C8        INY
C - - - - - 0x004A76 01:8A66: 4C B4 89  JMP loc_89B4


loc_8A69_FF:
C D 0 - - - 0x004A79 01:8A69: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004A7C 01:8A6C: E8        INX
C - - - - - 0x004A7D 01:8A6D: A5 06     LDA ram_0006
C - - - - - 0x004A7F 01:8A6F: F0 02     BEQ bra_8A73
C - - - - - 0x004A81 01:8A71: 86 1E     STX ram_index_ppu_buffer
bra_8A73:
C - - - - - 0x004A83 01:8A73: A6 10     LDX ram_0010
C - - - - - 0x004A85 01:8A75: BD 10 07  LDA ram_0710_obj,X
C - - - - - 0x004A88 01:8A78: 18        CLC
C - - - - - 0x004A89 01:8A79: 69 01     ADC #$01
C - - - - - 0x004A8B 01:8A7B: C9 06     CMP #$06
C - - - - - 0x004A8D 01:8A7D: 90 02     BCC bra_8A81
C - - - - - 0x004A8F 01:8A7F: A9 00     LDA #$00
bra_8A81:
C - - - - - 0x004A91 01:8A81: 9D 10 07  STA ram_0710_obj,X
C - - - - - 0x004A94 01:8A84: 60        RTS


tbl_8A88:
- D 0 - - - 0x004A98 01:8A88: 94 8A     .word _off016_8A94_00_US
- D 0 - - - 0x004A9A 01:8A8A: 06 8B     .word _off016_8B06_01_US
- D 0 - - - 0x004A9C 01:8A8C: 3C 8B     .word _off016_8B3C_02_US
- D 0 - - - 0x004A9E 01:8A8E: 75 8B     .word _off016_8B75_03_US
- D 0 - - - 0x004AA0 01:8A90: A1 8B     .word _off016_8BA1_04_US
- D 0 - - - 0x004AA2 01:8A92: CB 8B     .word _off016_8BCB_05_US
- - - - - - 0x004A97 01:8A87: 93 8A     .word _off016_EU_8A93_00_EU
- - - - - - 0x004A99 01:8A89: 0A 8B     .word _off016_EU_8B0A_01_EU
- - - - - - 0x004A9B 01:8A8B: 42 8B     .word _off016_EU_8B42_02_EU
- - - - - - 0x004A9D 01:8A8D: 7B 8B     .word _off016_EU_8B7B_03_EU
- - - - - - 0x004A9F 01:8A8F: AA 8B     .word _off016_EU_8BAA_04_EU
- - - - - - 0x004AA1 01:8A91: D6 8B     .word _off016_EU_8BD6_05_EU

; note: ppu addresses go through calculations (hi 0x0049C6 and 0x0049E9, lo 0x004A31)

_off016_8A94_00_US:
- D 0 - I - 0x004AA4 01:8A94: 21 0E     .dbyt $210E ; 
- D 0 - I - 0x004AA6 01:8A96: 04        .byte $04   ; counter
- D 0 - I - 0x004AA7 01:8A97: 00        .byte $00, $00, $00, $00   ; 

- D 0 - I - 0x004AAB 01:8A9B: 21 0F     .dbyt $210F ; 
- D 0 - I - 0x004AAD 01:8A9D: 04        .byte $04   ; counter
- D 0 - I - 0x004AAE 01:8A9E: 00        .byte $00, $00, $00, $00   ; 

- D 0 - I - 0x004AB2 01:8AA2: 20 10     .dbyt $2010 ; 
- D 0 - I - 0x004AB4 01:8AA4: 06        .byte $06   ; counter
- D 0 - I - 0x004AB5 01:8AA5: 09        .byte $09, $09, $00, $00, $00, $00   ; 

- D 0 - I - 0x004ABB 01:8AAB: 21 11     .dbyt $2111 ; 
- D 0 - I - 0x004ABD 01:8AAD: 03        .byte $03   ; counter
- D 0 - I - 0x004ABE 01:8AAE: 00        .byte $00, $00, $00   ; 

- D 0 - I - 0x004AC1 01:8AB1: 21 12     .dbyt $2112 ; 
- D 0 - I - 0x004AC3 01:8AB3: 02        .byte $02   ; counter
- D 0 - I - 0x004AC4 01:8AB4: 00        .byte $00, $00   ; 

- D 0 - I - 0x004AC6 01:8AB6: 06 10     .dbyt $0610 ; 
- D 0 - I - 0x004AC8 01:8AB8: 08        .byte $08   ; counter
- D 0 - I - 0x004AC9 01:8AB9: 09        .byte $09, $09, $09, $0A, $09, $0A, $09, $0A   ; 

- D 0 - I - 0x004AD1 01:8AC1: 1A 10     .dbyt $1A10 ; 
- D 0 - I - 0x004AD3 01:8AC3: 06        .byte $06   ; counter
- D 0 - I - 0x004AD4 01:8AC4: 0A        .byte $0A, $09, $0A, $09, $0A, $09   ; 

- D 0 - I - 0x004ADA 01:8ACA: 26 10     .dbyt $2610 ; 
- D 0 - I - 0x004ADC 01:8ACC: 1A        .byte $1A   ; counter
- D 0 - I - 0x004ADD 01:8ACD: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00   ; 
- D 0 - I - 0x004AED 01:8ADD: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00   ; 

- D 0 - I - 0x004AF7 01:8AE7: 03 0E     .dbyt $030E ; 
- D 0 - I - 0x004AF9 01:8AE9: 02        .byte $02   ; counter
- D 0 - I - 0x004AFA 01:8AEA: 00        .byte $00, $00   ; 

- D 0 - I - 0x004AFC 01:8AEC: 03 0F     .dbyt $030F ; 
- D 0 - I - 0x004AFE 01:8AEE: 02        .byte $02   ; counter
- D 0 - I - 0x004AFF 01:8AEF: 00        .byte $00, $00   ; 

- D 0 - I - 0x004B01 01:8AF1: 00 10     .dbyt $0010 ; 
- D 0 - I - 0x004B03 01:8AF3: 06        .byte $06   ; counter
- D 0 - I - 0x004B04 01:8AF4: B4        .byte $B4, $B5, $B6, $B7, $B8, $B9   ; 

- D 0 - I - 0x004B0A 01:8AFA: 01 11     .dbyt $0111 ; 
- D 0 - I - 0x004B0C 01:8AFC: 03        .byte $03   ; counter
- D 0 - I - 0x004B0D 01:8AFD: 00        .byte $00, $0D, $AF   ; 

- D 0 - I - 0x004B10 01:8B00: 01 12     .dbyt $0112 ; 
- D 0 - I - 0x004B12 01:8B02: 02        .byte $02   ; counter
- D 0 - I - 0x004B13 01:8B03: 00        .byte $00, $00   ; 

- D 0 - I - 0x004B15 01:8B05: FF        .byte $FF   ; end token



_off016_8B06_01_US:
- D 0 - I - 0x004B16 01:8B06: 20 10     .dbyt $2010 ; 
- D 0 - I - 0x004B18 01:8B08: 02        .byte $02   ; counter
- D 0 - I - 0x004B19 01:8B09: 00        .byte $00, $00   ; 

- D 0 - I - 0x004B1B 01:8B0B: 06 10     .dbyt $0610 ; 
- D 0 - I - 0x004B1D 01:8B0D: 08        .byte $08   ; counter
- D 0 - I - 0x004B1E 01:8B0E: 00        .byte $00, $00, $00, $00, $09, $09, $0A, $09   ; 

- D 0 - I - 0x004B26 01:8B16: 1A 10     .dbyt $1A10 ; 
- D 0 - I - 0x004B28 01:8B18: 06        .byte $06   ; counter
- D 0 - I - 0x004B29 01:8B19: 09        .byte $09, $0A, $09, $09, $00, $00   ; 

- D 0 - I - 0x004B2F 01:8B1F: 01 0E     .dbyt $010E ; 
- D 0 - I - 0x004B31 01:8B21: 01        .byte $01   ; counter
- D 0 - I - 0x004B32 01:8B22: 01        .byte $01   ; 

- D 0 - I - 0x004B33 01:8B23: 01 0F     .dbyt $010F ; 
- D 0 - I - 0x004B35 01:8B25: 02        .byte $02   ; counter
- D 0 - I - 0x004B36 01:8B26: 02        .byte $02, $03   ; 

- D 0 - I - 0x004B38 01:8B28: 00 10     .dbyt $0010 ; 
- D 0 - I - 0x004B3A 01:8B2A: 06        .byte $06   ; counter
- D 0 - I - 0x004B3B 01:8B2B: 00        .byte $00, $00, $06, $07, $08, $00   ; 

- D 0 - I - 0x004B41 01:8B31: 03 11     .dbyt $0311 ; 
- D 0 - I - 0x004B43 01:8B33: 02        .byte $02   ; counter
- D 0 - I - 0x004B44 01:8B34: 0E        .byte $0E, $0F   ; 

- D 0 - I - 0x004B46 01:8B36: 03 12     .dbyt $0312 ; 
- D 0 - I - 0x004B48 01:8B38: 02        .byte $02   ; counter
- D 0 - I - 0x004B49 01:8B39: 1B        .byte $1B, $1C   ; 

- D 0 - I - 0x004B4B 01:8B3B: FF        .byte $FF   ; end token



_off016_8B3C_02_US:
- D 0 - I - 0x004B4C 01:8B3C: 0A 10     .dbyt $0A10 ; 
- D 0 - I - 0x004B4E 01:8B3E: 14        .byte $14   ; counter
- D 0 - I - 0x004B4F 01:8B3F: 00        .byte $00, $00, $00, $00, $00, $09, $09, $0A, $0A, $C6, $0C, $0A, $0A, $09, $09, $00   ; 
- D 0 - I - 0x004B5F 01:8B4F: 00        .byte $00, $00, $00, $00   ; 

- D 0 - I - 0x004B63 01:8B53: 01 0E     .dbyt $010E ; 
- D 0 - I - 0x004B65 01:8B55: 04        .byte $04   ; counter
- D 0 - I - 0x004B66 01:8B56: 00        .byte $00, $00, $A7, $A8   ; 

- D 0 - I - 0x004B6A 01:8B5A: 01 0F     .dbyt $010F ; 
- D 0 - I - 0x004B6C 01:8B5C: 04        .byte $04   ; counter
- D 0 - I - 0x004B6D 01:8B5D: 00        .byte $00, $00, $A9, $AA   ; 

- D 0 - I - 0x004B71 01:8B61: 02 10     .dbyt $0210 ; 
- D 0 - I - 0x004B73 01:8B63: 02        .byte $02   ; counter
- D 0 - I - 0x004B74 01:8B64: AB        .byte $AB, $AC   ; 

- D 0 - I - 0x004B76 01:8B66: 01 11     .dbyt $0111 ; 
- D 0 - I - 0x004B78 01:8B68: 04        .byte $04   ; counter
- D 0 - I - 0x004B79 01:8B69: AD        .byte $AD, $AE, $AF, $B0   ; 

- D 0 - I - 0x004B7D 01:8B6D: 01 12     .dbyt $0112 ; 
- D 0 - I - 0x004B7F 01:8B6F: 04        .byte $04   ; counter
- D 0 - I - 0x004B80 01:8B70: B1        .byte $B1, $B2, $B3, $5D   ; 

- D 0 - I - 0x004B84 01:8B74: FF        .byte $FF   ; end token



_off016_8B75_03_US:

- D 0 - I - 0x004B85 01:8B75: 0F 10     .dbyt $0F10 ; 
- D 0 - I - 0x004B87 01:8B77: 0A        .byte $0A   ; counter
- D 0 - I - 0x004B88 01:8B78: 00        .byte $00, $00, $00, $00, $C8, $C9, $00, $00, $00, $00   ; 

- D 0 - I - 0x004B92 01:8B82: 03 0E     .dbyt $030E ; 
- D 0 - I - 0x004B94 01:8B84: 02        .byte $02   ; counter
- D 0 - I - 0x004B95 01:8B85: 00        .byte $00, $00   ; 

- D 0 - I - 0x004B97 01:8B87: 03 0F     .dbyt $030F ; 
- D 0 - I - 0x004B99 01:8B89: 02        .byte $02   ; counter
- D 0 - I - 0x004B9A 01:8B8A: 00        .byte $00, $00   ; 

- D 0 - I - 0x004B9C 01:8B8C: 00 10     .dbyt $0010 ; 
- D 0 - I - 0x004B9E 01:8B8E: 06        .byte $06   ; counter
- D 0 - I - 0x004B9F 01:8B8F: B4        .byte $B4, $B5, $B6, $B7, $B8, $B9   ; 

- D 0 - I - 0x004BA5 01:8B95: 01 11     .dbyt $0111 ; 
- D 0 - I - 0x004BA7 01:8B97: 03        .byte $03   ; counter
- D 0 - I - 0x004BA8 01:8B98: 00        .byte $00, $0D, $AF   ; 

- D 0 - I - 0x004BAB 01:8B9B: 01 12     .dbyt $0112 ; 
- D 0 - I - 0x004BAD 01:8B9D: 02        .byte $02   ; counter
- D 0 - I - 0x004BAE 01:8B9E: 00        .byte $00, $00   ; 

- D 0 - I - 0x004BB0 01:8BA0: FF        .byte $FF   ; end token



_off016_8BA1_04_US:
- D 0 - I - 0x004BB1 01:8BA1: 0F 10     .dbyt $0F10 ; 
- D 0 - I - 0x004BB3 01:8BA3: 0A        .byte $0A   ; counter
- D 0 - I - 0x004BB4 01:8BA4: 09        .byte $09, $09, $0A, $0A, $0B, $C7, $0A, $0A, $09, $09   ; 

- D 0 - I - 0x004BBE 01:8BAE: 01 0E     .dbyt $010E ; 
- D 0 - I - 0x004BC0 01:8BB0: 01        .byte $01   ; counter
- D 0 - I - 0x004BC1 01:8BB1: 01        .byte $01   ; 

- D 0 - I - 0x004BC2 01:8BB2: 01 0F     .dbyt $010F ; 
- D 0 - I - 0x004BC4 01:8BB4: 02        .byte $02   ; counter
- D 0 - I - 0x004BC5 01:8BB5: 02        .byte $02, $03   ; 

- D 0 - I - 0x004BC7 01:8BB7: 00 10     .dbyt $0010 ; 
- D 0 - I - 0x004BC9 01:8BB9: 06        .byte $06   ; counter
- D 0 - I - 0x004BCA 01:8BBA: 00        .byte $00, $00, $06, $07, $08, $00   ; 

- D 0 - I - 0x004BD0 01:8BC0: 03 11     .dbyt $0311 ; 
- D 0 - I - 0x004BD2 01:8BC2: 02        .byte $02   ; counter
- D 0 - I - 0x004BD3 01:8BC3: 0E        .byte $0E, $0F   ; 

- D 0 - I - 0x004BD5 01:8BC5: 03 12     .dbyt $0312 ; 
- D 0 - I - 0x004BD7 01:8BC7: 02        .byte $02   ; counter
- D 0 - I - 0x004BD8 01:8BC8: 1B        .byte $1B, $1C   ; 

- D 0 - I - 0x004BDA 01:8BCA: FF        .byte $FF   ; end token



_off016_8BCB_05_US:
- D 0 - I - 0x004BDB 01:8BCB: 0A 10     .dbyt $0A10 ; 
- D 0 - I - 0x004BDD 01:8BCD: 14        .byte $14   ; counter
- D 0 - I - 0x004BDE 01:8BCE: 09        .byte $09, $09, $0A, $09, $0A, $0A, $0A, $0A, $0A, $0B, $0C, $0A, $0A, $0A, $0A, $0A   ; 
- D 0 - I - 0x004BEE 01:8BDE: 09        .byte $09, $0A, $09, $09   ; 

- D 0 - I - 0x004BF2 01:8BE2: 01 0E     .dbyt $010E ; 
- D 0 - I - 0x004BF4 01:8BE4: 04        .byte $04   ; counter
- D 0 - I - 0x004BF5 01:8BE5: 00        .byte $00, $00, $A7, $A8   ; 

- D 0 - I - 0x004BF9 01:8BE9: 01 0F     .dbyt $010F ; 
- D 0 - I - 0x004BFB 01:8BEB: 04        .byte $04   ; counter
- D 0 - I - 0x004BFC 01:8BEC: 00        .byte $00, $00, $A9, $AA   ; 

- D 0 - I - 0x004C00 01:8BF0: 02 10     .dbyt $0210 ; 
- D 0 - I - 0x004C02 01:8BF2: 02        .byte $02   ; counter
- D 0 - I - 0x004C03 01:8BF3: AB        .byte $AB, $AC   ; 

- D 0 - I - 0x004C05 01:8BF5: 01 11     .dbyt $0111 ; 
- D 0 - I - 0x004C07 01:8BF7: 04        .byte $04   ; counter
- D 0 - I - 0x004C08 01:8BF8: AD        .byte $AD, $AE, $AF, $B0   ; 

- D 0 - I - 0x004C0C 01:8BFC: 01 12     .dbyt $0112 ; 
- D 0 - I - 0x004C0E 01:8BFE: 04        .byte $04   ; counter
- D 0 - I - 0x004C0F 01:8BFF: B1        .byte $B1, $B2, $B3, $5D   ; 

- D 0 - I - 0x004C13 01:8C03: FF        .byte $FF   ; end token



_off016_EU_8A93_00_EU:
- - - - - - 0x004AA3 01:8A93: 21 0F     .dbyt $210F ; 
- - - - - - 0x004AA5 01:8A95: 04        .byte $04   ; counter
- - - - - - 0x004AA6 01:8A96: 00        .byte $00, $00, $00, $00   ; 

- - - - - - 0x004AAA 01:8A9A: 20 10     .dbyt $2010 ; 
- - - - - - 0x004AAC 01:8A9C: 04        .byte $04   ; counter
- - - - - - 0x004AAD 01:8A9D: 04        .byte $04, $04, $04, $00   ; 

- - - - - - 0x004AB1 01:8AA1: 20 11     .dbyt $2011 ; 
- - - - - - 0x004AB3 01:8AA3: 06        .byte $06   ; counter
- - - - - - 0x004AB4 01:8AA4: 00        .byte $00, $00, $00, $00, $00, $00   ; 

- - - - - - 0x004ABA 01:8AAA: 21 12     .dbyt $2112 ; 
- - - - - - 0x004ABC 01:8AAC: 05        .byte $05   ; counter
- - - - - - 0x004ABD 01:8AAD: 00        .byte $00, $00, $00, $00, $00   ; 

- - - - - - 0x004AC2 01:8AB2: 21 13     .dbyt $2113 ; 
- - - - - - 0x004AC4 01:8AB4: 04        .byte $04   ; counter
- - - - - - 0x004AC5 01:8AB5: 00        .byte $00, $00, $00, $00   ; 

- - - - - - 0x004AC9 01:8AB9: 07 10     .dbyt $0710 ; 
- - - - - - 0x004ACB 01:8ABB: 08        .byte $08   ; counter
- - - - - - 0x004ACC 01:8ABC: 04        .byte $04, $04, $04, $05, $04, $05, $04, $05   ; 

- - - - - - 0x004AD4 01:8AC4: 1B 10     .dbyt $1B10 ; 
- - - - - - 0x004AD6 01:8AC6: 05        .byte $05   ; counter
- - - - - - 0x004AD7 01:8AC7: 05        .byte $05, $04, $05, $04, $05   ; 

- - - - - - 0x004ADC 01:8ACC: 27 10     .dbyt $2710 ; 
- - - - - - 0x004ADE 01:8ACE: 19        .byte $19   ; counter
- - - - - - 0x004ADF 01:8ACF: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00   ; 
- - - - - - 0x004AEF 01:8ADF: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00, $00   ; 

- - - - - - 0x004AF8 01:8AE8: 03 0F     .dbyt $030F ; 
- - - - - - 0x004AFA 01:8AEA: 02        .byte $02   ; counter
- - - - - - 0x004AFB 01:8AEB: 00        .byte $00, $00   ; 

- - - - - - 0x004AFD 01:8AED: 03 10     .dbyt $0310 ; 
- - - - - - 0x004AFF 01:8AEF: 02        .byte $02   ; counter
- - - - - - 0x004B00 01:8AF0: 00        .byte $00, $00   ; 

- - - - - - 0x004B02 01:8AF2: 00 11     .dbyt $0011 ; 
- - - - - - 0x004B04 01:8AF4: 06        .byte $06   ; counter
- - - - - - 0x004B05 01:8AF5: 9E        .byte $9E, $9F, $A0, $A1, $A2, $A3   ; 

- - - - - - 0x004B0B 01:8AFB: 01 12     .dbyt $0112 ; 
- - - - - - 0x004B0D 01:8AFD: 04        .byte $04   ; counter
- - - - - - 0x004B0E 01:8AFE: 00        .byte $00, $09, $93, $94   ; 

- - - - - - 0x004B12 01:8B02: 01 13     .dbyt $0113 ; 
- - - - - - 0x004B14 01:8B04: 04        .byte $04   ; counter
- - - - - - 0x004B15 01:8B05: 00        .byte $00, $00, $18, $97   ; 

- - - - - - 0x004B19 01:8B09: FF        .byte $FF   ; end token



_off016_EU_8B0A_01_EU:
- - - - - - 0x004B1A 01:8B0A: 20 10     .dbyt $2010 ; 
- - - - - - 0x004B1C 01:8B0C: 03        .byte $03   ; counter
- - - - - - 0x004B1D 01:8B0D: 00        .byte $00, $00, $00   ; 

- - - - - - 0x004B20 01:8B10: 07 10     .dbyt $0710 ; 
- - - - - - 0x004B22 01:8B12: 08        .byte $08   ; counter
- - - - - - 0x004B23 01:8B13: 00        .byte $00, $00, $00, $00, $04, $04, $05, $04   ; 

- - - - - - 0x004B2B 01:8B1B: 1B 10     .dbyt $1B10 ; 
- - - - - - 0x004B2D 01:8B1D: 05        .byte $05   ; counter
- - - - - - 0x004B2E 01:8B1E: 04        .byte $04, $05, $04, $04, $00   ; 

- - - - - - 0x004B33 01:8B23: 01 0F     .dbyt $010F ; 
- - - - - - 0x004B35 01:8B25: 01        .byte $01   ; counter
- - - - - - 0x004B36 01:8B26: 01        .byte $01   ; 

- - - - - - 0x004B37 01:8B27: 01 10     .dbyt $0110 ; 
- - - - - - 0x004B39 01:8B29: 02        .byte $02   ; counter
- - - - - - 0x004B3A 01:8B2A: 02        .byte $02, $03   ; 

- - - - - - 0x004B3C 01:8B2C: 00 11     .dbyt $0011 ; 
- - - - - - 0x004B3E 01:8B2E: 06        .byte $06   ; counter
- - - - - - 0x004B3F 01:8B2F: 00        .byte $00, $00, $06, $07, $08, $00   ; 

- - - - - - 0x004B45 01:8B35: 03 12     .dbyt $0312 ; 
- - - - - - 0x004B47 01:8B37: 03        .byte $03   ; counter
- - - - - - 0x004B48 01:8B38: 0A        .byte $0A, $0B, $08   ; 

- - - - - - 0x004B4B 01:8B3B: 03 13     .dbyt $0313 ; 
- - - - - - 0x004B4D 01:8B3D: 03        .byte $03   ; counter
- - - - - - 0x004B4E 01:8B3E: 0F        .byte $0F, $10, $11   ; 

- - - - - - 0x004B51 01:8B41: FF        .byte $FF   ; end token



_off016_EU_8B42_02_EU:
- - - - - - 0x004B52 01:8B42: 0B 10     .dbyt $0B10 ; 
- - - - - - 0x004B54 01:8B44: 14        .byte $14   ; counter
- - - - - - 0x004B55 01:8B45: 00        .byte $00, $00, $00, $00, $00, $04, $04, $05, $05, $B1, $3F, $05, $05, $04, $04, $00   ; 
- - - - - - 0x004B65 01:8B55: 00        .byte $00, $00, $00, $00   ; 

- - - - - - 0x004B69 01:8B59: 01 0F     .dbyt $010F ; 
- - - - - - 0x004B6B 01:8B5B: 04        .byte $04   ; counter
- - - - - - 0x004B6C 01:8B5C: 00        .byte $00, $00, $8B, $8C   ; 

- - - - - - 0x004B70 01:8B60: 01 10     .dbyt $0110 ; 
- - - - - - 0x004B72 01:8B62: 04        .byte $04   ; counter
- - - - - - 0x004B73 01:8B63: 00        .byte $00, $00, $8D, $8E   ; 

- - - - - - 0x004B77 01:8B67: 02 11     .dbyt $0211 ; 
- - - - - - 0x004B79 01:8B69: 02        .byte $02   ; counter
- - - - - - 0x004B7A 01:8B6A: 8F        .byte $8F, $90   ; 

- - - - - - 0x004B7C 01:8B6C: 01 12     .dbyt $0112 ; 
- - - - - - 0x004B7E 01:8B6E: 04        .byte $04   ; counter
- - - - - - 0x004B7F 01:8B6F: 91        .byte $91, $92, $93, $94   ; 

- - - - - - 0x004B83 01:8B73: 01 13     .dbyt $0113 ; 
- - - - - - 0x004B85 01:8B75: 04        .byte $04   ; counter
- - - - - - 0x004B86 01:8B76: 95        .byte $95, $96, $18, $97   ; 

- - - - - - 0x004B8A 01:8B7A: FF        .byte $FF   ; end token



_off016_EU_8B7B_03_EU:
- - - - - - 0x004B8B 01:8B7B: 10 10     .dbyt $1010 ; 
- - - - - - 0x004B8D 01:8B7D: 0A        .byte $0A   ; counter
- - - - - - 0x004B8E 01:8B7E: 00        .byte $00, $00, $00, $00, $B3, $B4, $00, $00, $00, $00   ; 

- - - - - - 0x004B98 01:8B88: 03 0F     .dbyt $030F ; 
- - - - - - 0x004B9A 01:8B8A: 02        .byte $02   ; counter
- - - - - - 0x004B9B 01:8B8B: 00        .byte $00, $00   ; 

- - - - - - 0x004B9D 01:8B8D: 03 10     .dbyt $0310 ; 
- - - - - - 0x004B9F 01:8B8F: 02        .byte $02   ; counter
- - - - - - 0x004BA0 01:8B90: 00        .byte $00, $00   ; 

- - - - - - 0x004BA2 01:8B92: 00 11     .dbyt $0011 ; 
- - - - - - 0x004BA4 01:8B94: 06        .byte $06   ; counter
- - - - - - 0x004BA5 01:8B95: 9E        .byte $9E, $9F, $A0, $A1, $A2, $A3   ; 

- - - - - - 0x004BAB 01:8B9B: 01 12     .dbyt $0112 ; 
- - - - - - 0x004BAD 01:8B9D: 04        .byte $04   ; counter
- - - - - - 0x004BAE 01:8B9E: 00        .byte $00, $09, $93, $94   ; 

- - - - - - 0x004BB2 01:8BA2: 01 13     .dbyt $0113 ; 
- - - - - - 0x004BB4 01:8BA4: 04        .byte $04   ; counter
- - - - - - 0x004BB5 01:8BA5: 00        .byte $00, $00, $18, $97   ; 

- - - - - - 0x004BB9 01:8BA9: FF        .byte $FF   ; 



_off016_EU_8BAA_04_EU:
- - - - - - 0x004BBA 01:8BAA: 10 10     .dbyt $1010 ; 
- - - - - - 0x004BBC 01:8BAC: 0A        .byte $0A   ; counter
- - - - - - 0x004BBD 01:8BAD: 04        .byte $04, $04, $05, $05, $3E, $B2, $05, $05, $04, $04   ; 

- - - - - - 0x004BC7 01:8BB7: 01 0F     .dbyt $010F ; 
- - - - - - 0x004BC9 01:8BB9: 01        .byte $01   ; counter
- - - - - - 0x004BCA 01:8BBA: 01        .byte $01   ; 

- - - - - - 0x004BCB 01:8BBB: 01 10     .dbyt $0110 ; 
- - - - - - 0x004BCD 01:8BBD: 02        .byte $02   ; counter
- - - - - - 0x004BCE 01:8BBE: 02        .byte $02, $03   ; 

- - - - - - 0x004BD0 01:8BC0: 00 11     .dbyt $0011 ; 
- - - - - - 0x004BD2 01:8BC2: 06        .byte $06   ; counter
- - - - - - 0x004BD3 01:8BC3: 00        .byte $00, $00, $06, $07, $08, $00   ; 

- - - - - - 0x004BD9 01:8BC9: 03 12     .dbyt $0312 ; 
- - - - - - 0x004BDB 01:8BCB: 03        .byte $03   ; counter
- - - - - - 0x004BDC 01:8BCC: 0A        .byte $0A, $0B, $08   ; 

- - - - - - 0x004BDF 01:8BCF: 03 13     .dbyt $0313 ; 
- - - - - - 0x004BE1 01:8BD1: 03        .byte $03   ; counter
- - - - - - 0x004BE2 01:8BD2: 0F        .byte $0F, $10, $11   ; 

- - - - - - 0x004BE5 01:8BD5: FF        .byte $FF   ; end token



_off016_EU_8BD6_05_EU:
- - - - - - 0x004BE6 01:8BD6: 0B 10     .dbyt $0B10 ; 
- - - - - - 0x004BE8 01:8BD8: 14        .byte $14   ; counter
- - - - - - 0x004BE9 01:8BD9: 04        .byte $04, $04, $05, $04, $05, $05, $05, $05, $05, $47, $48, $05, $05, $05, $05, $05   ; 
- - - - - - 0x004BF9 01:8BE9: 04        .byte $04, $05, $04, $04   ; 

- - - - - - 0x004BFD 01:8BED: 01 0F     .dbyt $010F ; 
- - - - - - 0x004BFF 01:8BEF: 04        .byte $04   ; counter
- - - - - - 0x004C00 01:8BF0: 00        .byte $00, $00, $8B, $8C   ; 

- - - - - - 0x004C04 01:8BF4: 01 10     .dbyt $0110 ; 
- - - - - - 0x004C06 01:8BF6: 04        .byte $04   ; counter
- - - - - - 0x004C07 01:8BF7: 00        .byte $00, $00, $8D, $8E   ; 

- - - - - - 0x004C0B 01:8BFB: 02 11     .dbyt $0211 ; 
- - - - - - 0x004C0D 01:8BFD: 02        .byte $02   ; counter
- - - - - - 0x004C0E 01:8BFE: 8F        .byte $8F, $90   ; 

- - - - - - 0x004C10 01:8C00: 01 12     .dbyt $0112 ; 
- - - - - - 0x004C12 01:8C02: 04        .byte $04   ; counter
- - - - - - 0x004C13 01:8C03: 91        .byte $91, $92, $93, $94   ; 

- - - - - - 0x004C17 01:8C07: 01 13     .dbyt $0113 ; 
- - - - - - 0x004C19 01:8C09: 04        .byte $04   ; counter
- - - - - - 0x004C1A 01:8C0A: 95        .byte $95, $96, $18, $97   ; 

- - - - - - 0x004C1E 01:8C0E: FF        .byte $FF   ; end token



sub_86B7:
; leon опт
                                        LDY ram_0748_obj,X
                                        LDA tbl_86BD_lo,y
                                        STA ram_0000
                                        LDA tbl_86BD_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_86BD_lo:
- D 0 - I - 0x0046CD 01:86BD: D3 86     .byte < ofs_013_86D3_00
- D 0 - I - 0x0046CF 01:86BF: E5 86     .byte < ofs_013_86E5_01
- D 0 - I - 0x0046D1 01:86C1: F9 86     .byte < ofs_013_86F9_02
- D 0 - I - 0x0046D3 01:86C3: 01 87     .byte < ofs_013_8701_03
- D 0 - I - 0x0046D5 01:86C5: 09 87     .byte < ofs_013_8709_04_предел_полета_X
- D 0 - I - 0x0046D7 01:86C7: 18 87     .byte < ofs_013_8718_05
- D 0 - I - 0x0046D9 01:86C9: 25 87     .byte < ofs_013_8725_06
- D 0 - I - 0x0046DB 01:86CB: 2D 87     .byte < ofs_013_872D_07
- D 0 - I - 0x0046DD 01:86CD: 3A 87     .byte < ofs_013_873A_08
- D 0 - I - 0x0046DF 01:86CF: 45 87     .byte < ofs_013_8745_09
- D 0 - I - 0x0046E1 01:86D1: 5A 87     .byte < ofs_013_875A_0A
tbl_86BD_hi:
- D 0 - I - 0x0046CD 01:86BD: D3 86     .byte > ofs_013_86D3_00
- D 0 - I - 0x0046CF 01:86BF: E5 86     .byte > ofs_013_86E5_01
- D 0 - I - 0x0046D1 01:86C1: F9 86     .byte > ofs_013_86F9_02
- D 0 - I - 0x0046D3 01:86C3: 01 87     .byte > ofs_013_8701_03
- D 0 - I - 0x0046D5 01:86C5: 09 87     .byte > ofs_013_8709_04_предел_полета_X
- D 0 - I - 0x0046D7 01:86C7: 18 87     .byte > ofs_013_8718_05
- D 0 - I - 0x0046D9 01:86C9: 25 87     .byte > ofs_013_8725_06
- D 0 - I - 0x0046DB 01:86CB: 2D 87     .byte > ofs_013_872D_07
- D 0 - I - 0x0046DD 01:86CD: 3A 87     .byte > ofs_013_873A_08
- D 0 - I - 0x0046DF 01:86CF: 45 87     .byte > ofs_013_8745_09
- D 0 - I - 0x0046E1 01:86D1: 5A 87     .byte > ofs_013_875A_0A



ofs_013_86D3_00:
C - - J - - 0x0046E3 01:86D3: BD 9C 07  LDA ram_позиция_объектов_x_старш,X
C - - - - - 0x0046E6 01:86D6: D0 54     BNE bra_872C_RTS
C - - - - - 0x0046E8 01:86D8: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x0046EB 01:86DB: C9 01     CMP #$01
C - - - - - 0x0046ED 01:86DD: 90 4D     BCC bra_872C_RTS
loc_86DF:
bra_86DF:
C - - - - - 0x0046EF 01:86DF: FE 48 07  INC ram_0748_obj,X
C - - - - - 0x0046F2 01:86E2: 4C 68 86  JMP loc_8668


ofs_013_86E5_01:
C - - J - - 0x0046F5 01:86E5: BD 8E 07  LDA ram_позиция_объектов_y_старш,X
C - - - - - 0x0046F8 01:86E8: D0 42     BNE bra_872C_RTS
C - - - - - 0x0046FA 01:86EA: BD 22 05  LDA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x0046FD 01:86ED: C9 40     CMP #$40
C - - - - - 0x0046FF 01:86EF: 90 0F     BCC bra_8700_RTS
C - - - - - 0x004701 01:86F1: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x004703 01:86F3: 09 40     ORA #$40
C - - - - - 0x004705 01:86F5: 85 94     STA ram_0094_конфиг_уровня
C - - - - - 0x004707 01:86F7: B0 E6     BCS bra_86DF    ; jmp


ofs_013_86F9_02:
C - - J - - 0x004709 01:86F9: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x00470C 01:86FC: C9 A0     CMP #$A0
C - - - - - 0x00470E 01:86FE: B0 DF     BCS bra_86DF
bra_8700_RTS:
C - - - - - 0x004710 01:8700: 60        RTS


ofs_013_8701_03:
C - - J - - 0x004711 01:8701: BD 22 05  LDA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x004714 01:8704: C9 78     CMP #$78
C - - - - - 0x004716 01:8706: B0 D7     BCS bra_86DF
C - - - - - 0x004718 01:8708: 60        RTS


ofs_013_8709_04_предел_полета_X:
C - - J - - 0x004719 01:8709: BD 9C 07  LDA ram_позиция_объектов_x_старш,X
C - - - - - 0x00471C 01:870C: C9 01     CMP #$01
C - - - - - 0x00471E 01:870E: D0 1C     BNE bra_872C_RTS
C - - - - - 0x004720 01:8710: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
; 1путин
                                        LDY ram_option_регион
                                        CMP tbl_8718_предел_полета_x,Y
C - - - - - 0x004725 01:8715: B0 C8     BCS bra_86DF
C - - - - - 0x004727 01:8717: 60        RTS


tbl_8718_предел_полета_x:
                                        .byte $30   ; 00 US
                                        .byte $20   ; 01 EU


ofs_013_8718_05:
C - - J - - 0x004728 01:8718: BD 9C 07  LDA ram_позиция_объектов_x_старш,X
C - - - - - 0x00472B 01:871B: D0 0F     BNE bra_872C_RTS
C - - - - - 0x00472D 01:871D: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x004730 01:8720: C9 E0     CMP #$E0
C - - - - - 0x004732 01:8722: 90 BB     BCC bra_86DF
C - - - - - 0x004734 01:8724: 60        RTS


ofs_013_8725_06:
C - - J - - 0x004735 01:8725: BD 22 05  LDA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x004738 01:8728: C9 50     CMP #$50
C - - - - - 0x00473A 01:872A: 90 B3     BCC bra_86DF
bra_872C_RTS:
C - - - - - 0x00473C 01:872C: 60        RTS


ofs_013_872D_07:
C - - J - - 0x00473D 01:872D: BD 9C 07  LDA ram_позиция_объектов_x_старш,X
C - - - - - 0x004740 01:8730: 10 FA     BPL bra_872C_RTS
C - - - - - 0x004742 01:8732: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x004745 01:8735: C9 E0     CMP #$E0
C - - - - - 0x004747 01:8737: 90 A6     BCC bra_86DF
C - - - - - 0x004749 01:8739: 60        RTS


ofs_013_873A_08:
C - - J - - 0x00474A 01:873A: BD 22 05  LDA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x00474D 01:873D: C9 78     CMP #$78
C - - - - - 0x00474F 01:873F: 90 BF     BCC bra_8700_RTS
; C = 1
C - - - - - 0x004751 01:8741: A9 01     LDA #$01
C - - - - - 0x004753 01:8743: D0 10     BNE bra_8755    ; jmp


ofs_013_8745_09:
C - - J - - 0x004755 01:8745: BD 9C 07  LDA ram_позиция_объектов_x_старш,X
C - - - - - 0x004758 01:8748: C9 01     CMP #$01
C - - - - - 0x00475A 01:874A: D0 E0     BNE bra_872C_RTS
C - - - - - 0x00475C 01:874C: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x00475F 01:874F: C9 10     CMP #$10
C - - - - - 0x004761 01:8751: 90 AD     BCC bra_8700_RTS
; C = 1
C - - - - - 0x004763 01:8753: A9 00     LDA #$00
bra_8755:   ; C = 1
C - - - - - 0x004765 01:8755: 9D 80 07  STA ram_0780_obj,X
                                        JMP loc_86DF    ; jmp


ofs_013_875A_0A:
C - - J - - 0x00476A 01:875A: BD AE 06  LDA ram_скорость_объектов_y_старш,X
C - - - - - 0x00476D 01:875D: 2A        ROL
C - - - - - 0x00476E 01:875E: 2A        ROL
C - - - - - 0x00476F 01:875F: 29 01     AND #$01
C - - - - - 0x004771 01:8761: A8        TAY
C - - - - - 0x004772 01:8762: BD 22 05  LDA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x004775 01:8765: D9 93 87  CMP tbl_8793_pos_Y,Y
C - - - - - 0x004778 01:8768: 6A        ROR
C - - - - - 0x004779 01:8769: 5D AE 06  EOR ram_скорость_объектов_y_старш,X
C - - - - - 0x00477C 01:876C: 10 03     BPL bra_8771
C - - - - - 0x00477E 01:876E: 20 EE A7  JSR sub_0x0067FE_inverse_spd_Y
bra_8771:
C - - - - - 0x004781 01:8771: BD 9C 07  LDA ram_позиция_объектов_x_старш,X
C - - - - - 0x004784 01:8774: D0 B6     BNE bra_872C_RTS
C - - - - - 0x004786 01:8776: BD CA 06  LDA ram_скорость_объектов_x_старш,X
C - - - - - 0x004789 01:8779: 2A        ROL
C - - - - - 0x00478A 01:877A: 2A        ROL
C - - - - - 0x00478B 01:877B: 29 01     AND #$01
C - - - - - 0x00478D 01:877D: A8        TAY
C - - - - - 0x00478E 01:877E: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x004791 01:8781: D9 95 87  CMP tbl_8795_pos_X,Y
C - - - - - 0x004794 01:8784: 6A        ROR
C - - - - - 0x004795 01:8785: 5D CA 06  EOR ram_скорость_объектов_x_старш,X
C - - - - - 0x004798 01:8788: 10 A2     BPL bra_872C_RTS
C - - - - - 0x00479A 01:878A: B9 97 87  LDA tbl_8797,Y
C - - - - - 0x00479D 01:878D: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x0047A0 01:8790: 4C DC A7  JMP loc_0x0067EC_inverse_spd_X



tbl_8793_pos_Y:
- D 0 - - - 0x0047A3 01:8793: 78        .byte $78   ; 00 
- D 0 - - - 0x0047A4 01:8794: 40        .byte $40   ; 01 



tbl_8795_pos_X:
- D 0 - - - 0x0047A5 01:8795: E0        .byte $E0   ; 00 
- D 0 - - - 0x0047A6 01:8796: 10        .byte $10   ; 01 



tbl_8797:
- - - - - - 0x0047A7 01:8797: 00        .byte $00   ; 00 
- D 0 - - - 0x0047A8 01:8798: 01        .byte $01   ; 01 



tbl_87B7:
- D 0 - - - 0x0047C7 01:87B7: 03        .byte con_buf_mode_03   ; 

- D 0 - - - 0x0047C8 01:87B8: 2B D8     .dbyt $2BD8 ; ppu address
- D 0 - - - 0x0047CA 01:87BA: 12        .byte $12, $AA   ; counter + fill tile

- D 0 - - - 0x0047CC 01:87BC: 06        .byte con_buf_mode_06   ; 

- D 0 - - - 0x0047CD 01:87BD: 2B EA     .dbyt $2BEA ; ppu address
- D 0 - - - 0x0047CF 01:87BF: 05        .byte $05   ; counter
- D 0 - - - 0x0047D0 01:87C0: AE        .byte $AE, $FA, $FA, $FA, $FA   ; tiles

- D 0 - - - 0x0047D5 01:87C5: FF        .byte $FF   ; change mode

- D 0 - - - 0x0047D6 01:87C6: 03        .byte con_buf_mode_03   ; 

- D 0 - - - 0x0047D7 01:87C7: 2B EF     .dbyt $2BEF ; ppu address
- D 0 - - - 0x0047D9 01:87C9: 08        .byte $08, $AA   ; counter + fill tile



_off001_0x0040E9_22_boss_area_1_gun:
- D 0 - I - 0x0040E9 01:80D9: E7 80     .word ofs_038_22_80E7_01_initialize_object ; 
- D 0 - I - 0x0040EB 01:80DB: 08 81     .word ofs_038_22_8108_02 ; 
- D 0 - I - 0x0040ED 01:80DD: 54 A3     .word ofs_038_22_0x006364_03_удалить_объект_06 ; 
- D 0 - I - 0x0040EF 01:80DF: 6B A3     .word ofs_038_22_0x00637B_04_удалить_объект_07 ; 
- D 0 - I - 0x0040F1 01:80E1: 97 81     .word ofs_038_22_8197_05 ; 
- D 0 - I - 0x0040F3 01:80E3: FD A2     .word ofs_038_22_0x00630D_06 ; 
- D 0 - I - 0x0040F5 01:80E5: AD 81     .word ofs_038_22_81AD_07 ; 



ofs_038_22_80E7_01_initialize_object:
C - - J - - 0x0040F7 01:80E7: A9 08     LDA #$08
C - - - - - 0x0040F9 01:80E9: 20 95 AB  JSR sub_0x006BA5_set_dynamic_hp_to_enemy
C - - - - - 0x0040FC 01:80EC: A9 02     LDA #$02
C - - - - - 0x0040FE 01:80EE: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x004101 01:80F1: A9 03     LDA #$03
C - - - - - 0x004103 01:80F3: 9D 48 07  STA ram_0748_obj,X
C - - - - - 0x004106 01:80F6: BC 1E 07  LDY ram_obj_flags,X
C - - - - - 0x004109 01:80F9: B9 04 81  LDA tbl_8104,Y
C - - - - - 0x00410C 01:80FC: 9D F4 06  STA ram_06F4_obj,X
C - - - - - 0x00410F 01:80FF: A9 01     LDA #$01
C - - - - - 0x004111 01:8101: 4C E0 A2  JMP loc_0x0062F0



tbl_8104:
- D 0 - - - 0x004114 01:8104: 6B        .byte $6B   ; 00 
- D 0 - - - 0x004115 01:8105: 95        .byte $95   ; 01 
- D 0 - - - 0x004116 01:8106: C1        .byte $C1   ; 02 
- D 0 - - - 0x004117 01:8107: F8        .byte $F8   ; 03 



ofs_038_22_8108_02:
C - - J - - 0x004118 01:8108: A9 01     LDA #$01
C - - - - - 0x00411A 01:810A: 9D 08 05  STA ram_кадр_врага_и_пуль,X
C - - - - - 0x00411D 01:810D: 20 E6 81  JSR sub_81E6
C - - - - - 0x004120 01:8110: A9 81     LDA #$81
C - - - - - 0x004122 01:8112: 9D 2C 07  STA ram_параметры_объектов,X
C - - - - - 0x004125 01:8115: BD 9C 07  LDA ram_позиция_объектов_x_старш,X
C - - - - - 0x004128 01:8118: D0 7C     BNE bra_8196_RTS
C - - - - - 0x00412A 01:811A: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x00412D 01:811D: C9 08     CMP #$08
C - - - - - 0x00412F 01:811F: 90 75     BCC bra_8196_RTS
C - - - - - 0x004131 01:8121: C9 10     CMP #$10
C - - - - - 0x004133 01:8123: 90 0D     BCC bra_8132
C - - - - - 0x004135 01:8125: C9 FC     CMP #$FC
C - - - - - 0x004137 01:8127: B0 6D     BCS bra_8196_RTS
C - - - - - 0x004139 01:8129: C9 F0     CMP #$F0
C - - - - - 0x00413B 01:812B: B0 05     BCS bra_8132
C - - - - - 0x00413D 01:812D: A9 00     LDA #$00
C - - - - - 0x00413F 01:812F: 9D 2C 07  STA ram_параметры_объектов,X
bra_8132:
C - - - - - 0x004142 01:8132: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x004145 01:8135: B9 AE 06  LDA ram_скорость_объектов_y_старш,Y
C - - - - - 0x004148 01:8138: 19 A0 06  ORA ram_скорость_объектов_y_младш,Y
C - - - - - 0x00414B 01:813B: F0 05     BEQ bra_8142
C - - - - - 0x00414D 01:813D: B9 AE 06  LDA ram_скорость_объектов_y_старш,Y
C - - - - - 0x004150 01:8140: 10 23     BPL bra_8165
bra_8142:
C - - - - - 0x004152 01:8142: DE F4 06  DEC ram_06F4_obj,X
C - - - - - 0x004155 01:8145: D0 1E     BNE bra_8165
C - - - - - 0x004157 01:8147: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x00415A 01:814A: 85 0A     STA ram_000A
C - - - - - 0x00415C 01:814C: 20 AE AA  JSR sub_0x006ABE
C - - - - - 0x00415F 01:814F: A0 02     LDY #$02
C - - - - - 0x004161 01:8151: 20 27 F3  JSR sub_0x01F337
C - - - - - 0x004164 01:8154: A9 10     LDA #$10
C - - - - - 0x004166 01:8156: DE 64 07  DEC ram_0764_obj,X
C - - - - - 0x004169 01:8159: D0 07     BNE bra_8162
C - - - - - 0x00416B 01:815B: A9 02     LDA #$02
C - - - - - 0x00416D 01:815D: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x004170 01:8160: A9 89     LDA #$89
bra_8162:
C - - - - - 0x004172 01:8162: 9D F4 06  STA ram_06F4_obj,X
bra_8165:
C - - - - - 0x004175 01:8165: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x004178 01:8168: D0 2C     BNE bra_8196_RTS
C - - - - - 0x00417A 01:816A: A9 0D     LDA #$0D
C - - - - - 0x00417C 01:816C: 9D E6 06  STA ram_счетчкики_для_объектов,X
C - - - - - 0x00417F 01:816F: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x004182 01:8172: 98        TYA
C - - - - - 0x004183 01:8173: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x004186 01:8176: 20 AE AA  JSR sub_0x006ABE
C - - - - - 0x004189 01:8179: 20 A5 F4  JSR sub_0x01F4B5
C - - - - - 0x00418C 01:817C: A0 00     LDY #$00
C - - - - - 0x00418E 01:817E: BD 48 07  LDA ram_0748_obj,X
C - - - - - 0x004191 01:8181: C9 05     CMP #$05
C - - - - - 0x004193 01:8183: 90 0A     BCC bra_818F
C - - - - - 0x004195 01:8185: C9 12     CMP #$12
C - - - - - 0x004197 01:8187: B0 06     BCS bra_818F
C - - - - - 0x004199 01:8189: C8        INY
C - - - - - 0x00419A 01:818A: C9 08     CMP #$08
C - - - - - 0x00419C 01:818C: 90 01     BCC bra_818F
C - - - - - 0x00419E 01:818E: C8        INY
bra_818F:
C - - - - - 0x00419F 01:818F: 98        TYA
C - - - - - 0x0041A0 01:8190: 18        CLC
C - - - - - 0x0041A1 01:8191: 69 01     ADC #$01
C - - - - - 0x0041A3 01:8193: 4C B0 81  JMP loc_81B0
bra_8196_RTS:
C - - - - - 0x0041A6 01:8196: 60        RTS



ofs_038_22_8197_05:
C - - J - - 0x0041A7 01:8197: 20 E6 81  JSR sub_81E6
C - - - - - 0x0041AA 01:819A: A9 04     LDA #$04
C - - - - - 0x0041AC 01:819C: 20 B0 81  JSR sub_81B0
C - - - - - 0x0041AF 01:819F: B0 F5     BCS bra_8196_RTS
C - - - - - 0x0041B1 01:81A1: BD 80 07  LDA ram_0780_obj,X
C - - - - - 0x0041B4 01:81A4: AA        TAX
C - - - - - 0x0041B5 01:81A5: DE 64 07  DEC ram_0764_obj,X
C - - - - - 0x0041B8 01:81A8: A6 10     LDX ram_0010
C - - - - - 0x0041BA 01:81AA: 4C 9A A2  JMP loc_0x0062AA



ofs_038_22_81AD_07: ; bzk optimize
C - - J - - 0x0041BD 01:81AD: 4C 3D A3  JMP loc_0x00634D_удалить_объект_04



loc_81B0:
sub_81B0:
C D 0 - - - 0x0041C0 01:81B0: 85 08     STA ram_0008
C - - - - - 0x0041C2 01:81B2: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x0041C5 01:81B5: C9 08     CMP #$08
C - - - - - 0x0041C7 01:81B7: 90 21     BCC bra_81DA
C - - - - - 0x0041C9 01:81B9: C9 FC     CMP #$FC
C - - - - - 0x0041CB 01:81BB: B0 1D     BCS bra_81DA
C - - - - - 0x0041CD 01:81BD: BD 1E 07  LDA ram_obj_flags,X
C - - - - - 0x0041D0 01:81C0: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x0041D2 01:81C2: E0 50     CPX #$50
C - - - - - 0x0041D4 01:81C4: B0 11     BCS bra_81D7
C - - - - - 0x0041D6 01:81C6: 29 07     AND #$07
C - - - - - 0x0041D8 01:81C8: 0A        ASL
                                        LDY ram_option_регион
                                        BEQ bra_81C9_US
                                        ADC #$08
bra_81C9_US:
C - - - - - 0x0041D9 01:81C9: A8        TAY
C - - - - - 0x0041DA 01:81CA: B9 DC 81  LDA tbl_81DC_ppu_addr,Y
C - - - - - 0x0041DD 01:81CD: 85 00     STA ram_0000
C - - - - - 0x0041DF 01:81CF: B9 DD 81  LDA tbl_81DC_ppu_addr + $01,Y
C - - - - - 0x0041E2 01:81D2: 85 01     STA ram_0001
C - - - - - 0x0041E4 01:81D4: 20 3B BC  JSR sub_0x007C4B_пушки_вертолета
bra_81D7:
C - - - - - 0x0041E7 01:81D7: A6 10     LDX ram_0010
C - - - - - 0x0041E9 01:81D9: 60        RTS
bra_81DA:
- - - - - - 0x0041EA 01:81DA: 18        CLC
- - - - - - 0x0041EB 01:81DB: 60        RTS



tbl_81DC_ppu_addr:
- D 0 - - - 0x0041EC 01:81DC: 8D 2E     .word $2E8D ; 00 US
- D 0 - - - 0x0041EE 01:81DE: 90 2E     .word $2E90 ; 01 US
- D 0 - - - 0x0041F0 01:81E0: 93 2E     .word $2E93 ; 02 US
- D 0 - - - 0x0041F2 01:81E2: 96 2E     .word $2E96 ; 03 US
                                        .word $2E8F ; 00 EU
                                        .word $2E92 ; 01 EU
                                        .word $2E95 ; 02 EU
                                        .word $2E98 ; 03 EU



sub_81E6:
C - - - - - 0x0041F6 01:81E6: BD 1E 07  LDA ram_obj_flags,X
C - - - - - 0x0041F9 01:81E9: 29 07     AND #$07
C - - - - - 0x0041FB 01:81EB: 0A        ASL
                                        LDY ram_option_регион
                                        BEQ bra_81EC_US
                                        ADC #$0A
bra_81EC_US:
C - - - - - 0x0041FC 01:81EC: A8        TAY
C - - - - - 0x0041FD 01:81ED: B9 36 82  LDA tbl_8236_координаты_пушек,Y
C - - - - - 0x004200 01:81F0: 85 08     STA ram_0008
C - - - - - 0x004202 01:81F2: 0A        ASL
C - - - - - 0x004203 01:81F3: A9 00     LDA #$00
C - - - - - 0x004205 01:81F5: 90 02     BCC bra_81F9
- - - - - - 0x004207 01:81F7: A9 FF     LDA #$FF
bra_81F9:
C - - - - - 0x004209 01:81F9: 85 0A     STA ram_000A
C - - - - - 0x00420B 01:81FB: B9 37 82  LDA tbl_8236_координаты_пушек + $01,Y
C - - - - - 0x00420E 01:81FE: 85 09     STA ram_0009
C - - - - - 0x004210 01:8200: 0A        ASL
C - - - - - 0x004211 01:8201: A9 00     LDA #$00
C - - - - - 0x004213 01:8203: 90 02     BCC bra_8207
C - - - - - 0x004215 01:8205: A9 FF     LDA #$FF
bra_8207:
C - - - - - 0x004217 01:8207: 85 0B     STA ram_000B
C - - - - - 0x004219 01:8209: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x00421C 01:820C: A5 09     LDA ram_0009
C - - - - - 0x00421E 01:820E: 18        CLC
C - - - - - 0x00421F 01:820F: 79 3C 05  ADC ram_позиция_x_спрайта_врага_и_пуль,Y
C - - - - - 0x004222 01:8212: 9D 3C 05  STA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x004225 01:8215: A5 0B     LDA ram_000B
C - - - - - 0x004227 01:8217: 79 9C 07  ADC ram_позиция_объектов_x_старш,Y
C - - - - - 0x00422A 01:821A: 9D 9C 07  STA ram_позиция_объектов_x_старш,X
C - - - - - 0x00422D 01:821D: D0 14     BNE bra_8233
C - - - - - 0x00422F 01:821F: A5 08     LDA ram_0008
C - - - - - 0x004231 01:8221: 18        CLC
C - - - - - 0x004232 01:8222: 79 22 05  ADC ram_позиция_y_спрайта_врага_и_пуль,Y
C - - - - - 0x004235 01:8225: 9D 22 05  STA ram_позиция_y_спрайта_врага_и_пуль,X
C - - - - - 0x004238 01:8228: A5 0A     LDA ram_000A
C - - - - - 0x00423A 01:822A: 79 8E 07  ADC ram_позиция_объектов_y_старш,Y
C - - - - - 0x00423D 01:822D: 9D 8E 07  STA ram_позиция_объектов_y_старш,X
C - - - - - 0x004240 01:8230: D0 01     BNE bra_8233
C - - - - - 0x004242 01:8232: 60        RTS
bra_8233:
C - - - - - 0x004243 01:8233: 4C 7D A2  JMP loc_0x00628D_clear_anim_id



tbl_8236_координаты_пушек:
;                                              +---------- pos_Y
;                                              |    +----- pos_X
;                                              |    |
- D 0 - - - 0x004246 01:8236: 02        .byte $02, $D0   ; 00 US
- D 0 - - - 0x004248 01:8238: 02        .byte $02, $E8   ; 01 US
- D 0 - - - 0x00424A 01:823A: 02        .byte $02, $00   ; 02 US
- D 0 - - - 0x00424C 01:823C: 02        .byte $02, $18   ; 03 US
- D 0 - - - 0x00424E 01:823E: 0A        .byte $0A, $B0   ; 04 US

;                                              +---------- pos_Y
;                                              |    +----- pos_X
;                                              |    |
                                        .byte $02, $E0   ; 00 EU
                                        .byte $02, $F8   ; 01 EU
                                        .byte $02, $10   ; 02 EU
                                        .byte $02, $28   ; 03 EU
                                        .byte $0A, $D0   ; 04 EU



_off001_0x004250_23_boss_area_1_door:
; helicopter boss area 1
- D 0 - I - 0x004250 01:8240: 4E 82     .word ofs_038_23_824E_01_initialize_object ; 
- D 0 - I - 0x004252 01:8242: 58 82     .word ofs_038_23_8258_02 ; 
- D 0 - I - 0x004254 01:8244: 73 82     .word ofs_038_23_8273_03_open_door ; 
- D 0 - I - 0x004256 01:8246: A8 82     .word ofs_038_23_82A8_04 ; 
- D 0 - I - 0x004258 01:8248: E5 82     .word ofs_038_23_82E5_05_close_door ; 
- D 0 - I - 0x00425A 01:824A: FC 82     .word ofs_038_23_82FC_06 ; 
- D 0 - I - 0x00425C 01:824C: 75 A2     .word ofs_038_23_0x006285_07_удалить_объект_02 ; 



ofs_038_23_824E_01_initialize_object:
C - - J - - 0x00425E 01:824E: A9 81     LDA #$81
C - - - - - 0x004260 01:8250: 9D 2C 07  STA ram_параметры_объектов,X
C - - - - - 0x004263 01:8253: A9 80     LDA #$80
C - - - - - 0x004265 01:8255: 4C E0 A2  JMP loc_0x0062F0



ofs_038_23_8258_02:
C - - J - - 0x004268 01:8258: 20 E4 81  JSR sub_81E6
C - - - - - 0x00426B 01:825B: BD 9C 07  LDA ram_позиция_объектов_x_старш,X
C - - - - - 0x00426E 01:825E: D0 31     BNE bra_8291_RTS
C - - - - - 0x004270 01:8260: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x004272 01:8262: 29 03     AND #$03
C - - - - - 0x004274 01:8264: D0 2B     BNE bra_8291_RTS
C - - - - - 0x004276 01:8266: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x004279 01:8269: D0 26     BNE bra_8291_RTS
C - - - - - 0x00427B 01:826B: A9 01     LDA #$01
C - - - - - 0x00427D 01:826D: 9D 10 07  STA ram_0710_obj,X
C - - - - - 0x004280 01:8270: 4C E0 A2  JMP loc_0x0062F0



ofs_038_23_8273_03_open_door:
C - - J - - 0x004283 01:8273: 20 E4 81  JSR sub_81E6
C - - - - - 0x004286 01:8276: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x004289 01:8279: D0 16     BNE bra_8291_RTS
C - - - - - 0x00428B 01:827B: 20 16 83  JSR sub_8316_отрисовка_двери_вертолета_US_EU
C - - - - - 0x00428E 01:827E: A9 01     LDA #$01
C - - - - - 0x004290 01:8280: B0 0C     BCS bra_828E
C - - - - - 0x004292 01:8282: FE 10 07  INC ram_0710_obj,X
C - - - - - 0x004295 01:8285: BD 10 07  LDA ram_0710_obj,X
C - - - - - 0x004298 01:8288: C9 04     CMP #$04
C - - - - - 0x00429A 01:828A: B0 06     BCS bra_8292
bra_828C:
C - - - - - 0x00429C 01:828C: A9 10     LDA #$10
bra_828E:
C - - - - - 0x00429E 01:828E: 9D E6 06  STA ram_счетчкики_для_объектов,X
bra_8291_RTS:
C - - - - - 0x0042A1 01:8291: 60        RTS
bra_8292:
C - - - - - 0x0042A2 01:8292: DE 10 07  DEC ram_0710_obj,X
C - - - - - 0x0042A5 01:8295: DE 10 07  DEC ram_0710_obj,X
C - - - - - 0x0042A8 01:8298: A9 20     LDA #$20
C - - - - - 0x0042AA 01:829A: 9D F4 06  STA ram_06F4_obj,X
C - - - - - 0x0042AD 01:829D: BC 56 07  LDY ram_scroll_X_obj,X
C - - - - - 0x0042B0 01:82A0: B9 A6 82  LDA tbl_82A6,Y
C - - - - - 0x0042B3 01:82A3: 4C E0 A2  JMP loc_0x0062F0



tbl_82A6:
- D 0 - - - 0x0042B6 01:82A6: B0        .byte $B0   ; 00 
- D 0 - - - 0x0042B7 01:82A7: A0        .byte $A0   ; 01 



ofs_038_23_82A8_04:
C - - J - - 0x0042B8 01:82A8: 20 E4 81  JSR sub_81E6
C - - - - - 0x0042BB 01:82AB: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x0042BD 01:82AD: 29 03     AND #$03
C - - - - - 0x0042BF 01:82AF: D0 0A     BNE bra_82BB
C - - - - - 0x0042C1 01:82B1: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x0042C4 01:82B4: D0 05     BNE bra_82BB
C - - - - - 0x0042C6 01:82B6: A9 01     LDA #$01
C - - - - - 0x0042C8 01:82B8: 4C E0 A2  JMP loc_0x0062F0
bra_82BB:
C - - - - - 0x0042CB 01:82BB: DE F4 06  DEC ram_06F4_obj,X
C - - - - - 0x0042CE 01:82BE: D0 D1     BNE bra_8291_RTS
C - - - - - 0x0042D0 01:82C0: A0 03     LDY #$03
C - - - - - 0x0042D2 01:82C2: 20 C8 AB  JSR sub_0x006BD8
C - - - - - 0x0042D5 01:82C5: 90 18     BCC bra_82DF
C - - - - - 0x0042D7 01:82C7: A4 11     LDY ram_0011
C - - - - - 0x0042D9 01:82C9: FE 48 07  INC ram_0748_obj,X
C - - - - - 0x0042DC 01:82CC: BD 48 07  LDA ram_0748_obj,X
C - - - - - 0x0042DF 01:82CF: C9 06     CMP #$06
C - - - - - 0x0042E1 01:82D1: A9 02     LDA #$02
C - - - - - 0x0042E3 01:82D3: 90 07     BCC bra_82DC
C - - - - - 0x0042E5 01:82D5: A9 00     LDA #$00
C - - - - - 0x0042E7 01:82D7: 9D 48 07  STA ram_0748_obj,X
C - - - - - 0x0042EA 01:82DA: A9 0A     LDA #$0A
bra_82DC:
C - - - - - 0x0042EC 01:82DC: 99 1E 07  STA ram_obj_flags,Y
bra_82DF:
C - - - - - 0x0042EF 01:82DF: A9 30     LDA #$30
C - - - - - 0x0042F1 01:82E1: 9D F4 06  STA ram_06F4_obj,X
bra_82E4_RTS:
C - - - - - 0x0042F4 01:82E4: 60        RTS



ofs_038_23_82E5_05_close_door:
C - - J - - 0x0042F5 01:82E5: 20 E4 81  JSR sub_81E6
C - - - - - 0x0042F8 01:82E8: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x0042FB 01:82EB: D0 A4     BNE bra_8291_RTS
C - - - - - 0x0042FD 01:82ED: 20 16 83  JSR sub_8316_отрисовка_двери_вертолета_US_EU
C - - - - - 0x004300 01:82F0: A9 01     LDA #$01
C - - - - - 0x004302 01:82F2: B0 9A     BCS bra_828E
C - - - - - 0x004304 01:82F4: DE 10 07  DEC ram_0710_obj,X
C - - - - - 0x004307 01:82F7: 10 93     BPL bra_828C
C - - - - - 0x004309 01:82F9: 4C D7 A2  JMP loc_0x0062E7_increase_obj_state



ofs_038_23_82FC_06:
C - - J - - 0x00430C 01:82FC: 20 E4 81  JSR sub_81E6
C - - - - - 0x00430F 01:82FF: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x004312 01:8302: B9 80 07  LDA ram_0780_obj,Y
C - - - - - 0x004315 01:8305: F0 DD     BEQ bra_82E4_RTS
C - - - - - 0x004317 01:8307: A9 01     LDA #$01
C - - - - - 0x004319 01:8309: 9D 56 07  STA ram_scroll_X_obj,X
C - - - - - 0x00431C 01:830C: A9 10     LDA #$10
C - - - - - 0x00431E 01:830E: 9D E6 06  STA ram_счетчкики_для_объектов,X
C - - - - - 0x004321 01:8311: A9 02     LDA #$02
C - - - - - 0x004323 01:8313: 4C 83 A2  JMP loc_0x006293_set_obj_state




sub_8316_отрисовка_двери_вертолета_US_EU:
; 1путин опт
                                        LDA ram_0710_obj,X
                                        LDX ram_index_ppu_buffer
                                        CPX #$40
                                        BCS bra_8375_skip
C - - - - - 0x004329 01:8319: 0A        ASL
                                        LDY ram_option_регион
                                        BEQ bra_831A_US
                                        ADC #$08
bra_831A_US:
C - - - - - 0x00432A 01:831A: A8        TAY
; if buffer is not too loaded
C - - - - - 0x004331 01:8321: B9 78 83  LDA tbl_8378_helicopter_door,Y
C - - - - - 0x004334 01:8324: 85 08     STA ram_0008
C - - - - - 0x004336 01:8326: B9 79 83  LDA tbl_8378_helicopter_door + $01,Y
C - - - - - 0x004339 01:8329: 85 09     STA ram_0009
                                        LDA ram_option_регион
                                        ASL
                                        TAY
C - - - - - 0x00433B 01:832B: A9 A8     LDA tbl_8376,Y
C - - - - - 0x00433D 01:832D: 85 00     STA ram_0001
C - - - - - 0x00433F 01:832F: A9 2A     LDA tbl_8376 + $01,Y
C - - - - - 0x004341 01:8331: 85 01     STA ram_0000
C - - - - - 0x004343 01:8333: A9 06     LDA #con_buf_mode_06
C - - - - - 0x004345 01:8335: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004348 01:8338: E8        INX
C - - - - - 0x004349 01:8339: A0 00     LDY #$00
C - - - - - 0x00434B 01:833B: A9 04     LDA #$04
C - - - - - 0x00434D 01:833D: 85 0A     STA ram_000A    ; loop counter
bra_833F_loop:
C - - - - - 0x00434F 01:833F: A5 01     LDA ram_0001    ; ppu hi
C - - - - - 0x004351 01:8341: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004354 01:8344: E8        INX
C - - - - - 0x004355 01:8345: A5 00     LDA ram_0000    ; ppu lo
C - - - - - 0x004357 01:8347: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x00435A 01:834A: E8        INX
C - - - - - 0x00435B 01:834B: A9 05     LDA #$05
                                        SEC
                                        SBC ram_option_регион
C - - - - - 0x00435D 01:834D: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004360 01:8350: 85 0B     STA ram_000B    ; tiles counter
C - - - - - 0x004362 01:8352: E8        INX
bra_8353_loop:
C - - - - - 0x004363 01:8353: B1 08     LDA (ram_0008),Y
C - - - - - 0x004365 01:8355: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004368 01:8358: C8        INY
C - - - - - 0x004369 01:8359: E8        INX
C - - - - - 0x00436A 01:835A: C6 0B     DEC ram_000B    ; tiles counter
C - - - - - 0x00436C 01:835C: D0 F5     BNE bra_8353_loop
C - - - - - 0x00436E 01:835E: A5 00     LDA ram_0000    ; ppu lo
C - - - - - 0x004370 01:8360: 18        CLC
C - - - - - 0x004371 01:8361: 69 20     ADC #$20
C - - - - - 0x004373 01:8363: 85 00     STA ram_0000    ; ppu lo
C - - - - - 0x004375 01:8365: 90 02     BCC bra_8369_not_overflow
C - - - - - 0x004377 01:8367: E6 01     INC ram_0001    ; ppu hi
bra_8369_not_overflow:
C - - - - - 0x004379 01:8369: C6 0A     DEC ram_000A    ; loop counter
C - - - - - 0x00437B 01:836B: D0 D2     BNE bra_833F_loop
; close buffer
C - - - - - 0x00437D 01:836D: A9 FF     LDA #$FF
C - - - - - 0x00437F 01:836F: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004382 01:8372: E8        INX
C - - - - - 0x004383 01:8373: 86 1E     STX ram_index_ppu_buffer
bra_8375_skip:
C - - - - - 0x004385 01:8375: A6 10     LDX ram_0010
C - - - - - 0x004387 01:8377: 60        RTS


tbl_8376:
                                        .dbyt $2AA8 ; 00 US
                                        .dbyt $2AAC ; 01 EU


tbl_8378_helicopter_door:
- D 0 - - - 0x004388 01:8378: 80 83     .word off_8380_00_US
- D 0 - - - 0x00438A 01:837A: 94 83     .word off_8394_01_US
- D 0 - - - 0x00438C 01:837C: A8 83     .word off_83A8_02_US
- D 0 - - - 0x00438E 01:837E: BC 83     .word off_83BC_03_US
- - - - - - 0x004388 01:8378: 80 83     .word off_8380_00_EU
- - - - - - 0x00438A 01:837A: 90 83     .word off_8390_01_EU
- - - - - - 0x00438C 01:837C: A0 83     .word off_83A0_02_EU
- - - - - - 0x00438E 01:837E: B0 83     .word off_83B0_03_EU



off_8380_00_US:
- D 0 - I - 0x004390 01:8380: 00        .byte $00, $00, $5B, $5C, $5D   ; 
- D 0 - I - 0x004395 01:8385: 00        .byte $00, $00, $00, $68, $69   ; 
- D 0 - I - 0x00439A 01:838A: 00        .byte $00, $00, $00, $00, $7C   ; 
- D 0 - I - 0x00439F 01:838F: 00        .byte $00, $00, $00, $00, $00   ; 



off_8394_01_US:
- D 0 - I - 0x0043A4 01:8394: 93        .byte $93, $94, $95, $5C, $5D   ; 
- D 0 - I - 0x0043A9 01:8399: 00        .byte $00, $96, $97, $98, $69   ; 
- D 0 - I - 0x0043AE 01:839E: 00        .byte $00, $00, $00, $96, $7C   ; 
- D 0 - I - 0x0043B3 01:83A3: 00        .byte $00, $00, $00, $00, $00   ; 



off_83A8_02_US:
- D 0 - I - 0x0043B8 01:83A8: 00        .byte $00, $00, $99, $5C, $5D   ; 
- D 0 - I - 0x0043BD 01:83AD: 00        .byte $00, $00, $9A, $68, $69   ; 
- D 0 - I - 0x0043C2 01:83B2: 9B        .byte $9B, $9C, $9D, $9E, $9F   ; 
- D 0 - I - 0x0043C7 01:83B7: 00        .byte $00, $00, $00, $00, $00   ; 



off_83BC_03_US:
- D 0 - I - 0x0043CC 01:83BC: 00        .byte $00, $00, $5B, $5C, $5D   ; 
- D 0 - I - 0x0043D1 01:83C1: 00        .byte $00, $00, $9A, $68, $69   ; 
- D 0 - I - 0x0043D6 01:83C6: 00        .byte $00, $00, $A0, $A1, $A2   ; 
- D 0 - I - 0x0043DB 01:83CB: A3        .byte $A3, $A4, $A5, $A6, $00   ; 



off_8380_00_EU:
- - - - - - 0x004390 01:8380: 26        .byte $26, $27, $28, $3A   ; 
- - - - - - 0x004394 01:8384: 00        .byte $00, $00, $2B, $2C   ; 
- - - - - - 0x004398 01:8388: 00        .byte $00, $00, $00, $2E   ; 
- - - - - - 0x00439C 01:838C: 00        .byte $00, $00, $00, $00   ; 



off_8390_01_EU:
- - - - - - 0x0043A0 01:8390: 98        .byte $98, $99, $28, $3A   ; 
- - - - - - 0x0043A4 01:8394: 9A        .byte $9A, $9B, $9C, $2C   ; 
- - - - - - 0x0043A8 01:8398: 00        .byte $00, $00, $9A, $9D   ; 
- - - - - - 0x0043AC 01:839C: 00        .byte $00, $00, $00, $00   ; 



off_83A0_02_EU:
- - - - - - 0x0043B0 01:83A0: 26        .byte $26, $27, $28, $3A   ; 
- - - - - - 0x0043B4 01:83A4: 00        .byte $00, $A4, $2B, $2C   ; 
- - - - - - 0x0043B8 01:83A8: A7        .byte $A7, $A8, $A9, $AA   ; 
- - - - - - 0x0043BC 01:83AC: 00        .byte $00, $00, $00, $00   ; 



off_83B0_03_EU:
- - - - - - 0x0043C0 01:83B0: 26        .byte $26, $27, $28, $3A   ; 
- - - - - - 0x0043C4 01:83B4: 00        .byte $00, $A5, $A6, $2C   ; 
- - - - - - 0x0043C8 01:83B8: 00        .byte $00, $AB, $AC, $AD   ; 
- - - - - - 0x0043CC 01:83BC: AE        .byte $AE, $AF, $B0, $00   ; 



_off001_0x0043E0_62_helicopter_rotor_blade:
- D 0 - I - 0x0043E0 01:83D0: D4 83     .word ofs_038_23_83D4_01_initialize_object ; 
- D 0 - I - 0x0043E2 01:83D2: E1 83     .word ofs_038_23_83E1_02 ; лопасти в процессе вращения, периодически молния



ofs_038_23_83D4_01_initialize_object:
C - - J - - 0x0043E4 01:83D4: A9 81     LDA #$81
C - - - - - 0x0043E6 01:83D6: 9D 2C 07  STA ram_параметры_объектов,X
C - - - - - 0x0043E9 01:83D9: 20 B7 A6  JSR sub_0x0066C7_удалить_объект_03
C - - - - - 0x0043EC 01:83DC: A9 0C     LDA #$0C
C - - - - - 0x0043EE 01:83DE: 4C E0 A2  JMP loc_0x0062F0



ofs_038_23_83E1_02:
; helicopter rotor and lightning at the beginning of area 1
C - - J - - 0x0043F1 01:83E1: A9 00     LDA #$00
C - - - - - 0x0043F3 01:83E3: 20 90 84  JSR sub_8490
C - - - - - 0x0043F6 01:83E6: 20 B7 A6  JSR sub_0x0066C7_удалить_объект_03
; 1путин опт
                                        LDA ram_index_ppu_buffer
                                        CMP #$20
                                        BCS bra_841F_RTS
C - - - - - 0x0043F9 01:83E9: BD 10 07  LDA ram_0710_obj,X
C - - - - - 0x0043FC 01:83EC: 0A        ASL
C - - - - - 0x0043FD 01:83ED: A8        TAY
C - - - - - 0x0043FE 01:83EE: B9 26 84  LDA tbl_8426,Y
C - - - - - 0x004401 01:83F1: 85 08     STA ram_0008
C - - - - - 0x004403 01:83F3: B9 27 84  LDA tbl_8426 + $01,Y
C - - - - - 0x004406 01:83F6: 85 09     STA ram_0009
C - - - - - 0x004408 01:83F8: A5 1E     LDX ram_index_ppu_buffer
C - - - - - 0x00440F 01:83FF: A0 00     LDY #$00
bra_8401_loop:
C - - - - - 0x004411 01:8401: B1 08     LDA (ram_0008),Y
C - - - - - 0x004413 01:8403: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004416 01:8406: E8        INX
C - - - - - 0x004417 01:8407: C8        INY
C - - - - - 0x004418 01:8408: C9 FF     CMP #$FF
C - - - - - 0x00441A 01:840A: D0 F5     BNE bra_8401_loop
C - - - - - 0x00441C 01:840C: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x00441E 01:840E: A6 10     LDX ram_0010
C - - - - - 0x004420 01:8410: BD 10 07  LDA ram_0710_obj,X
C - - - - - 0x004423 01:8413: 18        CLC
C - - - - - 0x004424 01:8414: 69 01     ADC #$01
C - - - - - 0x004426 01:8416: C9 06     CMP #$06
C - - - - - 0x004428 01:8418: 90 02     BCC bra_841C
C - - - - - 0x00442A 01:841A: A9 00     LDA #$00
bra_841C:
C - - - - - 0x00442C 01:841C: 9D 10 07  STA ram_0710_obj,X
bra_841F_RTS:
C - - - - - 0x00442F 01:841F: 60        RTS



tbl_8426:
- D 0 - - - 0x004436 01:8426: 32 84     .word off_8432_00
- D 0 - - - 0x004438 01:8428: 47 84     .word off_8447_01
- D 0 - - - 0x00443A 01:842A: 5C 84     .word off_845C_02
- D 0 - - - 0x00443C 01:842C: 6D 84     .word off_846D_03
- D 0 - - - 0x00443E 01:842E: 5C 84     .word off_845C_04
- D 0 - - - 0x004440 01:8430: 47 84     .word off_8447_05



off_8432_00:
- D 0 - I - 0x004442 01:8432: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x004443 01:8433: 20 84     .dbyt $2084 ; ppu address
- D 0 - I - 0x004445 01:8435: 10        .byte $10   ; counter
- D 0 - I - 0x004446 01:8436: 11        .byte $11, $11, $12, $11, $12, $12, $13, $75, $14, $76, $12, $12, $11, $12, $11, $11   ; tiles

- D 0 - I - 0x004456 01:8446: FF        .byte $FF   ; end token



off_8447_01:
off_8447_05:
- D 0 - I - 0x004457 01:8447: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x004458 01:8448: 20 84     .dbyt $2084 ; ppu address
- D 0 - I - 0x00445A 01:844A: 10        .byte $10   ; counter
- D 0 - I - 0x00445B 01:844B: 00        .byte $00, $00, $11, $12, $11, $12, $13, $75, $14, $76, $12, $12, $11, $11, $00, $00   ; tiles

- D 0 - I - 0x00446B 01:845B: FF        .byte $FF   ; end token



off_845C_02:
off_845C_04:
- D 0 - I - 0x00446C 01:845C: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x00446D 01:845D: 20 86     .dbyt $2086 ; ppu address
- D 0 - I - 0x00446F 01:845F: 0C        .byte $0C   ; counter
- D 0 - I - 0x004470 01:8460: 00        .byte $00, $00, $11, $11, $12, $75, $14, $76, $12, $12, $00, $00   ; tiles

- D 0 - I - 0x00447C 01:846C: FF        .byte $FF   ; end token



off_846D_03:
- D 0 - I - 0x00447D 01:846D: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x00447E 01:846E: 20 88     .dbyt $2088 ; ppu address
- D 0 - I - 0x004480 01:8470: 08        .byte $08   ; counter
- D 0 - I - 0x004481 01:8471: 00        .byte $00, $00, $00, $77, $78, $00, $00, $00   ; tiles

- D 0 - I - 0x004489 01:8479: FF        .byte $FF   ; end token



_off001_0x00448A_6F_thunder:
- D 0 - I - 0x00448A 01:847A: 7E 84     .word ofs_038_6F_847E_01_initialize_object ; 
- D 0 - I - 0x00448C 01:847C: 8B 84     .word ofs_038_6F_848B_02 ; 



ofs_038_6F_847E_01_initialize_object:
C - - J - - 0x00448E 01:847E: A9 81     LDA #$81
C - - - - - 0x004490 01:8480: 9D 2C 07  STA ram_параметры_объектов,X
C - - - - - 0x004493 01:8483: 20 B7 A6  JSR sub_0x0066C7_удалить_объект_03
C - - - - - 0x004496 01:8486: A9 01     LDA #$01
C - - - - - 0x004498 01:8488: 4C E0 A2  JMP loc_0x0062F0



ofs_038_6F_848B_02:
C - - J - - 0x00449B 01:848B: 20 B7 A6  JSR sub_0x0066C7_удалить_объект_03
C - - - - - 0x00449E 01:848E: A9 01     LDA #$01
sub_8490:
C - - - - - 0x0044A0 01:8490: 85 08     STA ram_0008
C - - - - - 0x0044A2 01:8492: BD 48 07  LDA ram_0748_obj,X
C - - - - - 0x0044A5 01:8495: D0 07     BNE bra_849E
C - - - - - 0x0044A7 01:8497: BD 3C 05  LDA ram_позиция_x_спрайта_врага_и_пуль,X
C - - - - - 0x0044AA 01:849A: C9 20     CMP #$20
C - - - - - 0x0044AC 01:849C: 90 4D     BCC bra_84EB_RTS
bra_849E:
C - - - - - 0x0044AE 01:849E: DE E6 06  DEC ram_счетчкики_для_объектов,X
C - - - - - 0x0044B1 01:84A1: D0 48     BNE bra_84EB_RTS
C - - - - - 0x0044B3 01:84A3: BD 48 07  LDA ram_0748_obj,X
C - - - - - 0x0044B6 01:84A6: D0 09     BNE bra_84B1
C - - - - - 0x0044B8 01:84A8: A5 08     LDA ram_0008
C - - - - - 0x0044BA 01:84AA: F0 05     BEQ bra_84B1
C - - - - - 0x0044BC 01:84AC: A9 1D     LDA #con_sound_1D
C - - - - - 0x0044BE 01:84AE: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_84B1:
C - - - - - 0x0044C1 01:84B1: BC 48 07  LDY ram_0748_obj,X
C - - - - - 0x0044C4 01:84B4: F0 02     BEQ bra_84B8
C - - - - - 0x0044C6 01:84B6: A0 03     LDY #$03
bra_84B8:
C - - - - - 0x0044C8 01:84B8: B9 F0 84  LDA tbl_84F0_colors,Y
C - - - - - 0x0044CB 01:84BB: 8D E9 03  STA ram_pal_buffer + $09
C - - - - - 0x0044CE 01:84BE: B9 F1 84  LDA tbl_84F0_colors + $01,Y
C - - - - - 0x0044D1 01:84C1: 8D EA 03  STA ram_pal_buffer + $0A
C - - - - - 0x0044D4 01:84C4: B9 F2 84  LDA tbl_84F0_colors + $02,Y
C - - - - - 0x0044D7 01:84C7: 8D EB 03  STA ram_pal_buffer + $0B
C - - - - - 0x0044DA 01:84CA: BD 48 07  LDA ram_0748_obj,X
C - - - - - 0x0044DD 01:84CD: 49 01     EOR #$01
C - - - - - 0x0044DF 01:84CF: 9D 48 07  STA ram_0748_obj,X
C - - - - - 0x0044E2 01:84D2: 4A        LSR
C - - - - - 0x0044E3 01:84D3: A9 05     LDA #$05
C - - - - - 0x0044E5 01:84D5: B0 11     BCS bra_84E8
C - - - - - 0x0044E7 01:84D7: BC 56 07  LDY ram_scroll_X_obj,X
C - - - - - 0x0044EA 01:84DA: FE 56 07  INC ram_scroll_X_obj,X
C - - - - - 0x0044ED 01:84DD: BD 56 07  LDA ram_scroll_X_obj,X
C - - - - - 0x0044F0 01:84E0: 29 03     AND #$03
C - - - - - 0x0044F2 01:84E2: 9D 56 07  STA ram_scroll_X_obj,X
C - - - - - 0x0044F5 01:84E5: B9 EC 84  LDA tbl_84EC,Y
bra_84E8:
C - - - - - 0x0044F8 01:84E8: 9D E6 06  STA ram_счетчкики_для_объектов,X
bra_84EB_RTS:
C - - - - - 0x0044FB 01:84EB: 60        RTS



tbl_84EC:
- D 0 - - - 0x0044FC 01:84EC: 0E        .byte $0E   ; 00 
- D 0 - - - 0x0044FD 01:84ED: 2A        .byte $2A   ; 01 
- D 0 - - - 0x0044FE 01:84EE: 1E        .byte $1E   ; 02 
- D 0 - - - 0x0044FF 01:84EF: C0        .byte $C0   ; 03 



tbl_84F0_colors:
- D 0 - - - 0x004500 01:84F0: 24        .byte $24, $26, $20   ; 00 
- D 0 - - - 0x004503 01:84F3: 27        .byte $27, $16, $04   ; 03 







.out .sprintf("Free bytes in bank 26: %Xh [%d]", ($BFFF - *), ($BFFF - *))

.segment "BANK_26b"
    .byte con_prg_bank + $27   ; 
