.segment "BANK_2C"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000 ; for listing file
; 0x018010-0x01A00F

.export _off001_0x00AEEF_03_выбегающий_солдат_уровни_сбоку
.export _off001_0x00B312_05_солдат_кидающий_гранаты
.export _off001_0x00B3A8_06_граната
.export _off001_0x00B43C_07_стреляющий_солдат_лежа
.export _off001_0x00B4BE_09_стреляющий_солдат_стоя_уровни_сбоку
.export _off001_0x00B965_0F_автоспавнер_гранат
.export _off001_0x004EDF_1A_пуля_гаубицы
.export _off001_0x004C14_17_скрытый_снайпер
.export _off001_0x01529D_31_автоспавнер_солдат_с_крыльями
.export _off001_0x01510E_30_солдат_с_крыльями
.export _off001_0x00B9D4_10_автоспавнер_выбегающих_солдат
.export _off001_0x014332_47_стреляющий_солдат_стоя_уровни_сверху
.export _off001_0x0143D2_4E_выбегающий_солдат_уровни_сверху
.export _off001_0x014011_1F_солдат_на_танке
.export _off001_0x0101C2_25_летающий_стреляющий_солдат
.export _off001_0x010276_43_дверь_спавнер_выбегающих_солдат

.export _off001_0x00B872_0D_бетонная_дверь_или_ворота
.export _off001_0x014C67_1D_падающая_платформа
.export _off001_0x014DBA_1E_блок_падающей_платформы
.export _off001_0x014E4B_29_лифт
.export _off001_0x0043E0_4D_лопасти_начального_вертолета_игроков
.export _off001_0x00448A_59_гроза
.export _off001_0x004F73_2F_землятресение
.export _off001_0x0082C5_39_падающий_потолок
.export _off001_0x0113DA_5B_смена_банков_chr

; bzk this byte must be placed at 8000
    .byte con_prg_bank + $2C   ; 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00AEEF_03_выбегающий_солдат_уровни_сбоку:
- D 1 - I - 0x006EFF 01:AEEF: FF AE     .word ofs_038_03_AEFF_01_активировать_объект ; 
- D 1 - I - 0x006F01 01:AEF1: BE AF     .word ofs_038_03_AFBE_02 ; в процессе бега, может перепрыгивать препятствия и падать вниз если под ногами пусто
- D 1 - I - 0x006F03 01:AEF3: E4 B0     .word ofs_038_03_B0E4_03 ; красный моб останавливается и стреляет
- D 1 - I - 0x006F05 01:AEF5: 2E B1     .word ofs_038_03_B12E_04 ; 
- D 1 - I - 0x006F07 01:AEF7: 76 B1     .word ofs_038_03_B176_05 ; подскакивает после попадания по нему
- D 1 - I - 0x006F09 01:AEF9: 9A A2     .word ofs_038_03_0x00A29A_06_обработка_состояния_смерти_объекта ; готовится взорваться
- D 1 - I - 0x006F0B 01:AEFB: FD A2     .word ofs_038_03_0x00630D_07_обработка_анимации_взрыва_объекта ; анимация взрыва
- D 1 - I - 0x006F0D 01:AEFD: 3D A3     .word ofs_038_03_0x00628A_08_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_03_AEFF_01_активировать_объект:
C - - J - - 0x006F0F 01:AEFF: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x006F12 01:AF02: F0 06     BEQ bra_AF0A
- - - - - - 0x006F14 01:AF04: DE E6 06  DEC ram_счетчики_для_объектов,X
- - - - - - 0x006F17 01:AF07: 4C B4 A6  JMP loc_0x0066D4_прибавить_позицию_спрайта_к_скорости_камеры_Y
bra_AF0A:
C - - - - - 0x006F1A 01:AF0A: A0 12     LDY #$12    ; баг? должно быть lda
C - - - - - 0x006F1C 01:AF0C: 20 00 A8  JSR sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает
C - - - - - 0x006F1F 01:AF0F: F0 03     BEQ bra_AF14
C - - - - - 0x006F21 01:AF11: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
bra_AF14:
C - - - - - 0x006F24 01:AF14: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x006F27 01:AF17: 30 08     BMI bra_AF21
C - - - - - 0x006F29 01:AF19: 4A        LSR
C - - - - - 0x006F2A 01:AF1A: 90 05     BCC bra_AF21
C - - - - - 0x006F2C 01:AF1C: A9 10     LDA #$10
C - - - - - 0x006F2E 01:AF1E: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
bra_AF21:
C - - - - - 0x006F31 01:AF21: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x006F34 01:AF24: 29 7F     AND #$7F
C - - - - - 0x006F36 01:AF26: A4 50     LDY ram_номер_уровня
C - - - - - 0x006F38 01:AF28: C0 07     CPY #con_level_8
C - - - - - 0x006F3A 01:AF2A: D0 02     BNE bra_AF2E
; 8й лвл
C - - - - - 0x006F3C 01:AF2C: 09 80     ORA #$80
bra_AF2E:
C - - - - - 0x006F3E 01:AF2E: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x006F41 01:AF31: 0A        ASL
C - - - - - 0x006F42 01:AF32: A9 00     LDA #$00
C - - - - - 0x006F44 01:AF34: 90 02     BCC bra_AF38
C - - - - - 0x006F46 01:AF36: A9 04     LDA #$04
bra_AF38:
C - - - - - 0x006F48 01:AF38: 9D 64 07  STA ram_0764_obj,X
                                        BIT ram_регион
                                        BVC bra_AF3B_US
; EU
                                        CPY #con_level_7
                                        BNE bra_AF3B_US
; 7й лвл
                                        LDA #$19
                                        STA ram_0764_obj,X
                                        LDA ram_флаги_объектов,X
                                        ORA #$40
                                        STA ram_флаги_объектов,X
bra_AF3B_US:
C - - - - - 0x006F4B 01:AF3B: A9 08     LDA #con_объект_хитбокс_02
C - - - - - 0x006F4D 01:AF3D: 9D 3A 07  STA ram_хитбоксы_объектов,X
C - - - - - 0x006F50 01:AF40: 20 6C AF  JSR sub_AF6C_определить_и_установить_скорость_X
C - - - - - 0x006F53 01:AF43: 20 99 AF  JSR sub_AF99_установить_скорость_Y_0100
C - - - - - 0x006F56 01:AF46: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x006F59 01:AF49: 4A        LSR
C - - - - - 0x006F5A 01:AF4A: 4A        LSR
C - - - - - 0x006F5B 01:AF4B: 4A        LSR
C - - - - - 0x006F5C 01:AF4C: 29 03     AND #$03
C - - - - - 0x006F5E 01:AF4E: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x006F61 01:AF51: 20 E8 B1  JSR sub_B1E8    ; установить аттрибуты спрайту
C - - - - - 0x006F64 01:AF54: A9 03     LDA #$03
C - - - - - 0x006F66 01:AF56: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x006F69 01:AF59: A9 10     LDA #$10
C - - - - - 0x006F6B 01:AF5B: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x006F6E 01:AF5E: 20 B7 A6  ;JSR sub_A6B7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x006F71 01:AF61: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_AF99_установить_скорость_Y_0100:
C - - - - - 0x006FA9 01:AF99: A9 00     LDA #< $0100
C - - - - - 0x006FAB 01:AF9B: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x006FAE 01:AF9E: A9 01     LDA #> $0100
C - - - - - 0x006FB0 01:AFA0: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x006FB3 01:AFA3: 60        RTS

; ******************************************************************************************************************

ofs_038_03_AFBE_02:
C - - J - - 0x006FCE 01:AFBE: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x006FD1 01:AFC1: 10 7C     BMI bra_AFC0_падение
                                        JMP loc_B03F
bra_AFC0_падение:
C - - - - - 0x006FD5 01:AFC5: BC 1E 07  LDA ram_флаги_объектов,X
                                        ASL
                                        LDY #$20    ; обычный солдат
                                        BCC bra_AFC8
                                        LDY #$36    ; чужой с 8го лвл
bra_AFC8:
                                        ASL
                                        BCC bra_AFCC
                                        LDY #$C1    ; чужой с 7го лвл
bra_AFCC:
                                        TYA
C - - - - - 0x006FDC 01:AFCC: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x006FDF 01:AFCF: A9 14     LDA #$14
C - - - - - 0x006FE1 01:AFD1: 85 0F     STA ram_000F
C - - - - - 0x006FE3 01:AFD3: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x006FE6 01:AFD6: 18        CLC
C - - - - - 0x006FE7 01:AFD7: 69 06     ADC #$06
C - - - - - 0x006FE9 01:AFD9: A8        TAY
C - - - - - 0x006FEA 01:AFDA: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x006FED 01:AFDD: 4A        LSR
C - - - - - 0x006FEE 01:AFDE: A9 07     LDA #$07
C - - - - - 0x006FF0 01:AFE0: B0 02     BCS bra_AFE4
C - - - - - 0x006FF2 01:AFE2: A9 F8     LDA #$F8
bra_AFE4:
C - - - - - 0x006FF4 01:AFE4: 85 08     STA ram_0008
C - - - - - 0x006FF6 01:AFE6: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006FF9 01:AFE9: 85 09     STA ram_0009
C - - - - - 0x006FFB 01:AFEB: 6A        ROR
C - - - - - 0x006FFC 01:AFEC: 45 08     EOR ram_0008
C - - - - - 0x006FFE 01:AFEE: 30 0D     BMI bra_AFFD
C - - - - - 0x007000 01:AFF0: A5 09     LDA ram_0009
C - - - - - 0x007002 01:AFF2: 20 7F BB  JSR sub_0x007B8F
C - - - - - 0x007005 01:AFF5: 90 06     BCC bra_AFFD
C - - - - - 0x007007 01:AFF7: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
                                        BEQ bra_B000    ; jmp
bra_AFFD:
C - - - - - 0x00700D 01:AFFD: 20 64 AF  JSR sub_AF64_определить_и_установить_скорость_X_если_скорости_небыло
bra_B000:
C D 1 - - - 0x007010 01:B000: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
C - - - - - 0x007013 01:B003: A9 12     LDA #$12
C - - - - - 0x007015 01:B005: 20 00 A8  JSR sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает
C - - - - - 0x007018 01:B008: F0 30     BEQ bra_B03A
C - - - - - 0x00701A 01:B00A: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
C - - - - - 0x00701D 01:B00D: 20 99 AF  JSR sub_AF99_установить_скорость_Y_0100
C - - - - - 0x007020 01:B010: A9 00     LDA #$00
C - - - - - 0x007022 01:B012: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x007025 01:B015: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x007028 01:B018: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00702B 01:B01B: 29 02     AND #$02
C - - - - - 0x00702D 01:B01D: F0 18     BEQ bra_B037
C - - - - - 0x00702F 01:B01F: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x007032 01:B022: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x007035 01:B025: D9 4C 05  CMP ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x007038 01:B028: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00703B 01:B02B: 29 FC     AND #$FC
C - - - - - 0x00703D 01:B02D: B0 02     BCS bra_B031
C - - - - - 0x00703F 01:B02F: 09 01     ORA #$01
bra_B031:
C - - - - - 0x007041 01:B031: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x007044 01:B034: 20 E8 B1  JSR sub_B1E8    ; установить аттрибуты спрайту
bra_B037:
C - - - - - 0x007047 01:B037: 20 6C AF  JSR sub_AF6C_определить_и_установить_скорость_X
bra_B03A:
C - - - - - 0x00704A 01:B03A: A9 1C     LDA #$1C
C - - - - - 0x00704C 01:B03C: 4C CB AA  JMP loc_0x00AACB_прибавить_скорость_Y
loc_B03F:
C - - - - - 0x00704F 01:B03F: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x007052 01:B042: F0 05     BEQ bra_B049
; 01 - красный стреляющий
C - - - - - 0x007054 01:B044: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x007057 01:B047: F0 73     BEQ bra_B0BC_выстрел
bra_B049:
C - - - - - 0x007059 01:B049: 20 9D B1  JSR sub_B19D
C - - - - - 0x00705C 01:B04C: B0 4C     BCS bra_B09A
C - - - - - 0x00705E 01:B04E: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
C - - - - - 0x007061 01:B051: BD 68 06  LDA ram_состояние_объектов_для_обработчика,X
C - - - - - 0x007064 01:B054: F0 18     BEQ bra_B06E_RTS
C - - - - - 0x007066 01:B056: A9 12     LDA #$12
C - - - - - 0x007068 01:B058: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x00706B 01:B05B: F0 12     BEQ bra_B06F
C - - - - - 0x00706D 01:B05D: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
C - - - - - 0x007070 01:B060: A5 09     LDA ram_0009
C - - - - - 0x007072 01:B062: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x007075 01:B065: C9 04     CMP #$04
C - - - - - 0x007077 01:B067: D0 02     BNE bra_B06B
C - - - - - 0x007079 01:B069: A0 01     LDY #$01
bra_B06B:
C - - - - - 0x00707B 01:B06B: 4C FD AB  JMP loc_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
bra_B06E_RTS:
C - - - - - 0x00707E 01:B06E: 60        RTS
bra_B06F:
C - - - - - 0x00707F 01:B06F: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x007082 01:B072: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007085 01:B075: 38        SEC
C - - - - - 0x007086 01:B076: F9 32 05  SBC ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x007089 01:B079: A0 0C     LDY #$0C
C - - - - - 0x00708B 01:B07B: B0 06     BCS bra_B083
C - - - - - 0x00708D 01:B07D: A0 08     LDY #$08
C - - - - - 0x00708F 01:B07F: 49 FF     EOR #$FF
C - - - - - 0x007091 01:B081: 69 01     ADC #$01
bra_B083:
C - - - - - 0x007093 01:B083: C9 10     CMP #$10
C - - - - - 0x007095 01:B085: B0 02     BCS bra_B089
C - - - - - 0x007097 01:B087: A0 00     LDY #$00
bra_B089:
C - - - - - 0x007099 01:B089: 84 08     STY ram_0008
C - - - - - 0x00709B 01:B08B: A5 23     LDA ram_рандом_байт
C - - - - - 0x00709D 01:B08D: 29 07     AND #$07
C - - - - - 0x00709F 01:B08F: 18        CLC
C - - - - - 0x0070A0 01:B090: 65 08     ADC ram_0008
C - - - - - 0x0070A2 01:B092: A8        TAY
C - - - - - 0x0070A3 01:B093: B9 C6 B0  LDA tbl_B0C6_индексы_скорости_Y,Y
C - - - - - 0x0070A6 01:B096: A8        TAY
C - - - - - 0x0070A7 01:B097: 4C 9F B0  BPL bra_B09F    ; jmp
bra_B09A:
C - - - - - 0x0070AA 01:B09A: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
C - - - - - 0x0070AD 01:B09D: A0 00     LDY #$00
bra_B09F:
C D 1 - - - 0x0070AF 01:B09F: B9 DE B0  LDA tbl_B0DE_скорость_Y,Y
C - - - - - 0x0070B2 01:B0A2: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0070B5 01:B0A5: B9 DF B0  LDA tbl_B0DE_скорость_Y + $01,Y
C - - - - - 0x0070B8 01:B0A8: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0070BB 01:B0AB: A9 80     LDA #$80
C - - - - - 0x0070BD 01:B0AD: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0070C0 01:B0B0: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0070C3 01:B0B3: 29 DF     AND #$DF
C - - - - - 0x0070C5 01:B0B5: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0070C8 01:B0B8: 4C 6C AF  JMP loc_AF6C_определить_и_установить_скорость_X
C - - - - - 0x0070CB 01:B0BB: 60        RTS
bra_B0BC_выстрел:
C - - - - - 0x0070CC 01:B0BC: A9 04     LDA #$04
C - - - - - 0x0070CE 01:B0BE: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0070D1 01:B0C1: A9 0E     LDA #$0E    ; счетчик
                                        STA ram_счетчики_для_объектов,X
C - - - - - 0x0070D3 01:B0C3: 4C E0 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_B0C6_индексы_скорости_Y:
; ??? по 4 или по 8
- D 1 - - - 0x0070D6 01:B0C6: 02        .byte $02   ; 
- D 1 - - - 0x0070D7 01:B0C7: 04        .byte $04   ; 
- D 1 - - - 0x0070D8 01:B0C8: 02        .byte $02   ; 
- D 1 - - - 0x0070D9 01:B0C9: 02        .byte $02   ; 
- D 1 - - - 0x0070DA 01:B0CA: 04        .byte $04   ; 
- D 1 - - - 0x0070DB 01:B0CB: 04        .byte $04   ; 
- D 1 - - - 0x0070DC 01:B0CC: 02        .byte $02   ; 
- D 1 - - - 0x0070DD 01:B0CD: 04        .byte $04   ; 
- D 1 - - - 0x0070DE 01:B0CE: 04        .byte $04   ; 
- D 1 - - - 0x0070DF 01:B0CF: 04        .byte $04   ; 
- D 1 - - - 0x0070E0 01:B0D0: 04        .byte $04   ; 
- D 1 - - - 0x0070E1 01:B0D1: 04        .byte $04   ; 
- D 1 - - - 0x0070E2 01:B0D2: 04        .byte $04   ; 
- D 1 - - - 0x0070E3 01:B0D3: 04        .byte $04   ; 
- D 1 - - - 0x0070E4 01:B0D4: 04        .byte $04   ; 
- D 1 - - - 0x0070E5 01:B0D5: 04        .byte $04   ; 
- D 1 - - - 0x0070E6 01:B0D6: 02        .byte $02   ; 
- D 1 - - - 0x0070E7 01:B0D7: 02        .byte $02   ; 
- D 1 - - - 0x0070E8 01:B0D8: 02        .byte $02   ; 
- D 1 - - - 0x0070E9 01:B0D9: 02        .byte $02   ; 
- - - - - - 0x0070EA 01:B0DA: 02        .byte $02   ; 
- - - - - - 0x0070EB 01:B0DB: 02        .byte $02   ; 
- - - - - - 0x0070EC 01:B0DC: 02        .byte $02   ; 
- - - - - - 0x0070ED 01:B0DD: 02        .byte $02   ; 

tbl_B0DE_скорость_Y:
- D 1 - - - 0x0070EE 01:B0DE: C0 FC     .word $FCC0 ; 00 
- D 1 - - - 0x0070F0 01:B0E0: 00 FE     .word $FE00 ; 02 
- D 1 - - - 0x0070F2 01:B0E2: 40 FF     .word $FF40 ; 04 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_B19D:
C - - - - - 0x0071AD 01:B19D: A9 10     LDA #$10
C - - - - - 0x0071AF 01:B19F: BC CA 06  LDY ram_скорость_объектов_X_старш,X
C - - - - - 0x0071B2 01:B1A2: 10 02     BPL bra_B1A6
C - - - - - 0x0071B4 01:B1A4: A9 F0     LDA #$F0
bra_B1A6:
C - - - - - 0x0071B6 01:B1A6: 20 22 A8  JSR sub_0x006832
C - - - - - 0x0071B9 01:B1A9: D0 05     BNE bra_B1B0
C - - - - - 0x0071BB 01:B1AB: 20 6C AF  JSR sub_AF6C_определить_и_установить_скорость_X
C - - - - - 0x0071BE 01:B1AE: 18        CLC
C - - - - - 0x0071BF 01:B1AF: 60        RTS
bra_B1B0:
C - - - - - 0x0071C0 01:B1B0: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
C - - - - - 0x0071C3 01:B1B3: A5 04     LDA ram_0004
C - - - - - 0x0071C5 01:B1B5: 38        SEC
C - - - - - 0x0071C6 01:B1B6: E9 10     SBC #$10
C - - - - - 0x0071C8 01:B1B8: 85 08     STA ram_0008
C - - - - - 0x0071CA 01:B1BA: 45 04     EOR ram_0004
C - - - - - 0x0071CC 01:B1BC: 0A        ASL
C - - - - - 0x0071CD 01:B1BD: A5 08     LDA ram_0008
C - - - - - 0x0071CF 01:B1BF: 90 02     BCC bra_B1C3
C - - - - - 0x0071D1 01:B1C1: 49 80     EOR #$80
bra_B1C3:
C - - - - - 0x0071D3 01:B1C3: A8        TAY
C - - - - - 0x0071D4 01:B1C4: 20 1B BB  JSR sub_0x007B2B
C - - - - - 0x0071D7 01:B1C7: 20 D0 BB  JSR sub_0x00BBD0
C - - - - - 0x0071DA 01:B1CA: F0 1A     BEQ bra_B1E6
C - - - - - 0x0071DC 01:B1CC: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0071DF 01:B1CF: 49 01     EOR #$01
C - - - - - 0x0071E1 01:B1D1: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x0071E4 01:B1D4: 20 E8 B1  JSR sub_B1E8
C - - - - - 0x0071E7 01:B1D7: 20 6C AF  JSR sub_AF6C_определить_и_установить_скорость_X
C - - - - - 0x0071EA 01:B1DA: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x0071ED 01:B1DD: D0 05     BNE bra_B1E4
C - - - - - 0x0071EF 01:B1DF: A9 06     LDA #$06
C - - - - - 0x0071F1 01:B1E1: 20 83 A2  JSR loc_0x006293_установить_состояние_объекта
bra_B1E4:
C - - - - - 0x0071F4 01:B1E4: 18        CLC
C - - - - - 0x0071F5 01:B1E5: 60        RTS
bra_B1E6:
C - - - - - 0x0071F6 01:B1E6: 38        SEC
C - - - - - 0x0071F7 01:B1E7: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_B1E8:
C - - - - - 0x0071F8 01:B1E8: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0071FB 01:B1EB: 4A        LSR
sub_B1EC:
C - - - - - 0x0071FC 01:B1EC: 08        PHP
C - - - - - 0x0071FD 01:B1ED: A5 50     LDA ram_номер_уровня
C - - - - - 0x0071FF 01:B1EF: BC 72 07  LDY ram_0772_obj,X
C - - - - - 0x007202 01:B1F2: F0 03     BEQ bra_B1F7
C - - - - - 0x007204 01:B1F4: 18        CLC
C - - - - - 0x007205 01:B1F5: 69 08     ADC #$08
bra_B1F7:
C - - - - - 0x007207 01:B1F7: A8        TAY
C - - - - - 0x007208 01:B1F8: B9 17 B2  LDA tbl_B217_аттрибуты_палитры,Y
C - - - - - 0x00720B 01:B1FB: 28        PLP
sub_B1FC:
C - - - - - 0x00720C 01:B1FC: B0 02     BCS bra_B200
C - - - - - 0x00720E 01:B1FE: 09 40     ORA #$40
bra_B200:
sub_B200:
C - - - - - 0x007210 01:B200: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x007213 01:B203: F0 05     BEQ bra_B20A
C - - - - - 0x007215 01:B205: DE 80 07  DEC ram_0780_obj,X
C - - - - - 0x007218 01:B208: 09 04     ORA #$04
bra_B20A:
C - - - - - 0x00721A 01:B20A: 85 00     STA ram_0000
C - - - - - 0x00721C 01:B20C: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x00721F 01:B20F: 29 20     AND #$20
C - - - - - 0x007221 01:B211: 05 00     ORA ram_0000
C - - - - - 0x007223 01:B213: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x007226 01:B216: 60        RTS

tbl_B217_аттрибуты_палитры:
; 00 
- D 1 - - - 0x007227 01:B217: 03        .byte $03   ; 00 area 1
- - - - - - 0x007228 01:B218: 03        .byte $03   ; 01 area 2
- D 1 - - - 0x007229 01:B219: 03        .byte $03   ; 02 area 3
- D 1 - - - 0x00722A 01:B21A: 03        .byte $03   ; 03 area 4
- D 1 - - - 0x00722B 01:B21B: 03        .byte $03   ; 04 area 5
- - - - - - 0x00722C 01:B21C: 03        .byte $03   ; 05 area 6
- D 1 - - - 0x00722D 01:B21D: 01        .byte $01   ; 06 area 7
- D 1 - - - 0x00722E 01:B21E: 03        .byte $03   ; 07 area 8
; 01 
- D 1 - - - 0x00722F 01:B21F: 01        .byte $01   ; 00 area 1
- - - - - - 0x007230 01:B220: 01        .byte $01   ; 01 area 2
- D 1 - - - 0x007231 01:B221: 01        .byte $01   ; 02 area 3
- D 1 - - - 0x007232 01:B222: 01        .byte $01   ; 03 area 4
- - - - - - 0x007233 01:B223: 01        .byte $01   ; 04 area 5
- - - - - - 0x007234 01:B224: 01        .byte $01   ; 05 area 6
- - - - - - 0x007235 01:B225: 01        .byte $01   ; 06 area 7
- - - - - - 0x007236 01:B226: 01        .byte $01   ; 07 area 8

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_AF64_определить_и_установить_скорость_X_если_скорости_небыло:
C - - - - - 0x006F74 01:AF64: BD BC 06  LDA ram_скорость_объектов_x_младш,X
C - - - - - 0x006F77 01:AF67: 1D CA 06  ORA ram_скорость_объектов_X_старш,X
C - - - - - 0x006F7A 01:AF6A: D0 2C     BNE bra_AF98_RTS
sub_AF6C_определить_и_установить_скорость_X:
loc_AF6C_определить_и_установить_скорость_X:
C D 1 - - - 0x006F7C 01:AF6C: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x006F7F 01:AF6F: 4A        LSR
C - - - - - 0x006F80 01:AF70: A9 00     LDA #$00
C - - - - - 0x006F82 01:AF72: A4 61     LDY ram_0061_конфиг_уровня
C - - - - - 0x006F84 01:AF74: F0 02     BEQ bra_AF78
C - - - - - 0x006F86 01:AF76: A9 04     LDA #$04
bra_AF78:
C - - - - - 0x006F88 01:AF78: BC 1E 07  LDY ram_флаги_объектов,X
C - - - - - 0x006F8B 01:AF7B: 10 02     BPL bra_AF7F
C - - - - - 0x006F8D 01:AF7D: A9 08     LDA #$08
bra_AF7F:
C - - - - - 0x006F8F 01:AF7F: 90 02     BCC bra_AF83
C - - - - - 0x006F91 01:AF81: 69 01     ADC #$01
bra_AF83:
C - - - - - 0x006F93 01:AF83: BC 48 07  LDY ram_скролл_объекта_Y,X
C - - - - - 0x006F96 01:AF86: 10 03     BPL bra_AF8B
C - - - - - 0x006F98 01:AF88: 18        CLC
C - - - - - 0x006F99 01:AF89: 69 0C     ADC #$0C
bra_AF8B:
C - - - - - 0x006F9B 01:AF8B: A8        TAY
C - - - - - 0x006F9C 01:AF8C: B9 A4 AF  LDA tbl_AFA4_скорость_X,Y
C - - - - - 0x006F9F 01:AF8F: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x006FA2 01:AF92: B9 A5 AF  LDA tbl_AFA4_скорость_X + $01,Y
C - - - - - 0x006FA5 01:AF95: 9D CA 06  STA ram_скорость_объектов_X_старш,X
bra_AF98_RTS:
C - - - - - 0x006FA8 01:AF98: 60        RTS

tbl_AFA4_скорость_X:
- D 1 - - - 0x006FB4 01:AFA4: 00 FF     .word $FF00 ; 00 
- D 1 - - - 0x006FB6 01:AFA6: 40 01     .word $0140 ; 01 
- D 1 - - - 0x006FB8 01:AFA8: 00 FF     .word $FF00 ; 02 
- D 1 - - - 0x006FBA 01:AFAA: 00 01     .word $0100 ; 03 
- D 1 - - - 0x006FBC 01:AFAC: C0 FE     .word $FEC0 ; 04 
- D 1 - - - 0x006FBE 01:AFAE: 80 01     .word $0180 ; 05 
- D 1 - - - 0x006FC0 01:AFB0: 20 FF     .word $FF20 ; 06 
- D 1 - - - 0x006FC2 01:AFB2: E0 00     .word $00E0 ; 07 
- D 1 - - - 0x006FC4 01:AFB4: 20 FF     .word $FF20 ; 08 
- D 1 - - - 0x006FC6 01:AFB6: E0 00     .word $00E0 ; 09 
- D 1 - - - 0x006FC8 01:AFB8: C0 FE     .word $FEC0 ; 0A 
- D 1 - - - 0x006FCA 01:AFBA: 80 01     .word $0180 ; 0B 
- - - - - - 0x006FCC 01:AFBC: 0C 18     .word $180C ; 0C

; ******************************************************************************************************************

ofs_038_03_B0E4_03:
C - - J - - 0x0070F4 01:B0E4: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x0070F7 01:B0E7: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x0070FA 01:B0EA: DD 3C 05  CMP ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0070FD 01:B0ED: 20 EC B1  JSR sub_B1EC    ; установить аттрибуты спрайту
C - - - - - 0x007100 01:B0F0: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x007103 01:B0F3: 4A        LSR
C - - - - - 0x007104 01:B0F4: A9 21     LDA #$21
C - - - - - 0x007106 01:B0F6: B0 07     BCS bra_B0FF
- - - - - - 0x007108 01:B0F8: A9 10     LDA #con_объект_хитбокс_04
- - - - - - 0x00710A 01:B0FA: 9D 3A 07  STA ram_хитбоксы_объектов,X
- - - - - - 0x00710D 01:B0FD: A9 22     LDA #$22
bra_B0FF:
C - - - - - 0x00710F 01:B0FF: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x007112 01:B102: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007115 01:B105: BD F4 06  LDA ram_счетчкик_жизни_объектов,X
C - - - - - 0x007118 01:B108: F0 0D     BEQ bra_B117
C - - - - - 0x00711A 01:B10A: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x00711D 01:B10D: D0 AC     BNE bra_AF98_RTS
C - - - - - 0x00711F 01:B10F: A9 06     LDA #$06
C - - - - - 0x007121 01:B111: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x007124 01:B114: 4C 27 B2  JMP loc_B227_попытка_создать_пулю
bra_B117:
C - - - - - 0x007127 01:B117: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00712A 01:B11A: D0 9F     BNE bra_AF98_RTS
C - - - - - 0x00712C 01:B11C: A9 08     LDA #con_объект_хитбокс_02
C - - - - - 0x00712E 01:B11E: 9D 3A 07  STA ram_хитбоксы_объектов,X
C - - - - - 0x007131 01:B121: 20 E8 B1  JSR sub_B1E8    ; установить аттрибуты спрайту
C - - - - - 0x007134 01:B124: A9 50     LDA #$50
C - - - - - 0x007136 01:B126: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x007139 01:B129: A9 02     LDA #$02
C - - - - - 0x00713B 01:B12B: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

loc_B227_попытка_создать_пулю:
C D 1 - - - 0x007237 01:B227: A0 02     LDY #con_obj_id_02
C - - - - - 0x007239 01:B229: 20 C8 AB  JSR sub_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x00723C 01:B22C: 90 37     BCC bra_B265_RTS
C - - - - - 0x00723E 01:B22E: BC 72 07  LDY ram_0772_obj,X
C - - - - - 0x007241 01:B231: B9 6B B2  LDA tbl_B26B_добавочная_позиция_спрайту,Y
C - - - - - 0x007244 01:B234: 18        CLC
C - - - - - 0x007245 01:B235: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007248 01:B238: 85 08     STA ram_0008
C - - - - - 0x00724A 01:B23A: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x00724D 01:B23D: 2A        ROL
C - - - - - 0x00724E 01:B23E: 2A        ROL
C - - - - - 0x00724F 01:B23F: 2A        ROL
C - - - - - 0x007250 01:B240: 29 01     AND #$01
C - - - - - 0x007252 01:B242: A8        TAY
C - - - - - 0x007253 01:B243: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x007256 01:B246: A6 11     LDX ram_0011    ; индекс новой пули
C - - - - - 0x007258 01:B248: 18        CLC
C - - - - - 0x007259 01:B249: 79 6A B2  ADC tbl_B26A_добавочная_позиция_спрайту,Y
C - - - - - 0x00725C 01:B24C: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00725F 01:B24F: A5 08     LDA ram_0008
C - - - - - 0x007261 01:B251: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007264 01:B254: 98        TYA
C - - - - - 0x007265 01:B255: 0A        ASL
C - - - - - 0x007266 01:B256: A8        TAY
C - - - - - 0x007267 01:B257: B9 66 B2  LDA tbl_B266_скорость_X,Y
C - - - - - 0x00726A 01:B25A: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x00726D 01:B25D: B9 67 B2  LDA tbl_B266_скорость_X + $01,Y
C - - - - - 0x007270 01:B260: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x007273 01:B263: A6 10     LDX ram_0010
bra_B265_RTS:
C - - - - - 0x007275 01:B265: 60        RTS

tbl_B266_скорость_X:
- D 1 - - - 0x007276 01:B266: 00 02     .word $0200 ; 00 
- D 1 - - - 0x007278 01:B268: 00 FE     .word $FE00 ; 01 

tbl_B26A_добавочная_позиция_спрайту:
- D 1 - - - 0x00727A 01:B26A: 08        .byte $08   ; 

tbl_B26B_добавочная_позиция_спрайту:
- D 1 - - - 0x00727B 01:B26B: F8        .byte $F8   ; 
- D 1 - - - 0x00727C 01:B26C: FC        .byte $FC   ; 
- - - - - - 0x00727D 01:B26D: 06        .byte $06   ;

; ******************************************************************************************************************

ofs_038_03_B12E_04:
ofs_038_07_B12E_03:
C - - J - - 0x00713E 01:B12E: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x007141 01:B131: 10 05     BPL bra_B138
C - - - - - 0x007143 01:B133: A9 15     LDA #con_sound_15
C - - - - - 0x007145 01:B135: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_B138:
C - - - - - 0x007148 01:B138: 20 93 B1  JSR sub_B193
loc_B13B:
C D 1 - - - 0x00714B 01:B13B: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x00714E 01:B13E: A9 83     LDA #$83
C - - - - - 0x007150 01:B140: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x007153 01:B143: A9 80     LDA #< $FC80
C - - - - - 0x007155 01:B145: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x007158 01:B148: A9 FC     LDA #> $FC80
C - - - - - 0x00715A 01:B14A: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x00715D 01:B14D: A9 60     LDA #< $0060
C - - - - - 0x00715F 01:B14F: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x007162 01:B152: A9 00     LDA #> $0060
C - - - - - 0x007164 01:B154: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x007167 01:B157: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00716A 01:B15A: C9 10     CMP #$10
C - - - - - 0x00716C 01:B15C: 90 04     BCC bra_B162
C - - - - - 0x00716E 01:B15E: C9 F0     CMP #$F0
C - - - - - 0x007170 01:B160: 90 03     BCC bra_B165
bra_B162:
C - - - - - 0x007172 01:B162: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
bra_B165:
C - - - - - 0x007175 01:B165: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x007178 01:B168: 0A        ASL
C - - - - - 0x007179 01:B169: 30 03     BMI bra_B16E
C - - - - - 0x00717B 01:B16B: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
bra_B16E:
C - - - - - 0x00717E 01:B16E: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007181 01:B171: A9 10     LDA #$10
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_B193:
                                        LDA ram_флаги_объектов,X
                                        ASL
                                        LDY #$1C
                                        BCC bra_B198
                                        LDY #$32
bra_B198:
                                        ASL
                                        BCC bra_B19B
                                        LDY #$BD
bra_B19B:
                                        TYA
bra_B19C_RTS:
C - - - - - 0x0071AC 01:B19C: 60        RTS

; ******************************************************************************************************************

ofs_038_03_B176_05:
ofs_038_07_B176_04:
C - - J - - 0x007186 01:B176: 20 93 B1  JSR sub_B193
loc_B179:
C D 1 - - - 0x007189 01:B179: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x00718C 01:B17C: A9 30     LDA #$30
C - - - - - 0x00718E 01:B17E: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_Y
C - - - - - 0x007191 01:B181: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007194 01:B184: C9 08     CMP #$08
C - - - - - 0x007196 01:B186: 90 08     BCC bra_B190
C - - - - - 0x007198 01:B188: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x00719B 01:B18B: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00719E 01:B18E: D0 0C     BEQ bra_B190
                                        RTS
bra_B190:
C - - - - - 0x0071A0 01:B190: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B312_05_солдат_кидающий_гранаты:
- D 1 - I - 0x007322 01:B312: 20 B3     .word ofs_038_05_B320_01_активация_объекта ; 
- D 1 - I - 0x007324 01:B314: 38 B3     .word ofs_038_05_B338_02 ; 
- D 1 - I - 0x007326 01:B316: 9E B3     .word ofs_038_05_B39E_03 ; 
- D 1 - I - 0x007328 01:B318: A3 B3     .word ofs_038_05_B3A3_04 ; 
- D 1 - I - 0x00732A 01:B31A: 9A A2     .word ofs_038_05_0x00A29A_05_обработка_состояния_смерти_объекта ; 
- D 1 - I - 0x00732C 01:B31C: FD A2     .word ofs_038_05_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x00732E 01:B31E: 3D A3     .word ofs_038_05_0x00628A_07_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_05_B320_01_активация_объекта:
C - - J - - 0x007330 01:B320: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x007333 01:B323: 4A        LSR
C - - - - - 0x007334 01:B324: 4A        LSR
C - - - - - 0x007335 01:B325: 29 03     AND #$03
C - - - - - 0x007337 01:B327: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x00733A 01:B32A: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x00733D 01:B32D: A9 01     LDA #$01
C - - - - - 0x00733F 01:B32F: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x007342 01:B332: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007345 01:B335: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_05_B338_02:
C - - J - - 0x007348 01:B338: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x00734B 01:B33B: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00734E 01:B33E: D9 4C 05  CMP ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x007351 01:B341: A9 01     LDA #$01
C - - - - - 0x007353 01:B343: 20 FC B1  JSR sub_B1FC    ; установить аттрибуты спрайту
C - - - - - 0x007356 01:B346: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x007359 01:B349: 4A        LSR
C - - - - - 0x00735A 01:B34A: A9 27     LDA #$27
C - - - - - 0x00735C 01:B34C: 90 02     BCC bra_B350
C - - - - - 0x00735E 01:B34E: A9 27     LDA #$27
bra_B350:
C - - - - - 0x007360 01:B350: BC E6 06  LDY ram_счетчики_для_объектов,X
C - - - - - 0x007363 01:B353: F0 06     BEQ bra_B35B
C - - - - - 0x007365 01:B355: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x007368 01:B358: 18        CLC
C - - - - - 0x007369 01:B359: 69 01     ADC #$01
bra_B35B:
C - - - - - 0x00736B 01:B35B: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x00736E 01:B35E: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007371 01:B361: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x007374 01:B364: D0 37     BNE bra_B39D_RTS
C - - - - - 0x007376 01:B366: A0 06     LDY #con_obj_id_06
C - - - - - 0x007378 01:B368: 20 C8 AB  JSR sub_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x00737B 01:B36B: 90 1E     BCC bra_B38B
C - - - - - 0x00737D 01:B36D: A9 0C     LDA #$0C
C - - - - - 0x00737F 01:B36F: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x007382 01:B372: A4 11     LDY ram_0011
C - - - - - 0x007384 01:B374: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x007387 01:B377: 0A        ASL
C - - - - - 0x007388 01:B378: 29 80     AND #$80
C - - - - - 0x00738A 01:B37A: 49 80     EOR #$80
C - - - - - 0x00738C 01:B37C: 19 1E 07  ORA ram_флаги_объектов,Y
C - - - - - 0x00738F 01:B37F: 99 1E 07  STA ram_флаги_объектов,Y
C - - - - - 0x007392 01:B382: B9 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x007395 01:B385: 18        CLC
C - - - - - 0x007396 01:B386: 69 EB     ADC #$EB
C - - - - - 0x007398 01:B388: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
bra_B38B:
C - - - - - 0x00739B 01:B38B: A9 18     LDA #$18
C - - - - - 0x00739D 01:B38D: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x0073A0 01:B390: 10 08     BPL bra_B39A
C - - - - - 0x0073A2 01:B392: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0073A5 01:B395: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0073A8 01:B398: A9 51     LDA #$51
bra_B39A:
C - - - - - 0x0073AA 01:B39A: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_B39D_RTS:
C - - - - - 0x0073AD 01:B39D: 60        RTS

; ******************************************************************************************************************

ofs_038_05_B39E_03:
C - - J - - 0x0073AE 01:B39E: A9 27     LDA #$27    ; кадр анимации
C - - - - - 0x0073B0 01:B3A0: 4C 3B B1  JMP loc_B13B

; ******************************************************************************************************************

ofs_038_05_B3A3_04:
C - - J - - 0x0073B3 01:B3A3: A9 27     LDA #$27    ; кадр анимации
C - - - - - 0x0073B5 01:B3A5: 4C 79 B1  JMP loc_B179

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B3A8_06_граната:
- D 1 - I - 0x0073B8 01:B3A8: B2 B3     .word ofs_038_06_B3B2_01_активация_объекта ; 
- D 1 - I - 0x0073BA 01:B3AA: FF B3     .word ofs_038_06_B3FF_02 ; 
- D 1 - I - 0x0073BC 01:B3AC: 8C A2     .word ofs_038_06_A28C_03 ; 
- D 1 - I - 0x0073BE 01:B3AE: FD A2     .word ofs_038_06_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x0073C0 01:B3B0: 3D A3     .word ofs_038_06_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_06_B3B2_01_активация_объекта:
C - - J - - 0x0073C2 01:B3B2: A0 98     LDY #$98
C - - - - - 0x0073C4 01:B3B4: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0073C7 01:B3B7: 29 03     AND #$03
C - - - - - 0x0073C9 01:B3B9: F0 02     BEQ bra_B3BD
C - - - - - 0x0073CB 01:B3BB: A0 99     LDY #$99
bra_B3BD:
C - - - - - 0x0073CD 01:B3BD: 98        TYA
C - - - - - 0x0073CE 01:B3BE: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0073D1 01:B3C1: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0073D4 01:B3C4: 29 03     AND #$03
C - - - - - 0x0073D6 01:B3C6: 0A        ASL
C - - - - - 0x0073D7 01:B3C7: 0A        ASL
C - - - - - 0x0073D8 01:B3C8: A8        TAY
C - - - - - 0x0073D9 01:B3C9: B9 EF B3  LDA tbl_B3EF_скорость,Y
C - - - - - 0x0073DC 01:B3CC: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0073DF 01:B3CF: B9 F0 B3  LDA tbl_B3EF_скорость + $01,Y
C - - - - - 0x0073E2 01:B3D2: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0073E5 01:B3D5: B9 F1 B3  LDA tbl_B3EF_скорость + $02,Y
C - - - - - 0x0073E8 01:B3D8: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0073EB 01:B3DB: B9 F2 B3  LDA tbl_B3EF_скорость + $03,Y
C - - - - - 0x0073EE 01:B3DE: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x0073F1 01:B3E1: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0073F4 01:B3E4: 30 03     BMI bra_B3E9
C - - - - - 0x0073F6 01:B3E6: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
bra_B3E9:
C - - - - - 0x0073F9 01:B3E9: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
bra_B3EC:
C - - - - - 0x0073FC 01:B3EC: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_B3EF_скорость:
; 00 
- - - - - - 0x0073FF 01:B3EF: 00 FC     .word $FC00 ; Y
- - - - - - 0x007401 01:B3F1: 00 FF     .word $FF00 ; X
; 01 
- D 1 - - - 0x007403 01:B3F3: 00 FF     .word $FF00 ; Y
- D 1 - - - 0x007405 01:B3F5: C0 FE     .word $FEC0 ; X
; 02 
- D 1 - - - 0x007407 01:B3F7: 00 FD     .word $FD00 ; Y
- D 1 - - - 0x007409 01:B3F9: C0 FF     .word $FFC0 ; X
; 03 
- - - - - - 0x00740B 01:B3FB: 00 FF     .word $FF00 ; Y
- - - - - - 0x00740D 01:B3FD: C0 FF     .word $FFC0 ; X

; ******************************************************************************************************************

ofs_038_06_B3FF_02:
C - - J - - 0x00740F 01:B3FF: A0 03     LDY #$03
C - - - - - 0x007411 01:B401: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x007414 01:B404: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
C - - - - - 0x007417 01:B407: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x00741A 01:B40A: 18        CLC
C - - - - - 0x00741B 01:B40B: 69 14     ADC #< $0014
C - - - - - 0x00741D 01:B40D: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x007420 01:B410: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x007423 01:B413: 69 00     ADC #> $0014
C - - - - - 0x007425 01:B415: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x007428 01:B418: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00742B 01:B41B: 29 03     AND #$03
C - - - - - 0x00742D 01:B41D: A8        TAY
C - - - - - 0x00742E 01:B41E: B9 38 B4  LDA tbl_B438_аттрибуты_спрайта,Y
C - - - - - 0x007431 01:B421: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x007434 01:B424: 30 07     BMI bra_B42D
C - - - - - 0x007436 01:B426: A9 98     LDA #$98
C - - - - - 0x007438 01:B428: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00743B 01:B42B: A9 01     LDA #$01
bra_B42D:
C - - - - - 0x00743D 01:B42D: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x007440 01:B430: A9 00     LDA #$00
C - - - - - 0x007442 01:B432: 20 00 A8  JSR sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает
C - - - - - 0x007445 01:B435: D0 B5     BNE bra_B3EC
C - - - - - 0x007447 01:B437: 60        RTS

tbl_B438_аттрибуты_спрайта:
- - - - - - 0x007448 01:B438: 01        .byte $01   ; 00 
- D 1 - - - 0x007449 01:B439: 01        .byte $01   ; 01 
- D 1 - - - 0x00744A 01:B43A: 21        .byte $21   ; 02 
- - - - - - 0x00744B 01:B43B: 01        .byte $01   ; 03

; ******************************************************************************************************************

ofs_038_1A_629C_03:
ofs_038_06_A28C_03:
C - - J - - 0x00629C 01:A28C: 20 9A A2  JSR sub_0x0062AA_обработка_состояния_смерти_объекта
C - - - - - 0x00629F 01:A28F: A9 0C     LDA #con_объект_хитбокс_03
C - - - - - 0x0062A1 01:A291: 9D 3A 07  STA ram_хитбоксы_объектов,X
C - - - - - 0x0062A4 01:A294: A9 82     LDA #$82
C - - - - - 0x0062A6 01:A296: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0062A9 01:A299: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x004EDF_1A_пуля_гаубицы:
- D 0 - I - 0x004EDF 01:8ECF: D9 8E     .word ofs_038_1A_8ED9_01_активация_объекта ; 
- D 0 - I - 0x004EE1 01:8ED1: 2C 8F     .word ofs_038_1A_8F2C_02 ; 
- D 0 - I - 0x004EE3 01:8ED3: 8C A2     .word ofs_038_1A_629C_03 ; 
- D 0 - I - 0x004EE5 01:8ED5: FD A2     .word ofs_038_1A_0x00630D_04_обработка_анимации_взрыва_объекта ;  
- D 0 - I - 0x004EE7 01:8ED7: 3D A3     .word ofs_038_1A_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_1A_8ED9_01_активация_объекта:
C - - J - - 0x004EE9 01:8ED9: A9 02     LDA #$02
C - - - - - 0x004EEB 01:8EDB: 9D 76 06  STA ram_жизни_объектов_8bit,X
C - - - - - 0x004EEE 01:8EDE: A9 18     LDA #$18
C - - - - - 0x004EF0 01:8EE0: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004EF3 01:8EE3: A9 01     LDA #$01
C - - - - - 0x004EF5 01:8EE5: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x004EF8 01:8EE8: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x004EFB 01:8EEB: 0A        ASL
C - - - - - 0x004EFC 01:8EEC: 0A        ASL
C - - - - - 0x004EFD 01:8EED: A8        TAY
C - - - - - 0x004EFE 01:8EEE: B9 0C 8F  LDA tbl_8F0C_скорость,Y
C - - - - - 0x004F01 01:8EF1: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x004F04 01:8EF4: B9 0D 8F  LDA tbl_8F0C_скорость + $01,Y
C - - - - - 0x004F07 01:8EF7: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x004F0A 01:8EFA: B9 0E 8F  LDA tbl_8F0C_скорость + $02,Y
C - - - - - 0x004F0D 01:8EFD: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x004F10 01:8F00: B9 0F 8F  LDA tbl_8F0C_скорость + $03,Y
C - - - - - 0x004F13 01:8F03: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x004F16 01:8F06: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004F19 01:8F09: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_8F0C_скорость:
; 00 
- D 0 - - - 0x004F1C 01:8F0C: 00 FD     .word $FD00 ; Y
- D 0 - - - 0x004F1E 01:8F0E: 90 FF     .word $FF90 ; X
; 01 
- D 0 - - - 0x004F20 01:8F10: 20 FD     .word $FD20 ; Y
- D 0 - - - 0x004F22 01:8F12: A0 FF     .word $FFA0 ; X
; 02 
- D 0 - - - 0x004F24 01:8F14: E0 FC     .word $FCE0 ; Y
- D 0 - - - 0x004F26 01:8F16: C0 FF     .word $FFC0 ; X
; 03 
- D 0 - - - 0x004F28 01:8F18: 20 FD     .word $FD20 ; Y
- D 0 - - - 0x004F2A 01:8F1A: D0 FF     .word $FFD0 ; X
; 04 
- D 0 - - - 0x004F2C 01:8F1C: C0 FC     .word $FCC0 ; Y
- D 0 - - - 0x004F2E 01:8F1E: E0 FF     .word $FFE0 ; X
; 05 
- D 0 - - - 0x004F30 01:8F20: 80 FD     .word $FD80 ; Y
- D 0 - - - 0x004F32 01:8F22: 80 FF     .word $FF80 ; X
; 06 
- D 0 - - - 0x004F34 01:8F24: A0 FC     .word $FCA0 ; Y
- D 0 - - - 0x004F36 01:8F26: 60 FF     .word $FF60 ; X
; 07 
- D 0 - - - 0x004F38 01:8F28: 40 FC     .word $FC40 ; Y
- D 0 - - - 0x004F3A 01:8F2A: 50 FF     .word $FF50 ; X
- - - - - - 0x00744B 01:B43B: 01        .byte $01   ; 03

; ******************************************************************************************************************

ofs_038_1A_8F2C_02:
C - - J - - 0x004F3C 01:8F2C: A9 3A     LDA #$3A
C - - - - - 0x004F3E 01:8F2E: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x004F41 01:8F31: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x004F44 01:8F34: 18        CLC
C - - - - - 0x004F45 01:8F35: 69 08     ADC #< $0008
C - - - - - 0x004F47 01:8F37: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x004F4A 01:8F3A: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x004F4D 01:8F3D: 85 08     STA ram_0008
C - - - - - 0x004F4F 01:8F3F: 69 00     ADC #> $0008
C - - - - - 0x004F51 01:8F41: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x004F54 01:8F44: A8        TAY
C - - - - - 0x004F55 01:8F45: 45 08     EOR ram_0008
C - - - - - 0x004F57 01:8F47: 10 08     BPL bra_8F51
C - - - - - 0x004F59 01:8F49: 98        TYA
C - - - - - 0x004F5A 01:8F4A: 30 05     BMI bra_8F51
C - - - - - 0x004F5C 01:8F4C: A9 17     LDA #con_sound_17
C - - - - - 0x004F5E 01:8F4E: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_8F51:
C - - - - - 0x004F61 01:8F51: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
C - - - - - 0x004F64 01:8F54: A9 00     LDA #$00
C - - - - - 0x004F66 01:8F56: 20 00 A8  JSR sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает
C - - - - - 0x004F69 01:8F59: A8        TAY
C - - - - - 0x004F6A 01:8F5A: B9 CC F8  LDA tbl_0x01F8DC,Y
C - - - - - 0x004F6D 01:8F5D: F0 03     BEQ bra_8F62_RTS
C - - - - - 0x004F6F 01:8F5F: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8F62_RTS:
C - - - - - 0x004F72 01:8F62: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B43C_07_стреляющий_солдат_лежа:
- D 1 - I - 0x00744C 01:B43C: 4A B4     .word ofs_038_07_B44A_01_активация_объекта ; 
- D 1 - I - 0x00744E 01:B43E: 6B B4     .word ofs_038_07_B46B_02 ; 
- D 1 - I - 0x007450 01:B440: 2E B1     .word ofs_038_07_B12E_03 ; 
- D 1 - I - 0x007452 01:B442: 76 B1     .word ofs_038_07_B176_04 ; 
- D 1 - I - 0x007454 01:B444: 9A A2     .word ofs_038_07_0x00A29A_05_обработка_состояния_смерти_объекта ; 
- D 1 - I - 0x007456 01:B446: FD A2     .word ofs_038_07_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x007458 01:B448: 3D A3     .word ofs_038_07_0x00628A_07_удалить_объект ; 

ofs_038_07_B44A_01_активация_объекта:
C - - J - - 0x00745A 01:B44A: A9 05     LDA #$05
C - - - - - 0x00745C 01:B44C: A0 06     LDY #$06
C - - - - - 0x00745E 01:B44E: 20 9B AB  JSR sub_0x006BAB_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x007461 01:B451: A9 01     LDA #$01
C - - - - - 0x007463 01:B453: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x007466 01:B456: A9 26     LDA #$26
C - - - - - 0x007468 01:B458: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x00746B 01:B45B: A9 01     LDA #$01
C - - - - - 0x00746D 01:B45D: 20 FC B1  JSR sub_B1FC    ; установить аттрибуты спрайту
C - - - - - 0x007470 01:B460: A9 67     LDA #$67
C - - - - - 0x007472 01:B462: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x007475 01:B465: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007478 01:B468: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_07_B46B_02:
C - - J - - 0x00747B 01:B46B: A9 41     LDA #$41
C - - - - - 0x00747D 01:B46D: 20 00 B2  JSR sub_B200    ; установить аттрибуты спрайту
C - - - - - 0x007480 01:B470: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007483 01:B473: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x007486 01:B476: D0 20     BNE bra_B498_RTS
C - - - - - 0x007488 01:B478: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00748B 01:B47B: C9 40     CMP #$40
C - - - - - 0x00748D 01:B47D: 90 19     BCC bra_B498_RTS
C - - - - - 0x00748F 01:B47F: A9 06     LDA #$06
C - - - - - 0x007491 01:B481: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x007494 01:B484: 20 99 B4  JSR sub_B499_попытка_создать_пулю
C - - - - - 0x007497 01:B487: A9 0A     LDA #$0A
C - - - - - 0x007499 01:B489: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x00749C 01:B48C: 10 07     BPL bra_B495
C - - - - - 0x00749E 01:B48E: A9 01     LDA #$01
C - - - - - 0x0074A0 01:B490: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0074A3 01:B493: A9 80     LDA #$80
bra_B495:
C - - - - - 0x0074A5 01:B495: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_B498_RTS:
C - - - - - 0x0074A8 01:B498: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_B499_попытка_создать_пулю:
C - - - - - 0x0074A9 01:B499: A0 02     LDY #con_obj_id_02  ; обычная пуля
C - - - - - 0x0074AB 01:B49B: 20 C8 AB  JSR sub_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0074AE 01:B49E: 90 1D     BCC bra_B4BD_RTS
C - - - - - 0x0074B0 01:B4A0: A4 11     LDY ram_0011
C - - - - - 0x0074B2 01:B4A2: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0074B5 01:B4A5: 69 03     ADC #$03
C - - - - - 0x0074B7 01:B4A7: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x0074BA 01:B4AA: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0074BD 01:B4AD: 38        SEC
C - - - - - 0x0074BE 01:B4AE: E9 10     SBC #$10
C - - - - - 0x0074C0 01:B4B0: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x0074C3 01:B4B3: A9 40     LDA #< $FE40
C - - - - - 0x0074C5 01:B4B5: 99 BC 06  STA ram_скорость_объектов_x_младш,Y
C - - - - - 0x0074C8 01:B4B8: A9 FE     LDA #> $FE40
C - - - - - 0x0074CA 01:B4BA: 99 CA 06  STA ram_скорость_объектов_X_старш,Y
bra_B4BD_RTS:
C - - - - - 0x0074CD 01:B4BD: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B4BE_09_стреляющий_солдат_стоя_уровни_сбоку:
- D 1 - I - 0x0074CE 01:B4BE: CC B4     .word ofs_038_09_B4CC_01_активация_объекта ; 
- D 1 - I - 0x0074D0 01:B4C0: E2 B4     .word ofs_038_09_B4E2_02 ; в процессе стрельбы на месте, стреляет периодически
- D 1 - I - 0x0074D2 01:B4C2: 43 B5     .word ofs_038_09_B543_03 ; 
- D 1 - I - 0x0074D4 01:B4C4: 48 B5     .word ofs_038_09_B548_04 ; 
- D 1 - I - 0x0074D6 01:B4C6: 9A A2     .word ofs_038_09_0x00A29A_05_обработка_состояния_смерти_объекта ; 
- D 1 - I - 0x0074D8 01:B4C8: FD A2     .word ofs_038_09_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x0074DA 01:B4CA: 3D A3     .word ofs_038_09_0x00628A_07_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_09_B4CC_01_активация_объекта:
C - - J - - 0x0074DC 01:B4CC: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0074DF 01:B4CF: 29 03     AND #$03
C - - - - - 0x0074E1 01:B4D1: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0074E4 01:B4D4: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0074EA 01:B4DA: A9 01     LDA #$01
C - - - - - 0x0074EC 01:B4DC: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_09_B4E2_02:
C - - J - - 0x0074F2 01:B4E2: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x0074F5 01:B4E5: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x0074F8 01:B4E8: DD 3C 05  CMP ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0074FB 01:B4EB: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0074FE 01:B4EE: 29 20     AND #$20
C - - - - - 0x007500 01:B4F0: 09 01     ORA #$01
C - - - - - 0x007502 01:B4F2: 20 FC B1  JSR sub_B1FC    ; установить аттрибуты спрайту
C - - - - - 0x007505 01:B4F5: A4 0A     LDY ram_000A    ; индекс игрока
C - - - - - 0x007507 01:B4F7: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00750A 01:B4FA: 38        SEC
C - - - - - 0x00750B 01:B4FB: F9 32 05  SBC ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x00750E 01:B4FE: 08        PHP
C - - - - - 0x00750F 01:B4FF: B0 04     BCS bra_B505
C - - - - - 0x007511 01:B501: 49 FF     EOR #$FF
C - - - - - 0x007513 01:B503: 69 01     ADC #$01
bra_B505:
C - - - - - 0x007515 01:B505: C9 10     CMP #$10
C - - - - - 0x007517 01:B507: A9 01     LDA #$01
C - - - - - 0x007519 01:B509: 90 08     BCC bra_B513
C - - - - - 0x00751B 01:B50B: 28        PLP
C - - - - - 0x00751C 01:B50C: A9 00     LDA #$00
C - - - - - 0x00751E 01:B50E: B0 02     BCS bra_B512
C - - - - - 0x007520 01:B510: A9 02     LDA #$02
bra_B512:
C - - - - - 0x007522 01:B512: 08        PHP
bra_B513:
C - - - - - 0x007523 01:B513: 28        PLP
C - - - - - 0x007524 01:B514: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x007527 01:B517: 18        CLC
C - - - - - 0x007528 01:B518: 69 23     ADC #$23
C - - - - - 0x00752A 01:B51A: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x00752D 01:B51D: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007530 01:B520: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x007533 01:B523: D0 1D     BNE bra_B542_RTS
                                        LDY #con_obj_id_02  ; обычная пуля объекта
                                        JSR sub_0x006BF8_поиск_пустого_слота_и_попытка_создать_пулю_на_позиции_текущего_объекта
C - - - - - 0x00755D 01:B54D: D0 2A     BCC bra_B530_выстрел_не_получился
C - - - - - 0x00753D 01:B52D: 20 4D B5  JSR sub_B54D_установка_данных_для_выстрела
bra_B530_выстрел_не_получился:
C - - - - - 0x007540 01:B530: A9 0C     LDA #$0C
C - - - - - 0x007542 01:B532: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x007545 01:B535: D0 08     BNE bra_B53F
C - - - - - 0x007547 01:B537: BD 64 07  LDA ram_0764_obj,X  ; кол-во пуль в очереди
C - - - - - 0x00754A 01:B53A: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x00754D 01:B53D: A9 60     LDA #$60
bra_B53F:
C - - - - - 0x00754F 01:B53F: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_B542_RTS:
C - - - - - 0x007552 01:B542: 60        RTS

sub_B54D_установка_данных_для_выстрела:
C - - - - - 0x007535 01:B525: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта_объекта
C - - - - - 0x00755F 01:B54F: A9 06     LDA #$06
C - - - - - 0x007561 01:B551: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x007564 01:B554: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x007567 01:B557: 0A        ASL
C - - - - - 0x007568 01:B558: 0A        ASL
C - - - - - 0x007569 01:B559: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00756C 01:B55C: 90 02     BCC bra_B560
C - - - - - 0x00756E 01:B55E: 69 02     ADC #$02
bra_B560:
C - - - - - 0x007570 01:B560: A8        TAY
C - - - - - 0x007571 01:B561: A6 11     LDX ram_0011    ; индекс нового объекта
C - - - - - 0x007573 01:B563: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007576 01:B566: 18        CLC
C - - - - - 0x007577 01:B567: 79 7A B5  ADC tbl_B57A_позиция_Y,Y
C - - - - - 0x00757A 01:B56A: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00757D 01:B56D: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x007580 01:B570: 18        CLC
C - - - - - 0x007581 01:B571: 79 80 B5  ADC tbl_B580_позиция_X,Y
C - - - - - 0x007584 01:B574: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
                                        JSR sub_0x01F360_определить_множитель_скорости_пули_от_сложности_игры
                                        JSR sub_0x01F360_расчет_угла_от_объекта_до_игрока
                                        JSR sub_0x01F370_установить_скорость_пули_объекта
C - - - - - 0x007587 01:B577: A6 10     LDX ram_0010    ; загрузить индекс объекта
bra_B579_RTS:
C - - - - - 0x007589 01:B579: 60        RTS

tbl_B57A_позиция_Y:
- D 1 - - - 0x00758A 01:B57A: F0        .byte $F0   ; 
- D 1 - - - 0x00758B 01:B57B: FB        .byte $FB   ; 
- D 1 - - - 0x00758C 01:B57C: 00        .byte $00   ; 
- D 1 - - - 0x00758D 01:B57D: F0        .byte $F0   ; 
- D 1 - - - 0x00758E 01:B57E: FB        .byte $FB   ; 
- D 1 - - - 0x00758F 01:B57F: 00        .byte $00   ; 

tbl_B580_позиция_X:
- D 1 - - - 0x007590 01:B580: 06        .byte $06   ; 
- D 1 - - - 0x007591 01:B581: 07        .byte $07   ; 
- D 1 - - - 0x007592 01:B582: 05        .byte $05   ; 
- D 1 - - - 0x007593 01:B583: FA        .byte $FA   ; 
- D 1 - - - 0x007594 01:B584: F9        .byte $F9   ; 
- D 1 - - - 0x007595 01:B585: FB        .byte $FB   ; 

; ******************************************************************************************************************

ofs_038_09_B543_03:
C - - J - - 0x007553 01:B543: A9 23     LDA #$23    ; кадр анимации
C - - - - - 0x007555 01:B545: 4C 3B B1  JMP loc_B13B

; ******************************************************************************************************************

ofs_038_09_B548_04:
C - - J - - 0x007558 01:B548: A9 23     LDA #$23    ; кадр анимации
C - - - - - 0x00755A 01:B54A: 4C 79 B1  JMP loc_B179

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B965_0F_автоспавнер_гранат:
- D 1 - I - 0x007975 01:B965: 6B B9     .word ofs_038_0F_B96B_01_активация_объекта ; 
- D 1 - I - 0x007977 01:B967: 8B B9     .word ofs_038_0F_B98B_02 ; 
- D 1 - I - 0x007979 01:B969: 9A B9     .word ofs_038_0F_B99A_03 ; 

; ******************************************************************************************************************

ofs_038_0F_B96B_01_активация_объекта:
C - - J - - 0x00797B 01:B96B: A9 01     LDA #$01
C - - - - - 0x00797D 01:B96D: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x007980 01:B970: A9 81     LDA #$81
C - - - - - 0x007982 01:B972: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x007985 01:B975: A9 F0     LDA #con_HP_F0
C - - - - - 0x007987 01:B977: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x00798A 01:B97A: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00798D 01:B97D: 29 03     AND #$03
C - - - - - 0x00798F 01:B97F: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x007992 01:B982: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x007995 01:B985: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007998 01:B988: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0F_B98B_02:
C - - J - - 0x00799B 01:B98B: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00799E 01:B98E: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0079A1 01:B991: C9 E0     CMP #$E0
C - - - - - 0x0079A3 01:B993: B0 3E     BCS bra_B9D3_RTS
C - - - - - 0x0079A5 01:B995: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0F_B99A_03:
C - - J - - 0x0079AA 01:B99A: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0079AD 01:B99D: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0079B0 01:B9A0: C9 20     CMP #$20
C - - - - - 0x0079B2 01:B9A2: B0 03     BCS bra_B9A7
C - - - - - 0x0079B4 01:B9A4: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_B9A7:
C - - - - - 0x0079B7 01:B9A7: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0079BA 01:B9AA: D0 27     BNE bra_B9D3_RTS
C - - - - - 0x0079BC 01:B9AC: A0 06     LDY #con_obj_id_06  ; граната
C - - - - - 0x0079BE 01:B9AE: 20 C8 AB  JSR sub_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0079C1 01:B9B1: 90 0E     BCC bra_B9C1
C - - - - - 0x0079C3 01:B9B3: A4 11     LDY ram_0011
C - - - - - 0x0079C5 01:B9B5: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0079C8 01:B9B8: 0A        ASL
C - - - - - 0x0079C9 01:B9B9: 0A        ASL
C - - - - - 0x0079CA 01:B9BA: 29 80     AND #$80
C - - - - - 0x0079CC 01:B9BC: 09 02     ORA #$02
C - - - - - 0x0079CE 01:B9BE: 99 1E 07  STA ram_флаги_объектов,Y
bra_B9C1:
C - - - - - 0x0079D1 01:B9C1: A9 18     LDA #$18
C - - - - - 0x0079D3 01:B9C3: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x0079D6 01:B9C6: 10 08     BPL bra_B9D0
C - - - - - 0x0079D8 01:B9C8: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0079DB 01:B9CB: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0079DE 01:B9CE: A9 63     LDA #$63
bra_B9D0:
C - - - - - 0x0079E0 01:B9D0: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_B9D3_RTS:
C - - - - - 0x0079E3 01:B9D3: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x004C14_17_скрытый_снайпер:
- D 0 - I - 0x004C14 01:8C04: 16 8C     .word ofs_038_17_8C16_01_активация_объекта ; 
- D 0 - I - 0x004C16 01:8C06: 2C 8C     .word ofs_038_17_8C2C_02 ; 
- D 0 - I - 0x004C18 01:8C08: 43 8C     .word ofs_038_17_8C43_03 ; 
- D 0 - I - 0x004C1A 01:8C0A: 79 8C     .word ofs_038_17_8C79_04 ; 
- D 0 - I - 0x004C1C 01:8C0C: A1 8C     .word ofs_038_17_8CA1_05 ; 
- D 0 - I - 0x004C1E 01:8C0E: AE 8C     .word ofs_038_17_8CAE_06 ; 
- D 0 - I - 0x004C20 01:8C10: 9A A2     .word ofs_038_17_0x0062AA_07_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x004C22 01:8C12: FD A2     .word ofs_038_17_0x00630D_08_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x004C24 01:8C14: 3D A3     .word ofs_038_17_0x00628A_09_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_17_8C16_01_активация_объекта:
C - - J - - 0x004C26 01:8C16: A9 81     LDA #$81
C - - - - - 0x004C28 01:8C18: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004C2B 01:8C1B: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x004C2E 01:8C1E: 18        CLC
C - - - - - 0x004C2F 01:8C1F: 69 05     ADC #$05
C - - - - - 0x004C31 01:8C21: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x004C34 01:8C24: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004C37 01:8C27: A9 20     LDA #$20    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_17_8C2C_02:
C - - J - - 0x004C3C 01:8C2C: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x004C3F 01:8C2F: D0 0F     BNE bra_8C40
C - - - - - 0x004C41 01:8C31: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004C44 01:8C34: 20 B3 8C  JSR sub_8CB3
C - - - - - 0x004C47 01:8C37: C0 02     CPY #$02
C - - - - - 0x004C49 01:8C39: 90 05     BCC bra_8C40
C - - - - - 0x004C4B 01:8C3B: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8C40:
C - - - - - 0x004C50 01:8C40: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8CB3:
C - - - - - 0x004CC3 01:8CB3: A9 08     LDA #$08
C - - - - - 0x004CC5 01:8CB5: 9D E6 06  STA ram_счетчики_для_объектов,X
sub_8CB8:
C - - - - - 0x004CC8 01:8CB8: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004CCB 01:8CBB: B9 D7 8C  LDA tbl_8CD7_кадры_анимации,Y
C - - - - - 0x004CCE 01:8CBE: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x004CD1 01:8CC1: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x004CD4 01:8CC4: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004CD7 01:8CC7: D9 4C 05  CMP ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x004CDA 01:8CCA: A9 01     LDA #$01
C - - - - - 0x004CDC 01:8CCC: B0 02     BCS bra_8CD0
C - - - - - 0x004CDE 01:8CCE: A9 41     LDA #$41
bra_8CD0:
C - - - - - 0x004CE0 01:8CD0: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x004CE3 01:8CD3: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
bra_8CD6_RTS:
C - - - - - 0x004CE6 01:8CD6: 60        RTS

tbl_8CD7_кадры_анимации:
- D 0 - - - 0x004CE7 01:8CD7: 59        .byte $59   ; 00 
- D 0 - - - 0x004CE8 01:8CD8: 5A        .byte $5A   ; 01 
- D 0 - - - 0x004CE9 01:8CD9: 5B        .byte $5B   ; 02 

; ******************************************************************************************************************

ofs_038_17_8C43_03:
C - - J - - 0x004C53 01:8C43: 20 B8 8C  JSR sub_8CB8
C - - - - - 0x004C56 01:8C46: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004C59 01:8C49: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x004C5C 01:8C4C: D0 2A     BNE bra_8CD6_RTS
C - - - - - 0x004C5E 01:8C4E: A9 00     LDA #$00
C - - - - - 0x004C60 01:8C50: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004C63 01:8C53: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x004C66 01:8C56: 38        SEC
C - - - - - 0x004C67 01:8C57: E9 05     SBC #$05
C - - - - - 0x004C69 01:8C59: 85 08     STA ram_0008
C - - - - - 0x004C6B 01:8C5B: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x004C6E 01:8C5E: 0A        ASL
C - - - - - 0x004C6F 01:8C5F: 0A        ASL
C - - - - - 0x004C70 01:8C60: A9 0B     LDA #$0B
C - - - - - 0x004C72 01:8C62: B0 02     BCS bra_8C66
C - - - - - 0x004C74 01:8C64: A9 F4     LDA #$F4
bra_8C66:
C - - - - - 0x004C76 01:8C66: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004C79 01:8C69: 85 09     STA ram_0009
C - - - - - 0x004C7B 01:8C6B: A0 03     LDY #$03
C - - - - - 0x004C7D 01:8C6D: 20 27 F3  JSR sub_0x01F337
C - - - - - 0x004C80 01:8C70: A9 30     LDA #$30
- - - - - - 0x004C85 01:8C75: 9D E6 06  STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_17_8C79_04:
C - - J - - 0x004C89 01:8C79: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x004C8C 01:8C7C: D0 C2     BNE bra_8C9F
C - - - - - 0x004C8E 01:8C7E: A9 81     LDA #$81
C - - - - - 0x004C90 01:8C80: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004C93 01:8C83: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004C96 01:8C86: 20 B3 8C  JSR sub_8CB3
C - - - - - 0x004C99 01:8C89: C0 00     CPY #$00
C - - - - - 0x004C9B 01:8C8B: D0 B3     BNE bra_8C9F
C - - - - - 0x004C9D 01:8C8D: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004CA0 01:8C90: C9 30     CMP #$30
C - - - - - 0x004CA2 01:8C92: 90 0A     BCC bra_8C9E
C - - - - - 0x004CA4 01:8C94: A9 60     LDA #$60
C - - - - - 0x004CA6 01:8C96: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x004CA9 01:8C99: A9 02     LDA #$02
C - - - - - 0x004CAB 01:8C9B: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта
bra_8C9E:
C - - - - - 0x004CAE 01:8C9E: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_8C9F:
                                        JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; ******************************************************************************************************************

ofs_038_17_8CA1_05:
C - - J - - 0x004CB1 01:8CA1: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x004CB4 01:8CA4: 49 40     EOR #$40
C - - - - - 0x004CB6 01:8CA6: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x004CB9 01:8CA9: A9 23     LDA #$23    ; кадр анимации
C - - - - - 0x004CBB 01:8CAB: 4C 3B B1  JMP loc_B13B

; ******************************************************************************************************************

ofs_038_17_8CAE_06:
C - - J - - 0x004CBE 01:8CAE: A9 23     LDA #$23    ; кадр анимации
C - - - - - 0x004CC0 01:8CB0: 4C 79 B1  JMP loc_B179

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x01510E_30_солдат_с_крыльями:
- D 0 - I - 0x01510E 05:90FE: 12 91     .word ofs_038_30_9112_01_активация_объекта ; 
- D 0 - I - 0x015110 05:9100: 40 91     .word ofs_038_30_9140_02 ; 
- D 0 - I - 0x015112 05:9102: CC 91     .word ofs_038_30_91CC_03 ; 
- D 0 - I - 0x015114 05:9104: 05 92     .word ofs_038_30_9205_04 ; 
- D 0 - I - 0x015116 05:9106: 4C 92     .word ofs_038_30_924C_05 ; 
- D 0 - I - 0x015118 05:9108: 70 92     .word ofs_038_30_9270_06 ; 
- D 0 - I - 0x01511A 05:910A: 75 92     .word ofs_038_30_9275_07 ; 
- D 0 - I - 0x01511C 05:910C: 9A A2     .word ofs_038_30_0x0062AA_08_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x01511E 05:910E: FD A2     .word ofs_038_30_0x00630D_09_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x015120 05:9110: 3D A3     .word ofs_038_30_0x00628A_0A_удалить_объект ;

; ******************************************************************************************************************

ofs_038_30_9112_01_активация_объекта:
C - - J - - 0x015122 05:9112: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x015125 05:9115: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x015128 05:9118: 29 01     AND #$01
C - - - - - 0x01512A 05:911A: 9D 1E 07  STA ram_флаги_объектов,X
sub_911D:
C - - - - - 0x01512D 05:911D: 0A        ASL
C - - - - - 0x01512E 05:911E: A8        TAY
C - - - - - 0x01512F 05:911F: B9 3C 91  LDA tbl_913C_скорость_X,Y
C - - - - - 0x015132 05:9122: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x015135 05:9125: B9 3D 91  LDA tbl_913C_скорость_X + $01,Y
C - - - - - 0x015138 05:9128: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x01513B 05:912B: 20 31 91  JSR sub_9131_определить_аттрибут_спрайта
C - - - - - 0x01513E 05:912E: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9131_определить_аттрибут_спрайта:
C - - - - - 0x015141 05:9131: 0A        ASL
C - - - - - 0x015142 05:9132: A9 41     LDA #$41
C - - - - - 0x015144 05:9134: B0 02     BCS bra_9138
C - - - - - 0x015146 05:9136: A9 01     LDA #$01
bra_9138:
C - - - - - 0x015148 05:9138: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x01514B 05:913B: 60        RTS

tbl_913C_скорость_X:
- D 0 - - - 0x01514C 05:913C: 00 FF     .word $FF00 ; 00 
- D 0 - - - 0x01514E 05:913E: 00 01     .word $0100 ; 01 

; ******************************************************************************************************************

ofs_038_30_9140_02:
C - - J - - 0x015150 05:9140: A9 12     LDA #$12
C - - - - - 0x015152 05:9142: 20 00 A8  JSR sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает
C - - - - - 0x015155 05:9145: F0 79     BEQ bra_91C0
C - - - - - 0x015157 05:9147: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
C - - - - - 0x01515A 05:914A: A5 03     LDA ram_0003
C - - - - - 0x01515C 05:914C: 29 01     AND #$01
C - - - - - 0x01515E 05:914E: 85 03     STA ram_0003
C - - - - - 0x015160 05:9150: A9 01     LDA #$01
C - - - - - 0x015162 05:9152: BC CA 06  LDY ram_скорость_объектов_X_старш,X
C - - - - - 0x015165 05:9155: 10 02     BPL bra_9159
C - - - - - 0x015167 05:9157: A9 FF     LDA #$FF
bra_9159:
C - - - - - 0x015169 05:9159: 85 08     STA ram_0008
C - - - - - 0x01516B 05:915B: 18        CLC
C - - - - - 0x01516C 05:915C: 65 03     ADC ram_0003
C - - - - - 0x01516E 05:915E: C9 02     CMP #$02
C - - - - - 0x015170 05:9160: 29 01     AND #$01
C - - - - - 0x015172 05:9162: 85 03     STA ram_0003
C - - - - - 0x015174 05:9164: A5 04     LDA ram_0004
C - - - - - 0x015176 05:9166: 90 03     BCC bra_916B
C - - - - - 0x015178 05:9168: 18        CLC
C - - - - - 0x015179 05:9169: 65 08     ADC ram_0008
bra_916B:
C - - - - - 0x01517B 05:916B: A8        TAY
C - - - - - 0x01517C 05:916C: 20 1B BB  JSR sub_0x007B2B
C - - - - - 0x01517F 05:916F: F0 4F     BEQ bra_91C0
C - - - - - 0x015181 05:9171: A9 08     LDA #$08
C - - - - - 0x015183 05:9173: BC CA 06  LDY ram_скорость_объектов_X_старш,X
C - - - - - 0x015186 05:9176: 10 02     BPL bra_917A
C - - - - - 0x015188 05:9178: A9 F8     LDA #$F8
bra_917A:
C - - - - - 0x01518A 05:917A: 20 22 A8  JSR sub_0x006832
C - - - - - 0x01518D 05:917D: F0 09     BEQ bra_9188
C - - - - - 0x01518F 05:917F: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
C - - - - - 0x015192 05:9182: 20 31 91  JSR sub_9131_определить_аттрибут_спрайта
C - - - - - 0x015195 05:9185: FE 48 07  INC ram_скролл_объекта_Y,X
bra_9188:
C - - - - - 0x015198 05:9188: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x01519B 05:918B: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01519E 05:918E: 38        SEC
C - - - - - 0x01519F 05:918F: F9 32 05  SBC ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x0151A2 05:9192: B0 04     BCS bra_9198
C - - - - - 0x0151A4 05:9194: 49 FF     EOR #$FF
C - - - - - 0x0151A6 05:9196: 69 01     ADC #$01
bra_9198:
C - - - - - 0x0151A8 05:9198: C9 08     CMP #$08
C - - - - - 0x0151AA 05:919A: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0151AD 05:919D: B0 04     BCS bra_91A3
C - - - - - 0x0151AF 05:919F: C9 02     CMP #$02
C - - - - - 0x0151B1 05:91A1: 90 15     BCC bra_91B8
bra_91A3:
C - - - - - 0x0151B3 05:91A3: C9 03     CMP #$03
C - - - - - 0x0151B5 05:91A5: B0 19     BCS bra_91C0
C - - - - - 0x0151B7 05:91A7: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0151BA 05:91AA: 38        SEC
C - - - - - 0x0151BB 05:91AB: F9 4C 05  SBC ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x0151BE 05:91AE: B0 04     BCS bra_91B4
C - - - - - 0x0151C0 05:91B0: 49 FF     EOR #$FF
C - - - - - 0x0151C2 05:91B2: 69 01     ADC #$01
bra_91B4:
C - - - - - 0x0151C4 05:91B4: C9 28     CMP #$28
C - - - - - 0x0151C6 05:91B6: 90 08     BCC bra_91C0
bra_91B8:
C - - - - - 0x0151C8 05:91B8: A0 07     LDY #$07
C - - - - - 0x0151CA 05:91BA: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x0151CD 05:91BD: 4C 07 A7  JMP loc_0x006717_обработка_позиции_объекта_по_Y
bra_91C0:
C - - - - - 0x0151D0 05:91C0: 20 C7 A7  JSR sub_0x0067D7_очистить_скорость_X_Y
C - - - - - 0x0151D3 05:91C3: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
C - - - - - 0x0151D6 05:91C6: A9 10     LDA #$10    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_30_91CC_03:
C - - J - - 0x0151DC 05:91CC: 20 7A 92  JSR sub_927A
C - - - - - 0x0151DF 05:91CF: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0151E2 05:91D2: D0 F7     BNE bra_928C_RTS
C - - - - - 0x0151E4 05:91D4: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0151E7 05:91D7: CD 4C 05  CMP ram_позиция_x_спрайта_игрока
C - - - - - 0x0151EA 05:91DA: A0 00     LDY #$00
C - - - - - 0x0151EC 05:91DC: B0 02     BCS bra_91E0
C - - - - - 0x0151EE 05:91DE: A0 04     LDY #$04
bra_91E0:
C - - - - - 0x0151F0 05:91E0: B9 FD 91  LDA tbl_91FD_скорость,Y
C - - - - - 0x0151F3 05:91E3: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0151F6 05:91E6: B9 FE 91  LDA tbl_91FD_скорость + $01,Y
C - - - - - 0x0151F9 05:91E9: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0151FC 05:91EC: B9 FF 91  LDA tbl_91FD_скорость + $02,Y
C - - - - - 0x0151FF 05:91EF: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x015202 05:91F2: B9 00 92  LDA tbl_91FD_скорость + $03,Y
C - - - - - 0x015205 05:91F5: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x015208 05:91F8: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_927A:
C - - - - - 0x01528A 05:927A: A9 6B     LDA #$6B
C - - - - - 0x01528C 05:927C: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x01528F 05:927F: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
C - - - - - 0x015292 05:9282: A9 12     LDA #$12
C - - - - - 0x015294 05:9284: 20 00 A8  JSR sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает
C - - - - - 0x015297 05:9287: F0 03     BEQ bra_928C_RTS
C - - - - - 0x015299 05:9289: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
bra_928C_RTS:
C - - - - - 0x01529C 05:928C: 60        RTS

tbl_91FD_скорость:
; 00 
- D 0 - - - 0x01520D 05:91FD: 80 FE     .word $FE80 ; Y
- D 0 - - - 0x01520F 05:91FF: 40 FF     .word $FF40 ; X
; 04 
- D 0 - - - 0x015211 05:9201: 80 FE     .word $FE80 ; Y
- D 0 - - - 0x015213 05:9203: C0 00     .word $00C0 ; X

; ******************************************************************************************************************

ofs_038_30_9205_04:
C - - J - - 0x015215 05:9205: A9 6C     LDA #$6C
C - - - - - 0x015217 05:9207: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x01521A 05:920A: 20 07 A7  JSR sub_0x006717_обработка_позиции_объекта_по_Y
C - - - - - 0x01521D 05:920D: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x015220 05:9210: 18        CLC
C - - - - - 0x015221 05:9211: 69 18     ADC #< $0018
C - - - - - 0x015223 05:9213: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x015226 05:9216: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x015229 05:9219: 69 00     ADC #> $0018
C - - - - - 0x01522B 05:921B: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x01522E 05:921E: A9 08     LDA #$08
C - - - - - 0x015230 05:9220: BC CA 06  LDY ram_скорость_объектов_X_старш,X
C - - - - - 0x015233 05:9223: 10 02     BPL bra_9227
C - - - - - 0x015235 05:9225: A9 F8     LDA #$F8
bra_9227:
C - - - - - 0x015237 05:9227: 20 22 A8  JSR sub_0x006832
C - - - - - 0x01523A 05:922A: F0 06     BEQ bra_9232
C - - - - - 0x01523C 05:922C: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
C - - - - - 0x01523F 05:922F: FE 48 07  INC ram_скролл_объекта_Y,X
bra_9232:
C - - - - - 0x015242 05:9232: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x015245 05:9235: C9 02     CMP #$02
C - - - - - 0x015247 05:9237: 90 12     BCC bra_924B_RTS
C - - - - - 0x015249 05:9239: A9 12     LDA #$12
C - - - - - 0x01524B 05:923B: 20 00 A8  JSR sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает
C - - - - - 0x01524E 05:923E: F0 0B     BEQ bra_924B_RTS
C - - - - - 0x015250 05:9240: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
C - - - - - 0x015253 05:9243: 20 C7 A7  JSR sub_0x0067D7_очистить_скорость_X_Y
C - - - - - 0x015256 05:9246: A9 08     LDA #$08    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_924B_RTS:
C - - - - - 0x01525B 05:924B: 60        RTS

; ******************************************************************************************************************

ofs_038_30_924C_05:
C - - J - - 0x01525C 05:924C: 20 7A 92  JSR sub_927A
C - - - - - 0x01525F 05:924F: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x015262 05:9252: D0 F7     BNE bra_924B_RTS
C - - - - - 0x015264 05:9254: A9 00     LDA #$00
C - - - - - 0x015266 05:9256: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x015269 05:9259: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x01526C 05:925C: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01526F 05:925F: D9 4C 05  CMP ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x015272 05:9262: A9 00     LDA #$00
C - - - - - 0x015274 05:9264: B0 02     BCS bra_9268
C - - - - - 0x015276 05:9266: A9 01     LDA #$01
bra_9268:
C - - - - - 0x015278 05:9268: 20 1D 91  JSR sub_911D
C - - - - - 0x01527B 05:926B: A9 02     LDA #$02
C - - - - - 0x01527D 05:926D: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

; ******************************************************************************************************************

ofs_038_30_9270_06:
C - - J - - 0x015280 05:9270: A9 6C     LDA #$6C    ; кадр анимации
C - - - - - 0x015282 05:9272: 4C 3B B1  JMP loc_B13B

; ******************************************************************************************************************

ofs_038_30_9275_07:
C - - J - - 0x015285 05:9275: A9 6C     LDA #$6C    ; кадр анимации
C - - - - - 0x015287 05:9277: 4C 79 B1  JMP loc_B179

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x01529D_31_автоспавнер_солдат_с_крыльями:
- D 0 - I - 0x01529D 05:928D: 91 92     .word ofs_038_31_9291_01_активация_объекта ; 
- D 0 - I - 0x01529F 05:928F: 9E 92     .word ofs_038_31_929E_02 ; 

; ******************************************************************************************************************

ofs_038_31_9291_01_активация_объекта:
C - - J - - 0x0152A1 05:9291: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0152A4 05:9294: A9 03     LDA #$03
C - - - - - 0x0152A6 05:9296: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0152A9 05:9299: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_31_929E_02:
C - - J - - 0x0152AE 05:929E: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0152B1 05:92A1: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0152B4 05:92A4: C9 10     CMP #$10
C - - - - - 0x0152B6 05:92A6: 90 1F     BCC bra_92C7_RTS
C - - - - - 0x0152B8 05:92A8: C9 A0     CMP #$A0
C - - - - - 0x0152BA 05:92AA: B0 1C     BCS bra_92C8
C - - - - - 0x0152BC 05:92AC: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0152BF 05:92AF: D0 16     BNE bra_92C7_RTS
C - - - - - 0x0152C1 05:92B1: A9 30     LDA #$30
C - - - - - 0x0152C3 05:92B3: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x0152C6 05:92B6: D0 07     BNE bra_92BF
C - - - - - 0x0152C8 05:92B8: A9 03     LDA #$03
C - - - - - 0x0152CA 05:92BA: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0152CD 05:92BD: A9 F0     LDA #$F0
bra_92BF:
C - - - - - 0x0152CF 05:92BF: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0152D2 05:92C2: A0 40     LDY #con_obj_id_30
C - - - - - 0x0152D4 05:92C4: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
bra_92C7_RTS:
C - - - - - 0x0152D7 05:92C7: 60        RTS
bra_92C8:
C - - - - - 0x0152D8 05:92C8: 4C 75 A2  JMP loc_0x00628A_удалить_объект

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B9D4_10_автоспавнер_выбегающих_солдат:
- D 1 - I - 0x0079E4 01:B9D4: DC B9     .word ofs_038_10_B9DC_01_активация_объекта ; 
- D 1 - I - 0x0079E6 01:B9D6: F0 B9     .word ofs_038_10_B9F0_02 ; 
- D 1 - I - 0x0079E8 01:B9D8: 2B BA     .word ofs_038_10_BA2B_03 ; 
- - - - - - 0x0079EA 01:B9DA: 75 A2     .word ofs_038_10_0x00628A_04_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_10_B9DC_01_активация_объекта:
C - - J - - 0x0079EC 01:B9DC: A9 F0     LDA #con_HP_F0
C - - - - - 0x0079EE 01:B9DE: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x0079F1 01:B9E1: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0079F4 01:B9E4: 38        SEC
C - - - - - 0x0079F5 01:B9E5: E9 04     SBC #$04
C - - - - - 0x0079F7 01:B9E7: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0079FA 01:B9EA: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0079FD 01:B9ED: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_10_B9F0_02:
C - - J - - 0x007A00 01:B9F0: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007A03 01:B9F3: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x007A06 01:B9F6: C9 E8     CMP #$E8
C - - - - - 0x007A08 01:B9F8: B0 7F     BCS bra_92C7_RTS
C - - - - - 0x007A0A 01:B9FA: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007A0D 01:B9FD: 18        CLC
C - - - - - 0x007A0E 01:B9FE: 69 12     ADC #$12
C - - - - - 0x007A10 01:BA00: A8        TAY
C - - - - - 0x007A11 01:BA01: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x007A14 01:BA04: E9 10     SBC #$10
C - - - - - 0x007A16 01:BA06: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x007A19 01:BA09: A5 03     LDA ram_0003
C - - - - - 0x007A1B 01:BA0B: 29 01     AND #$01
C - - - - - 0x007A1D 01:BA0D: 0A        ASL
C - - - - - 0x007A1E 01:BA0E: AA        TAX
C - - - - - 0x007A1F 01:BA0F: BD 27 BA  LDA tbl_BA27,X
C - - - - - 0x007A22 01:BA12: 99 00 04  STA ram_0400,Y
C - - - - - 0x007A25 01:BA15: BD 28 BA  LDA tbl_BA27 + $01,X
C - - - - - 0x007A28 01:BA18: 99 01 04  STA ram_0401,Y
C - - - - - 0x007A2B 01:BA1B: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x007A2D 01:BA1D: A9 01     LDA #$01
C - - - - - 0x007A2F 01:BA1F: 9D 48 07  STA ram_скролл_объекта_Y,X
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_BA27:
- D 1 - - - 0x007A37 01:BA27: 11        .byte $11, $10   ; 00 
- D 1 - - - 0x007A39 01:BA29: 01        .byte $01, $11   ; 01 

; ******************************************************************************************************************

ofs_038_10_BA2B_03:
C - - J - - 0x007A3B 01:BA2B: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007A3E 01:BA2E: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x007A41 01:BA31: D0 46     BNE bra_BA79_RTS
C - - - - - 0x007A43 01:BA33: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x007A46 01:BA36: A4 0A     LDY ram_000A     ; индекс игрока
C - - - - - 0x007A48 01:BA38: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x007A4B 01:BA3B: 38        SEC
C - - - - - 0x007A4C 01:BA3C: F9 4C 05  SBC ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x007A4F 01:BA3F: B0 05     BCS bra_BA46
C - - - - - 0x007A51 01:BA41: 49 FF     EOR #$FF
C - - - - - 0x007A53 01:BA43: 69 01     ADC #$01
C - - - - - 0x007A55 01:BA45: 18        CLC
bra_BA46:
C - - - - - 0x007A56 01:BA46: A0 81     LDY #$81
C - - - - - 0x007A58 01:BA48: 90 02     BCC bra_BA4C
C - - - - - 0x007A5A 01:BA4A: A0 00     LDY #$00
bra_BA4C:
C - - - - - 0x007A5C 01:BA4C: 84 12     STY ram_0012
C - - - - - 0x007A5E 01:BA4E: C9 18     CMP #$18
C - - - - - 0x007A60 01:BA50: 90 16     BCC bra_BA68
C - - - - - 0x007A62 01:BA52: A0 03     LDY #con_obj_id_03
C - - - - - 0x007A64 01:BA54: 20 C8 AB  JSR sub_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x007A67 01:BA57: 90 0F     BCC bra_BA68
C - - - - - 0x007A6E 01:BA5E: A4 11     LDY ram_0011
C - - - - - 0x007A69 01:BA59: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x007A6C 01:BA5C: 29 20     AND #$20
C - - - - - 0x007A70 01:BA60: 99 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,Y
C - - - - - 0x007A73 01:BA63: A5 12     LDA ram_0012
C - - - - - 0x007A75 01:BA65: 99 1E 07  STA ram_флаги_объектов,Y
bra_BA68:
C - - - - - 0x007A78 01:BA68: A9 20     LDA #$20
C - - - - - 0x007A7A 01:BA6A: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x007A7D 01:BA6D: 10 07     BPL bra_BA76
C - - - - - 0x007A7F 01:BA6F: A9 01     LDA #$01
C - - - - - 0x007A81 01:BA71: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x007A84 01:BA74: A9 80     LDA #$80
bra_BA76:
C - - - - - 0x007A86 01:BA76: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_BA79_RTS:
C - - - - - 0x007A89 01:BA79: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x014332_47_стреляющий_солдат_стоя_уровни_сверху:
- D 0 - I - 0x014332 05:8322: 2C 83     .word ofs_038_47_832C_01_активация_объекта ; 
- D 0 - I - 0x014334 05:8324: 4D 83     .word ofs_038_47_834D_02 ; 
- D 0 - I - 0x014336 05:8326: 9A A2     .word ofs_038_47_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x014338 05:8328: FD A2     .word ofs_038_37_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x01433A 05:832A: 3D A3     .word ofs_038_37_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_47_832C_01_активация_объекта:
C - - J - - 0x01433C 05:832C: A9 02     LDA #$02
C - - - - - 0x01433E 05:832E: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x014341 05:8331: A9 01     LDA #$01    ; кол-во пуль в очереди
C - - - - - 0x014343 05:8333: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x014346 05:8336: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014349 05:8339: A9 06     LDA #$06
C - - - - - 0x01434B 05:833B: 9D 48 07  STA ram_счетчик_поворота_объекта,X
C - - - - - 0x01434E 05:833E: A9 03     LDA #$02
C - - - - - 0x014350 05:8340: 9D 56 07  STA ram_угол_направления_объекта,X
C - - - - - 0x014353 05:8343: A9 20     LDA #$20
C - - - - - 0x014355 05:8345: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x014358 05:8348: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JSR sub_0x006AEA_выбрать_рандомного_игрока
                                        STA ram_0764_obj,X  ; отложить индекс игрока
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_47_834D_02:
C - - J - - 0x01435D 05:834D: BC 56 07  LDY ram_угол_направления_объекта,X
C - - - - - 0x014360 05:8350: B9 A3 83  LDA tbl_83A3_кадры_анимации,Y
C - - - - - 0x014363 05:8353: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x014366 05:8356: B9 AB 83  LDA tbl_83AB_аттрибуты_спрайта,Y
C - - - - - 0x014369 05:8359: 20 19 87  JSR sub_8719
C - - - - - 0x01436C 05:835C: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
                                        LDA ram_счетчкик_жизни_объектов,X
C - - - - - 0x014372 05:8362: D0 2A     BEQ bra_8398
C - - - - - 0x01436F 05:835F: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
bra_8398:
                                        LDA ram_0764_obj,X  ; отложенный индекс рандомного игрока
                                        STA ram_000A    ; индекс рандомного игрока
C - - - - - 0x0143AF 05:839F: 20 95 F4  JSR sub_0x01F4A5_определить_угол_и_сравнить_между_собой
                                        BNE bra_838E_поворот_объекта
; попытка выстрела
                                        LDA ram_счетчкик_жизни_объектов,X
                                        BNE bra_83A2_RTS
                                        LDY #con_obj_id_02  ; обычная пуля объекта
                                        JSR sub_0x006BF8_поиск_пустого_слота_и_попытка_создать_пулю_на_позиции_текущего_объекта
                                        BCC bra_83A2_RTS
; есть свободный слот, пуля была создана
                                        JSR sub_0x01F360_определить_множитель_скорости_пули_от_сложности_игры
                                        LDY ram_0017    ; точный угол от объекта до игрока 
                                        LDX ram_0011    ; индекс нового объекта
                                        JSR sub_0x01F370_установить_скорость_пули_объекта
                                        LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x0143CB 05:83BB: BC 56 07  LDY ram_угол_направления_объекта,X
                                        JSR sub_86EB_выровнить_позиции_спрайта_пули
C - - - - - 0x014384 05:8374: A9 10     LDA #$10    ; кд перед 2м выстрелом
C - - - - - 0x014386 05:8376: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x014389 05:8379: 10 0F     BPL bra_838A
; 2й выстрел в очереди
                                        JSR sub_0x006AEA_выбрать_рандомного_игрока
                                        STA ram_0764_obj,X  ; отложить индекс игрока
C - - - - - 0x01438B 05:837B: A9 01     LDA #$01    ; кол-во пуль в очереди
C - - - - - 0x01438D 05:837D: 9D 72 07  STA ram_0772_obj,X
                                        LDY ram_option_сложность
C - - - - - 0x014390 05:8380: A5 23     LDA ram_рандом_байт
C - - - - - 0x014392 05:8382: 65 5B     ADC ram_счетчик_кадров
                                        STA ram_рандом_байт
C - - - - - 0x014396 05:8386: 29 0F     AND #$0F
                                        ADC tbl_83B3_кд_до_следующего_выстрела,Y
bra_838A:
C - - - - - 0x01439A 05:838A: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x01439D 05:838D: 60        RTS
bra_838E_поворот_объекта:
C - - - - - 0x01439E 05:838E: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0143A1 05:8391: D0 0F     BNE bra_83A2_RTS
                                        LDY ram_option_сложность
                                        LDA tbl_83B4_счетчик_поворота_вокруг_себя,Y
C - - - - - 0x0143A5 05:8395: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0143AF 05:839F: 20 95 F4  JMP loc_0x01F4A7_определить_сторону_поворота_и_повернуть_объект
bra_83A2_RTS:
C - - - - - 0x0143B2 05:83A2: 60        RTS

tbl_83A3_кадры_анимации:
- D 0 - - - 0x0143B3 05:83A3: 47        .byte $47   ; 00 
- D 0 - - - 0x0143B4 05:83A4: 41        .byte $41   ; 01 
- D 0 - - - 0x0143B5 05:83A5: 3E        .byte $3E   ; 02 
- D 0 - - - 0x0143B6 05:83A6: 41        .byte $41   ; 03 
- D 0 - - - 0x0143B7 05:83A7: 47        .byte $47   ; 04 
- D 0 - - - 0x0143B8 05:83A8: 44        .byte $44   ; 05 
- D 0 - - - 0x0143B9 05:83A9: 48        .byte $48   ; 06 
- D 0 - - - 0x0143BA 05:83AA: 44        .byte $44   ; 07 

tbl_83AB_аттрибуты_спрайта:
- D 0 - - - 0x0143BB 05:83AB: 40        .byte $40   ; 00 
- D 0 - - - 0x0143BC 05:83AC: 40        .byte $40   ; 01 
- D 0 - - - 0x0143BD 05:83AD: 00        .byte $00   ; 02 
- D 0 - - - 0x0143BE 05:83AE: 00        .byte $00   ; 03 
- D 0 - - - 0x0143BF 05:83AF: 00        .byte $00   ; 04 
- D 0 - - - 0x0143C0 05:83B0: 00        .byte $00   ; 05 
- D 0 - - - 0x0143C1 05:83B1: 00        .byte $00   ; 06 
- D 0 - - - 0x0143C2 05:83B2: 40        .byte $40   ; 07 

tbl_83B3_кд_до_следующего_выстрела:
                                        .byte $77   ; 00 normal
                                        .byte $5F   ; 00 hard
                                        .byte $39   ; 00 insane

tbl_83B4_счетчик_поворота_вокруг_себя:
                                        .byte $08   ; 00 normal
                                        .byte $06   ; 01 hard
                                        .byte $04   ; 02 insane

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0143D2_4E_выбегающий_солдат_уровни_сверху:
- D 0 - I - 0x0143D2 05:83C2: CE 83     .word ofs_038_4E_83CE_01_активация_объекта ; 
- D 0 - I - 0x0143D4 05:83C4: 4D 84     .word ofs_038_4E_844D_02 ; 
- D 0 - I - 0x0143D6 05:83C6: 8F 86     .word ofs_038_4E_868F_03 ; 
- D 0 - I - 0x0143D8 05:83C8: 9A A2     .word ofs_038_4E_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x0143DA 05:83CA: FD A2     .word ofs_038_4E_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x0143DC 05:83CC: 3D A3     .word ofs_038_4E_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_4E_83CE_01_активация_объекта:
C - - J - - 0x0143DE 05:83CE: A9 02     LDA #$02
C - - - - - 0x0143E0 05:83D0: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0143E3 05:83D3: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0143E6 05:83D6: 4A        LSR
C - - - - - 0x0143E7 05:83D7: 90 0A     BCC bra_83E3
; bit 01 = выбегают снизу экрана
C - - - - - 0x0143E9 05:83D9: A9 40     LDA #$40
C - - - - - 0x0143EB 05:83DB: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0143EE 05:83DE: A9 E0     LDA #$E0
C - - - - - 0x0143F0 05:83E0: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
bra_83E3:
C - - - - - 0x0143F3 05:83E3: 20 F3 83  JSR sub_83F3
C - - - - - 0x0143F6 05:83E6: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x0143F9 05:83E9: A9 20     LDA #$20
C - - - - - 0x0143FB 05:83EB: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0143FE 05:83EE: A9 30     LDA #$30    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_83F3:
C - - - - - 0x014403 05:83F3: 20 4C 86  JSR sub_864C
C - - - - - 0x014409 05:83F9: 20 F0 F4  JSR sub_0x01F4A5_определить_угол_и_сравнить_между_собой
C - - - - - 0x01440E 05:83FE: 9D 48 07  STA ram_счетчик_поворота_объекта,X
C - - - - - 0x014411 05:8401: A8        TAY
C - - - - - 0x014412 05:8402: 20 9B F4  JSR sub_0x01F4AB_установить_угол_направления_от_счетчика_поворота
C - - - - - 0x014415 05:8405: 4C 0E 84  JMP loc_840E_установить_скорость_Y_X

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8408:
C - - - - - 0x014418 05:8408: 20 4C 86  JSR sub_864C
C - - - - - 0x01441B 05:840B: 20 95 F4  JSR sub_0x01F4A5_определить_угол_и_сравнить_между_собой
                                        BEQ bra_840E_установить_скорость_Y_X
; углы не совпали, нужно повернуть объект
                                        JSR loc_0x01F4A7_определить_сторону_поворота_и_повернуть_объект
loc_840E_установить_скорость_Y_X:
sub_840E_установить_скорость_Y_X:
bra_840E_установить_скорость_Y_X:
                                        LDY ram_option_сложность
C D 0 - - - 0x01441E 05:840E: BD 56 07  LDA ram_угол_направления_объекта,X
C - - - - - 0x014421 05:8411: 0A        ASL
C - - - - - 0x014422 05:8412: 0A        ASL
                                        CLC
                                        ADC tbl_842C_добавочный_индекс,Y
C - - - - - 0x014423 05:8413: A8        TAY
C - - - - - 0x014424 05:8414: B9 2D 84  LDA tbl_842D_скорость,Y
C - - - - - 0x014427 05:8417: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x01442A 05:841A: B9 2E 84  LDA tbl_842D_скорость + $01,Y
C - - - - - 0x01442D 05:841D: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x014430 05:8420: B9 2F 84  LDA tbl_842D_скорость + $02,Y
C - - - - - 0x014433 05:8423: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x014436 05:8426: B9 30 84  LDA tbl_842D_скорость + $03,Y
C - - - - - 0x014439 05:8429: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x01443C 05:842C: 60        RTS

tbl_842C_добавочный_индекс:
                                        .byte off_842D_скорость_normal - tbl_842D_скорость  ; 00
                                        .byte off_842D_скорость_hard - tbl_842D_скорость    ; 01
                                        .byte off_842D_скорость_insane - tbl_842D_скорость  ; 02

tbl_842D_скорость:
off_842D_скорость_normal:
; 00 RIGHT
- D 0 - - - 0x01443D 05:842D: 00 00     .word $0000 ; Y
- D 0 - - - 0x01443F 05:842F: C0 00     .word $00C0 ; X
; 01 RIGHT+DOWN
- D 0 - - - 0x014441 05:8431: 87 00     .word $0087 ; Y
- D 0 - - - 0x014443 05:8433: 87 00     .word $0087 ; X
; 02 DOWN
- D 0 - - - 0x014445 05:8435: C0 00     .word $00C0 ; Y
- D 0 - - - 0x014447 05:8437: 00 00     .word $0000 ; X
; 03 LEFT+DOWN
- D 0 - - - 0x014449 05:8439: 87 00     .word $0087 ; Y
- D 0 - - - 0x01444B 05:843B: 79 FF     .word $FF79 ; X
; 04 LEFT
- D 0 - - - 0x01444D 05:843D: 00 00     .word $0000 ; Y
- D 0 - - - 0x01444F 05:843F: 40 FF     .word $FF40 ; X
; 05 LEFT+UP
- D 0 - - - 0x014451 05:8441: 79 FF     .word $FF79 ; Y
- D 0 - - - 0x014453 05:8443: 79 FF     .word $FF79 ; X
; 06 UP
- D 0 - - - 0x014455 05:8445: 40 FF     .word $FF40 ; Y
- D 0 - - - 0x014457 05:8447: 00 00     .word $0000 ; X
; 07 RIGHT+UP
- D 0 - - - 0x014459 05:8449: 79 FF     .word $FF79 ; Y
- D 0 - - - 0x01445B 05:844B: 87 00     .word $0087 ; X

off_842D_скорость_hard:
; 00 RIGHT
                                        .word $0000 ; Y
                                        .word $00E0 ; X
; 01 RIGHT+DOWN
                                        .word $009E ; Y
                                        .word $009E ; X
; 02 DOWN
                                        .word $00E0 ; Y
                                        .word $0000 ; X
; 03 LEFT+DOWN
                                        .word $009E ; Y
                                        .word $FF62 ; X
; 04 LEFT
                                        .word $0000 ; Y
                                        .word $FF20 ; X
; 05 LEFT+UP
                                        .word $FF62 ; Y
                                        .word $FF62 ; X
; 06 UP
                                        .word $FF20 ; Y
                                        .word $0000 ; X
; 07 RIGHT+UP
                                        .word $FF62 ; Y
                                        .word $009E ; X

off_842D_скорость_insane:
; 00 RIGHT
                                        .word $0000 ; Y
                                        .word $0110 ; X
; 01 RIGHT+DOWN
                                        .word $00C0 ; Y
                                        .word $00C0 ; X
; 02 DOWN
                                        .word $0110 ; Y
                                        .word $0000 ; X
; 03 LEFT+DOWN
                                        .word $00C0 ; Y
                                        .word $FF40 ; X
; 04 LEFT
                                        .word $0000 ; Y
                                        .word $FEF0 ; X
; 05 LEFT+UP
                                        .word $FF40 ; Y
                                        .word $FF40 ; X
; 06 UP
                                        .word $FEF0 ; Y
                                        .word $0000 ; X
; 07 RIGHT+UP
                                        .word $FF40 ; Y
                                        .word $00C0 ; X

; ******************************************************************************************************************

ofs_038_4E_844D_02:
C - - J - - 0x01445D 05:844D: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x014460 05:8450: F0 2D     BEQ bra_847F
C - - - - - 0x014462 05:8452: B9 A1 85  LDA tbl_85A2_добавочная_позиция_Y - $01,Y
C - - - - - 0x014465 05:8455: 18        CLC
C - - - - - 0x014466 05:8456: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014469 05:8459: 85 08     STA ram_0008
C - - - - - 0x01446B 05:845B: B9 A5 85  LDA tbl_85A6_добавочная_позиция_X - $01,Y
C - - - - - 0x01446E 05:845E: 18        CLC
C - - - - - 0x01446F 05:845F: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014472 05:8462: A4 08     LDY ram_0008
C - - - - - 0x014474 05:8464: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x014477 05:8467: D0 16     BNE bra_847F


C - - - - - 0x014479 05:8469: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x01447C 05:846C: B9 A9 85  LDA tbl_85AA_счетчики_поворота - $01,Y
C - - - - - 0x01447F 05:846F: 9D 48 07  STA ram_счетчик_поворота_объекта,X
C - - - - - 0x014482 05:8472: A9 08     LDA #$08
C - - - - - 0x014484 05:8474: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x014487 05:8477: A9 00     LDA #$00
C - - - - - 0x014489 05:8479: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x01448C 05:847C: 4C 04 85  JMP loc_8504
bra_847F:
C - - - - - 0x01448F 05:847F: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x014492 05:8482: 1D BC 06  ORA ram_скорость_объектов_x_младш,X
C - - - - - 0x014495 05:8485: F0 40     BEQ bra_84C7
C - - - - - 0x014497 05:8487: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x01449A 05:848A: 2A        ROL
C - - - - - 0x01449B 05:848B: 2A        ROL
C - - - - - 0x01449C 05:848C: 29 01     AND #$01
C - - - - - 0x01449E 05:848E: A8        TAY
C - - - - - 0x01449F 05:848F: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0144A2 05:8492: D9 B2 85  CMP tbl_85B2_позиция_X_спрайта,Y
C - - - - - 0x0144A5 05:8495: C8        INY
C - - - - - 0x0144A6 05:8496: 84 13     STY ram_0013
C - - - - - 0x0144A8 05:8498: 6A        ROR
C - - - - - 0x0144A9 05:8499: 5D CA 06  EOR ram_скорость_объектов_X_старш,X
C - - - - - 0x0144AC 05:849C: 30 1B     BMI bra_84B9
C - - - - - 0x0144AE 05:849E: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x0144B1 05:84A1: 0A        ASL
C - - - - - 0x0144B2 05:84A2: A9 08     LDA #$08
C - - - - - 0x0144B4 05:84A4: A0 01     LDY #$01
C - - - - - 0x0144B6 05:84A6: 90 03     BCC bra_84AB
C - - - - - 0x0144B8 05:84A8: A9 F8     LDA #$F8
C - - - - - 0x0144BA 05:84AA: C8        INY
bra_84AB:
C - - - - - 0x0144BB 05:84AB: 84 13     STY ram_0013
C - - - - - 0x0144BD 05:84AD: 18        CLC
C - - - - - 0x0144BE 05:84AE: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0144C1 05:84B1: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0144C4 05:84B4: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x0144C7 05:84B7: F0 0E     BEQ bra_84C7
bra_84B9:
C - - - - - 0x0144C9 05:84B9: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x0144CC 05:84BC: D0 03     BNE bra_84C1
C - - - - - 0x0144CE 05:84BE: 4C 3B 85  JMP loc_853B
bra_84C1:
C - - - - - 0x0144D1 05:84C1: 20 2B 86  JSR sub_862B_повернуть_объект_на_180_градусов
C - - - - - 0x0144D4 05:84C4: 4C 04 85  JMP loc_8504
bra_84C7:
C - - - - - 0x0144D7 05:84C7: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0144DA 05:84CA: 1D A0 06  ORA ram_скорость_объектов_y_младш,X
C - - - - - 0x0144DD 05:84CD: F0 2B     BEQ bra_84FA
C - - - - - 0x0144DF 05:84CF: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0144E2 05:84D2: 0A        ASL
C - - - - - 0x0144E3 05:84D3: A9 10     LDA #$10
C - - - - - 0x0144E5 05:84D5: A0 03     LDY #$03
C - - - - - 0x0144E7 05:84D7: 90 03     BCC bra_84DC
C - - - - - 0x0144E9 05:84D9: A9 F8     LDA #$F8
C - - - - - 0x0144EB 05:84DB: C8        INY
bra_84DC:
C - - - - - 0x0144EC 05:84DC: 84 13     STY ram_0013
C - - - - - 0x0144EE 05:84DE: 18        CLC
C - - - - - 0x0144EF 05:84DF: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0144F2 05:84E2: C9 E8     CMP #$E8
C - - - - - 0x0144F4 05:84E4: B0 14     BCS bra_84FA
C - - - - - 0x0144F6 05:84E6: A8        TAY
C - - - - - 0x0144F7 05:84E7: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0144FA 05:84EA: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x0144FD 05:84ED: F0 0B     BEQ bra_84FA
C - - - - - 0x0144FF 05:84EF: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x014502 05:84F2: F0 2B     BEQ bra_851F
- - - - - - 0x014504 05:84F4: 20 2B 86  JSR sub_862B_повернуть_объект_на_180_градусов
- - - - - - 0x014507 05:84F7: 4C 04 85  JMP loc_8504
bra_84FA:
C - - - - - 0x01450A 05:84FA: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x01450D 05:84FD: D0 05     BNE bra_8504
C - - - - - 0x01450F 05:84FF: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x014512 05:8502: F0 53     BEQ bra_8557
bra_8504:
loc_8504:
C D 0 - - - 0x014514 05:8504: 20 C3 85  JSR sub_85C3
C - - - - - 0x014517 05:8507: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x01451A 05:850A: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x01451D 05:850D: 29 02     AND #$02
C - - - - - 0x01451F 05:850F: F0 0D     BEQ bra_851E_RTS
; bit 02 = выстрел объекта
C - - - - - 0x014521 05:8511: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x014524 05:8514: D0 08     BNE bra_851E_RTS
C - - - - - 0x014526 05:8516: A9 20     LDA #$20
C - - - - - 0x014528 05:8518: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x01452B 05:851B: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_851E_RTS:
C - - - - - 0x01452E 05:851E: 60        RTS
bra_851F:
C - - - - - 0x01452F 05:851F: 20 66 86  JSR sub_8666
C - - - - - 0x014532 05:8522: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014535 05:8525: C5 0C     CMP ram_000C
C - - - - - 0x014537 05:8527: 6A        ROR
C - - - - - 0x014538 05:8528: 5D AE 06  EOR ram_скорость_объектов_Y_старш,X
C - - - - - 0x01453B 05:852B: 30 2A     BMI bra_8557
C - - - - - 0x01453D 05:852D: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014540 05:8530: C5 0B     CMP ram_000B
C - - - - - 0x014542 05:8532: A9 00     LDA #$00
C - - - - - 0x014544 05:8534: 90 02     BCC bra_8538
C - - - - - 0x014546 05:8536: A9 01     LDA #$01
bra_8538:
C - - - - - 0x014548 05:8538: 4C 8A 85  JMP loc_858A

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

loc_853B:
C D 0 - - - 0x01454B 05:853B: 20 66 86  JSR sub_8666
C - - - - - 0x01454E 05:853E: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014551 05:8541: C5 0B     CMP ram_000B    ; позиция_X_спрайта_игрока
C - - - - - 0x014553 05:8543: 6A        ROR
C - - - - - 0x014554 05:8544: 5D CA 06  EOR ram_скорость_объектов_X_старш,X
C - - - - - 0x014557 05:8547: 30 0E     BMI bra_8557
C - - - - - 0x014559 05:8549: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01455C 05:854C: C5 0C     CMP ram_000C    ; позиция_Y_спрайта_игрока
C - - - - - 0x01455E 05:854E: A9 02     LDA #$02
C - - - - - 0x014560 05:8550: 90 02     BCC bra_8554
C - - - - - 0x014562 05:8552: A9 03     LDA #$03
bra_8554:
C - - - - - 0x014564 05:8554: 4C 8A 85  JMP loc_858A
bra_8557:
C - - - - - 0x014567 05:8557: 20 66 86  JSR sub_8666
C - - - - - 0x01456A 05:855A: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01456D 05:855D: C5 0C     CMP ram_000C    ; позиция_Y_спрайта_игрока
C - - - - - 0x01456F 05:855F: 90 0A     BCC bra_856B_игрок_ниже
; объект ниже игрока
C - - - - - 0x014571 05:8561: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x014574 05:8564: 0A        ASL
C - - - - - 0x014575 05:8565: 30 0C     BMI bra_8573
; если объект был сверху, и зашел ниже игрока, объект больше не будет преследовать игрока и уйдет вниз экрана
C - - - - - 0x014577 05:8567: A9 80     LDA #$80    ; флаг что объект перестает преследовать игрока
C - - - - - 0x014579 05:8569: D0 05     BNE bra_8570    ; jmp
bra_856B_игрок_ниже:
C - - - - - 0x01457B 05:856B: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x01457E 05:856E: 29 BF     AND #$BF    ; очистить bit 40
bra_8570:
C - - - - - 0x014580 05:8570: 9D 72 07  STA ram_0772_obj,X
bra_8573:
C - - - - - 0x014583 05:8573: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x014585 05:8575: E5 23     SBC ram_рандом_байт
C - - - - - 0x014587 05:8577: 85 23     STA ram_рандом_байт
C - - - - - 0x01458B 05:857B: 29 07     AND #$07
C - - - - - 0x01458D 05:857D: A8        TAY
C - - - - - 0x01458E 05:857E: B9 B4 85  LDA tbl_85B4_счетчики,Y
C - - - - - 0x014591 05:8581: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x014594 05:8584: 20 08 84  JSR sub_8408
C - - - - - 0x014597 05:8587: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

loc_858A:
C D 0 - - - 0x01459A 05:858A: A8        TAY
C - - - - - 0x01459B 05:858B: B9 AA 85  LDA tbl_85AA_счетчики_поворота,Y
C - - - - - 0x01459E 05:858E: 9D 48 07  STA ram_счетчик_поворота_объекта,X
C - - - - - 0x0145A1 05:8591: B9 AE 85  LDA tbl_85AE_углы_направления,Y
C - - - - - 0x0145A4 05:8594: 9D 56 07  STA ram_угол_направления_объекта,X
C - - - - - 0x0145A7 05:8597: A5 13     LDA ram_0013
C - - - - - 0x0145A9 05:8599: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0145AC 05:859C: 20 0E 84  JSR sub_840E_установить_скорость_Y_X
C - - - - - 0x0145AF 05:859F: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

tbl_85A2_добавочная_позиция_Y:
- D 0 - - - 0x0145B2 05:85A2: 00        .byte $00   ; 01
- D 0 - - - 0x0145B3 05:85A3: 00        .byte $00   ; 02
- D 0 - - - 0x0145B4 05:85A4: 10        .byte $10   ; 03
- D 0 - - - 0x0145B5 05:85A5: F8        .byte $F8   ; 04

tbl_85A6_добавочная_позиция_X:
- D 0 - - - 0x0145B6 05:85A6: 08        .byte $08   ; 01
- D 0 - - - 0x0145B7 05:85A7: F8        .byte $F8   ; 02
- D 0 - - - 0x0145B8 05:85A8: 00        .byte $00   ; 03
- D 0 - - - 0x0145B9 05:85A9: 00        .byte $00   ; 04

tbl_85AA_счетчики_поворота:
- D 0 - - - 0x0145BA 05:85AA: 00        .byte $00   ; 00 (01)
- D 0 - - - 0x0145BB 05:85AB: 0C        .byte $0C   ; 01 (02)
- D 0 - - - 0x0145BC 05:85AC: 06        .byte $06   ; 02 (03)
- D 0 - - - 0x0145BD 05:85AD: 12        .byte $12   ; 03 (04)

tbl_85AE_углы_направления:
- D 0 - - - 0x0145BE 05:85AE: 00        .byte $00   ; 00
- D 0 - - - 0x0145BF 05:85AF: 04        .byte $04   ; 01
- D 0 - - - 0x0145C0 05:85B0: 02        .byte $02   ; 02
- D 0 - - - 0x0145C1 05:85B1: 06        .byte $06   ; 03

tbl_85B2_позиция_X_спрайта:
- D 0 - - - 0x0145C2 05:85B2: F0        .byte $F0   ; 00
- D 0 - - - 0x0145C3 05:85B3: 10        .byte $10   ; 01

tbl_85B4_счетчики:
- D 0 - - - 0x0145C4 05:85B4: 1A        .byte $1A   ; 00
- D 0 - - - 0x0145C5 05:85B5: 08        .byte $08   ; 01
- D 0 - - - 0x0145C6 05:85B6: 18        .byte $18   ; 02
- D 0 - - - 0x0145C7 05:85B7: 20        .byte $20   ; 03
- D 0 - - - 0x0145C8 05:85B8: 02        .byte $02   ; 04
- D 0 - - - 0x0145C9 05:85B9: 1C        .byte $1C   ; 05
- D 0 - - - 0x0145CA 05:85BA: 05        .byte $05   ; 06
- D 0 - - - 0x0145CB 05:85BB: 0E        .byte $0E   ; 07

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_85BC:
C - - - - - 0x0145CC 05:85BC: A9 03     LDA #$03
C - - - - - 0x0145CE 05:85BE: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0145D1 05:85C1: D0 1D     BNE bra_85E0    ; jmp

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_85C3:
C - - - - - 0x0145D3 05:85C3: FE 02 07  INC ram_счетчик_анимации_объектов,X
C - - - - - 0x0145D6 05:85C6: BD 02 07  LDA ram_счетчик_анимации_объектов,X
C - - - - - 0x0145D9 05:85C9: C9 08     CMP #$08
C - - - - - 0x0145DB 05:85CB: 90 10     BCC bra_85DD
C - - - - - 0x0145DD 05:85CD: A9 00     LDA #$00
C - - - - - 0x0145DF 05:85CF: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x0145E2 05:85D2: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0145E5 05:85D5: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0145E8 05:85D8: 29 03     AND #$03
C - - - - - 0x0145EA 05:85DA: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
bra_85DD:
C - - - - - 0x0145ED 05:85DD: BC 56 07  LDY ram_угол_направления_объекта,X
bra_85E0:
C - - - - - 0x0145F0 05:85E0: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0145F3 05:85E3: 4A        LSR
C - - - - - 0x0145F4 05:85E4: 4A        LSR
C - - - - - 0x0145F5 05:85E5: A9 01     LDA #$01
C - - - - - 0x0145F7 05:85E7: B0 02     BCS bra_85EB
C - - - - - 0x0145F9 05:85E9: A9 03     LDA #$03
bra_85EB:
C - - - - - 0x0145FB 05:85EB: 19 03 86  ORA tbl_8603_аттрибуты_спрайта,Y
C - - - - - 0x0145FE 05:85EE: 84 08     STY ram_0008
C - - - - - 0x014600 05:85F0: 20 19 87  JSR sub_8719
C - - - - - 0x014603 05:85F3: A5 08     LDA ram_0008
C - - - - - 0x014605 05:85F5: 0A        ASL
C - - - - - 0x014606 05:85F6: 0A        ASL
C - - - - - 0x014607 05:85F7: 18        CLC
C - - - - - 0x014608 05:85F8: 7D 10 07  ADC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01460B 05:85FB: A8        TAY
C - - - - - 0x01460C 05:85FC: B9 0B 86  LDA tbl_860B_кадры_анимации,Y
C - - - - - 0x01460F 05:85FF: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x014612 05:8602: 60        RTS

tbl_8603_аттрибуты_спрайта:
- D 0 - - - 0x014613 05:8603: 40        .byte $40   ; 00 
- D 0 - - - 0x014614 05:8604: 40        .byte $40   ; 01 
- D 0 - - - 0x014615 05:8605: 00        .byte $00   ; 02 
- D 0 - - - 0x014616 05:8606: 00        .byte $00   ; 03 
- D 0 - - - 0x014617 05:8607: 00        .byte $00   ; 04 
- D 0 - - - 0x014618 05:8608: 00        .byte $00   ; 05 
- D 0 - - - 0x014619 05:8609: 00        .byte $00   ; 06 
- D 0 - - - 0x01461A 05:860A: 40        .byte $40   ; 07 

tbl_860B_кадры_анимации:
- D 0 - - - 0x01461B 05:860B: 45        .byte $45, $46, $47, $46   ; 00 
- D 0 - - - 0x01461F 05:860F: 3F        .byte $3F, $40, $41, $40   ; 01 
- D 0 - - - 0x014623 05:8613: 3C        .byte $3C, $3D, $3E, $3D   ; 02 
- D 0 - - - 0x014627 05:8617: 3F        .byte $3F, $40, $41, $40   ; 03 
- D 0 - - - 0x01462B 05:861B: 45        .byte $45, $46, $47, $46   ; 04 
- D 0 - - - 0x01462F 05:861F: 42        .byte $42, $43, $44, $43   ; 05 
- D 0 - - - 0x014633 05:8623: 48        .byte $48, $49, $4A, $49   ; 06 
- D 0 - - - 0x014637 05:8627: 42        .byte $42, $43, $44, $43   ; 07 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_862B_повернуть_объект_на_180_градусов:
C - - - - - 0x01463B 05:862B: BD 48 07  LDA ram_счетчик_поворота_объекта,X
C - - - - - 0x01463E 05:862E: 18        CLC
C - - - - - 0x01463F 05:862F: 69 0C     ADC #$0C
C - - - - - 0x014641 05:8631: C9 18     CMP #$18
C - - - - - 0x014643 05:8633: 90 02     BCC bra_8637
C - - - - - 0x014645 05:8635: E9 18     SBC #$18
bra_8637:
C - - - - - 0x014647 05:8637: 9D 48 07  STA ram_счетчик_поворота_объекта,X
C - - - - - 0x01464A 05:863A: BD 56 07  LDA ram_угол_направления_объекта,X
C - - - - - 0x01464D 05:863D: 18        CLC
C - - - - - 0x01464E 05:863E: 69 04     ADC #$04
C - - - - - 0x014650 05:8640: C9 08     CMP #$08
C - - - - - 0x014652 05:8642: 90 02     BCC bra_8646
C - - - - - 0x014654 05:8644: E9 08     SBC #$08
bra_8646:
C - - - - - 0x014656 05:8646: 9D 56 07  STA ram_угол_направления_объекта,X
C - - - - - 0x014659 05:8649: 4C 0E 84  JMP loc_840E_установить_скорость_Y_X

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_864C:
C - - - - - 0x01465C 05:864C: 20 7C 86  JSR sub_867C_определить_случайную_точку_для_выхода_объекта
C - - - - - 0x014664 05:8654: 20 0B AB  JSR sub_0x006AEA_выбрать_рандомного_игрока
C - - - - - 0x014669 05:8659: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x01466C 05:865C: 29 FE     AND #$FE
C - - - - - 0x01466E 05:865E: 05 0A     ORA ram_000A    ; номер ближнего игрока
C - - - - - 0x014670 05:8660: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x014673 05:8663: 85 0A     STA ram_000A    ; номер ближнего игрока
C - - - - - 0x014675 05:8665: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8666:
C - - - - - 0x014676 05:8666: 20 7C 86  JSR sub_867C_определить_случайную_точку_для_выхода_объекта
C - - - - - 0x014679 05:8669: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x01467C 05:866C: 30 0D     BMI bra_867B_RTS
; объект еще преследует игрока
C - - - - - 0x01467E 05:866E: 29 01     AND #$01
C - - - - - 0x014680 05:8670: A8        TAY
C - - - - - 0x014681 05:8671: B9 32 05  LDA ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x014684 05:8674: 85 0C     STA ram_000C
C - - - - - 0x014686 05:8676: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x014689 05:8679: 85 0B     STA ram_000B
bra_867B_RTS:
C - - - - - 0x01468B 05:867B: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_867C_определить_случайную_точку_для_выхода_объекта:
; видимо нужно чтобы объект уходил в рандомную область экрана, когда перестает преследование
C - - - - - 0x01468C 05:867C: A5 23     LDA ram_рандом_байт
C - - - - - 0x01468E 05:867E: 29 03     AND #$03
C - - - - - 0x014690 05:8680: A8        TAY
C - - - - - 0x014691 05:8681: B9 8B 86  LDA tbl_868B_позиция_X_спрайта_игрока,Y
C - - - - - 0x014694 05:8684: 85 0B     STA ram_000B
C - - - - - 0x014696 05:8686: A9 FF     LDA #$FF    ; позиция_Y_спрайта_игрока
C - - - - - 0x014698 05:8688: 85 0C     STA ram_000C
C - - - - - 0x01469A 05:868A: 60        RTS

tbl_868B_позиция_X_спрайта_игрока:
- D 0 - - - 0x01469B 05:868B: 20        .byte $20   ; 00 
- D 0 - - - 0x01469C 05:868C: 60        .byte $60   ; 01 
- D 0 - - - 0x01469D 05:868D: A0        .byte $A0   ; 02 
- D 0 - - - 0x01469E 05:868E: E0        .byte $E0   ; 03 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8719:
C - - - - - 0x014729 05:8719: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x01472C 05:871C: F0 05     BEQ bra_8723
C - - - - - 0x01472E 05:871E: DE 80 07  DEC ram_0780_obj,X
C - - - - - 0x014731 05:8721: 09 04     ORA #$04
bra_8723:
C - - - - - 0x014733 05:8723: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x014736 05:8726: 60        RTS

; ******************************************************************************************************************

ofs_038_4E_868F_03:
; на входе - ram_счетчкик_жизни_объектов = 20
C - - J - - 0x01469F 05:868F: BD 72 07  LDA ram_0772_obj,X
                                        AND #$01
C - - - - - 0x0146A8 05:8698: 85 0A     STA ram_000A
C - - - - - 0x0146AE 05:869E: 20 F0 F4  JSR sub_0x01F4A5_определить_угол_и_сравнить_между_собой
                                        TAY
C - - - - - 0x0146B3 05:86A3: B9 D4 F4  LDA tbl_0x01F4E4_углы_направления_объекта,Y
C - - - - - 0x0146B6 05:86A6: A8        TAY
C - - - - - 0x0146B7 05:86A7: 85 17     STA ram_000E    ; ram_угол_направления_объекта
C - - - - - 0x0146B9 05:86A9: 20 BC 85  JSR sub_85BC
C - - - - - 0x0146BF 05:86AF: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0146C2 05:86B2: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x0146C5 05:86B5: F0 18     BEQ bra_86CF
C - - - - - 0x0146C7 05:86B7: BD F4 06  LDA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0146CA 05:86BA: C9 10     CMP #$10
C - - - - - 0x0146CC 05:86BC: D0 10     BNE bra_86CE_RTS
; 10, выстрел
                                        LDY #con_obj_id_02  ; обычная пуля объекта
                                        JSR sub_0x006BF8_поиск_пустого_слота_и_попытка_создать_пулю_на_позиции_текущего_объекта
                                        BCC bra_86CF
C - - - - - 0x0146CE 05:86BE: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта_объекта
                                        JSR sub_0x01F360_определить_множитель_скорости_пули_от_сложности_игры
                                        LDY ram_0017    ; точный угол от объекта до игрока
                                        LDX ram_0011    ; индекс нового объекта
                                        JSR sub_0x01F370_установить_скорость_пули_объекта
                                        LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x0146F9 05:86E9: A4 17     LDY ram_000E    ; ram_угол_направления_объекта
C - - - - - 0x0146D6 05:86C6: 20 E7 86  JSR sub_86EB_выровнить_позиции_спрайта_пули
C - - - - - 0x0146D9 05:86C9: A9 08     LDA #$08
C - - - - - 0x0146DB 05:86CB: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_86CE_RTS:
C - - - - - 0x0146DE 05:86CE: 60        RTS
bra_86CF:
                                        LDY ram_option_сложность
C - - - - - 0x0146DF 05:86CF: A5 23     LDA ram_рандом_байт
C - - - - - 0x0146E1 05:86D1: 65 1B     ADC ram_счетчик_кадров
C - - - - - 0x0146E3 05:86D3: 85 23     STA ram_рандом_байт
C - - - - - 0x0146E5 05:86D5: 29 1F     AND #$1F
                                        ADC tbl_86DE_кд_до_следующего_выстрела,Y
C - - - - - 0x0146E9 05:86D9: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0146EC 05:86DC: A9 02     LDA #$02
C - - - - - 0x0146EE 05:86DE: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

tbl_86DE_кд_до_следующего_выстрела:
                                        .byte $70   ; 00 normal
                                        .byte $48   ; 00 hard
                                        .byte $20   ; 00 insane

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_86EB_выровнить_позиции_спрайта_пули:
C D 0 - - - 0x0146FB 05:86EB: A9 06     LDA #$06
C - - - - - 0x0146FD 05:86ED: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x014700 05:86F0: A6 11     LDX ram_0011    ; загрузить индекс нового объекта
C - - - - - 0x014702 05:86F2: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014705 05:86F5: 18        CLC
C - - - - - 0x014706 05:86F6: 79 09 87  ADC tbl_8709_добавочная_позиция_Y,Y
C - - - - - 0x014709 05:86F9: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01470C 05:86FC: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01470F 05:86FF: 18        CLC
C - - - - - 0x014710 05:8700: 79 11 87  ADC tbl_8711_добавочная_позиция_X,Y
C - - - - - 0x014713 05:8703: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014716 05:8706: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x014718 05:8708: 60        RTS

tbl_8709_добавочная_позиция_Y:
- D 0 - - - 0x014719 05:8709: FC        .byte $FC   ; 00 
- D 0 - - - 0x01471A 05:870A: 03        .byte $03   ; 01 
- D 0 - - - 0x01471B 05:870B: 04        .byte $04   ; 02 
- D 0 - - - 0x01471C 05:870C: 03        .byte $03   ; 03 
- D 0 - - - 0x01471D 05:870D: FC        .byte $FC   ; 04 
- D 0 - - - 0x01471E 05:870E: F3        .byte $F3   ; 05 
- D 0 - - - 0x01471F 05:870F: F0        .byte $F0   ; 06 
- D 0 - - - 0x014720 05:8710: F3        .byte $F3   ; 07 

tbl_8711_добавочная_позиция_X:
- D 0 - - - 0x014721 05:8711: 08        .byte $08   ; 00 
- D 0 - - - 0x014722 05:8712: 08        .byte $08   ; 01 
- D 0 - - - 0x014723 05:8713: FD        .byte $FD   ; 02 
- D 0 - - - 0x014724 05:8714: F8        .byte $F8   ; 03 
- D 0 - - - 0x014725 05:8715: F8        .byte $F8   ; 04 
- D 0 - - - 0x014726 05:8716: F8        .byte $F8   ; 05 
- D 0 - - - 0x014727 05:8717: 03        .byte $03   ; 06 
- D 0 - - - 0x014728 05:8718: 08        .byte $08   ; 07 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x014011_1F_солдат_на_танке:
- D 0 - I - 0x014011 05:8001: 13 80     .word ofs_038_1F_8013_01_активация_объекта ; 
- D 0 - I - 0x014013 05:8003: 4B 80     .word ofs_038_1F_804B_02 ; 
- D 0 - I - 0x014015 05:8005: 60 80     .word ofs_038_1F_8060_03 ; 
- D 0 - I - 0x014017 05:8007: C7 80     .word ofs_038_1F_80C7_04 ; 
- D 0 - I - 0x014019 05:8009: 54 A3     .word ofs_038_1F_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам ; 
- D 0 - I - 0x01401B 05:800B: 6B A3     .word ofs_038_1F_0x00637B_06_маленькие_взрывы_объектов ; 
- D 0 - I - 0x01401D 05:800D: 4F 81     .word ofs_038_1F_814F_07 ; 
- D 0 - I - 0x01401F 05:800F: FD A2     .word ofs_038_1F_0x00630D_08_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x014021 05:8011: 3D A3     .word ofs_038_1F_0x00628A_09_удалить_объект ;

; ******************************************************************************************************************

ofs_038_1F_8013_01_активация_объекта:
C - - J - - 0x014023 05:8013: A9 10     LDA #$10
C - - - - - 0x014025 05:8015: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
                                        JSR sub_0x006AEA_выбрать_рандомного_игрока
                                        STA ram_0764_obj,X  ; отложить индекс игрока
C - - - - - 0x014028 05:8018: A9 85     LDA #$85
C - - - - - 0x01402A 05:801A: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x01402D 05:801D: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014030 05:8020: 18        CLC
C - - - - - 0x014031 05:8021: 69 08     ADC #$08
C - - - - - 0x014033 05:8023: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014036 05:8026: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014039 05:8029: 18        CLC
C - - - - - 0x01403A 05:802A: 69 04     ADC #$04
C - - - - - 0x01403C 05:802C: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01403F 05:802F: A9 04     LDA #$04
C - - - - - 0x014041 05:8031: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x014044 05:8034: A9 1B     LDA #$1B    ; счетчик перед первым выстрелом из автомата
C - - - - - 0x014046 05:8036: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x014049 05:8039: A9 06     LDA #$06
C - - - - - 0x01404B 05:803B: 9D 48 07  STA ram_счетчик_поворота_объекта,X
C - - - - - 0x01404E 05:803E: A9 03     LDA #$02
C - - - - - 0x014050 05:8040: 9D 56 07  STA ram_угол_направления_объекта,X
C - - - - - 0x014053 05:8043: E6 9F     INC ram_009F
C - - - - - 0x014055 05:8045: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014058 05:8048: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_1F_804B_02:
C - - J - - 0x01405B 05:804B: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x01405E 05:804E: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014061 05:8051: C9 20     CMP #$20
C - - - - - 0x014063 05:8053: 90 0A     BCC bra_805F_RTS
C - - - - - 0x014065 05:8055: A9 05     LDA #$05
C - - - - - 0x014067 05:8057: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x01406A 05:805A: A9 10     LDA #$10    ; счетчик перед первым выстрелом из танка
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_805F_RTS:
C - - - - - 0x01406F 05:805F: 60        RTS

; ******************************************************************************************************************

ofs_038_1F_8060_03:
C - - J - - 0x014070 05:8060: BC 56 07  LDY ram_угол_направления_объекта,X
C - - - - - 0x014073 05:8063: B9 B7 80  LDA tbl_80B7_кадры_анимации,Y
C - - - - - 0x014076 05:8066: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x014079 05:8069: B9 BF 80  LDA tbl_80BF_аттрибуты_спрайта,Y
C - - - - - 0x01407C 05:806C: 20 19 87  JSR sub_8719
C - - - - - 0x01407F 05:806F: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

                                        LDA ram_счетчкик_жизни_объектов,X
                                        BEQ bra_8077
C - - - - - 0x014082 05:8072: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
bra_8077:
C - - - - - 0x01408E 05:807E: BD 64 07  LDA ram_0764_obj,X  ; отложенный индекс игрока
C - - - - - 0x014091 05:8081: 85 0A     STA ram_000A    ; индекс игрока
                                        JSR sub_0x01F4A5_определить_угол_и_сравнить_между_собой
                                        BNE bra_8093_повернуть_объект
; углы совпали
                                        LDA tbl_0x01F4E4_углы_направления_объекта,Y
C - - - - - 0x01408A 05:807A: C9 06     CMP #$06    ; игрок ровно над пулеметчиком
C - - - - - 0x01408C 05:807C: F0 15     BEQ bra_80A7_ожидание_выстрела_из_танка
; попытка выстрела
                                        LDA ram_счетчкик_жизни_объектов,X
                                        BNE bra_80A7_ожидание_выстрела_из_танка
                                        LDY #con_obj_id_02  ; обычная пуля объекта
                                        JSR sub_0x006BF8_поиск_пустого_слота_и_попытка_создать_пулю_на_позиции_текущего_объекта
                                        BCC bra_80A7_ожидание_выстрела_из_танка
                                        JSR sub_0x006ABE_копировать_позиции_спрайта_объекта
                                        JSR sub_0x01F360_определить_множитель_скорости_пули_от_сложности_игры
                                        LDY ram_0017    ; точный угол от объекта до игрока
                                        LDX ram_0011    ; загрузить индекс нового объекта
                                        JSR sub_0x01F370_установить_скорость_пули_объекта
                                        LDX ram_0010    ; загрузить индекс объекта
                                        
C - - - - - 0x01409B 05:808B: 20 66 81  JSR sub_8166_выровнить_позиции_спрайта_пули
                                        JSR sub_0x006AEA_выбрать_рандомного_игрока
C - - - - - 0x0140B1 05:80A1: 9D 64 07  STA ram_0764_obj,X  ; отложить индекс игрока
C - - - - - 0x01409E 05:808E: A9 4D     LDA #$4D
C - - - - - 0x0140A0 05:8090: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
                                        BNE bra_80A7_ожидание_выстрела_из_танка    ; jmp
bra_8093_повернуть_объект:
C - - - - - 0x0140A3 05:8093: DE 02 07  DEC ram_счетчик_анимации_объектов,X
C - - - - - 0x0140A6 05:8096: D0 0F     BNE bra_80A7_ожидание_выстрела_из_танка
C - - - - - 0x0140A8 05:8098: A9 08     LDA #$08
C - - - - - 0x0140AA 05:809A: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x0140B4 05:80A4: 20 95 F4  JSR sub_0x01F4A7_определить_сторону_поворота_и_повернуть_объект
bra_80A7_ожидание_выстрела_из_танка:
C - - - - - 0x0140B7 05:80A7: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0140BA 05:80AA: D0 0A     BNE bra_80B6_RTS
C - - - - - 0x0140BC 05:80AC: A9 00     LDA #$00
C - - - - - 0x0140BE 05:80AE: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0140C1 05:80B1: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_80B6_RTS:
C - - - - - 0x0140C6 05:80B6: 60        RTS

tbl_80B7_кадры_анимации:
- D 0 - - - 0x0140C7 05:80B7: 53        .byte $53   ; 00 
- D 0 - - - 0x0140C8 05:80B8: 52        .byte $52   ; 01 
- D 0 - - - 0x0140C9 05:80B9: 51        .byte $51   ; 02 
- D 0 - - - 0x0140CA 05:80BA: 52        .byte $52   ; 03 
- D 0 - - - 0x0140CB 05:80BB: 53        .byte $53   ; 04 
- - - - - - 0x0140CC 05:80BC: 53        .byte $53   ; 05 
- - - - - - 0x0140CD 05:80BD: 53        .byte $53   ; 06 
- - - - - - 0x0140CE 05:80BE: 53        .byte $53   ; 07 

tbl_80BF_аттрибуты_спрайта:
- D 0 - - - 0x0140CF 05:80BF: 40        .byte $40   ; 00 
- D 0 - - - 0x0140D0 05:80C0: 40        .byte $40   ; 01 
- D 0 - - - 0x0140D1 05:80C1: 00        .byte $00   ; 02 
- D 0 - - - 0x0140D2 05:80C2: 00        .byte $00   ; 03 
- D 0 - - - 0x0140D3 05:80C3: 00        .byte $00   ; 04 
- - - - - - 0x0140D4 05:80C4: 00        .byte $00   ; 05 
- - - - - - 0x0140D5 05:80C5: 00        .byte $00   ; 06 
- - - - - - 0x0140D6 05:80C6: 40        .byte $40   ; 07 

; ******************************************************************************************************************

ofs_038_1F_80C7_04:
; выстрел из танка
C - - J - - 0x0140D7 05:80C7: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0140DA 05:80CA: C9 C0     CMP #$C0
C - - - - - 0x0140DC 05:80CC: 90 03     BCC bra_80D1
- - - - - - 0x0140DE 05:80CE: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_80D1:
C - - - - - 0x0140E1 05:80D1: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0140E4 05:80D4: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0140E7 05:80D7: D0 64     BNE bra_813D_RTS
C - - - - - 0x0140E9 05:80D9: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0140EC 05:80DC: 0A        ASL
C - - - - - 0x0140ED 05:80DD: A8        TAY
C - - - - - 0x0140EE 05:80DE: B9 4B 81  LDA tbl_814B_блоки_фона,Y
C - - - - - 0x0140F1 05:80E1: 85 08     STA ram_0008
C - - - - - 0x0140F3 05:80E3: B9 4C 81  LDA tbl_814B_блоки_фона + $01,Y
C - - - - - 0x0140F6 05:80E6: 85 0C     STA ram_000C
C - - - - - 0x0140F8 05:80E8: A9 11     LDA #$11
C - - - - - 0x0140FA 05:80EA: 85 0D     STA ram_000D
C - - - - - 0x0140FC 05:80EC: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0140FF 05:80EF: 69 08     ADC #$08
C - - - - - 0x014101 05:80F1: A8        TAY
C - - - - - 0x014102 05:80F2: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014105 05:80F5: E9 08     SBC #$08
C - - - - - 0x014107 05:80F7: 20 B2 A8  JSR sub_0x0068C2
C - - - - - 0x01410A 05:80FA: A9 01     LDA #$01
C - - - - - 0x01410C 05:80FC: B0 3C     BCS bra_813A
C - - - - - 0x01410E 05:80FE: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x014111 05:8101: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x014114 05:8104: C9 02     CMP #$02
C - - - - - 0x014116 05:8106: B0 36     BCS bra_813E
C - - - - - 0x014118 05:8108: A9 02     LDA #$02
C - - - - - 0x01411A 05:810A: 85 08     STA ram_0008
bra_810C_loop:
C - - - - - 0x01411C 05:810C: A0 30     LDY #con_obj_id_21
C - - - - - 0x01411E 05:810E: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x014121 05:8111: 90 2A     BCC bra_813D_RTS
C - - - - - 0x014123 05:8113: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014126 05:8116: 18        CLC
C - - - - - 0x014127 05:8117: 69 1C     ADC #$1A    ; добавочная_позиция_Y
C - - - - - 0x014129 05:8119: 85 09     STA ram_0009
C - - - - - 0x01412B 05:811B: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01412E 05:811E: A6 11     LDX ram_0011    ; загрузить индекс нового объекта
C - - - - - 0x014130 05:8120: A4 08     LDY ram_0008
C - - - - - 0x014132 05:8122: 18        CLC
C - - - - - 0x014133 05:8123: 79 48 81  ADC tbl_8148_добавочная_позиция_X,Y
C - - - - - 0x014136 05:8126: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014139 05:8129: A5 09     LDA ram_0009
C - - - - - 0x01413B 05:812B: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01413E 05:812E: 98        TYA
C - - - - - 0x01413F 05:812F: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x014142 05:8132: C6 08     DEC ram_0008
C - - - - - 0x014144 05:8134: 10 D6     BPL bra_810C_loop
C - - - - - 0x014146 05:8136: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x014148 05:8138: A9 08     LDA #$08
bra_813A:
C - - - - - 0x01414A 05:813A: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_813D_RTS:
C - - - - - 0x01414D 05:813D: 60        RTS
bra_813E:
C - - - - - 0x01414E 05:813E: A9 60     LDA #$60    ; кд перед следующим выстрелом
C - - - - - 0x014150 05:8140: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x014153 05:8143: A9 03     LDA #$03
C - - - - - 0x014155 05:8145: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

tbl_8148_добавочная_позиция_X:
- D 0 - - - 0x014158 05:8148: F4        .byte $F7   ; 00 
- D 0 - - - 0x014159 05:8149: 0C        .byte $0B   ; 01 
- D 0 - - - 0x01415A 05:814A: 00        .byte $01   ; 02 

tbl_814B_блоки_фона:
;                                              +---------- 
;                                              |    +----- 
;                                              |    |
- D 0 - - - 0x01415B 05:814B: 69        .byte $69, $6A   ; 00 
- D 0 - - - 0x01415D 05:814D: 46        .byte $46, $47   ; 01 

; ******************************************************************************************************************

ofs_038_1F_814F_07:
C - - J - - 0x01415F 05:814F: C6 9F     DEC ram_009F
C - - - - - 0x014161 05:8151: D0 06     BNE bra_8159
C - - - - - 0x014163 05:8153: A9 40     LDA #$40
C - - - - - 0x014165 05:8155: 85 7D     STA ram_007D_тип_скролла
C - - - - - 0x014167 05:8157: 85 71     STA ram_0071_тип_скролла
bra_8159:
C - - - - - 0x01416B 05:815B: 20 46 A8  JSR sub_A844
C - - - - - 0x01416E 05:815E: B0 03     BCS bra_8163
C - - - - - 0x014170 05:8160: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта
bra_8163:
- - - - - - 0x014173 05:8163: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_A844:
                                        LDA ram_index_ppu_buffer
                                        CMP #$01
                                        BCS bra_A88B
C - - - - - 0x00685A 01:A84A: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00685D 01:A84D: 85 12     STA ram_0012    ; позиция_y_спрайта
C - - - - - 0x00685F 01:A84F: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x006862 01:A852: 85 13     STA ram_0013    ; позиция_x_спрайта
C - - - - - 0x00686A 01:A85A: A0 03     LDY #$03
bra_A85C_loop:
C - - - - - 0x00686C 01:A85C: 84 0F     STY ram_000F
C - - - - - 0x006873 01:A863: B9 8E A8  LDA tbl_A88E,Y
C - - - - - 0x006876 01:A866: 85 08     STA ram_0008
C - - - - - 0x006878 01:A868: A5 12     LDA ram_0012    ; позиция_y_спрайта
C - - - - - 0x00687A 01:A86A: 79 92 A8  ADC tbl_A892,Y
C - - - - - 0x00687D 01:A86D: 85 0C     STA ram_000C
C - - - - - 0x00687F 01:A86F: A5 13     LDA ram_0013    ; позиция_x_спрайта
C - - - - - 0x006881 01:A871: 79 96 A8  ADC tbl_A896,Y
C - - - - - 0x006884 01:A874: A4 0C     LDY ram_000C
C - - - - - 0x006886 01:A876: 20 A4 FE  JSR sub_0x01FEB4_подготовка_и_выбор_банков_для_перерисовки_части_фона_через_буфер
C - - - - - 0x006889 01:A879: 8A        TXA
C - - - - - 0x00688A 01:A87A: 38        SEC
C - - - - - 0x00688B 01:A87B: E9 04     SBC #$04
C - - - - - 0x00688D 01:A87D: 85 1E     STA ram_index_ppu_buffer
C - - - - - 0x00688F 01:A87F: AA        TAX
C - - - - - 0x006890 01:A880: A9 FF     LDA #$FF
C - - - - - 0x006892 01:A882: 9D FF 02  STA ram_nmt_buffer - $01,X
C - - - - - 0x006895 01:A885: A4 0F     LDY ram_000F
C - - - - - 0x006897 01:A887: 88        DEY
C - - - - - 0x006898 01:A888: 10 D2     BPL bra_A85C_loop
C - - - - - 0x00689A 01:A88A: 18        CLC
bra_A88B:
C - - - - - 0x00689B 01:A88B: A6 10     LDX ram_0010
C - - - - - 0x00689D 01:A88D: 60        RTS

tbl_A88E:
- D 1 - - - 0x00689E 01:A88E: 65        .byte $65   ; 00 
- D 1 - - - 0x00689F 01:A88F: 66        .byte $66   ; 01 
- D 1 - - - 0x0068A0 01:A890: 67        .byte $67   ; 02 
- D 1 - - - 0x0068A1 01:A891: 68        .byte $68   ; 03 

tbl_A892:
- D 1 - - - 0x0068A2 01:A892: F0        .byte $F0   ; 00 
- D 1 - - - 0x0068A3 01:A893: F0        .byte $F0   ; 01 
- D 1 - - - 0x0068A4 01:A894: 10        .byte $10   ; 02 
- D 1 - - - 0x0068A5 01:A895: 10        .byte $10   ; 03 

tbl_A896:
- D 1 - - - 0x0068A6 01:A896: F0        .byte $F0   ; 00 
- D 1 - - - 0x0068A7 01:A897: 10        .byte $10   ; 01 
- D 1 - - - 0x0068A8 01:A898: F0        .byte $F0   ; 02 
- D 1 - - - 0x0068A9 01:A899: 10        .byte $10   ; 03 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8166_выровнить_позиции_спрайта_пули:
C - - - - - 0x014178 05:8168: A9 06     LDA #$06
C - - - - - 0x01417A 05:816A: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x01417D 05:816D: BC 56 07  LDY ram_угол_направления_объекта,X
C - - - - - 0x014180 05:8170: A6 11     LDX ram_0011    ; загрузить индекс нового объекта
C - - - - - 0x014182 05:8172: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014185 05:8175: 18        CLC
C - - - - - 0x014186 05:8176: 79 89 81  ADC tbl_8189_позиция_Y,Y
C - - - - - 0x014189 05:8179: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01418C 05:817C: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01418F 05:817F: 18        CLC
C - - - - - 0x014190 05:8180: 79 91 81  ADC tbl_8191_позиция_X,Y
C - - - - - 0x014193 05:8183: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014196 05:8186: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x014198 05:8188: 60        RTS

tbl_8189_позиция_Y:
- D 0 - - - 0x014199 05:8189: F6        .byte $F6   ; 00 
- D 0 - - - 0x01419A 05:818A: 00        .byte $01   ; 01 
- D 0 - - - 0x01419B 05:818B: 02        .byte $03   ; 02 
- D 0 - - - 0x01419C 05:818C: 00        .byte $01   ; 03 
- D 0 - - - 0x01419D 05:818D: F6        .byte $F7   ; 04 
- - - - - - 0x01419E 05:818E: F6        .byte $F6   ; 05 
- - - - - - 0x01419F 05:818F: F6        .byte $F6   ; 06 
- - - - - - 0x0141A0 05:8190: F6        .byte $F6   ; 07 

tbl_8191_позиция_X:
- D 0 - - - 0x0141A1 05:8191: 0E        .byte $0E   ; 00 
- D 0 - - - 0x0141A2 05:8192: 0C        .byte $0A   ; 01 
- D 0 - - - 0x0141A3 05:8193: 00        .byte $01   ; 02 
- D 0 - - - 0x0141A4 05:8194: F4        .byte $F7   ; 03 
- D 0 - - - 0x0141A5 05:8195: F2        .byte $F5   ; 04 
- - - - - - 0x0141A6 05:8196: F2        .byte $F2   ; 05 
- - - - - - 0x0141A7 05:8197: 00        .byte $00   ; 06 
- - - - - - 0x0141A8 05:8198: 0E        .byte $0E   ; 07 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0101C2_25_летающий_стреляющий_солдат:
- D 0 - I - 0x0101C2 04:81B2: BE 81     .word ofs_038_25_81BE_01_активация_объекта ; 
- D 0 - I - 0x0101C4 04:81B4: E1 81     .word ofs_038_25_81E1_02 ; 
- D 0 - I - 0x0101C6 04:81B6: FF 81     .word ofs_038_25_81FF_03 ; 
- D 0 - I - 0x0101C8 04:81B8: 9A A2     .word ofs_038_25_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x0101CA 04:81BA: FD A2     .word ofs_038_25_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x0101CC 04:81BC: 3D A3     .word ofs_038_25_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_25_81BE_01_активация_объекта:
C - - J - - 0x0101CE 04:81BE: A9 C8     LDA #$C8
C - - - - - 0x0101D0 04:81C0: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0101D3 04:81C3: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0101D6 04:81C6: A0 00     LDY #$00
C - - - - - 0x0101D8 04:81C8: 20 D0 81  JSR sub_81D0_установить_скорость_Y
C - - - - - 0x0101DB 04:81CB: A9 60     LDA #$60    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_81D0_установить_скорость_Y:
C - - - - - 0x0101E0 04:81D0: B9 DD 81  LDA tbl_81DD_скорость_Y,Y
C - - - - - 0x0101E3 04:81D3: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0101E6 04:81D6: B9 DE 81  LDA tbl_81DD_скорость_Y + $01,Y
C - - - - - 0x0101E9 04:81D9: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0101EC 04:81DC: 60        RTS

tbl_81DD_скорость_Y:
- D 0 - - - 0x0101ED 04:81DD: 00 FF     .word $FF00 ; 00 
- D 0 - - - 0x0101EF 04:81DF: 00 01     .word $0100 ; 02 

; ******************************************************************************************************************

ofs_038_25_81E1_02:
C - - J - - 0x0101F1 04:81E1: 20 1C 82  JSR sub_821C
C - - - - - 0x0101F4 04:81E4: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x0101F7 04:81E7: 20 38 82  JSR sub_8238
C - - - - - 0x0101FA 04:81EA: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0101FD 04:81ED: C9 20     CMP #$20
C - - - - - 0x0101FF 04:81EF: B0 0D     BCS bra_81FE_RTS
C - - - - - 0x010201 04:81F1: A0 02     LDY #$02
C - - - - - 0x010203 04:81F3: 20 D0 81  JSR sub_81D0_установить_скорость_Y
C - - - - - 0x010206 04:81F6: A9 90     LDA #$90
C - - - - - 0x010208 04:81F8: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x01020B 04:81FB: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_81FE_RTS:
C - - - - - 0x01020E 04:81FE: 60        RTS

; ******************************************************************************************************************

ofs_038_25_81FF_03:
C - - J - - 0x01020F 04:81FF: 20 1C 82  JSR sub_821C
C - - - - - 0x010212 04:8202: A0 FC     LDY #$FC
C - - - - - 0x010214 04:8204: 20 8E A9  JSR sub_0x00699E
C - - - - - 0x010217 04:8207: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x01021A 04:820A: 20 38 82  JSR sub_8238
C - - - - - 0x01021D 04:820D: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x010220 04:8210: 30 EC     BMI bra_81FE_RTS
C - - - - - 0x010222 04:8212: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010225 04:8215: C9 D0     CMP #$D0
C - - - - - 0x010227 04:8217: 90 E5     BCC bra_81FE_RTS
C - - - - - 0x010229 04:8219: 4C EE A7  JMP loc_0x0067FE_отразить_скорость_по_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_821C:
C - - - - - 0x01022C 04:821C: A0 0C     LDY #$0C
C - - - - - 0x01022E 04:821E: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x010231 04:8221: 20 24 AB  JSR sub_0x006B34_выбрать_ближайшего_игрока_по_оси_y
C - - - - - 0x010234 04:8224: 98        TYA
C - - - - - 0x010235 04:8225: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x010238 04:8228: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01023B 04:822B: D9 4C 05  CMP ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x01023E 04:822E: A9 41     LDA #$41
C - - - - - 0x010240 04:8230: 90 02     BCC bra_8234
C - - - - - 0x010242 04:8232: A9 01     LDA #$01
bra_8234:
C - - - - - 0x010244 04:8234: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x010247 04:8237: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8238:
C - - - - - 0x010248 04:8238: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x01024B 04:823B: D0 28     BNE bra_8265_RTS
C - - - - - 0x01024D 04:823D: A9 67     LDA #$67
C - - - - - 0x01024F 04:823F: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x010252 04:8242: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010255 04:8245: 38        SEC
C - - - - - 0x010256 04:8246: E9 10     SBC #$10
C - - - - - 0x010258 04:8248: 85 08     STA ram_0008
C - - - - - 0x01025A 04:824A: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x01025D 04:824D: 0A        ASL
C - - - - - 0x01025E 04:824E: 0A        ASL
C - - - - - 0x01025F 04:824F: A9 0A     LDA #$0A
C - - - - - 0x010261 04:8251: B0 02     BCS bra_8255
C - - - - - 0x010263 04:8253: A9 F6     LDA #$F6
bra_8255:
C - - - - - 0x010265 04:8255: 18        CLC
C - - - - - 0x010266 04:8256: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010269 04:8259: 85 09     STA ram_0009
C - - - - - 0x01026B 04:825B: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x01026E 04:825E: 85 0A     STA ram_000A
C - - - - - 0x010270 04:8260: A0 02     LDY #$02
C - - - - - 0x010272 04:8262: 4C 27 F3  JMP loc_0x01F337
bra_8265_RTS:
C - - - - - 0x010275 04:8265: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x010276_43_дверь_спавнер_выбегающих_солдат:
- D 0 - I - 0x010276 04:8266: 6E 82     .word ofs_038_43_826E_01_активация_объекта ; 
- D 0 - I - 0x010278 04:8268: 79 82     .word ofs_038_43_8279_02 ; 
- D 0 - I - 0x01027A 04:826A: 86 82     .word ofs_038_43_8286_03 ; 
- D 0 - I - 0x01027C 04:826C: AF 82     .word ofs_038_43_82AF_04 ; 

; ******************************************************************************************************************

ofs_038_43_826E_01_активация_объекта:
C - - J - - 0x01027E 04:826E: A9 81     LDA #$81
C - - - - - 0x010280 04:8270: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x010283 04:8273: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x010286 04:8276: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_43_8279_02:
C - - J - - 0x010289 04:8279: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x01028C 04:827C: 20 18 84  JSR sub_0x008418
C - - - - - 0x01028F 04:827F: B0 2D     BCS bra_82AE_RTS
C - - - - - 0x010291 04:8281: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_43_8286_03:
C - - J - - 0x010296 04:8286: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x010299 04:8289: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x01029C 04:828C: D0 20     BNE bra_82AE_RTS
C - - - - - 0x01029E 04:828E: 20 E4 82  JSR sub_82E4
C - - - - - 0x0102A1 04:8291: A9 01     LDA #$01
C - - - - - 0x0102A3 04:8293: B0 16     BCS bra_82AB
C - - - - - 0x0102A5 04:8295: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0102A8 04:8298: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0102AB 04:829B: C9 03     CMP #$03
C - - - - - 0x0102AD 04:829D: A9 0A     LDA #$0A
C - - - - - 0x0102AF 04:829F: 90 0A     BCC bra_82AB
C - - - - - 0x0102B1 04:82A1: A9 03     LDA #$03
C - - - - - 0x0102B3 04:82A3: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0102B6 04:82A6: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_82AB:
C - - - - - 0x0102BB 04:82AB: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_82AE_RTS:
C - - - - - 0x0102BE 04:82AE: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_82E4:
C - - - - - 0x0102F4 04:82E4: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0102F7 04:82E7: 0A        ASL
C - - - - - 0x0102F8 04:82E8: A8        TAY
C - - - - - 0x0102F9 04:82E9: B9 F7 82  LDA tbl_82F6 + $01,Y
C - - - - - 0x0102FC 04:82EC: 85 0C     STA ram_000C
C - - - - - 0x0102FE 04:82EE: B9 F6 82  LDA tbl_82F6,Y
C - - - - - 0x010301 04:82F1: A0 1F     LDY #$1F
C - - - - - 0x010303 04:82F3: 4C A8 A8  JMP loc_0x0068B8

tbl_82F6:
;                                              +---------- 
;                                              |    +----- 
;                                              |    |
- D 0 - - - 0x010306 04:82F6: 61        .byte $61, $75   ; 00 
- D 0 - - - 0x010308 04:82F8: 76        .byte $76, $77   ; 01 
- D 0 - - - 0x01030A 04:82FA: 78        .byte $78, $79   ; 02 

; ******************************************************************************************************************

ofs_038_43_82AF_04:
C - - J - - 0x0102BF 04:82AF: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0102C2 04:82B2: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0102C5 04:82B5: D0 F7     BNE bra_82AE_RTS
C - - - - - 0x0102C7 04:82B7: A9 10     LDA #$10
C - - - - - 0x0102C9 04:82B9: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0102CC 04:82BC: A0 03     LDY #con_obj_id_03  ; обычный бегающий солдат
C - - - - - 0x0102CE 04:82BE: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0102D1 04:82C1: 90 19     BCC bra_82DC
C - - - - - 0x0102D3 04:82C3: A4 11     LDY ram_0011
C - - - - - 0x0102D5 04:82C5: A9 81     LDA #$81
C - - - - - 0x0102D7 04:82C7: 99 1E 07  STA ram_флаги_объектов,Y
C - - - - - 0x0102DA 04:82CA: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0102DD 04:82CD: 18        CLC
C - - - - - 0x0102DE 04:82CE: 69 18     ADC #$18
C - - - - - 0x0102E0 04:82D0: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x0102E3 04:82D3: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0102E6 04:82D6: 18        CLC
C - - - - - 0x0102E7 04:82D7: 69 04     ADC #$04
C - - - - - 0x0102E9 04:82D9: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
bra_82DC:
C - - - - - 0x0102EC 04:82DC: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x0102EF 04:82DF: D0 CD     BNE bra_82AE_RTS
C - - - - - 0x0102F1 04:82E1: 4C 75 A2  JMP loc_0x00628A_удалить_объект

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B872_0D_бетонная_дверь_или_ворота:
- D 1 - I - 0x007882 01:B872: 84 B8     .word ofs_038_0D_B884_01_активация_объекта ; 
- D 1 - I - 0x007884 01:B874: A9 B8     .word ofs_038_0D_B8A9_02 ; 
- D 1 - I - 0x007886 01:B876: BC B8     .word ofs_038_0D_0x0066C7_03_прибавить_позицию_спрайта_к_скорости_камеры_X_Y ; 
- D 1 - I - 0x007888 01:B878: 5E A3     .word ofs_038_0D_0x00636E_04_подготовить_к_взрывам ; 
- D 1 - I - 0x00788A 01:B87A: 6B A3     .word ofs_038_0D_0x00637B_05_маленькие_взрывы_объектов ; 
- D 1 - I - 0x00788C 01:B87C: BF B8     .word ofs_038_0D_B8BF_06 ; 
- D 1 - I - 0x00788E 01:B87E: 19 B9     .word ofs_038_0D_B919_07 ; 
- D 1 - I - 0x007890 01:B880: FD A2     .word ofs_038_0D_0x00630D_08_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x007892 01:B882: 3D A3     .word ofs_038_0D_0x00628A_09_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_0D_B884_01_активация_объекта:
C - - J - - 0x007894 01:B884: A9 01     LDA #$01
C - - - - - 0x007896 01:B886: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x007899 01:B889: A9 10     LDA #$10
C - - - - - 0x00789B 01:B88B: 9D 76 06  STA ram_жизни_объектов_8bit,X
C - - - - - 0x00789E 01:B88E: A9 89     LDA #$89
C - - - - - 0x0078A0 01:B890: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0078A3 01:B893: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0078A6 01:B896: 29 01     AND #$01
C - - - - - 0x0078A8 01:B898: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x0078AB 01:B89B: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0078AE 01:B89E: 69 08     ADC #$08
C - - - - - 0x0078B0 01:B8A0: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0078B3 01:B8A3: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0078B6 01:B8A6: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0D_B8A9_02:
C - - J - - 0x0078B9 01:B8A9: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0078BC 01:B8AC: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0078BF 01:B8AF: C9 20     CMP #$20
C - - - - - 0x0078C1 01:B8B1: 90 08     BCC bra_B8BB_RTS
C - - - - - 0x0078C3 01:B8B3: A9 09     LDA #$09
C - - - - - 0x0078C5 01:B8B5: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0078C8 01:B8B8: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_B8BB_RTS:
C - - - - - 0x0078CB 01:B8BB: 60        RTS

; ******************************************************************************************************************

ofs_038_0D_B8BF_06:
C - - J - - 0x0078CF 01:B8BF: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0078D2 01:B8C2: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0078D5 01:B8C5: D0 21     BNE bra_B8E8
C - - - - - 0x0078D7 01:B8C7: A9 FF     LDA #$FF
C - - - - - 0x0078D9 01:B8C9: 85 2F     STA ram_002F
C - - - - - 0x0078DB 01:B8CB: A0 05     LDY #$05
C - - - - - 0x0078DD 01:B8CD: A9 55     LDA #$55
bra_B8CF_loop:
C - - - - - 0x0078DF 01:B8CF: 99 D0 07  STA ram_07D0,Y
C - - - - - 0x0078E2 01:B8D2: 88        DEY
C - - - - - 0x0078E3 01:B8D3: 10 FA     BPL bra_B8CF_loop
C - - - - - 0x0078E5 01:B8D5: A0 20     LDY #$20
bra_B8D7_loop:
C - - - - - 0x0078E7 01:B8D7: A9 00     LDA #$00
C - - - - - 0x0078E9 01:B8D9: 99 03 04  STA ram_0403,Y
C - - - - - 0x0078EC 01:B8DC: 99 04 04  STA ram_0404,Y
C - - - - - 0x0078EF 01:B8DF: 98        TYA
C - - - - - 0x0078F0 01:B8E0: 38        SEC
C - - - - - 0x0078F1 01:B8E1: E9 08     SBC #$08
C - - - - - 0x0078F3 01:B8E3: A8        TAY
C - - - - - 0x0078F4 01:B8E4: 10 F1     BPL bra_B8D7_loop
C - - - - - 0x0078F6 01:B8E6: 30 13     BMI bra_B8FB    ; jmp
bra_B8E8:
C - - - - - 0x0078F8 01:B8E8: A0 10     LDY #$10
bra_B8EA_loop:
C - - - - - 0x0078FA 01:B8EA: A9 10     LDA #$10
C - - - - - 0x0078FC 01:B8EC: 99 4B 04  STA ram_044B,Y
C - - - - - 0x0078FF 01:B8EF: A9 01     LDA #$01
C - - - - - 0x007901 01:B8F1: 99 4C 04  STA ram_044C,Y
C - - - - - 0x007904 01:B8F4: 98        TYA
C - - - - - 0x007905 01:B8F5: 38        SEC
C - - - - - 0x007906 01:B8F6: E9 08     SBC #$08
C - - - - - 0x007908 01:B8F8: A8        TAY
C - - - - - 0x007909 01:B8F9: 10 EF     BPL bra_B8EA_loop
bra_B8FB:
C - - - - - 0x00790B 01:B8FB: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00790E 01:B8FE: 4A        LSR
C - - - - - 0x00790F 01:B8FF: B0 08     BCS bra_B909
C - - - - - 0x007911 01:B901: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007914 01:B904: 69 10     ADC #$10
C - - - - - 0x007916 01:B906: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
bra_B909:
C - - - - - 0x007919 01:B909: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00791C 01:B90C: E9 10     SBC #$10
C - - - - - 0x00791E 01:B90E: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x007921 01:B911: A9 02     LDA #$02
C - - - - - 0x007923 01:B913: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x007926 01:B916: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0D_B919_07:
C - - J - - 0x007929 01:B919: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00792C 01:B91C: F0 02     BEQ bra_B920
C - - - - - 0x00792E 01:B91E: A9 03     LDA #$03
bra_B920:
C - - - - - 0x007930 01:B920: 18        CLC
C - - - - - 0x007931 01:B921: 7D 48 07  ADC ram_скролл_объекта_Y,X
C - - - - - 0x007934 01:B924: A8        TAY
C - - - - - 0x007935 01:B925: B9 5F B9  LDA tbl_B95F,Y
C - - - - - 0x007938 01:B928: F0 0C     BEQ bra_B936
C - - - - - 0x00793A 01:B92A: 85 0C     STA ram_000C
C - - - - - 0x00793C 01:B92C: B9 59 B9  LDA tbl_B959,Y
C - - - - - 0x00793F 01:B92F: A0 01     LDY #$01
C - - - - - 0x007941 01:B931: 20 A8 A8  JSR sub_0x0068B8
C - - - - - 0x007944 01:B934: B0 20     BCS bra_B956
bra_B936:
C - - - - - 0x007946 01:B936: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007949 01:B939: E9 1F     SBC #$1F
C - - - - - 0x00794B 01:B93B: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00794E 01:B93E: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x007951 01:B941: 10 13     BPL bra_B956
C - - - - - 0x007953 01:B943: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007956 01:B946: 69 50     ADC #$50
C - - - - - 0x007958 01:B948: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00795B 01:B94B: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00795E 01:B94E: 69 10     ADC #$10
C - - - - - 0x007960 01:B950: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x007963 01:B953: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта
bra_B956:
C - - - - - 0x007966 01:B956: 4C B7 A6  JMP sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

tbl_B959:
; 00 
- D 1 - - - 0x007969 01:B959: 6C        .byte $6C   ; 00 
- D 1 - - - 0x00796A 01:B95A: 6D        .byte $6D   ; 01 
- D 1 - - - 0x00796B 01:B95B: C3        .byte $C3   ; 02 
; 02 
- - - - - - 0x00796C 01:B95C: 00        .byte $00   ; 00 
- D 1 - - - 0x00796D 01:B95D: 70        .byte $70   ; 01 
- D 1 - - - 0x00796E 01:B95E: 74        .byte $74   ; 02 

tbl_B95F:
; 00 
- D 1 - - - 0x00796F 01:B95F: C5        .byte $C5   ; 00 
- D 1 - - - 0x007970 01:B960: C6        .byte $C6   ; 01 
- D 1 - - - 0x007971 01:B961: C4        .byte $C4   ; 02 
; 02 
- D 1 - - - 0x007972 01:B962: 00        .byte $00   ; 00 
- D 1 - - - 0x007973 01:B963: 71        .byte $71   ; 01 
- D 1 - - - 0x007974 01:B964: 75        .byte $75   ; 02 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x014C67_1D_падающая_платформа:
- D 0 - I - 0x014C67 05:8C57: 63 8C     .word ofs_038_1D_8C63_01_активация_объекта ; 
- D 0 - I - 0x014C69 05:8C59: 76 8C     .word ofs_038_1D_8C76_02 ; 
- D 0 - I - 0x014C6B 05:8C5B: 85 8C     .word ofs_038_1D_8C85_03 ; 
- D 0 - I - 0x014C6D 05:8C5D: C1 8C     .word ofs_038_1D_8CC1_04 ; 
- D 0 - I - 0x014C6F 05:8C5F: 08 8D     .word ofs_038_1D_8D08_05 ; 
- D 0 - I - 0x014C71 05:8C61: A1 8D     .word ofs_038_1D_8DA1_06 ; 

; ******************************************************************************************************************

ofs_038_1D_8C63_01_активация_объекта:
C - - J - - 0x014C73 05:8C63: A9 01     LDA #$01
C - - - - - 0x014C75 05:8C65: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x014C78 05:8C68: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014C7B 05:8C6B: 69 04     ADC #$04
C - - - - - 0x014C7D 05:8C6D: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014C80 05:8C70: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014C83 05:8C73: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_1D_8C76_02:
C - - J - - 0x014C86 05:8C76: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014C89 05:8C79: A5 61     LDA ram_0061_конфиг_уровня
C - - - - - 0x014C8B 05:8C7B: F0 07     BEQ bra_8C84_RTS
C - - - - - 0x014C8D 05:8C7D: A5 71     LDA ram_0071_тип_скролла
C - - - - - 0x014C8F 05:8C7F: 10 03     BPL bra_8C84_RTS
C - - - - - 0x014C91 05:8C81: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8C84_RTS:
C - - - - - 0x014C94 05:8C84: 60        RTS

; ******************************************************************************************************************

ofs_038_1D_8C85_03:
C - - J - - 0x014C95 05:8C85: A9 01     LDA #$01
C - - - - - 0x014C97 05:8C87: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x014C9A 05:8C8A: A9 FF     LDA #$FF
C - - - - - 0x014C9C 05:8C8C: 85 08     STA ram_0008
C - - - - - 0x014C9E 05:8C8E: 85 09     STA ram_0009
C - - - - - 0x014CA0 05:8C90: A0 0F     LDY ram_макс_индекс_пули_игрока
bra_8C92_loop:
C - - - - - 0x014CA2 05:8C92: B9 A8 05  LDA ram_пули_игрока_атрибуты_обработки,Y
C - - - - - 0x014CA5 05:8C95: C9 01     CMP #con_plr_bullet_attr_05 ; пуля активна (обрабатывается)
C - - - - - 0x014CA7 05:8C97: D0 16     BNE bra_8CAF
; есть активная пуля
C - - - - - 0x014CA9 05:8C99: B9 88 05  LDA ram_позиция_x_спрайта,Y
C - - - - - 0x014CAC 05:8C9C: C9 38     CMP #$38    ; левая граница
C - - - - - 0x014CAE 05:8C9E: 90 0F     BCC bra_8CAF
C - - - - - 0x014CB0 05:8CA0: C9 C8     CMP #$C8    ; правая граница
C - - - - - 0x014CB2 05:8CA2: B0 0B     BCS bra_8CAF
C - - - - - 0x014CB4 05:8CA4: B9 78 05  LDA ram_позиция_y_спрайта,Y
C - - - - - 0x014CB7 05:8CA7: C5 08     CMP ram_0008
C - - - - - 0x014CB9 05:8CA9: B0 04     BCS bra_8CAF
C - - - - - 0x014CBB 05:8CAB: 85 08     STA ram_0008
C - - - - - 0x014CBD 05:8CAD: 84 09     STY ram_0009
bra_8CAF:
C - - - - - 0x014CBF 05:8CAF: 88        DEY
C - - - - - 0x014CC0 05:8CB0: 10 E0     BPL bra_8C92_loop
C - - - - - 0x014CC2 05:8CB2: A9 80     LDA #$80
C - - - - - 0x014CC4 05:8CB4: A4 09     LDY ram_0009
C - - - - - 0x014CC6 05:8CB6: 30 03     BMI bra_8CBB
C - - - - - 0x014CC8 05:8CB8: B9 88 05  LDA ram_позиция_x_спрайта,Y
bra_8CBB:
C - - - - - 0x014CCB 05:8CBB: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014CCE 05:8CBE: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; ******************************************************************************************************************

ofs_038_1D_8CC1_04:
C - - J - - 0x014CD1 05:8CC1: A9 20     LDA #$20
C - - - - - 0x014CD3 05:8CC3: 8D 89 04  STA ram_0489
C - - - - - 0x014CD6 05:8CC6: A9 00     LDA #$00
C - - - - - 0x014CD8 05:8CC8: 8D 8A 04  STA ram_048A
C - - - - - 0x014CDB 05:8CCB: 8D 8B 04  STA ram_048B
C - - - - - 0x014CDE 05:8CCE: 8D 8C 04  STA ram_048C
C - - - - - 0x014CE1 05:8CD1: 8D 8D 04  STA ram_048D
C - - - - - 0x014CE4 05:8CD4: A9 02     LDA #$02
C - - - - - 0x014CE6 05:8CD6: 8D 8E 04  STA ram_048E
C - - - - - 0x014CE9 05:8CD9: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014CEC 05:8CDC: 38        SEC
C - - - - - 0x014CED 05:8CDD: E9 04     SBC #$04
C - - - - - 0x014CEF 05:8CDF: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014CF2 05:8CE2: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014CF5 05:8CE5: 29 F0     AND #$F0
C - - - - - 0x014CF7 05:8CE7: 09 04     ORA #$04
C - - - - - 0x014CF9 05:8CE9: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x014CFC 05:8CEC: 38        SEC
C - - - - - 0x014CFD 05:8CED: E9 10     SBC #$10
C - - - - - 0x014CFF 05:8CEF: C9 30     CMP #$30
C - - - - - 0x014D01 05:8CF1: B0 02     BCS bra_8CF5
- - - - - - 0x014D03 05:8CF3: A9 00     LDA #$00
bra_8CF5:
C - - - - - 0x014D05 05:8CF5: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x014D08 05:8CF8: A9 01     LDA #$01
C - - - - - 0x014D0A 05:8CFA: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x014D0D 05:8CFD: A9 10     LDA #$10
C - - - - - 0x014D0F 05:8CFF: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x014D12 05:8D02: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014D15 05:8D05: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_1D_8D08_05:
C - - J - - 0x014D18 05:8D08: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014D1B 05:8D0B: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014D1E 05:8D0E: F0 40     BEQ bra_8D50
C - - - - - 0x014D20 05:8D10: DE 64 07  DEC ram_0764_obj,X
C - - - - - 0x014D23 05:8D13: D0 3B     BNE bra_8D50
C - - - - - 0x014D25 05:8D15: A9 00     LDA #$00
C - - - - - 0x014D27 05:8D17: 85 08     STA ram_0008
C - - - - - 0x014D29 05:8D19: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014D2C 05:8D1C: 38        SEC
C - - - - - 0x014D2D 05:8D1D: E9 04     SBC #$04
C - - - - - 0x014D2F 05:8D1F: A8        TAY
C - - - - - 0x014D30 05:8D20: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014D33 05:8D23: 20 E6 A8  JSR sub_0x0068F6
C - - - - - 0x014D36 05:8D26: A9 01     LDA #$01
C - - - - - 0x014D38 05:8D28: B0 23     BCS bra_8D4D
C - - - - - 0x014D3A 05:8D2A: A0 2D     LDY #con_obj_id_1E  ; блок падающей платформы
C - - - - - 0x014D3C 05:8D2C: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x014D3F 05:8D2F: 90 0B     BCC bra_8D3C
C - - - - - 0x014D41 05:8D31: A4 11     LDY ram_0011
C - - - - - 0x014D43 05:8D33: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014D46 05:8D36: 18        CLC
C - - - - - 0x014D47 05:8D37: 69 04     ADC #$04
C - - - - - 0x014D49 05:8D39: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
bra_8D3C:
C - - - - - 0x014D4C 05:8D3C: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014D4F 05:8D3F: 18        CLC
C - - - - - 0x014D50 05:8D40: 69 10     ADC #$10
C - - - - - 0x014D52 05:8D42: C9 D0     CMP #$D0
C - - - - - 0x014D54 05:8D44: 90 02     BCC bra_8D48
C - - - - - 0x014D56 05:8D46: A9 00     LDA #$00
bra_8D48:
C - - - - - 0x014D58 05:8D48: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x014D5B 05:8D4B: A9 10     LDA #$10
bra_8D4D:
C - - - - - 0x014D5D 05:8D4D: 9D 64 07  STA ram_0764_obj,X
bra_8D50:
C - - - - - 0x014D60 05:8D50: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x014D63 05:8D53: F0 40     BEQ bra_8D95
C - - - - - 0x014D65 05:8D55: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x014D68 05:8D58: D0 3B     BNE bra_8D95
C - - - - - 0x014D6A 05:8D5A: A9 00     LDA #$00
C - - - - - 0x014D6C 05:8D5C: 85 08     STA ram_0008
C - - - - - 0x014D6E 05:8D5E: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014D71 05:8D61: 38        SEC
C - - - - - 0x014D72 05:8D62: E9 08     SBC #$08
C - - - - - 0x014D74 05:8D64: A8        TAY
C - - - - - 0x014D75 05:8D65: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x014D78 05:8D68: 20 E6 A8  JSR sub_0x0068F6
C - - - - - 0x014D7B 05:8D6B: A9 01     LDA #$01
C - - - - - 0x014D7D 05:8D6D: B0 23     BCS bra_8D92
C - - - - - 0x014D7F 05:8D6F: A0 2D     LDY #con_obj_id_1E  ; блок падающей платформы
C - - - - - 0x014D81 05:8D71: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x014D84 05:8D74: 90 0B     BCC bra_8D81
C - - - - - 0x014D86 05:8D76: A4 11     LDY ram_0011
C - - - - - 0x014D88 05:8D78: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x014D8B 05:8D7B: 18        CLC
C - - - - - 0x014D8C 05:8D7C: 69 04     ADC #$04
C - - - - - 0x014D8E 05:8D7E: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
bra_8D81:
C - - - - - 0x014D91 05:8D81: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x014D94 05:8D84: 38        SEC
C - - - - - 0x014D95 05:8D85: E9 10     SBC #$10
C - - - - - 0x014D97 05:8D87: C9 30     CMP #$30
C - - - - - 0x014D99 05:8D89: B0 02     BCS bra_8D8D
C - - - - - 0x014D9B 05:8D8B: A9 00     LDA #$00
bra_8D8D:
C - - - - - 0x014D9D 05:8D8D: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x014DA0 05:8D90: A9 10     LDA #$10
bra_8D92:
C - - - - - 0x014DA2 05:8D92: 9D 72 07  STA ram_0772_obj,X
bra_8D95:
C - - - - - 0x014DA5 05:8D95: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014DA8 05:8D98: 1D 56 07  ORA ram_скролл_объекта_X,X
C - - - - - 0x014DAB 05:8D9B: D0 03     BNE bra_8DA0_RTS
C - - - - - 0x014DAD 05:8D9D: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8DA0_RTS:
C - - - - - 0x014DB0 05:8DA0: 60        RTS

; ******************************************************************************************************************

ofs_038_1D_8DA1_06:
C - - J - - 0x014DB1 05:8DA1: A9 40     LDA #$40
C - - - - - 0x014DB3 05:8DA3: 85 71     STA ram_0071_тип_скролла
C - - - - - 0x014DB5 05:8DA5: 85 7D     STA ram_007D_тип_скролла
C - - - - - 0x014DB7 05:8DA7: 4C 75 A2  JMP loc_0x00628A_удалить_объект

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x014DBA_1E_блок_падающей_платформы:
- D 0 - I - 0x014DBA 05:8DAA: B4 8D     .word ofs_038_1E_8DB4_01_активация_объекта ; 
- D 0 - I - 0x014DBC 05:8DAC: C4 8D     .word ofs_038_1E_8DC4_02 ; 
- D 0 - I - 0x014DBE 05:8DAE: 9A A2     .word ofs_038_1E_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x014DC0 05:8DB0: FD A2     .word ofs_038_1E_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x014DC2 05:8DB2: 3D A3     .word ofs_038_1E_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_1E_8DB4_01_активация_объекта:
C - - J - - 0x014DC4 05:8DB4: A9 62     LDA #$62
C - - - - - 0x014DC6 05:8DB6: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x014DC9 05:8DB9: A9 04     LDA #$04
C - - - - - 0x014DCB 05:8DBB: 9D 76 06  STA ram_жизни_объектов_8bit,X
C - - - - - 0x014DCE 05:8DBE: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
bra_8DC1:
C - - - - - 0x014DD1 05:8DC1: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_1E_8DC4_02:
C - - J - - 0x014DD4 05:8DC4: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x014DD7 05:8DC7: 18        CLC
C - - - - - 0x014DD8 05:8DC8: 69 20     ADC #< $0020
C - - - - - 0x014DDA 05:8DCA: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x014DDD 05:8DCD: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x014DE0 05:8DD0: 69 00     ADC #> $0020
C - - - - - 0x014DE2 05:8DD2: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x014DE5 05:8DD5: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x014DE8 05:8DD8: A9 00     LDA #$00
C - - - - - 0x014DEA 05:8DDA: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x014DED 05:8DDD: D0 E2     BNE bra_8DC1
C - - - - - 0x014DEF 05:8DDF: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x014E4B_29_лифт:
- D 0 - I - 0x014E4B 05:8E3B: 49 8E     .word ofs_038_29_8E49_01_активация_объекта ; 
- D 0 - I - 0x014E4D 05:8E3D: 51 8E     .word ofs_038_29_8E51_02 ; 
- D 0 - I - 0x014E4F 05:8E3F: 70 8E     .word ofs_038_29_8E70_03 ; 
- D 0 - I - 0x014E51 05:8E41: 96 8E     .word ofs_038_29_8E96_04 ; 
- D 0 - I - 0x014E53 05:8E43: A3 8E     .word ofs_038_29_8EA3_05 ; 
- D 0 - I - 0x014E55 05:8E45: BB 8E     .word ofs_038_29_8EBB_06 ; 
- D 0 - I - 0x014E57 05:8E47: DE 8E     .word ofs_038_29_8EDE_07 ; 

; ******************************************************************************************************************

ofs_038_29_8E49_01_активация_объекта:
C - - J - - 0x014E59 05:8E49: A9 81     LDA #$81
C - - - - - 0x014E5B 05:8E4B: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x014E5E 05:8E4E: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_29_8E51_02:
C - - J - - 0x014E61 05:8E51: A5 FC     LDA ram_scroll_Y
C - - - - - 0x014E63 05:8E53: D0 1A     BNE bra_8E6F_RTS
C - - - - - 0x014E65 05:8E55: A9 00     LDA #$00
C - - - - - 0x014E67 05:8E57: 85 7E     STA ram_007E
C - - - - - 0x014E69 05:8E59: A9 C0     LDA #$C0
C - - - - - 0x014E6B 05:8E5B: 85 71     STA ram_0071_тип_скролла
C - - - - - 0x014E6D 05:8E5D: A9 A0     LDA #$A0
C - - - - - 0x014E6F 05:8E5F: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
loc_8E62:
C D 0 - - - 0x014E72 05:8E62: A9 00     LDA #$00
C - - - - - 0x014E74 05:8E64: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x014E77 05:8E67: A9 08     LDA #$08
C - - - - - 0x014E79 05:8E69: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x014E7C 05:8E6C: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8E6F_RTS:
C - - - - - 0x014E7F 05:8E6F: 60        RTS

; ******************************************************************************************************************

ofs_038_29_8E70_03:
C - - J - - 0x014E80 05:8E70: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x014E83 05:8E73: F0 05     BEQ bra_8E7A
C - - - - - 0x014E85 05:8E75: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x014E88 05:8E78: D0 F5     BNE bra_8E6F_RTS
bra_8E7A:
C - - - - - 0x014E8A 05:8E7A: A0 00     LDY #$00
C - - - - - 0x014E8C 05:8E7C: 20 F7 8E  JSR sub_8EF7
C - - - - - 0x014E8F 05:8E7F: 90 EE     BCC bra_8E6F_RTS
C - - - - - 0x014E91 05:8E81: A9 02     LDA #con_irq_area_4_elevator
C - - - - - 0x014E93 05:8E83: 85 27     STA ram_irq_handler_hi
C - - - - - 0x014E95 05:8E85: 20 C5 90  JSR sub_90C5
C - - - - - 0x014E98 05:8E88: A9 00     LDA #$00
C - - - - - 0x014E9A 05:8E8A: 85 FA     STA ram_00FA
C - - - - - 0x014E9C 05:8E8C: A9 00     LDA #$00
C - - - - - 0x014E9E 05:8E8E: 85 FB     STA ram_00FB
C - - - - - 0x014EA0 05:8E90: 20 C5 90  JSR sub_90C5
C - - - - - 0x014EA3 05:8E93: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_29_8E96_04:
C - - J - - 0x014EA6 05:8E96: 20 C5 90  JSR sub_90C5
C - - - - - 0x014EA9 05:8E99: A0 01     LDY #$01
C - - - - - 0x014EAB 05:8E9B: 20 F7 8E  JSR sub_8EF7
C - - - - - 0x014EAE 05:8E9E: 90 CF     BCC bra_8E6F_RTS
C - - - - - 0x014EB0 05:8EA0: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_29_8EA3_05:
C - - J - - 0x014EB3 05:8EA3: 20 C5 90  JSR sub_90C5
C - - - - - 0x014EB6 05:8EA6: A9 80     LDA #$80
C - - - - - 0x014EB8 05:8EA8: 85 7E     STA ram_007E
C - - - - - 0x014EBA 05:8EAA: A9 C0     LDA #$C0
C - - - - - 0x014EBC 05:8EAC: 85 7F     STA ram_007F
C - - - - - 0x014EBE 05:8EAE: A9 FF     LDA #$FF
C - - - - - 0x014EC0 05:8EB0: 85 80     STA ram_номер_анимации_логотипа
C - - - - - 0x014EC2 05:8EB2: A9 40     LDA #$40
C - - - - - 0x014EC4 05:8EB4: 85 71     STA ram_0071_тип_скролла
C - - - - - 0x014EC6 05:8EB6: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_29_8EBB_06:
C - - J - - 0x014ECB 05:8EBB: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x014ECD 05:8EBD: 29 03     AND #$03
C - - - - - 0x014ECF 05:8EBF: D0 0F     BNE bra_8ED0
C - - - - - 0x014ED1 05:8EC1: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x014ED4 05:8EC4: D0 0A     BNE bra_8ED0
C - - - - - 0x014ED6 05:8EC6: A9 80     LDA #$80
C - - - - - 0x014ED8 05:8EC8: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x014EDB 05:8ECB: A9 21     LDA #con_sound_21   ; сирена
C - - - - - 0x014EDD 05:8ECD: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_8ED0:
C - - - - - 0x014EE0 05:8ED0: 20 C5 90  JSR sub_90C5
C - - - - - 0x014EE3 05:8ED3: A5 7E     LDA ram_007E
C - - - - - 0x014EE5 05:8ED5: D0 98     BNE bra_8E6F_RTS
C - - - - - 0x014EE7 05:8ED7: A5 FC     LDA ram_scroll_Y
C - - - - - 0x014EE9 05:8ED9: D0 94     BNE bra_8E6F_RTS
C - - - - - 0x014EEB 05:8EDB: 4C 62 8E  JMP loc_8E62

; ******************************************************************************************************************

ofs_038_29_8EDE_07:
C - - J - - 0x014EEE 05:8EDE: 20 C5 90  JSR sub_90C5
C - - - - - 0x014EF1 05:8EE1: A0 02     LDY #$02
C - - - - - 0x014EF3 05:8EE3: 20 F7 8E  JSR sub_8EF7
C - - - - - 0x014EF6 05:8EE6: 90 0E     BCC bra_8EF6_RTS
                                        INC ram_002B
C - - - - - 0x014EFB 05:8EEB: A9 40     LDA #$40
C - - - - - 0x014EFD 05:8EED: 85 71     STA ram_0071_тип_скролла
C - - - - - 0x014EFF 05:8EEF: A9 00     LDA #$00
C - - - - - 0x014F01 05:8EF1: 85 80     STA ram_номер_анимации_логотипа
C - - - - - 0x014F03 05:8EF3: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_8EF6_RTS:
C - - - - - 0x014F06 05:8EF6: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8EF7:
C - - - - - 0x014F07 05:8EF7: 84 0C     STY ram_000C
C - - - - - 0x014F09 05:8EF9: B9 80 8F  LDA tbl_8F80,Y
C - - - - - 0x014F0C 05:8EFC: 85 0B     STA ram_000B
C - - - - - 0x014F0E 05:8EFE: 98        TYA
C - - - - - 0x014F0F 05:8EFF: 0A        ASL
C - - - - - 0x014F10 05:8F00: A8        TAY
C - - - - - 0x014F11 05:8F01: B9 7A 8F  LDA tbl_8F7A_поинтеры,Y
C - - - - - 0x014F14 05:8F04: 85 09     STA ram_0009
C - - - - - 0x014F16 05:8F06: B9 7B 8F  LDA tbl_8F7A_поинтеры + $01,Y
C - - - - - 0x014F19 05:8F09: 85 0A     STA ram_000A
C - - - - - 0x014F1B 05:8F0B: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014F1E 05:8F0E: 0A        ASL
C - - - - - 0x014F1F 05:8F0F: A8        TAY
C - - - - - 0x014F20 05:8F10: B1 09     LDA (ram_0009),Y
C - - - - - 0x014F22 05:8F12: 85 08     STA ram_0008
C - - - - - 0x014F24 05:8F14: C8        INY
C - - - - - 0x014F25 05:8F15: B1 09     LDA (ram_0009),Y
C - - - - - 0x014F27 05:8F17: 85 09     STA ram_0009
C - - - - - 0x014F29 05:8F19: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x014F2B 05:8F1B: E0 10     CPX #$10
C - - - - - 0x014F2D 05:8F1D: B0 54     BCS bra_8F73
C - - - - - 0x014F2F 05:8F1F: A0 00     LDY #$00
C - - - - - 0x014F31 05:8F21: B1 08     LDA (ram_0008),Y
C - - - - - 0x014F33 05:8F23: 85 0A     STA ram_000A
C - - - - - 0x014F35 05:8F25: C8        INY
bra_8F26_loop:
C - - - - - 0x014F36 05:8F26: B1 08     LDA (ram_0008),Y
C - - - - - 0x014F38 05:8F28: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x014F3B 05:8F2B: C8        INY
C - - - - - 0x014F3C 05:8F2C: E8        INX
C - - - - - 0x014F3D 05:8F2D: C6 0A     DEC ram_000A
C - - - - - 0x014F3F 05:8F2F: D0 F5     BNE bra_8F26_loop
C - - - - - 0x014F41 05:8F31: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x014F43 05:8F33: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x014F45 05:8F35: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x014F48 05:8F38: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014F4B 05:8F3B: C5 0B     CMP ram_000B
C - - - - - 0x014F4D 05:8F3D: 90 37     BCC bra_8F76_RTS
C - - - - - 0x014F4F 05:8F3F: A9 00     LDA #$00
C - - - - - 0x014F51 05:8F41: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x014F54 05:8F44: A4 0C     LDY ram_000C
C - - - - - 0x014F56 05:8F46: B9 77 8F  LDA tbl_8F77,Y
C - - - - - 0x014F59 05:8F49: A8        TAY
C - - - - - 0x014F5A 05:8F4A: A9 06     LDA #$06
C - - - - - 0x014F5C 05:8F4C: 85 0D     STA ram_000D
bra_8F4E_loop:
C - - - - - 0x014F5E 05:8F4E: A9 11     LDA #$11
C - - - - - 0x014F60 05:8F50: 99 01 04  STA ram_0401,Y
C - - - - - 0x014F63 05:8F53: A9 00     LDA #$00
C - - - - - 0x014F65 05:8F55: 99 09 04  STA ram_0409,Y
C - - - - - 0x014F68 05:8F58: C8        INY
C - - - - - 0x014F69 05:8F59: C6 0D     DEC ram_000D
C - - - - - 0x014F6B 05:8F5B: D0 F1     BNE bra_8F4E_loop
C - - - - - 0x014F6D 05:8F5D: A9 21     LDA #$21
C - - - - - 0x014F6F 05:8F5F: 99 FA 03  STA ram_pal_buffer + $1A,Y
C - - - - - 0x014F72 05:8F62: A9 12     LDA #$12
C - - - - - 0x014F74 05:8F64: 99 01 04  STA ram_0401,Y
C - - - - - 0x014F77 05:8F67: A9 20     LDA #$20
C - - - - - 0x014F79 05:8F69: 99 02 04  STA ram_0402,Y
C - - - - - 0x014F7C 05:8F6C: A9 02     LDA #$02
C - - - - - 0x014F7E 05:8F6E: 99 09 04  STA ram_0409,Y
C - - - - - 0x014F81 05:8F71: 38        SEC
C - - - - - 0x014F82 05:8F72: 60        RTS
bra_8F73:
- - - - - - 0x014F83 05:8F73: A6 10     LDX ram_0010    ; загрузить индекс объекта
- - - - - - 0x014F85 05:8F75: 18        CLC
bra_8F76_RTS:
C - - - - - 0x014F86 05:8F76: 60        RTS

tbl_8F77:
- D 0 - - - 0x014F87 05:8F77: 50        .byte $50   ; 00 
- D 0 - - - 0x014F88 05:8F78: D0        .byte $D0   ; 01 
- D 0 - - - 0x014F89 05:8F79: D0        .byte $D0   ; 02 

tbl_8F80:
- D 0 - - - 0x014F90 05:8F80: 04        .byte $04   ; 00 
- D 0 - - - 0x014F91 05:8F81: 04        .byte $04   ; 01 
- D 0 - - - 0x014F92 05:8F82: 04        .byte $04   ; 02 

tbl_8F7A_поинтеры:
- D 0 - - - 0x014F8A 05:8F7A: 83 8F     .word off_8F83_00
- D 0 - - - 0x014F8C 05:8F7C: 8B 8F     .word off_8F8B_01
- D 0 - - - 0x014F8E 05:8F7E: 93 8F     .word off_8F93_02

off_8F83_00:
- D 0 - I - 0x014F93 05:8F83: 9B 8F     .word _off025_00_8F9B_00
- D 0 - I - 0x014F95 05:8F85: B1 8F     .word _off025_00_8FB1_01
- D 0 - I - 0x014F97 05:8F87: D7 8F     .word _off025_00_8FD7_02
- D 0 - I - 0x014F99 05:8F89: FD 8F     .word _off025_00_8FFD_03

off_8F8B_01:
- D 0 - I - 0x014F9B 05:8F8B: 08 90     .word _off025_01_9008_00
- D 0 - I - 0x014F9D 05:8F8D: 1C 90     .word _off025_01_901C_01
- D 0 - I - 0x014F9F 05:8F8F: 30 90     .word _off025_01_9030_02
- D 0 - I - 0x014FA1 05:8F91: 44 90     .word _off025_01_9044_03

off_8F93_02:
- D 0 - I - 0x014FA3 05:8F93: 58 90     .word _off025_02_9058_00
- D 0 - I - 0x014FA5 05:8F95: 6E 90     .word _off025_02_906E_01
- D 0 - I - 0x014FA7 05:8F97: 94 90     .word _off025_02_9094_02
- D 0 - I - 0x014FA9 05:8F99: BA 90     .word _off025_02_90BA_03

; _________________________________________________________________________________________________________________

_off025_00_8F9B_00:
- D 0 - I - 0x014FAB 05:8F9B: 15        .byte @end - * - $01   ; total data size

- D 0 - I - 0x014FAC 05:8F9C: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x014FAD 05:8F9D: 22 80     .dbyt $2280 ; ppu address
- D 0 - I - 0x014FAF 05:8F9F: 04        .byte $04   ; counter
- D 0 - I - 0x014FB0 05:8FA0: 40        .byte $40, $40, $29, $6E   ; tiles

- D 0 - I - 0x014FB4 05:8FA4: 22 9C     .dbyt $229C ; ppu address
- D 0 - I - 0x014FB6 05:8FA6: 04        .byte $04   ; counter
- D 0 - I - 0x014FB7 05:8FA7: 2A        .byte $2A, $6F, $40, $40   ; tiles

- D 0 - I - 0x014FBB 05:8FAB: FF        .byte $FF   ; change mode

- D 0 - I - 0x014FBC 05:8FAC: 03        .byte con_buf_mode_03   ; 
- D 0 - I - 0x014FBD 05:8FAD: 22 84     .dbyt $2284 ; ppu address
- D 0 - I - 0x014FBF 05:8FAF: 18        .byte $18, $2B   ; counter + fill tile
@end:

; _________________________________________________________________________________________________________________

_off025_00_8FB1_01:
- D 0 - I - 0x014FC1 05:8FB1: 25        .byte @end - * - $01   ; total data size

- D 0 - I - 0x014FC2 05:8FB2: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x014FC3 05:8FB3: 22 A0     .dbyt $22A0 ; ppu address
- D 0 - I - 0x014FC5 05:8FB5: 20        .byte $20   ; counter
- D 0 - I - 0x014FC6 05:8FB6: 6B        .byte $6B, $6C, $70, $71, $72, $71, $72, $71, $72, $71, $72, $71, $72, $71, $72, $71   ; tiles
- D 0 - I - 0x014FD6 05:8FC6: 72        .byte $72, $71, $72, $71, $72, $71, $72, $71, $72, $71, $72, $71, $72, $73, $6B, $6C   ; 

- D 0 - I - 0x014FE6 05:8FD6: FF        .byte $FF   ; change mode
@end:

; _________________________________________________________________________________________________________________

_off025_00_8FD7_02:
- D 0 - I - 0x014FE7 05:8FD7: 25        .byte @end - * - $01   ; total data size

- D 0 - I - 0x014FE8 05:8FD8: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x014FE9 05:8FD9: 22 C0     .dbyt $22C0 ; ppu address
- D 0 - I - 0x014FEB 05:8FDB: 20        .byte $20   ; counter
- D 0 - I - 0x014FEC 05:8FDC: 30        .byte $30, $6D, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74   ; tiles
- D 0 - I - 0x014FFC 05:8FEC: 1E        .byte $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $30, $6D   ; 

- D 0 - I - 0x01500C 05:8FFC: FF        .byte $FF   ; change mode
@end:

; _________________________________________________________________________________________________________________

_off025_00_8FFD_03:
- D 0 - I - 0x01500D 05:8FFD: 0A        .byte @end - * - $01   ; total data size

- D 0 - I - 0x01500E 05:8FFE: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x01500F 05:8FFF: 22 E0     .dbyt $22E0 ; ppu address
- D 0 - I - 0x015011 05:9001: 24        .byte $24, $00   ; counter + fill tile

- D 0 - I - 0x015013 05:9003: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x015014 05:9004: 23 E8     .dbyt $23E8 ; ppu address
- D 0 - I - 0x015016 05:9006: 08        .byte $08, $00   ; counter + fill tile
@end:

; _________________________________________________________________________________________________________________

_off025_01_9008_00:
- D 0 - I - 0x015018 05:9008: 13        .byte @end - * - $01   ; total data size

- D 0 - I - 0x015019 05:9009: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x01501A 05:900A: 2E 80     .dbyt $2E80 ; ppu address
- D 0 - I - 0x01501C 05:900C: 03        .byte $03   ; counter
- D 0 - I - 0x01501D 05:900D: 3A        .byte $3A, $F0, $0C   ; tiles

- D 0 - I - 0x015020 05:9010: 2E 9D     .dbyt $2E9D ; ppu address
- D 0 - I - 0x015022 05:9012: 03        .byte $03   ; counter
- D 0 - I - 0x015023 05:9013: D5        .byte $D5, $3D, $3A   ; tiles

- D 0 - I - 0x015026 05:9016: FF        .byte $FF   ; change mode

- D 0 - I - 0x015027 05:9017: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x015028 05:9018: 2E 83     .dbyt $2E83 ; ppu address
- D 0 - I - 0x01502A 05:901A: 1A        .byte $1A, $00   ; counter + fill tile
@end:

; _________________________________________________________________________________________________________________

_off025_01_901C_01:
- D 0 - I - 0x01502C 05:901C: 13        .byte @end - * - $01   ; total data size

- D 0 - I - 0x01502D 05:901D: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x01502E 05:901E: 2E A0     .dbyt $2EA0 ; ppu address
- D 0 - I - 0x015030 05:9020: 03        .byte $03   ; counter
- D 0 - I - 0x015031 05:9021: F5        .byte $F5, $F6, $0C   ; tiles

- D 0 - I - 0x015034 05:9024: 2E BD     .dbyt $2EBD ; ppu address
- D 0 - I - 0x015036 05:9026: 03        .byte $03   ; counter
- D 0 - I - 0x015037 05:9027: D5        .byte $D5, $EE, $43   ; tiles

- D 0 - I - 0x01503A 05:902A: FF        .byte $FF   ; change mode

- D 0 - I - 0x01503B 05:902B: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x01503C 05:902C: 2E A3     .dbyt $2EA3 ; ppu address
- D 0 - I - 0x01503E 05:902E: 1A        .byte $1A, $00   ; counter + fill tile
@end:

; _________________________________________________________________________________________________________________

_off025_01_9030_02:
- D 0 - I - 0x015040 05:9030: 13        .byte @end - * - $01   ; total data size

- D 0 - I - 0x015041 05:9031: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x015042 05:9032: 2E C0     .dbyt $2EC0 ; ppu address
- D 0 - I - 0x015044 05:9034: 03        .byte $03   ; counter
- D 0 - I - 0x015045 05:9035: 3B        .byte $3B, $F7, $0C   ; tiles

- D 0 - I - 0x015048 05:9038: 2E DD     .dbyt $2EDD ; ppu address
- D 0 - I - 0x01504A 05:903A: 03        .byte $03   ; counter
- D 0 - I - 0x01504B 05:903B: D5        .byte $D5, $3E, $44   ; tiles

- D 0 - I - 0x01504E 05:903E: FF        .byte $FF   ; change mode

- D 0 - I - 0x01504F 05:903F: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x015050 05:9040: 2E C3     .dbyt $2EC3 ; ppu address
- D 0 - I - 0x015052 05:9042: 1A        .byte $1A, $00   ; counter + fill tile
@end:

; _________________________________________________________________________________________________________________

_off025_01_9044_03:
- D 0 - I - 0x015054 05:9044: 13        .byte @end - * - $01   ; total data size

- D 0 - I - 0x015055 05:9045: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x015056 05:9046: 2E E0     .dbyt $2EE0 ; ppu address
- D 0 - I - 0x015058 05:9048: 03        .byte $03   ; counter
- D 0 - I - 0x015059 05:9049: C5        .byte $C5, $F1, $1B   ; tiles

- D 0 - I - 0x01505C 05:904C: 2E FD     .dbyt $2EFD ; ppu address
- D 0 - I - 0x01505E 05:904E: 03        .byte $03   ; counter
- D 0 - I - 0x01505F 05:904F: D6        .byte $D6, $E9, $C5   ; tiles

- D 0 - I - 0x015062 05:9052: FF        .byte $FF   ; change mode

- D 0 - I - 0x015063 05:9053: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x015064 05:9054: 2E E3     .dbyt $2EE3 ; ppu address
- D 0 - I - 0x015066 05:9056: 1A        .byte $1A, $00   ; counter + fill tile
@end:

; _________________________________________________________________________________________________________________

_off025_02_9058_00:
- D 0 - I - 0x015068 05:9058: 15        .byte @end - * - $01   ; total data size

- D 0 - I - 0x015069 05:9059: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x01506A 05:905A: 2E 80     .dbyt $2E80 ; ppu address
- D 0 - I - 0x01506C 05:905C: 04        .byte $04   ; counter
- D 0 - I - 0x01506D 05:905D: 40        .byte $40, $40, $29, $6E   ; tiles

- D 0 - I - 0x015071 05:9061: 2E 9C     .dbyt $2E9C ; ppu address
- D 0 - I - 0x015073 05:9063: 04        .byte $04   ; counter
- D 0 - I - 0x015074 05:9064: 2A        .byte $2A, $6F, $40, $40   ; tiles

- D 0 - I - 0x015078 05:9068: FF        .byte $FF   ; change mode

- D 0 - I - 0x015079 05:9069: 03        .byte con_buf_mode_03   ; 

- D 0 - I - 0x01507A 05:906A: 2E 84     .dbyt $2E84 ; ppu address
- D 0 - I - 0x01507C 05:906C: 18        .byte $18, $2B   ; counter + fill tile
@end:

; _________________________________________________________________________________________________________________

_off025_02_906E_01:
- D 0 - I - 0x01507E 05:906E: 25        .byte @end - * - $01   ; total data size

- D 0 - I - 0x01507F 05:906F: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x015080 05:9070: 2E A0     .dbyt $2EA0 ; ppu address
- D 0 - I - 0x015082 05:9072: 20        .byte $20   ; counter
- D 0 - I - 0x015083 05:9073: 6B        .byte $6B, $6C, $70, $71, $72, $71, $72, $71, $72, $71, $72, $71, $72, $71, $72, $71   ; tiles
- D 0 - I - 0x015093 05:9083: 72        .byte $72, $71, $72, $71, $72, $71, $72, $71, $72, $71, $72, $71, $72, $73, $6B, $6C   ; 

- D 0 - I - 0x0150A3 05:9093: FF        .byte $FF   ; change mode
@end:

; _________________________________________________________________________________________________________________

_off025_02_9094_02:
- D 0 - I - 0x0150A4 05:9094: 25        .byte @end - * - $01   ; total data size

- D 0 - I - 0x0150A5 05:9095: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x0150A6 05:9096: 2E C0     .dbyt $2EC0 ; ppu address
- D 0 - I - 0x0150A8 05:9098: 20        .byte $20   ; counter
- D 0 - I - 0x0150A9 05:9099: 30        .byte $30, $6D, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74   ; tiles
- D 0 - I - 0x0150B9 05:90A9: 1E        .byte $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $1E, $74, $30, $6D   ; 
- D 0 - I - 0x0150C9 05:90B9: FF        .byte $FF   ; close buffer
@end:

; _________________________________________________________________________________________________________________

_off025_02_90BA_03:
- D 0 - I - 0x0150CA 05:90BA: 0A        .byte @end - * - $01   ; total data size

- D 0 - I - 0x0150CB 05:90BB: 03        .byte con_buf_mode_03   ; 
- D 0 - I - 0x0150CC 05:90BC: 2E E0     .dbyt $2EE0 ; ppu address
- D 0 - I - 0x0150CE 05:90BE: 20        .byte $20, $00   ; counter + fill tile

- D 0 - I - 0x0150D0 05:90C0: 03        .byte con_buf_mode_03   ; 
- D 0 - I - 0x0150D1 05:90C1: 2F E8     .dbyt $2FE8 ; ppu address
- D 0 - I - 0x0150D3 05:90C3: 08        .byte $08, $00   ; counter + fill tile
@end:

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_90C5:
C - - - - - 0x0150D5 05:90C5: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0150D8 05:90C8: 85 45     STA ram_номер_сканлинии
C - - - - - 0x0150DA 05:90CA: 18        CLC
C - - - - - 0x0150DB 05:90CB: 69 20     ADC #$20
C - - - - - 0x0150DD 05:90CD: 18        CLC
C - - - - - 0x0150DE 05:90CE: 65 FC     ADC ram_scroll_Y
C - - - - - 0x0150E0 05:90D0: B0 04     BCS bra_90D6
C - - - - - 0x0150E2 05:90D2: C9 F0     CMP #$F0
C - - - - - 0x0150E4 05:90D4: 90 02     BCC bra_90D8
bra_90D6:
C - - - - - 0x0150E6 05:90D6: 69 0F     ADC #$0F
bra_90D8:
C - - - - - 0x0150E8 05:90D8: 85 00     STA ram_0000
C - - - - - 0x0150EA 05:90DA: 29 07     AND #$07
C - - - - - 0x0150EC 05:90DC: 85 47     STA ram_0047
C - - - - - 0x0150EE 05:90DE: A9 1F     LDA #$1F
C - - - - - 0x0150F0 05:90E0: 38        SEC
C - - - - - 0x0150F1 05:90E1: E5 47     SBC ram_0047
C - - - - - 0x0150F3 05:90E3: 85 46     STA ram_0046
C - - - - - 0x0150F5 05:90E5: A9 09     LDA #$09
C - - - - - 0x0150F7 05:90E7: 85 4B     STA ram_004B
C - - - - - 0x0150F9 05:90E9: A5 00     LDA ram_0000
C - - - - - 0x0150FB 05:90EB: 29 F8     AND #$F8
C - - - - - 0x0150FD 05:90ED: 0A        ASL
C - - - - - 0x0150FE 05:90EE: 26 4B     ROL ram_004B
C - - - - - 0x015100 05:90F0: 0A        ASL
C - - - - - 0x015101 05:90F1: 26 4B     ROL ram_004B
C - - - - - 0x015103 05:90F3: 85 4A     STA ram_004A
C - - - - - 0x015105 05:90F5: A9 A0     LDA #$A0
C - - - - - 0x015107 05:90F7: 38        SEC
C - - - - - 0x015108 05:90F8: FD 22 05  SBC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01510B 05:90FB: 85 F9     STA ram_00F9
C - - - - - 0x01510D 05:90FD: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0043E0_4D_лопасти_начального_вертолета_игроков:
- D 0 - I - 0x0043E0 01:83D0: D4 83     .word ofs_038_4D_83D4_01_активация_объекта ; 
- D 0 - I - 0x0043E2 01:83D2: E1 83     .word ofs_038_4D_83E1_02 ; лопасти в процессе вращения, периодически молния

; ******************************************************************************************************************

ofs_038_4D_83D4_01_активация_объекта:
C - - J - - 0x0043E4 01:83D4: A9 81     LDA #$81
C - - - - - 0x0043E6 01:83D6: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0043E9 01:83D9: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0043EC 01:83DC: A9 0C     LDA #$0C    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_4D_83E1_02:
; helicopter rotor and lightning at the beginning of area 1
C - - J - - 0x0043F1 01:83E1: A9 00     LDA #$00
C - - - - - 0x0043F3 01:83E3: 20 90 84  JSR sub_8490
C - - - - - 0x0043F6 01:83E6: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
                                        LDA ram_index_ppu_buffer
                                        CMP #$20
                                        BCS bra_841F_RTS
C - - - - - 0x0043F9 01:83E9: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0043FC 01:83EC: 0A        ASL
C - - - - - 0x0043FD 01:83ED: A8        TAY
C - - - - - 0x0043FE 01:83EE: B9 26 84  LDA tbl_8426_поинтеры,Y
C - - - - - 0x004401 01:83F1: 85 08     STA ram_0008
C - - - - - 0x004403 01:83F3: B9 27 84  LDA tbl_8426_поинтеры + $01,Y
C - - - - - 0x004406 01:83F6: 85 09     STA ram_0009
C - - - - - 0x004408 01:83F8: A5 1E     LDX ram_index_ppu_buffer
C - - - - - 0x00440F 01:83FF: A0 00     LDY #$00
bra_8401_loop:
C - - - - - 0x004411 01:8401: B1 08     LDA (ram_0008),Y
C - - - - - 0x004413 01:8403: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x004416 01:8406: E8        INX
C - - - - - 0x004417 01:8407: C8        INY
C - - - - - 0x004418 01:8408: C9 FF     CMP #$FF
C - - - - - 0x00441A 01:840A: D0 F5     BNE bra_8401_loop
C - - - - - 0x00441C 01:840C: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x00441E 01:840E: A6 10     LDX ram_0010
C - - - - - 0x004420 01:8410: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004423 01:8413: 18        CLC
C - - - - - 0x004424 01:8414: 69 01     ADC #$01
C - - - - - 0x004426 01:8416: C9 06     CMP #$06
C - - - - - 0x004428 01:8418: 90 02     BCC bra_841C
C - - - - - 0x00442A 01:841A: A9 00     LDA #$00
bra_841C:
C - - - - - 0x00442C 01:841C: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
bra_841F_RTS:
C - - - - - 0x00442F 01:841F: 60        RTS

tbl_8426_поинтеры:
- D 0 - - - 0x004436 01:8426: 32 84     .word off_8432_00
- D 0 - - - 0x004438 01:8428: 47 84     .word off_8447_01
- D 0 - - - 0x00443A 01:842A: 5C 84     .word off_845C_02
- D 0 - - - 0x00443C 01:842C: 6D 84     .word off_846D_03
- D 0 - - - 0x00443E 01:842E: 5C 84     .word off_845C_04
- D 0 - - - 0x004440 01:8430: 47 84     .word off_8447_05

; _________________________________________________________________________________________________________________

off_8432_00:
- D 0 - I - 0x004442 01:8432: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x004443 01:8433: 20 84     .dbyt $2084 ; ppu address
- D 0 - I - 0x004445 01:8435: 10        .byte $10   ; counter
- D 0 - I - 0x004446 01:8436: 11        .byte $11, $11, $12, $11, $12, $12, $13, $75, $14, $76, $12, $12, $11, $12, $11, $11   ; tiles

- D 0 - I - 0x004456 01:8446: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_8447_01:
off_8447_05:
- D 0 - I - 0x004457 01:8447: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x004458 01:8448: 20 84     .dbyt $2084 ; ppu address
- D 0 - I - 0x00445A 01:844A: 10        .byte $10   ; counter
- D 0 - I - 0x00445B 01:844B: 00        .byte $00, $00, $11, $12, $11, $12, $13, $75, $14, $76, $12, $12, $11, $11, $00, $00   ; tiles

- D 0 - I - 0x00446B 01:845B: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_845C_02:
off_845C_04:
- D 0 - I - 0x00446C 01:845C: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x00446D 01:845D: 20 86     .dbyt $2086 ; ppu address
- D 0 - I - 0x00446F 01:845F: 0C        .byte $0C   ; counter
- D 0 - I - 0x004470 01:8460: 00        .byte $00, $00, $11, $11, $12, $75, $14, $76, $12, $12, $00, $00   ; tiles

- D 0 - I - 0x00447C 01:846C: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_846D_03:
- D 0 - I - 0x00447D 01:846D: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x00447E 01:846E: 20 88     .dbyt $2088 ; ppu address
- D 0 - I - 0x004480 01:8470: 08        .byte $08   ; counter
- D 0 - I - 0x004481 01:8471: 00        .byte $00, $00, $00, $77, $78, $00, $00, $00   ; tiles

- D 0 - I - 0x004489 01:8479: FF        .byte $FF   ; end token

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00448A_59_гроза:
- D 0 - I - 0x00448A 01:847A: 7E 84     .word ofs_038_59_847E_01_активация_объекта ; 
- D 0 - I - 0x00448C 01:847C: 8B 84     .word ofs_038_59_848B_02 ; 

; ******************************************************************************************************************

ofs_038_59_847E_01_активация_объекта:
C - - J - - 0x00448E 01:847E: A9 81     LDA #$81
C - - - - - 0x004490 01:8480: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004493 01:8483: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004496 01:8486: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_59_848B_02:
C - - J - - 0x00449B 01:848B: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00449E 01:848E: A9 01     LDA #$01
sub_8490:
C - - - - - 0x0044A0 01:8490: 85 08     STA ram_0008
C - - - - - 0x0044A2 01:8492: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0044A5 01:8495: D0 07     BNE bra_849E
C - - - - - 0x0044A7 01:8497: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0044AA 01:849A: C9 20     CMP #$20
C - - - - - 0x0044AC 01:849C: 90 4D     BCC bra_84EB_RTS
bra_849E:
C - - - - - 0x0044AE 01:849E: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0044B1 01:84A1: D0 48     BNE bra_84EB_RTS
C - - - - - 0x0044B3 01:84A3: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0044B6 01:84A6: D0 09     BNE bra_84B1
C - - - - - 0x0044B8 01:84A8: A5 08     LDA ram_0008
C - - - - - 0x0044BA 01:84AA: F0 05     BEQ bra_84B1
C - - - - - 0x0044BC 01:84AC: A9 1D     LDA #con_sound_1D   ; звук молнии
C - - - - - 0x0044BE 01:84AE: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_84B1:
C - - - - - 0x0044C1 01:84B1: BC 48 07  LDY ram_скролл_объекта_Y,X
C - - - - - 0x0044C4 01:84B4: F0 02     BEQ bra_84B8
C - - - - - 0x0044C6 01:84B6: A0 03     LDY #$03
bra_84B8:
C - - - - - 0x0044C8 01:84B8: B9 F0 84  LDA tbl_84F0_палитра,Y
C - - - - - 0x0044CB 01:84BB: 8D E9 03  STA ram_pal_buffer + $09
C - - - - - 0x0044CE 01:84BE: B9 F1 84  LDA tbl_84F0_палитра + $01,Y
C - - - - - 0x0044D1 01:84C1: 8D EA 03  STA ram_pal_buffer + $0A
C - - - - - 0x0044D4 01:84C4: B9 F2 84  LDA tbl_84F0_палитра + $02,Y
C - - - - - 0x0044D7 01:84C7: 8D EB 03  STA ram_pal_buffer + $0B
C - - - - - 0x0044DA 01:84CA: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0044DD 01:84CD: 49 01     EOR #$01
C - - - - - 0x0044DF 01:84CF: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0044E2 01:84D2: 4A        LSR
C - - - - - 0x0044E3 01:84D3: A9 05     LDA #$05
C - - - - - 0x0044E5 01:84D5: B0 11     BCS bra_84E8
C - - - - - 0x0044E7 01:84D7: BC 56 07  LDY ram_скролл_объекта_X,X
C - - - - - 0x0044EA 01:84DA: FE 56 07  INC ram_скролл_объекта_X,X
C - - - - - 0x0044ED 01:84DD: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0044F0 01:84E0: 29 03     AND #$03
C - - - - - 0x0044F2 01:84E2: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0044F5 01:84E5: B9 EC 84  LDA tbl_84EC_счетчики,Y
bra_84E8:
C - - - - - 0x0044F8 01:84E8: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_84EB_RTS:
C - - - - - 0x0044FB 01:84EB: 60        RTS

tbl_84EC_счетчики:
- D 0 - - - 0x0044FC 01:84EC: 0E        .byte $0E   ; 00 
- D 0 - - - 0x0044FD 01:84ED: 2A        .byte $2A   ; 01 
- D 0 - - - 0x0044FE 01:84EE: 1E        .byte $1E   ; 02 
- D 0 - - - 0x0044FF 01:84EF: C0        .byte $C0   ; 03 

tbl_84F0_палитра:
- D 0 - - - 0x004500 01:84F0: 24        .byte $24, $26, $20   ; 00 
- D 0 - - - 0x004503 01:84F3: 27        .byte $27, $16, $04   ; 03 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x004F73_2F_землятресение:
- D 0 - I - 0x004F73 01:8F63: 69 8F     .word ofs_038_2F_8F69_01_активация_объекта ; 
- D 0 - I - 0x004F75 01:8F65: 7A 8F     .word ofs_038_2F_8F7A_02 ; 
- D 0 - I - 0x004F77 01:8F67: A6 8F     .word ofs_038_2F_8FA6_03 ; 

; ******************************************************************************************************************

ofs_038_2F_8F69_01_активация_объекта:
C - - J - - 0x004F79 01:8F69: A5 FC     LDA ram_scroll_Y
C - - - - - 0x004F7B 01:8F6B: 85 7B     STA ram_007B
C - - - - - 0x004F7D 01:8F6D: A9 81     LDA #$81
C - - - - - 0x004F7F 01:8F6F: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004F82 01:8F72: A9 01     LDA #$01
C - - - - - 0x004F84 01:8F74: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x004F87 01:8F77: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_2F_8F7A_02:
C - - J - - 0x004F8A 01:8F7A: 20 64 AB  JSR sub_0x006B74
C - - - - - 0x004F8D 01:8F7D: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x004F90 01:8F80: 0A        ASL
C - - - - - 0x004F91 01:8F81: A8        TAY
C - - - - - 0x004F92 01:8F82: A5 63     LDA ram_0063
C - - - - - 0x004F94 01:8F84: D9 C0 90  CMP tbl_90C0,Y
C - - - - - 0x004F97 01:8F87: 90 3B     BCC bra_8FC4_RTS
C - - - - - 0x004F99 01:8F89: D0 07     BNE bra_8F92
C - - - - - 0x004F9B 01:8F8B: A5 FD     LDA ram_scroll_X
C - - - - - 0x004F9D 01:8F8D: D9 C1 90  CMP tbl_90C0 + $01,Y
C - - - - - 0x004FA0 01:8F90: 90 32     BCC bra_8FC4_RTS
bra_8F92:
C - - - - - 0x004FA2 01:8F92: A9 20     LDA #con_sound_20   ; звук землятресения
C - - - - - 0x004FA4 01:8F94: 20 DE FD  JSR sub_0x01FDEE_play_sound
C - - - - - 0x004FA7 01:8F97: A9 00     LDA #$00
C - - - - - 0x004FA9 01:8F99: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x004FAC 01:8F9C: A9 14     LDA #$14
C - - - - - 0x004FAE 01:8F9E: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x004FB1 01:8FA1: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_90C0:
;                                              +---------- 
;                                              |    +----- scroll_X
;                                              |    |
- D 0 - - - 0x0050D0 01:90C0: 0E        .byte $0E, $E0   ; 
- D 0 - - - 0x0050D2 01:90C2: 0F        .byte $0F, $00   ; 
- D 0 - - - 0x0050D4 01:90C4: 0F        .byte $0F, $20   ; 
- D 0 - - - 0x0050D6 01:90C6: 0F        .byte $0F, $70   ; 
- D 0 - - - 0x0050D8 01:90C8: 0F        .byte $0F, $B0   ; 
- D 0 - - - 0x0050DA 01:90CA: 0F        .byte $0F, $D0   ; 
- D 0 - - - 0x0050DC 01:90CC: 10        .byte $10, $60   ; 
- D 0 - - - 0x0050DE 01:90CE: 10        .byte $10, $A0   ; 
- D 0 - - - 0x0050E0 01:90D0: 10        .byte $10, $E0   ; 
- D 0 - - - 0x0050E2 01:90D2: 11        .byte $11, $40   ; 
- D 0 - - - 0x0050E4 01:90D4: 11        .byte $11, $80   ; 
- D 0 - - - 0x0050E6 01:90D6: 11        .byte $11, $C0   ; 
- D 0 - - - 0x0050E8 01:90D8: 11        .byte $11, $E0   ; 
- D 0 - - - 0x0050EA 01:90DA: 12        .byte $12, $00   ; 
- D 0 - - - 0x0050EC 01:90DC: 12        .byte $12, $20   ; 

; ******************************************************************************************************************

ofs_038_2F_8FA6_03:
C - - J - - 0x004FB6 01:8FA6: 20 64 AB  JSR sub_0x006B74
C - - - - - 0x004FB9 01:8FA9: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x004FBC 01:8FAC: D0 16     BNE bra_8FC4_RTS
C - - - - - 0x004FBE 01:8FAE: 20 DB 8F  JSR sub_8FDB
C - - - - - 0x004FC1 01:8FB1: A9 01     LDA #$01
C - - - - - 0x004FC3 01:8FB3: B0 0C     BCS bra_8FC1
C - - - - - 0x004FC5 01:8FB5: BD 64 07  LDA ram_0764_obj,X  ; 14 дефолт
C - - - - - 0x004FC8 01:8FB8: C5 0D     CMP ram_000D    ; 1D макс
C - - - - - 0x004FCA 01:8FBA: F0 09     BEQ bra_8FC5
C - - - - - 0x004FCC 01:8FBC: FE 64 07  INC ram_0764_obj,X
C - - - - - 0x004FCF 01:8FBF: A9 08     LDA #$08
bra_8FC1:
C - - - - - 0x004FD1 01:8FC1: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_8FC4_RTS:
C - - - - - 0x004FD4 01:8FC4: 60        RTS
bra_8FC5:
C - - - - - 0x004FD5 01:8FC5: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x004FD8 01:8FC8: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x004FDB 01:8FCB: C9 0F     CMP #$0F
C - - - - - 0x004FDD 01:8FCD: B0 05     BCS bra_8FD4
C - - - - - 0x004FDF 01:8FCF: A9 02     LDA #$02
C - - - - - 0x004FE1 01:8FD1: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта
bra_8FD4:
C - - - - - 0x004FE4 01:8FD4: A5 7B     LDA ram_007B
C - - - - - 0x004FE6 01:8FD6: 85 FC     STA ram_scroll_Y
C - - - - - 0x004FE8 01:8FD8: 4C 75 A2  JMP loc_0x00628A_удалить_объект

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8FDB:
; earthquake area 3
; drawing falling ground
C - - - - - 0x004FEB 01:8FDB: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x004FEE 01:8FDE: 0A        ASL
C - - - - - 0x004FEF 01:8FDF: 0A        ASL
C - - - - - 0x004FF0 01:8FE0: A8        TAY
C - - - - - 0x004FF1 01:8FE1: B9 DE 90  LDA tbl_90DE,Y
C - - - - - 0x004FF4 01:8FE4: 85 0A     STA ram_000A
C - - - - - 0x004FF6 01:8FE6: B9 DF 90  LDA tbl_90DE + $01,Y
C - - - - - 0x004FF9 01:8FE9: 85 0D     STA ram_000D
C - - - - - 0x004FFB 01:8FEB: A9 04     LDA #$04
C - - - - - 0x004FFD 01:8FED: 85 01     STA ram_0001
C - - - - - 0x004FFF 01:8FEF: B9 E0 90  LDA tbl_90DE + $02,Y
C - - - - - 0x005002 01:8FF2: 0A        ASL
C - - - - - 0x005003 01:8FF3: 85 00     STA ram_0000
C - - - - - 0x005005 01:8FF5: 26 01     ROL ram_0001
C - - - - - 0x005007 01:8FF7: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x00500A 01:8FFA: 0A        ASL
C - - - - - 0x00500B 01:8FFB: 0A        ASL
C - - - - - 0x00500C 01:8FFC: 0A        ASL
C - - - - - 0x00500D 01:8FFD: 0A        ASL
C - - - - - 0x00500E 01:8FFE: 26 01     ROL ram_0001
C - - - - - 0x005010 01:9000: 0A        ASL
C - - - - - 0x005011 01:9001: 26 01     ROL ram_0001
C - - - - - 0x005013 01:9003: 18        CLC
C - - - - - 0x005014 01:9004: 65 00     ADC ram_0000
C - - - - - 0x005016 01:9006: 85 00     STA ram_0000
C - - - - - 0x005018 01:9008: B9 E1 90  LDA tbl_90DE + $03,Y
C - - - - - 0x00501B 01:900B: A8        TAY
C - - - - - 0x00501C 01:900C: B9 1A 91  LDA tbl_911A_поинтеры,Y
C - - - - - 0x00501F 01:900F: 85 08     STA ram_0008
C - - - - - 0x005021 01:9011: B9 1B 91  LDA tbl_911A_поинтеры + $01,Y
C - - - - - 0x005024 01:9014: 85 09     STA ram_0009
C - - - - - 0x005026 01:9016: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x005029 01:9019: 4A        LSR
C - - - - - 0x00502A 01:901A: 90 2D     BCC bra_9049
C - - - - - 0x00502C 01:901C: A5 01     LDA ram_0001
C - - - - - 0x00502E 01:901E: 85 02     STA ram_0002
C - - - - - 0x005030 01:9020: A5 00     LDA ram_0000
C - - - - - 0x005032 01:9022: 0A        ASL
C - - - - - 0x005033 01:9023: 26 02     ROL ram_0002
C - - - - - 0x005035 01:9025: 0A        ASL
C - - - - - 0x005036 01:9026: 26 02     ROL ram_0002
C - - - - - 0x005038 01:9028: 0A        ASL
C - - - - - 0x005039 01:9029: 46 02     LSR ram_0002
C - - - - - 0x00503B 01:902B: 6A        ROR
C - - - - - 0x00503C 01:902C: 46 02     LSR ram_0002
C - - - - - 0x00503E 01:902E: 6A        ROR
C - - - - - 0x00503F 01:902F: 46 02     LSR ram_0002
C - - - - - 0x005041 01:9031: 6A        ROR
C - - - - - 0x005042 01:9032: 46 02     LSR ram_0002
C - - - - - 0x005044 01:9034: 6A        ROR
C - - - - - 0x005045 01:9035: 46 02     LSR ram_0002
C - - - - - 0x005047 01:9037: 6A        ROR
C - - - - - 0x005048 01:9038: A8        TAY
C - - - - - 0x005049 01:9039: A5 0A     LDA ram_000A
C - - - - - 0x00504B 01:903B: 4A        LSR
C - - - - - 0x00504C 01:903C: 4A        LSR
C - - - - - 0x00504D 01:903D: 85 02     STA ram_0002
C - - - - - 0x00504F 01:903F: A9 00     LDA #$00
bra_9041_loop:
C - - - - - 0x005051 01:9041: 99 00 04  STA ram_0400,Y
C - - - - - 0x005054 01:9044: C8        INY
C - - - - - 0x005055 01:9045: C6 02     DEC ram_0002
C - - - - - 0x005057 01:9047: D0 F8     BNE bra_9041_loop
bra_9049:
C - - - - - 0x005059 01:9049: A9 00     LDY #$00
C - - - - - 0x005067 01:9057: A9 1B     LDA #$1B
C - - - - - 0x005069 01:9059: 38        SEC
C - - - - - 0x00506A 01:905A: FD 64 07  SBC ram_0764_obj,X
C - - - - - 0x00506D 01:905D: B0 02     BCS bra_9061
C - - - - - 0x00506F 01:905F: A9 00     LDA #$00
bra_9061:
; A = 00-07
C - - - - - 0x005071 01:9061: 85 0C     STA ram_000C
C - - - - - 0x005073 01:9063: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x005075 01:9065: E0 20     CPX #$20
C - - - - - 0x005077 01:9067: B0 36     BCS bra_909F
C - - - - - 0x005079 01:9069: A9 03     LDA #con_buf_mode_03
C - - - - - 0x00507B 01:906B: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x00507E 01:906E: E8        INX
C - - - - - 0x00507F 01:906F: 20 A2 90  JSR sub_90A2
C - - - - - 0x005082 01:9072: A9 00     LDA #$00    ; fill tile
C - - - - - 0x005084 01:9074: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x005087 01:9077: E8        INX
C - - - - - 0x005088 01:9078: A5 0C     LDA ram_000C
C - - - - - 0x00508A 01:907A: F0 20     BEQ bra_909C_skip
C - - - - - 0x00508C 01:907C: A9 06     LDA #con_buf_mode_06
C - - - - - 0x00508E 01:907E: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x005091 01:9081: E8        INX
bra_9082_loop:
C - - - - - 0x005092 01:9082: 20 A2 90  JSR sub_90A2
; A = 04 08
C - - - - - 0x005095 01:9085: 85 0B     STA ram_000B
bra_9087_loop:
C - - - - - 0x005097 01:9087: B1 08     LDA (ram_0008),Y
C - - - - - 0x005099 01:9089: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x00509C 01:908C: C8        INY
C - - - - - 0x00509D 01:908D: E8        INX
C - - - - - 0x00509E 01:908E: C6 0B     DEC ram_000B
C - - - - - 0x0050A0 01:9090: D0 F5     BNE bra_9087_loop
C - - - - - 0x0050A2 01:9092: C6 0C     DEC ram_000C    ; 06 макс
C - - - - - 0x0050A4 01:9094: D0 EC     BNE bra_9082_loop
; close buffer
C - - - - - 0x0050A6 01:9096: A9 FF     LDA #$FF
C - - - - - 0x0050A8 01:9098: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0050AB 01:909B: E8        INX
bra_909C_skip:
C - - - - - 0x0050AC 01:909C: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x0050AE 01:909E: 18        CLC
bra_909F:
C - - - - - 0x0050AF 01:909F: A6 10     LDX ram_0010
C - - - - - 0x0050B1 01:90A1: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_90A2:
C - - - - - 0x0050B2 01:90A2: A5 01     LDA ram_0001    ; ppu hi
C - - - - - 0x0050B4 01:90A4: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0050B7 01:90A7: E8        INX
C - - - - - 0x0050B8 01:90A8: A5 00     LDA ram_0000    ; ppu lo
C - - - - - 0x0050BA 01:90AA: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0050BD 01:90AD: E8        INX
C - - - - - 0x0050C0 01:90B0: 18        CLC
C - - - - - 0x0050C1 01:90B1: 69 20     ADC #$20
C - - - - - 0x0050C3 01:90B3: 85 00     STA ram_0000
C - - - - - 0x0050C5 01:90B5: 90 02     BCC bra_90B9_not_overflow
C - - - - - 0x0050C7 01:90B7: E6 01     INC ram_0001
bra_90B9_not_overflow:
C - - - - - 0x0050C9 01:90B9: A5 0A     LDA ram_000A    ; counter
C - - - - - 0x0050CB 01:90BB: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0050CE 01:90BE: E8        INX
C - - - - - 0x0050CF 01:90BF: 60        RTS

tbl_90DE:
;                                              +-------------------- 
;                                              |    +--------------- 
;                                              |    |    +---------- 
;                                              |    |    |    +----- index for 0x00512A
;                                              |    |    |    |
- D 0 - - - 0x0050EE 01:90DE: 04        .byte $04, $17, $88, $00   ; 00 
- D 0 - - - 0x0050F2 01:90E2: 04        .byte $04, $1D, $8A, $02   ; 01 
- D 0 - - - 0x0050F6 01:90E6: 08        .byte $08, $15, $8C, $04   ; 02 
- D 0 - - - 0x0050FA 01:90EA: 08        .byte $08, $19, $00, $04   ; 03 
- D 0 - - - 0x0050FE 01:90EE: 08        .byte $08, $15, $04, $04   ; 04 
- D 0 - - - 0x005102 01:90F2: 04        .byte $04, $1D, $08, $00   ; 05 
- D 0 - - - 0x005106 01:90F6: 04        .byte $04, $1D, $80, $00   ; 06 
- D 0 - - - 0x00510A 01:90FA: 04        .byte $04, $1D, $84, $00   ; 07 
- D 0 - - - 0x00510E 01:90FE: 04        .byte $04, $1D, $88, $00   ; 08 
- D 0 - - - 0x005112 01:9102: 04        .byte $04, $1D, $8C, $00   ; 09 
- D 0 - - - 0x005116 01:9106: 08        .byte $08, $19, $00, $04   ; 0A 
- D 0 - - - 0x00511A 01:910A: 08        .byte $08, $15, $04, $04   ; 0B 
- D 0 - - - 0x00511E 01:910E: 04        .byte $04, $1D, $08, $00   ; 0C 
- D 0 - - - 0x005122 01:9112: 04        .byte $04, $19, $0A, $02   ; 0D 
- D 0 - - - 0x005126 01:9116: 04        .byte $04, $17, $0C, $00   ; 0E 

tbl_911A_поинтеры:
- D 0 - - - 0x00512A 01:911A: 20 91     .word off_9120_00
- D 0 - - - 0x00512C 01:911C: 48 91     .word off_9148_02
- D 0 - - - 0x00512E 01:911E: 70 91     .word off_9170_04

; _________________________________________________________________________________________________________________

off_9120_00:
- D 0 - I - 0x005130 01:9120: 2A        .byte $2A, $2A, $2B, $2B   ; 00 
- D 0 - I - 0x005134 01:9124: C5        .byte $C5, $C6, $C5, $C6   ; 01 
- D 0 - I - 0x005138 01:9128: 2E        .byte $2E, $C9, $30, $CF   ; 02 
- D 0 - I - 0x00513C 01:912C: CB        .byte $CB, $CC, $D1, $D2   ; 03 
- D 0 - I - 0x005140 01:9130: 30        .byte $30, $D0, $2F, $CA   ; 04 
- D 0 - I - 0x005144 01:9134: CB        .byte $CB, $CC, $CD, $CE   ; 05 
- D 0 - I - 0x005148 01:9138: 30        .byte $30, $CF, $31, $D0   ; 06 

; _________________________________________________________________________________________________________________

off_9148_02:
- D 0 - I - 0x005158 01:9148: 2C        .byte $2C, $2B, $2B, $2C   ; 00 
- D 0 - I - 0x00515C 01:914C: C5        .byte $C5, $C6, $C7, $C8   ; 01 
- D 0 - I - 0x005160 01:9150: 2E        .byte $2E, $C9, $2F, $CA   ; 02 
- D 0 - I - 0x005164 01:9154: CB        .byte $CB, $CC, $CD, $CE   ; 03 
- D 0 - I - 0x005168 01:9158: 30        .byte $30, $CF, $31, $D0   ; 04 
- D 0 - I - 0x00516C 01:915C: D1        .byte $D1, $D2, $D3, $D4   ; 05 
- D 0 - I - 0x005170 01:9160: 2F        .byte $2F, $CA, $2E, $C9   ; 06 

; _________________________________________________________________________________________________________________

off_9170_04:
- D 0 - I - 0x005180 01:9170: 2A        .byte $2A, $2A, $2B, $2B, $2C, $2B, $2B, $2C   ; 00 
- D 0 - I - 0x005188 01:9178: C5        .byte $C5, $C6, $C5, $C6, $C5, $C6, $C7, $C8   ; 01 
- D 0 - I - 0x005190 01:9180: 2E        .byte $2E, $C9, $30, $CF, $2E, $C9, $2F, $CA   ; 02 
- D 0 - I - 0x005198 01:9188: CB        .byte $CB, $CC, $D1, $D2, $CB, $CC, $CD, $CE   ; 03 
- D 0 - I - 0x0051A0 01:9190: 30        .byte $30, $D0, $2F, $CA, $30, $CF, $31, $D0   ; 04 
- D 0 - I - 0x0051A8 01:9198: CB        .byte $CB, $CC, $CD, $CE, $D1, $D2, $D3, $D4   ; 05 
- D 0 - I - 0x0051B0 01:91A0: 30        .byte $30, $CF, $31, $D0, $2F, $CA, $2E, $C9   ; 06  

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0082C5_39_падающий_потолок:
- D 0 - I - 0x0082C5 02:82B5: BF 82     .word ofs_038_39_82BF_01_активация_объекта ; 
- D 0 - I - 0x0082C7 02:82B7: CC 82     .word ofs_038_39_82CC_02 ; 
- D 0 - I - 0x0082C9 02:82B9: 1A 83     .word ofs_038_39_831A_03 ; 
- D 0 - I - 0x0082CB 02:82BB: 3A 83     .word ofs_038_39_833A_04 ; 
- D 0 - I - 0x0082CD 02:82BD: 57 83     .word ofs_038_39_8357_05 ; 

; ******************************************************************************************************************

ofs_038_39_82BF_01_активация_объекта:
C - - J - - 0x0082CF 02:82BF: A9 81     LDA #$81
C - - - - - 0x0082D1 02:82C1: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0082D4 02:82C4: A9 20     LDA #$20
C - - - - - 0x0082D6 02:82C6: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0082D9 02:82C9: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_39_82CC_02:
C - - J - - 0x0082DC 02:82CC: A5 FD     LDA ram_scroll_X
C - - - - - 0x0082DE 02:82CE: D0 49     BNE bra_8319_RTS
C - - - - - 0x0082E0 02:82D0: A9 00     LDA #$00
C - - - - - 0x0082E2 02:82D2: 85 60     STA ram_0060_unk
C - - - - - 0x0082E4 02:82D4: 85 70     STA ram_0070
C - - - - - 0x0082E6 02:82D6: 20 7F FC  JSR sub_0x01FC8F_copy_reg_values
C - - - - - 0x0082E9 02:82D9: 20 94 AA  JSR sub_0x006AA4_save_reg_values
C - - - - - 0x0082EC 02:82DC: A9 80     LDA #$80
C - - - - - 0x0082EE 02:82DE: 85 85     STA ram_0085_for_2006
C - - - - - 0x0082F0 02:82E0: A9 01     LDA #con_mirroring_H
C - - - - - 0x0082F2 02:82E2: 85 26     STA ram_mirroring
C - - - - - 0x0082F4 02:82E4: A9 06     LDA #con_irq_area_8_ceiling
C - - - - - 0x0082F6 02:82E6: 85 27     STA ram_irq_handler_hi
C - - - - - 0x0082F8 02:82E8: A9 B9     LDA #$B9
C - - - - - 0x0082FA 02:82EA: 85 45     STA ram_номер_сканлинии
C - - - - - 0x0082FC 02:82EC: A9 E0     LDA #$E0
C - - - - - 0x0082FE 02:82EE: 85 4A     STA ram_004A
C - - - - - 0x008300 02:82F0: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008303 02:82F3: 4A        LSR
C - - - - - 0x008304 02:82F4: A9 2E     LDA #$2E
C - - - - - 0x008306 02:82F6: A0 AA     LDY #$AA
C - - - - - 0x008308 02:82F8: 90 04     BCC bra_82FE
C - - - - - 0x00830A 02:82FA: A9 22     LDA #$22
C - - - - - 0x00830C 02:82FC: A0 A8     LDY #$A8
bra_82FE:
C - - - - - 0x00830E 02:82FE: 85 4B     STA ram_004B
C - - - - - 0x008310 02:8300: 84 FF     STY ram_for_2000
C - - - - - 0x008312 02:8302: 84 FB     STY ram_00FB
C - - - - - 0x008314 02:8304: 20 CE A9  JSR sub_0x0069DE
C - - - - - 0x008317 02:8307: A9 08     LDA #$08
C - - - - - 0x008319 02:8309: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x00831C 02:830C: A9 00     LDA #$00
C - - - - - 0x00831E 02:830E: 85 73     STA ram_0073
C - - - - - 0x008320 02:8310: 85 74     STA ram_0074_конфиг_уровня
C - - - - - 0x008322 02:8312: 85 77     STA ram_0077
C - - - - - 0x008324 02:8314: 85 64     STA ram_0064
C - - - - - 0x008326 02:8316: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8319_RTS:
C - - - - - 0x008329 02:8319: 60        RTS

; ******************************************************************************************************************

ofs_038_39_831A_03:
C - - J - - 0x00832A 02:831A: 20 76 83  JSR sub_8376
C - - - - - 0x00832D 02:831D: A5 60     LDA ram_0060_unk
C - - - - - 0x00832F 02:831F: 05 70     ORA ram_0070
C - - - - - 0x008331 02:8321: D0 16     BNE bra_8339_RTS
C - - - - - 0x008333 02:8323: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x008336 02:8326: F0 05     BEQ bra_832D
C - - - - - 0x008338 02:8328: A9 00     LDA #$00
C - - - - - 0x00833A 02:832A: 85 6B     STA ram_006B
C - - - - - 0x00833C 02:832C: 60        RTS
bra_832D:
C - - - - - 0x00833D 02:832D: A9 01     LDA #$01
C - - - - - 0x00833F 02:832F: 85 85     STA ram_0085_for_2006
C - - - - - 0x008341 02:8331: A9 00     LDA #$00
C - - - - - 0x008343 02:8333: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x008346 02:8336: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8339_RTS:
C - - - - - 0x008349 02:8339: 60        RTS

; ******************************************************************************************************************

ofs_038_39_833A_04:
C - - J - - 0x00834A 02:833A: A9 00     LDA #$00
C - - - - - 0x00834C 02:833C: 85 9A     STA ram_009A
C - - - - - 0x00834E 02:833E: 20 8F 83  JSR sub_838F
C - - - - - 0x008351 02:8341: 20 76 83  JSR sub_8376
C - - - - - 0x008354 02:8344: BD 9C 07  LDA ram_позиция_объектов_X_старш,X
C - - - - - 0x008357 02:8347: F0 F0     BEQ bra_8339_RTS
C - - - - - 0x008359 02:8349: C9 FE     CMP #$FE
C - - - - - 0x00835B 02:834B: B0 EC     BCS bra_8339_RTS
C - - - - - 0x00835D 02:834D: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008360 02:8350: C9 20     CMP #$20
C - - - - - 0x008362 02:8352: D0 E5     BNE bra_8339_RTS
C - - - - - 0x008364 02:8354: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_39_8357_05:
C - - J - - 0x008367 02:8357: 20 76 83  JSR sub_8376
C - - - - - 0x00836A 02:835A: A5 FD     LDA ram_scroll_X
C - - - - - 0x00836C 02:835C: D0 DB     BNE bra_8339_RTS
C - - - - - 0x00836E 02:835E: 20 A1 AA  JSR sub_0x006AB1_restore_reg_values
C - - - - - 0x008371 02:8361: A5 FD     LDA ram_scroll_X
C - - - - - 0x008373 02:8363: 85 FA     STA ram_00FA
C - - - - - 0x008375 02:8365: A9 00     LDA #$00
C - - - - - 0x008377 02:8367: 85 85     STA ram_0085_for_2006
C - - - - - 0x008379 02:8369: 20 82 F1  JSR sub_0x01F192
C - - - - - 0x00837C 02:836C: E6 74     INC ram_0074_конфиг_уровня
C - - - - - 0x00837E 02:836E: C6 65     DEC ram_0065
                                        INC ram_002B
C - - - - - 0x008383 02:8373: 4C 75 A2  JMP loc_0x00628A_удалить_объект

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8376:
C - - - - - 0x008386 02:8376: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008389 02:8379: 38        SEC
C - - - - - 0x00838A 02:837A: E5 62     SBC ram_скорость_камеры_X
C - - - - - 0x00838C 02:837C: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00838F 02:837F: BD 9C 07  LDA ram_позиция_объектов_X_старш,X
C - - - - - 0x008392 02:8382: E9 00     SBC #$00
C - - - - - 0x008394 02:8384: 9D 9C 07  STA ram_позиция_объектов_X_старш,X
C - - - - - 0x008397 02:8387: 20 0A AA  JSR sub_0x006A1A
C - - - - - 0x00839A 02:838A: A5 FD     LDA ram_scroll_X
C - - - - - 0x00839C 02:838C: 85 FA     STA ram_00FA
C - - - - - 0x00839E 02:838E: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_838F:
                                        LDY ram_скролл_объекта_Y,X
                                        LDA tbl_8395_lo,y
                                        STA ram_0000
                                        LDA tbl_8396_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_8395_lo:
- D 0 - I - 0x0083A5 02:8395: 9F 83     .byte < ofs_017_839F_00
- D 0 - I - 0x0083A7 02:8397: C9 83     .byte < ofs_017_83C9_01
- D 0 - I - 0x0083A9 02:8399: E6 83     .byte < ofs_017_83E6_02
- D 0 - I - 0x0083AB 02:839B: F4 83     .byte < ofs_017_83F4_03
- D 0 - I - 0x0083AD 02:839D: 3A 84     .byte < ofs_017_843A_04
tbl_8396_hi:
- D 0 - I - 0x0083A5 02:8395: 9F 83     .byte > ofs_017_839F_00
- D 0 - I - 0x0083A7 02:8397: C9 83     .byte > ofs_017_83C9_01
- D 0 - I - 0x0083A9 02:8399: E6 83     .byte > ofs_017_83E6_02
- D 0 - I - 0x0083AB 02:839B: F4 83     .byte > ofs_017_83F4_03
- D 0 - I - 0x0083AD 02:839D: 3A 84     .byte > ofs_017_843A_04

; _________________________________________________________________________________________________________________

ofs_017_839F_00:
C - - J - - 0x0083AF 02:839F: A9 10     LDA #$10
C - - - - - 0x0083B1 02:83A1: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_Y
C - - - - - 0x0083B4 02:83A4: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0083B7 02:83A7: 85 08     STA ram_0008
C - - - - - 0x0083B9 02:83A9: 20 48 84  JSR sub_8448_посчитать_позицию_Y_объекта_от_скорости
C - - - - - 0x0083BC 02:83AC: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0083BF 02:83AF: 38        SEC
C - - - - - 0x0083C0 02:83B0: E5 08     SBC ram_0008
C - - - - - 0x0083C2 02:83B2: 85 9A     STA ram_009A
C - - - - - 0x0083C4 02:83B4: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0083C7 02:83B7: C9 A0     CMP #$A0
C - - - - - 0x0083C9 02:83B9: 90 0D     BCC bra_83C8_RTS
C - - - - - 0x0083CB 02:83BB: A9 22     LDA #con_sound_22
C - - - - - 0x0083CD 02:83BD: 20 DE FD  JSR sub_0x01FDEE_play_sound
C - - - - - 0x0083D0 02:83C0: A9 20     LDA #$20
bra_83C2:
loc_83C2:
C D 0 - - - 0x0083D2 02:83C2: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0083D5 02:83C5: FE 48 07  INC ram_скролл_объекта_Y,X
bra_83C8_RTS:
C - - - - - 0x0083D8 02:83C8: 60        RTS

; _________________________________________________________________________________________________________________

ofs_017_83C9_01:
C - - J - - 0x0083D9 02:83C9: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x0083DC 02:83CC: 29 03     AND #$03
C - - - - - 0x0083DE 02:83CE: D0 0D     BNE bra_83DD
C - - - - - 0x0083E0 02:83D0: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x0083E3 02:83D3: 4A        LSR
C - - - - - 0x0083E4 02:83D4: 29 02     AND #$02
C - - - - - 0x0083E6 02:83D6: A8        TAY
C - - - - - 0x0083E7 02:83D7: 20 5C 84  JSR sub_845C_установить_скорость_Y
C - - - - - 0x0083EA 02:83DA: 20 48 84  JSR sub_8448_посчитать_позицию_Y_объекта_от_скорости
bra_83DD:
C - - - - - 0x0083ED 02:83DD: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0083F0 02:83E0: D0 E6     BNE bra_83C8_RTS
C - - - - - 0x0083F2 02:83E2: A9 40     LDA #$40
C - - - - - 0x0083F4 02:83E4: D0 DC     BNE bra_83C2    ; jmp

; _________________________________________________________________________________________________________________

ofs_017_83E6_02:
C - - J - - 0x0083F6 02:83E6: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0083F9 02:83E9: D0 DD     BNE bra_83C8_RTS
C - - - - - 0x0083FB 02:83EB: A0 04     LDY #$04
C - - - - - 0x0083FD 02:83ED: 20 5C 84  JSR sub_845C_установить_скорость_Y
C - - - - - 0x008400 02:83F0: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x008403 02:83F3: 60        RTS

; _________________________________________________________________________________________________________________

ofs_017_83F4_03:
C - - J - - 0x008404 02:83F4: 20 48 84  JSR sub_8448_посчитать_позицию_Y_объекта_от_скорости
C - - - - - 0x008407 02:83F7: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00840A 02:83FA: C9 21     CMP #$21
C - - - - - 0x00840C 02:83FC: B0 CA     BCS bra_83C8_RTS
C - - - - - 0x00840E 02:83FE: A9 20     LDA #$20
C - - - - - 0x008410 02:8400: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008413 02:8403: A9 05     LDA #$05
C - - - - - 0x008415 02:8405: 85 08     STA ram_0008
bra_8407_loop:
C - - - - - 0x008417 02:8407: A0 2A     LDY #con_obj_id_1B  ; летающий круглый эмбрион
C - - - - - 0x008419 02:8409: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x00841C 02:840C: 90 1B     BCC bra_8429
C - - - - - 0x00841E 02:840E: A6 11     LDX ram_0011
C - - - - - 0x008420 02:8410: A4 08     LDY ram_0008
C - - - - - 0x008422 02:8412: B9 2E 84  LDA tbl_842E_позиция_Y,Y
C - - - - - 0x008425 02:8415: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008428 02:8418: B9 34 84  LDA tbl_8434_позиция_X,Y
C - - - - - 0x00842B 02:841B: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00842E 02:841E: A9 01     LDA #$01
C - - - - - 0x008430 02:8420: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x008433 02:8423: A6 10     LDX ram_0010
C - - - - - 0x008435 02:8425: C6 08     DEC ram_0008
C - - - - - 0x008437 02:8427: 10 DE     BPL bra_8407_loop
bra_8429:
C - - - - - 0x008439 02:8429: A9 40     LDA #$40
C - - - - - 0x00843B 02:842B: 4C C2 83  JMP loc_83C2

tbl_842E_позиция_Y:
- D 0 - - - 0x00843E 02:842E: 38        .byte $38   ; 00 
- D 0 - - - 0x00843F 02:842F: 38        .byte $38   ; 01 
- D 0 - - - 0x008440 02:8430: 30        .byte $30   ; 02 
- D 0 - - - 0x008441 02:8431: 30        .byte $30   ; 03 
- D 0 - - - 0x008442 02:8432: 28        .byte $28   ; 04 
- D 0 - - - 0x008443 02:8433: 28        .byte $28   ; 05 

tbl_8434_позиция_X:
- D 0 - - - 0x008444 02:8434: 30        .byte $30   ; 00 
- D 0 - - - 0x008445 02:8435: D0        .byte $D0   ; 01 
- D 0 - - - 0x008446 02:8436: 50        .byte $50   ; 02 
- D 0 - - - 0x008447 02:8437: B0        .byte $B0   ; 03 
- D 0 - - - 0x008448 02:8438: 70        .byte $70   ; 04 
- D 0 - - - 0x008449 02:8439: 90        .byte $90   ; 05 

; _________________________________________________________________________________________________________________

ofs_017_843A_04:
C - - J - - 0x00844A 02:843A: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00844D 02:843D: D0 89     BNE bra_83C8_RTS
C - - - - - 0x00844F 02:843F: 20 CA A7  JSR sub_0x0067DA_очистить_скорость_Y
C - - - - - 0x008452 02:8442: A9 00     LDA #$00
C - - - - - 0x008454 02:8444: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x008457 02:8447: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8448_посчитать_позицию_Y_объекта_от_скорости:
C - - - - - 0x008458 02:8448: BD 84 06  LDA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x00845B 02:844B: 18        CLC
C - - - - - 0x00845C 02:844C: 7D A0 06  ADC ram_скорость_объектов_y_младш,X
C - - - - - 0x00845F 02:844F: 9D 84 06  STA ram_дробная_скорость_объекта_y_младш,X
C - - - - - 0x008462 02:8452: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008465 02:8455: 7D AE 06  ADC ram_скорость_объектов_Y_старш,X
C - - - - - 0x008468 02:8458: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00846B 02:845B: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_845C_установить_скорость_Y:
C - - - - - 0x00846C 02:845C: B9 69 84  LDA tbl_8469_скорость_Y,Y
C - - - - - 0x00846F 02:845F: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x008472 02:8462: B9 6A 84  LDA tbl_8469_скорость_Y + $01,Y
C - - - - - 0x008475 02:8465: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x008478 02:8468: 60        RTS

tbl_8469_скорость_Y:
- D 0 - - - 0x008479 02:8469: 00 02     .word $0200 ; 00 
- D 0 - - - 0x00847B 02:846B: 00 FE     .word $FE00 ; 02 
- D 0 - - - 0x00847D 02:846D: 00 FF     .word $FF00 ; 04 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0113DA_5B_смена_банков_chr:
- D 0 - I - 0x0113DA 04:93CA: CE 93     .word ofs_038_5B_93CE_01_активация_объекта ; 
- D 0 - I - 0x0113DC 04:93CC: FB 93     .word ofs_038_5B_93FB_02 ; 

; ******************************************************************************************************************

ofs_038_5B_93CE_01_активация_объекта:
C - - J - - 0x0113DE 04:93CE: A9 F0     LDA #con_HP_F0
C - - - - - 0x0113E0 04:93D0: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x0113E3 04:93D3: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0113E6 04:93D6: 29 01     AND #$01
C - - - - - 0x0113E8 04:93D8: A8        TAY
C - - - - - 0x0113E9 04:93D9: B9 F3 93  LDA tbl_93F3_chr_bank_bg_0,Y
C - - - - - 0x0113EC 04:93DC: 8D F0 07  STA ram_bg_bank_1
C - - - - - 0x0113EF 04:93DF: B9 F5 93  LDA tbl_93F5_chr_bank_bg_1,Y
C - - - - - 0x0113F2 04:93E2: 8D F1 07  STA ram_bg_bank_2
C - - - - - 0x0113F5 04:93E5: B9 F7 93  LDA tbl_93F7_irq_handler,Y
C - - - - - 0x0113F8 04:93E8: 85 27     STA ram_irq_handler_hi
C - - - - - 0x0113FA 04:93EA: B9 F9 93  LDA tbl_93F9,Y
C - - - - - 0x0113FD 04:93ED: 20 FD 93  JSR sub_93FD
C - - - - - 0x011400 04:93F0: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_93F3_chr_bank_bg_0:
- D 0 - - - 0x011403 04:93F3: 50        .byte con_chr_bank + $50   ; 00 
- D 0 - - - 0x011404 04:93F4: 54        .byte con_chr_bank + $54   ; 01 

tbl_93F5_chr_bank_bg_1:
- D 0 - - - 0x011405 04:93F5: 52        .byte con_chr_bank + $52   ; 00 
- D 0 - - - 0x011406 04:93F6: 56        .byte con_chr_bank + $56   ; 01 

tbl_93F7_irq_handler:
- D 0 - - - 0x011407 04:93F7: 0E        .byte con_irq_area_6_change_floor_color   ; 00 
- D 0 - - - 0x011408 04:93F8: 0F        .byte con_irq_area_6_boss   ; 01 

tbl_93F9:
- D 0 - - - 0x011409 04:93F9: 06        .byte $06   ; 00 
- D 0 - - - 0x01140A 04:93FA: 08        .byte $08   ; 01 

; ******************************************************************************************************************

ofs_038_5B_93FB_02:
C - - J - - 0x01140B 04:93FB: A5 45     LDA ram_номер_сканлинии
sub_93FD:
C - - - - - 0x01140D 04:93FD: 38        SEC
C - - - - - 0x01140E 04:93FE: E5 72     SBC ram_скорость_камеры_Y
C - - - - - 0x011410 04:9400: 85 45     STA ram_номер_сканлинии
C - - - - - 0x011412 04:9402: C9 F0     CMP #$F0
C - - - - - 0x011414 04:9404: B0 07     BCS bra_940D
C - - - - - 0x011416 04:9406: A5 71     LDA ram_0071_тип_скролла
C - - - - - 0x011418 04:9408: 30 09     BMI bra_9413_RTS
C - - - - - 0x01141A 04:940A: 4C 7F FC  JMP loc_0x01FC8F_copy_reg_values
bra_940D:
C - - - - - 0x01141D 04:940D: 20 75 A2  JSR sub_0x00628A_удалить_объект
                                        INC ram_002B
bra_9413_RTS:
C - - - - - 0x011423 04:9413: 60        RTS




.out .sprintf("Free bytes in bank 2C: %Xh [%d]", ($A000 - *), ($A000 - *))
