.segment "BANK_30"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000 ; for listing file
; 0x020010-0x02400F



.export loc_0x000011
.export loc_0x001191_обработка_пуль_игроков
.export sub_0x001271
.export _off004_0x002B55_01_area_2
.export _off005_0x002B71_01_area_2
.export _off006_0x002F4F_01_area_2
.export _off007_0x003E9F_01_area_2



; bzk this byte must be placed at 8000
- D 0 - - - 0x000010 00:8000: 30        .byte con_prg_bank + $30   ; 



loc_0x000011:
C D 0 - - - 0x000011 00:8001: A9        LDA #$00
C - - - - - 0x000013 00:8003: 85 72     STA ram_cam_spd_Y
C - - - - - 0x000015 00:8005: 85 62     STA ram_cam_spd_X
C - - - - - 0x000029 00:8019: 20 60 83  JSR sub_8360
C - - - - - 0x00002C 00:801C: 20 BE 83  JSR sub_83BE
C - - - - - 0x00002F 00:801F: A2 00     LDX #$00    ; pl 1
                                        LDY #$01    ; pl 2
                                        LDA ram_удержанная_кнопка
                                        ORA ram_00B0_копия_удержанная_кнопка
                                        AND #con_btn_Right
                                        BEQ bra_8033
                                        LDA ram_копия_позиция_x_спрайта_игрока
                                        CMP #$80    ; граница экрана X, до начала скрола
                                        BCS bra_8035
bra_8033:
C - - - - - 0x000043 00:8033: E8        INX ; 01
C - - - - - 0x000044 00:8034: 88        DEY ; 00
bra_8035:
C - - - - - 0x000045 00:8035: 86 10     STX ram_0010
C - - - - - 0x000047 00:8037: 84 11     STY ram_0011
C - - - - - 0x000049 00:8039: 20 13 85  JSR sub_8513_обработка_статуса_игрока__правее
C - - - - - 0x00004C 00:803C: A5 10     LDA ram_0010
C - - - - - 0x00004E 00:803E: A6 11     LDX ram_0011
C - - - - - 0x000050 00:8040: 86 10     STX ram_0010
C - - - - - 0x000052 00:8042: 85 11     STA ram_0011
C - - - - - 0x000054 00:8044: 20 17 85  JSR sub_8517_обработка_статуса_игрока___левее

C - - - - - 0x000057 00:8047: A2 00     LDX #$00
C - - - - - 0x000059 00:8049: A0 01     LDY #$01
C - - - - - 0x00005B 00:804B: A5 71     LDA ram_0071_тип_скролла
C - - - - - 0x00005D 00:804D: 30 1E     BMI bra_806D
                                        LDA ram_конфиг_уровня_вид
                                        BEQ bra_8063_вид_сбоку
; вид сверху
                                        LDA ram_удержанная_кнопка
                                        AND #con_btn_Up
                                        BEQ bra_8079
                                        LDA ram_копия_позиция_y_спрайта_игрока
                                        CMP #$80    ; граница экрана Y, до начала скрола
                                        BCC bra_807C
                                        BCS bra_8079    ; jmp
bra_8063_вид_сбоку:
                                        LDA ram_копия_позиция_y_спрайта_игрока
                                        CMP ram_копия_позиция_y_спрайта_игрока + $01
                                        BCC bra_807C
                                        BNE bra_8079
C - - - - - 0x000073 00:8063: A5 AF     LDA ram_состояние_игрока_в_полете + $01
C - - - - - 0x000075 00:8065: 10 14     BPL bra_807C
C - - - - - 0x000077 00:8067: A5 A9     LDA ram_скорость_игрока_y_старш + $01
C - - - - - 0x000079 00:8069: 10 10     BPL bra_807C
C - - - - - 0x00007B 00:806B: 30 0C     BMI bra_8079    ; jmp
bra_806D:
C - - - - - 0x00007D 00:806D: A5 CF     LDA ram_копия_позиция_y_спрайта_игрока + $01
C - - - - - 0x00007F 00:806F: C5 CE     CMP ram_копия_позиция_y_спрайта_игрока
C - - - - - 0x000081 00:8071: 90 08     BCC bra_807C
C - - - - - 0x000083 00:8073: D0 04     BNE bra_8079
C - - - - - 0x000085 00:8075: 24 AF     BIT ram_состояние_игрока_в_полете + $01
C - - - - - 0x000087 00:8077: 50 02     BVC bra_807C
bra_8079:
C - - - - - 0x000089 00:8079: E8        INX ; 01
C - - - - - 0x00008A 00:807A: 88        DEY ; 00
bra_807C:
C - - - - - 0x00008B 00:807B: 86 10     STX ram_0010
C - - - - - 0x00008D 00:807D: 84 11     STY ram_0011
C - - - - - 0x00008F 00:807F: 20 AE 88  JSR sub_88AE_обработка_статуса_игрока__выше
C - - - - - 0x000092 00:8082: A5 10     LDA ram_0010
C - - - - - 0x000094 00:8084: A6 11     LDX ram_0011
C - - - - - 0x000096 00:8086: 86 10     STX ram_0010
C - - - - - 0x000098 00:8088: 85 11     STA ram_0011
C - - - - - 0x00009A 00:808A: 20 B2 88  JSR sub_88B2_обработка_статуса_игрока__ниже
C - - - - - 0x00009D 00:808D: 20 F2 83  JSR sub_83F2
; 1путин: удален код на колво S
C - - - - - 0x0000B8 00:80A8: 20 57 84  JSR sub_8457_borrow_lives
C - - - - - 0x0000BB 00:80AB: A5 CA     LDA ram_plr_game_over
C - - - - - 0x0000BD 00:80AD: 25 CB     AND ram_plr_game_over + $01
C - - - - - 0x0000BF 00:80AF: F0 03     BEQ bra_80B4_RTS
C - - - - - 0x0000C1 00:80B1: 4C F6 E8  JMP loc_0x01E906
bra_80B4_RTS:
C - - - - - 0x0000C4 00:80B4: 60        RTS


sub_80B5_обработка_анимации_игрока:
C - - - - - 0x0000C5 00:80B5: A9 FF     LDA #$FF
C - - - - - 0x0000C7 00:80B7: 95 C6     STA ram_хитбоксы_игрока,X
C - - - - - 0x0000C9 00:80B9: A9 00     LDA #$00
C - - - - - 0x0000CB 00:80BB: 95 C2     STA ram_флаг_мертвого_игрока,X
C - - - - - 0x0000CD 00:80BD: B5 BC     LDA ram_счетчик_тряска_при_выстреле,X
C - - - - - 0x0000CF 00:80BF: F0 02     BEQ bra_80C3
C - - - - - 0x0000D1 00:80C1: D6 BC     DEC ram_счетчик_тряска_при_выстреле,X
bra_80C3:
C - - - - - 0x0000D3 00:80C3: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x0000D5 00:80C5: C9 04     CMP #$04
C - - - - - 0x0000D7 00:80C7: D0 2C     BNE bra_80F5
; вода
C - - - - - 0x0000D9 00:80C9: A9 7F     LDA #$7F
C - - - - - 0x0000DB 00:80CB: 95 C6     STA ram_хитбоксы_игрока,X
C - - - - - 0x0000DD 00:80CD: A0 00     LDY #$00
C - - - - - 0x0000DF 00:80CF: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x0000E1 00:80D1: 29 04     AND #con_btn_Down
C - - - - - 0x0000E3 00:80D3: F0 02     BEQ bra_80D7
; нажал вниз, должен нырнуть под воду
C - - - - - 0x0000E5 00:80D5: A0 02     LDY #$02
bra_80D7:
C - - - - - 0x0000E7 00:80D7: 98        TYA
C - - - - - 0x0000E8 00:80D8: 4A        LSR
C - - - - - 0x0000E9 00:80D9: 95 C2     STA ram_флаг_мертвого_игрока,X
; 1путин: фикс игрока, чтобы сразу нырял под воду, если нажата вниз
                                        BNE bra_80EF
;C - - - - - 0x0000EB 00:80DB: B5 BC     LDA ram_счетчик_тряска_при_выстреле,X
;C - - - - - 0x0000ED 00:80DD: F0 10     BEQ bra_80EF
C - - - - - 0x0000EF 00:80DF: A0 04     LDY #$04
C - - - - - 0x0000F1 00:80E1: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x0000F3 00:80E3: 29 08     AND #con_btn_Up
C - - - - - 0x0000F5 00:80E5: F0 08     BEQ bra_80EF
C - - - - - 0x0000F7 00:80E7: C8        INY ; 05
C - - - - - 0x0000F8 00:80E8: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x0000FA 00:80EA: 29 03     AND #con_btns_LR
C - - - - - 0x0000FC 00:80EC: D0 01     BNE bra_80EF
C - - - - - 0x0000FE 00:80EE: C8        INY ; 06
bra_80EF:
C - - - - - 0x0000FF 00:80EF: B9 1D 82  LDA tbl_821D_кадры_игрока_в_водe,Y
C - - - - - 0x000102 00:80F2: 4C CC 81  JMP loc_81CC
bra_80F5:
C - - - - - 0x000105 00:80F5: B5 AE     LDA ram_состояние_игрока_в_полете,X
C - - - - - 0x000107 00:80F7: 0A        ASL
C - - - - - 0x000108 00:80F8: 90 03     BCC bra_80FD
C - - - - - 0x00010A 00:80FA: 4C AB 81  JMP loc_81AB
bra_80FD:
C - - - - - 0x00010D 00:80FD: 0A        ASL
C - - - - - 0x00010E 00:80FE: 90 0D     BCC bra_810D
C - - - - - 0x000110 00:8100: A9 01     LDA #$01
C - - - - - 0x000112 00:8102: B4 A0     LDY ram_статус_игрока,X
C - - - - - 0x000114 00:8104: C0 02     CPY #con_plr_status_живой
C - - - - - 0x000116 00:8106: F0 02     BEQ bra_810A
C - - - - - 0x000118 00:8108: A9 05     LDA #$05
bra_810A:
C - - - - - 0x00011A 00:810A: 4C CC 81  JMP loc_81CC
bra_810D:
C - - - - - 0x00011D 00:810D: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x00011F 00:810F: 29 03     AND #con_btns_LR
C - - - - - 0x000121 00:8111: F0 18     BEQ bra_812B
C - - - - - 0x000123 00:8113: F6 B6     INC ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000125 00:8115: B5 B6     LDA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000127 00:8117: C9 06     CMP #$06
C - - - - - 0x000129 00:8119: 90 18     BCC bra_8133
C - - - - - 0x00012B 00:811B: A9 00     LDA #$00
C - - - - - 0x00012D 00:811D: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x00012F 00:811F: F6 B4     INC ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000131 00:8121: B4 B4     LDY ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000133 00:8123: C0 06     CPY #$06
C - - - - - 0x000135 00:8125: 90 0C     BCC bra_8133
C - - - - - 0x000137 00:8127: A0 00     LDY #$00
C - - - - - 0x000139 00:8129: F0 06     BEQ bra_8131    ; jmp
bra_812B:
C - - - - - 0x00013B 00:812B: A9 00     LDA #$00
C - - - - - 0x00013D 00:812D: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x00013F 00:812F: A0 02     LDY #$02
bra_8131:
C - - - - - 0x000141 00:8131: 94 B4     STY ram_00B4_счетчик_анимаций_игрока,X
bra_8133:
C - - - - - 0x000143 00:8133: B4 B4     LDY ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000145 00:8135: A5 5C     LDA ram_статус_завершения_уровня
C - - - - - 0x000147 00:8137: F0 0F     BEQ bra_8148
; если уровень завершается
C - - - - - 0x000149 00:8139: B9 F9 81  LDA tbl_81F9,Y
C - - - - - 0x00014C 00:813C: D5 D6     CMP ram_00D6_шаги_игрока,X
C - - - - - 0x00014E 00:813E: F0 08     BEQ bra_8148
C - - - - - 0x000150 00:8140: 95 D6     STA ram_00D6_шаги_игрока,X
C - - - - - 0x000152 00:8142: A8        TAY ; update Z flag
C - - - - - 0x000153 00:8143: F0 03     BEQ bra_8148
C - - - - - 0x000155 00:8145: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_8148:
C - - - - - 0x000158 00:8148: A9 00     LDA #$00
C - - - - - 0x00015A 00:814A: 85 00     STA ram_0000
C - - - - - 0x00015C 00:814C: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x00015E 00:814E: 4A        LSR
C - - - - - 0x00015F 00:814F: 4A        LSR
C - - - - - 0x000160 00:8150: 4A        LSR
C - - - - - 0x000161 00:8151: A0 0C     LDY #$0C
C - - - - - 0x000163 00:8153: B0 23     BCS bra_8178    ; if con_btn_Down
C - - - - - 0x000165 00:8155: 4A        LSR
C - - - - - 0x000166 00:8156: A9 02     LDA #$02
C - - - - - 0x000168 00:8158: 85 00     STA ram_0000
C - - - - - 0x00016A 00:815A: A0 06     LDY #$06
C - - - - - 0x00016C 00:815C: B0 1A     BCS bra_8178    ; if con_btn_Up
C - - - - - 0x00016E 00:815E: A0 12     LDY #$12
C - - - - - 0x000170 00:8160: B5 BC     LDA ram_счетчик_тряска_при_выстреле,X
C - - - - - 0x000172 00:8162: F0 0A     BEQ bra_816E
C - - - - - 0x000174 00:8164: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000176 00:8166: 29 03     AND #con_btns_LR
C - - - - - 0x000178 00:8168: D0 36     BNE bra_81A0
C - - - - - 0x00017A 00:816A: A9 0B     LDA #$0B
C - - - - - 0x00017C 00:816C: D0 3A     BNE bra_81A8    ; jmp
bra_816E:
C - - - - - 0x00017E 00:816E: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000180 00:8170: 29 03     AND #con_btns_LR
C - - - - - 0x000182 00:8172: F0 2C     BEQ bra_81A0
C - - - - - 0x000184 00:8174: A0 00     LDY #$00
C - - - - - 0x000186 00:8176: F0 28     BEQ bra_81A0    ; jmp
bra_8178:
C - - - - - 0x000188 00:8178: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x00018A 00:817A: 29 03     AND #con_btns_LR
C - - - - - 0x00018C 00:817C: D0 22     BNE bra_81A0
C - - - - - 0x00018E 00:817E: A5 00     LDA ram_0000
C - - - - - 0x000190 00:8180: D0 10     BNE bra_8192
C - - - - - 0x000192 00:8182: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x000194 00:8184: C9 06     CMP #$06
C - - - - - 0x000196 00:8186: A0 3F     LDY #$3F
C - - - - - 0x000198 00:8188: 90 06     BCC bra_8190
C - - - - - 0x00019A 00:818A: A0 5F     LDY #$5F
C - - - - - 0x00019C 00:818C: A9 04     LDA #$04
C - - - - - 0x00019E 00:818E: 85 00     STA ram_0000
bra_8190:
C - - - - - 0x0001A0 00:8190: 94 C6     STY ram_хитбоксы_игрока,X
bra_8192:
C - - - - - 0x0001A2 00:8192: B5 BC     LDA ram_счетчик_тряска_при_выстреле,X
C - - - - - 0x0001A4 00:8194: F0 02     BEQ bra_8198
C - - - - - 0x0001A6 00:8196: E6 00     INC ram_0000
bra_8198:
C - - - - - 0x0001A8 00:8198: A4 00     LDY ram_0000
C - - - - - 0x0001AA 00:819A: B9 17 82  LDA tbl_8217,Y
C - - - - - 0x0001AD 00:819D: 4C CC 81  JMP loc_81CC
bra_81A0:
C - - - - - 0x0001B0 00:81A0: 98        TYA
C - - - - - 0x0001B1 00:81A1: 18        CLC
C - - - - - 0x0001B2 00:81A2: 75 B4     ADC ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x0001B4 00:81A4: A8        TAY
C - - - - - 0x0001B5 00:81A5: B9 FF 81  LDA tbl_81FF,Y
bra_81A8:
C - - - - - 0x0001B8 00:81A8: 4C CC 81  JMP loc_81CC



loc_81AB:
C D 0 - - - 0x0001BB 00:81AB: A9 1F     LDA #$1F
C - - - - - 0x0001BD 00:81AD: 95 C6     STA ram_хитбоксы_игрока,X
C - - - - - 0x0001BF 00:81AF: F6 B6     INC ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x0001C1 00:81B1: B5 B6     LDA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x0001C3 00:81B3: C9 05     CMP #$05
C - - - - - 0x0001C5 00:81B5: 90 10     BCC bra_81C7
C - - - - - 0x0001C7 00:81B7: A9 00     LDA #$00
C - - - - - 0x0001C9 00:81B9: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x0001CB 00:81BB: F6 B4     INC ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x0001CD 00:81BD: B5 B4     LDA ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x0001CF 00:81BF: C9 04     CMP #$04
C - - - - - 0x0001D1 00:81C1: 90 04     BCC bra_81C7
C - - - - - 0x0001D3 00:81C3: A9 00     LDA #$00
C - - - - - 0x0001D5 00:81C5: 95 B4     STA ram_00B4_счетчик_анимаций_игрока,X
bra_81C7:
C - - - - - 0x0001D7 00:81C7: B5 B4     LDA ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x0001D9 00:81C9: 18        CLC
C - - - - - 0x0001DA 00:81CA: 69 1A     ADC #$1A
sub_81CC:
loc_81CC:
C D 0 - - - 0x0001DC 00:81CC: A8        TAY
C - - - - - 0x0001DD 00:81CD: B5 C4     LDA ram_инвиз_игрока,X
C - - - - - 0x0001DF 00:81CF: F0 07     BEQ bra_81D8
C - - - - - 0x0001E1 00:81D1: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x0001E3 00:81D3: 4A        LSR
C - - - - - 0x0001E4 00:81D4: 90 02     BCC bra_81D8
C - - - - - 0x0001E6 00:81D6: A0 00     LDY #$00
bra_81D8:
C - - - - - 0x0001E8 00:81D8: 98        TYA
C - - - - - 0x0001E9 00:81D9: 9D 18 05  STA ram_кадр_игрока,X
C - - - - - 0x0001EC 00:81DC: BD F7 81  LDA tbl_81F7,X
C - - - - - 0x0001EF 00:81DF: 1D 66 05  ORA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x0001F2 00:81E2: B4 D4     LDY ram_бессмертие_игрока,X
C - - - - - 0x0001F4 00:81E4: F0 0D     BEQ bra_81F3
C - - - - - 0x0001F6 00:81E6: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x0001F8 00:81E8: 4A        LSR
C - - - - - 0x0001F9 00:81E9: 4A        LSR
C - - - - - 0x0001FA 00:81EA: BD 66 05  LDA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x0001FD 00:81ED: 29 FC     AND #$FC
C - - - - - 0x0001FF 00:81EF: 90 02     BCC bra_81F3
C - - - - - 0x000201 00:81F1: 09 01     ORA #$01
bra_81F3:
C - - - - - 0x000203 00:81F3: 9D 66 05  STA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x000206 00:81F6: 60        RTS



tbl_81F7:
- D 0 - - - 0x000207 00:81F7: 00        .byte $00   ; 00 
- D 0 - - - 0x000208 00:81F8: 01        .byte $01   ; 01 



tbl_81F9:
- D 0 - - - 0x000209 00:81F9: 07        .byte con_sound_07   ; 00 
- D 0 - - - 0x00020A 00:81FA: 00        .byte $00   ; 01 
- D 0 - - - 0x00020B 00:81FB: 00        .byte $00   ; 02 
- D 0 - - - 0x00020C 00:81FC: 07        .byte con_sound_07   ; 03 
- D 0 - - - 0x00020D 00:81FD: 00        .byte $00   ; 04 
- D 0 - - - 0x00020E 00:81FE: 00        .byte $00   ; 05 



tbl_81FF:
; 00 
- D 0 - - - 0x00020F 00:81FF: 01        .byte $01   ; 00 
- D 0 - - - 0x000210 00:8200: 02        .byte $02   ; 01 
- D 0 - - - 0x000211 00:8201: 03        .byte $03   ; 02 
- D 0 - - - 0x000212 00:8202: 04        .byte $04   ; 03 
- D 0 - - - 0x000213 00:8203: 02        .byte $02   ; 04 
- D 0 - - - 0x000214 00:8204: 05        .byte $05   ; 05 
; 06 
- D 0 - - - 0x000215 00:8205: 0C        .byte $0C   ; 00 
- D 0 - - - 0x000216 00:8206: 0D        .byte $0D   ; 01 
- D 0 - - - 0x000217 00:8207: 0E        .byte $0E   ; 02 
- D 0 - - - 0x000218 00:8208: 0F        .byte $0F   ; 03 
- D 0 - - - 0x000219 00:8209: 0D        .byte $0D   ; 04 
- D 0 - - - 0x00021A 00:820A: 10        .byte $10   ; 05 
; 0C 
- D 0 - - - 0x00021B 00:820B: 11        .byte $11   ; 00 
- D 0 - - - 0x00021C 00:820C: 12        .byte $12   ; 01 
- D 0 - - - 0x00021D 00:820D: 13        .byte $13   ; 02 
- D 0 - - - 0x00021E 00:820E: 14        .byte $14   ; 03 
- D 0 - - - 0x00021F 00:820F: 12        .byte $12   ; 04 
- D 0 - - - 0x000220 00:8210: 15        .byte $15   ; 05 
; 12 
- D 0 - - - 0x000221 00:8211: 06        .byte $06   ; 00 
- D 0 - - - 0x000222 00:8212: 07        .byte $07   ; 01 
- D 0 - - - 0x000223 00:8213: 08        .byte $08   ; 02 
- D 0 - - - 0x000224 00:8214: 09        .byte $09   ; 03 
- D 0 - - - 0x000225 00:8215: 07        .byte $07   ; 04 
- D 0 - - - 0x000226 00:8216: 0A        .byte $0A   ; 05 



tbl_8217:
- D 0 - - - 0x000227 00:8217: 16        .byte $16   ; 00 
- D 0 - - - 0x000228 00:8218: 17        .byte $17   ; 01 
- D 0 - - - 0x000229 00:8219: 18        .byte $18   ; 02 
- D 0 - - - 0x00022A 00:821A: 19        .byte $19   ; 03 
- D 0 - - - 0x00022B 00:821B: 23        .byte $23   ; 04 
- D 0 - - - 0x00022C 00:821C: 24        .byte $24   ; 05 



tbl_821D_кадры_игрока_в_водe:
- D 0 - - - 0x00022D 00:821D: 25        .byte $25   ; 00 
- - - - - - 0x00022E 00:821E: 26        .byte $26   ; 01 placeholder
- D 0 - - - 0x00022F 00:821F: 27        .byte $27   ; 02 
- - - - - - 0x000230 00:8220: 28        .byte $28   ; 03 placeholder
- D 0 - - - 0x000231 00:8221: 29        .byte $29   ; 04 
- D 0 - - - 0x000232 00:8222: 2A        .byte $2A   ; 05 
- D 0 - - - 0x000233 00:8223: 2B        .byte $2B   ; 06 



sub_8224_угол_выстрела_игрока:
C - - - - - 0x000234 00:8224: A0 00     LDY #$00
C - - - - - 0x000236 00:8226: BD 66 05  LDA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x000239 00:8229: 0A        ASL
C - - - - - 0x00023A 00:822A: 10 01     BPL bra_822D
C - - - - - 0x00023C 00:822C: C8        INY ; 01 спрайт игрока повернут влево (40)
bra_822D:
C - - - - - 0x00023D 00:822D: 84 00     STY ram_0000    ; вправо (00), влево(01)
C - - - - - 0x00023F 00:822F: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000241 00:8231: 29 0F     AND #con_btns_Dpad
                                        TAY
                                        AND #con_btns_LR
                                        BEQ bra_8230
                                        AND #$01
                                        STA ram_сторона_игрока_вид_сверху,X  ; индекс, временное хранение куда смотрит игрок
bra_8230:
                                        LDA tbl_8259_DPAD_индексы,Y
                                        ASL
                                        LDY ram_состояние_игрока_в_полете,X
                                        BPL bra_823A_на_земле
; в прыжке
                                        CLC
                                        ADC #$20    ; в прыжке
                                        BNE bra_8250    ; jmp
bra_823A_на_земле:
C - - - - - 0x000256 00:8246: B5 B2     LDY ram_поверхность_под_игроком,X
C - - - - - 0x000258 00:8248: C9 06     CPY #$06
C - - - - - 0x00025A 00:824A: B0 02     BCC bra_8250
                                        CLC
                                        ADC #$10    ; диагональ (на земле)
bra_8250:
C - - - - - 0x000260 00:8250: 65 00     ADC ram_0000    ; вправо (00), влево(01)
C - - - - - 0x000262 00:8252: A8        TAY
C - - - - - 0x000263 00:8253: B9 59 82  LDA tbl_825A_направления,Y
C - - - - - 0x000266 00:8256: 95 BA     STA ram_угол_выстрела_игрока,X
C - - - - - 0x000268 00:8258: 60        RTS


;     08
;   0A  09
; 02 DPAD 01
;   06  05
;     04
tbl_8259_DPAD_индексы:
                                        .byte $00   ; 00 NONE
                                        .byte $00   ; 01 Right
                                        .byte $04   ; 02 Left 
                                        .byte $00   ; 03 Right+LEFT (не возможен)
                                        .byte $02   ; 04 Down
                                        .byte $01   ; 05 RIGHT+DOWN
                                        .byte $03   ; 06 LEFT+DOWN
                                        .byte $00   ; 07 Right+LEFT+DOWN (не возможен)
                                        .byte $06   ; 08 Up
                                        .byte $07   ; 09 RIGHT+UP
                                        .byte $05   ; 0A LEFT+UP

;     06
;   05  07
; 04      00
;   03  01
;     02
tbl_825A_направления:
; на земле
; ровная поверхность
;                                              ----------- смотрит вправо 
;                                              |    ------ смотрит влево
;                                              |    |
                                        .byte $02, $07   ; 00 NONE/RIGHT
                                        .byte $03, $06   ; 01 RIGHT+DOWN
                                        .byte $04, $05   ; 02 DOWN
                                        .byte $03, $06   ; 03 LEFT+DOWN
                                        .byte $02, $07   ; 04 LEFT
                                        .byte $01, $08   ; 05 LEFT+UP
                                        .byte $00, $09   ; 06 UP
                                        .byte $01, $08   ; 07 RIGHT+UP
; на земле
; диагональная поверхность +10
                                        .byte $0C, $11   ; 00 NONE/RIGHT
                                        .byte $0D, $10   ; 01 RIGHT+DOWN
                                        .byte $0E, $0F   ; 02 DOWN
                                        .byte $0D, $10   ; 03 LEFT+DOWN
                                        .byte $0C, $11   ; 04 LEFT
                                        .byte $0B, $12   ; 05 LEFT+UP
                                        .byte $0A, $13   ; 06 UP
                                        .byte $0B, $12   ; 07 RIGHT+UP
; в прыжке +20
                                        .byte $16, $1A   ; 00 NONE/RIGHT
                                        .byte $17, $19   ; 01 RIGHT+DOWN
                                        .byte $18, $18   ; 02 DOWN
                                        .byte $17, $19   ; 03 LEFT+DOWN
                                        .byte $16, $1A   ; 04 LEFT
                                        .byte $15, $1B   ; 05 LEFT+UP
                                        .byte $14, $14   ; 06 UP
                                        .byte $15, $1B   ; 07 RIGHT+UP

sub_826F:
C - - - - - 0x00027F 00:826F: A9 00     LDA #$00
C - - - - - 0x000281 00:8271: 85 15     STA ram_0015
C - - - - - 0x000283 00:8273: 20 A3 82  JSR sub_82A3
C - - - - - 0x000286 00:8276: 90 29     BCC bra_82A1
C - - - - - 0x000288 00:8278: A5 FD     LDA ram_scroll_X
C - - - - - 0x00028A 00:827A: 29 0F     AND #$0F
C - - - - - 0x00028C 00:827C: 85 00     STA ram_0000
C - - - - - 0x00028E 00:827E: A9 28     LDA #$28
C - - - - - 0x000290 00:8280: 38        SEC
C - - - - - 0x000291 00:8281: E5 00     SBC ram_0000
C - - - - - 0x000293 00:8283: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
bra_8286_loop:
C - - - - - 0x000296 00:8286: 20 A3 82  JSR sub_82A3
C - - - - - 0x000299 00:8289: 90 16     BCC bra_82A1
C - - - - - 0x00029B 00:828B: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x00029E 00:828E: 18        CLC
C - - - - - 0x00029F 00:828F: 69 10     ADC #$10
C - - - - - 0x0002A1 00:8291: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0002A4 00:8294: C9 E0     CMP #$E0
C - - - - - 0x0002A6 00:8296: 90 EE     BCC bra_8286_loop
C - - - - - 0x0002A8 00:8298: A5 15     LDA ram_0015
C - - - - - 0x0002AA 00:829A: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0002AD 00:829D: D0 02     BNE bra_82A1
C - - - - - 0x0002AF 00:829F: 18        CLC
C - - - - - 0x0002B0 00:82A0: 60        RTS
bra_82A1:
C - - - - - 0x0002B1 00:82A1: 38        SEC
C - - - - - 0x0002B2 00:82A2: 60        RTS



sub_82A3:
C - - - - - 0x0002B3 00:82A3: BC 32 05  LDY ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0002B6 00:82A6: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0002B9 00:82A9: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x0002BC 00:82AC: A8        TAY
C - - - - - 0x0002BD 00:82AD: B9 CC F8  LDA tbl_0x01F8DC,Y
C - - - - - 0x0002C0 00:82B0: D0 5F     BNE bra_8311
C - - - - - 0x0002C2 00:82B2: A5 15     LDA ram_0015
C - - - - - 0x0002C4 00:82B4: D0 05     BNE bra_82BB
C - - - - - 0x0002C6 00:82B6: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0002C9 00:82B9: 85 15     STA ram_0015
bra_82BB:
C - - - - - 0x0002CB 00:82BB: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0002CE 00:82BE: 18        CLC
C - - - - - 0x0002CF 00:82BF: 69 20     ADC #$20
C - - - - - 0x0002D1 00:82C1: 85 16     STA ram_0016
bra_82C3_loop:
C - - - - - 0x0002D3 00:82C3: A4 16     LDY ram_0016
C - - - - - 0x0002D5 00:82C5: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0002D8 00:82C8: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x0002DB 00:82CB: D0 0C     BNE bra_82D9
C - - - - - 0x0002DD 00:82CD: A5 16     LDA ram_0016
C - - - - - 0x0002DF 00:82CF: 18        CLC
C - - - - - 0x0002E0 00:82D0: 69 10     ADC #$10
C - - - - - 0x0002E2 00:82D2: 85 16     STA ram_0016
C - - - - - 0x0002E4 00:82D4: C9 E0     CMP #$E0
C - - - - - 0x0002E6 00:82D6: 90 EB     BCC bra_82C3_loop
C - - - - - 0x0002E8 00:82D8: 60        RTS
bra_82D9:
C - - - - - 0x0002E9 00:82D9: 18        CLC
C - - - - - 0x0002EA 00:82DA: 60        RTS



sub_82DB_проверка_возможности_прыжка_с_платформы:
C - - - - - 0x0002EB 00:82DB: A8        TAY
C - - - - - 0x0002EC 00:82DC: 4A        LSR
C - - - - - 0x0002ED 00:82DD: 4A        LSR
C - - - - - 0x0002EE 00:82DE: 4A        LSR
C - - - - - 0x0002EF 00:82DF: 4A        LSR
C - - - - - 0x0002F0 00:82E0: 85 16     STA ram_0016
C - - - - - 0x0002F2 00:82E2: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0002F5 00:82E5: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x0002F8 00:82E8: D0 25     BNE bra_830F
C - - - - - 0x0002FA 00:82EA: A4 04     LDY ram_0004
bra_82EC_loop:
C - - - - - 0x0002FC 00:82EC: E6 16     INC ram_0016
C - - - - - 0x0002FE 00:82EE: A5 16     LDA ram_0016
C - - - - - 0x000300 00:82F0: C9 0E     CMP #$0E
C - - - - - 0x000302 00:82F2: B0 1C     BCS bra_8310_RTS
C - - - - - 0x000304 00:82F4: 98        TYA
C - - - - - 0x000305 00:82F5: 29 80     AND #$80
C - - - - - 0x000307 00:82F7: 85 17     STA ram_0017
C - - - - - 0x000309 00:82F9: 98        TYA
C - - - - - 0x00030A 00:82FA: 29 7F     AND #$7F
C - - - - - 0x00030C 00:82FC: 18        CLC
C - - - - - 0x00030D 00:82FD: 69 08     ADC #$08
C - - - - - 0x00030F 00:82FF: C9 78     CMP #$78
C - - - - - 0x000311 00:8301: 90 02     BCC bra_8305
- - - - - - 0x000313 00:8303: 69 07     ADC #$07
bra_8305:
C - - - - - 0x000315 00:8305: 29 7F     AND #$7F
C - - - - - 0x000317 00:8307: 05 17     ORA ram_0017
C - - - - - 0x000319 00:8309: A8        TAY
C - - - - - 0x00031A 00:830A: 20 1B BB  JSR sub_0x007B2B
C - - - - - 0x00031D 00:830D: F0 DD     BEQ bra_82EC_loop
bra_830F:
C - - - - - 0x00031F 00:830F: 18        CLC
bra_8310_RTS:
C - - - - - 0x000320 00:8310: 60        RTS
bra_8311:
C - - - - - 0x000321 00:8311: 38        SEC
C - - - - - 0x000322 00:8312: 60        RTS



;loc_8313_убить_игрока_если_застрял_в_стене:
;C D 0 - - - 0x000323 00:8313: A5 1B     LDA ram_счетчик_кадров
;C - - - - - 0x000325 00:8315: 29 0F     AND #$0F
;C - - - - - 0x000327 00:8317: D0 1B     BNE bra_8334_RTS
;C - - - - - 0x000329 00:8319: A5 5C     LDA ram_статус_завершения_уровня
;C - - - - - 0x00032B 00:831B: D0 17     BNE bra_8334_RTS
;C - - - - - 0x00032D 00:831D: BC 32 05  LDY ram_позиция_y_спрайта_игрока,X
;C - - - - - 0x000330 00:8320: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
;C - - - - - 0x000333 00:8323: 20 C0 BA  JSR sub_0x007AD0
;C - - - - - 0x000336 00:8326: A8        TAY
;C - - - - - 0x000337 00:8327: F0 0B     BEQ bra_8334_RTS
;C - - - - - 0x000339 00:8329: A5 5D     LDA ram_конфиг_уровня_вид
;C - - - - - 0x00033B 00:832B: D0 04     BNE bra_8331_вид_сверху
; вид сбоку
;C - - - - - 0x00033D 00:832D: C0 02     CPY #$02
;C - - - - - 0x00033F 00:832F: D0 03     BNE bra_8334_RTS
;bra_8331_вид_сверху:
;C - - - - - 0x000341 00:8331: 4C AD F6  JMP loc_0x01F6BD_убить_игрока
;bra_8334_RTS:
;C - - - - - 0x000344 00:8334: 60        RTS



loc_8335:
C D 0 - - - 0x000345 00:8335: 20 57 83  JSR sub_8357
C - - - - - 0x000348 00:8338: F0 1C     BEQ bra_8356_RTS
C - - - - - 0x00034A 00:833A: A9 18     LDA #$18
C - - - - - 0x00034C 00:833C: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
bra_833F_loop:
C - - - - - 0x00034F 00:833F: 20 57 83  JSR sub_8357
C - - - - - 0x000352 00:8342: F0 CD     BEQ bra_8311
C - - - - - 0x000354 00:8344: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000357 00:8347: 18        CLC
C - - - - - 0x000358 00:8348: 69 10     ADC #$10
C - - - - - 0x00035A 00:834A: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x00035D 00:834D: C9 F0     CMP #$F0
C - - - - - 0x00035F 00:834F: 90 EE     BCC bra_833F_loop
- - - - - - 0x000361 00:8351: A9 38     LDA #$38
- - - - - - 0x000363 00:8353: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
bra_8356_RTS:
C - - - - - 0x000366 00:8356: 60        RTS



sub_8357:
C - - - - - 0x000367 00:8357: BC 32 05  LDY ram_позиция_y_спрайта_игрока,X
C - - - - - 0x00036A 00:835A: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x00036D 00:835D: 4C C0 BA  JMP loc_0x007AD0



sub_8360:
C - - - - - 0x000370 00:8360: A5 84     LDA ram_0083 + $01
C - - - - - 0x000372 00:8362: F0 18     BEQ bra_837C
C - - - - - 0x000374 00:8364: A0 00     LDY #$00
C - - - - - 0x000376 00:8366: A2 01     LDX #$01
bra_8368_loop:
C - - - - - 0x000378 00:8368: B5 CA     LDA ram_plr_game_over,X
C - - - - - 0x00037A 00:836A: D0 08     BNE bra_8374
C - - - - - 0x00037C 00:836C: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x00037F 00:836F: C9 60     CMP #$60
C - - - - - 0x000381 00:8371: B0 01     BCS bra_8374
C - - - - - 0x000383 00:8373: C8        INY
bra_8374:
C - - - - - 0x000384 00:8374: CA        DEX
C - - - - - 0x000385 00:8375: 10 F1     BPL bra_8368_loop
C - - - - - 0x000387 00:8377: 98        TYA
C - - - - - 0x000388 00:8378: D0 15     BNE bra_838F
C - - - - - 0x00038A 00:837A: F0 38     BEQ bra_83B4    ; jmp
bra_837C:
C - - - - - 0x00038C 00:837C: A5 98     LDA ram_0098
C - - - - - 0x00038E 00:837E: F0 33     BEQ bra_83B3_RTS
C - - - - - 0x000390 00:8380: A5 98     LDA ram_0098
C - - - - - 0x000392 00:8382: 29 FE     AND #$FE
C - - - - - 0x000394 00:8384: 85 00     STA ram_0000
C - - - - - 0x000396 00:8386: C5 FC     CMP ram_scroll_Y
C - - - - - 0x000398 00:8388: F0 2A     BEQ bra_83B4
C - - - - - 0x00039A 00:838A: A5 98     LDA ram_0098
C - - - - - 0x00039C 00:838C: 4A        LSR
C - - - - - 0x00039D 00:838D: B0 12     BCS bra_83A1
bra_838F:
C - - - - - 0x00039F 00:838F: A5 9C     LDA ram_009C
C - - - - - 0x0003A1 00:8391: 30 0A     BMI bra_839D
C - - - - - 0x0003A3 00:8393: C5 82     CMP ram_0082_конфиг_уровня
C - - - - - 0x0003A5 00:8395: D0 06     BNE bra_839D
C - - - - - 0x0003A7 00:8397: A5 00     LDA ram_0000
C - - - - - 0x0003A9 00:8399: C5 FC     CMP ram_scroll_Y
C - - - - - 0x0003AB 00:839B: B0 17     BCS bra_83B4
bra_839D:
C - - - - - 0x0003AD 00:839D: A9 FF     LDA #$FF
C - - - - - 0x0003AF 00:839F: D0 10     BNE bra_83B1    ; jmp
bra_83A1:
C - - - - - 0x0003B1 00:83A1: A5 9C     LDA ram_009C
C - - - - - 0x0003B3 00:83A3: 30 0A     BMI bra_83AF
C - - - - - 0x0003B5 00:83A5: C5 82     CMP ram_0082_конфиг_уровня
C - - - - - 0x0003B7 00:83A7: D0 06     BNE bra_83AF
C - - - - - 0x0003B9 00:83A9: A5 00     LDA ram_0000
C - - - - - 0x0003BB 00:83AB: C5 FC     CMP ram_scroll_Y
C - - - - - 0x0003BD 00:83AD: 90 05     BCC bra_83B4
bra_83AF:
C - - - - - 0x0003BF 00:83AF: A9 01     LDA #$01
bra_83B1:
C - - - - - 0x0003C1 00:83B1: 85 72     STA ram_cam_spd_Y
bra_83B3_RTS:
C - - - - - 0x0003C3 00:83B3: 60        RTS
bra_83B4:
C - - - - - 0x0003C4 00:83B4: A0 00     LDY #$00
C - - - - - 0x0003C6 00:83B6: 84 98     STY ram_0098
C - - - - - 0x0003C8 00:83B8: 84 84     STY ram_0083 + $01
C - - - - - 0x0003CA 00:83BA: 88        DEY
C - - - - - 0x0003CB 00:83BB: 84 9C     STY ram_009C
C - - - - - 0x0003CD 00:83BD: 60        RTS



sub_83BE:
C - - - - - 0x0003CE 00:83BE: A6 6F     LDX ram_006F
C - - - - - 0x0003D0 00:83C0: F0 2F     BEQ bra_83F1_RTS
C - - - - - 0x0003D2 00:83C2: CA        DEX
C - - - - - 0x0003D3 00:83C3: F0 1E     BEQ bra_83E3
C - - - - - 0x0003D5 00:83C5: CA        DEX
C - - - - - 0x0003D6 00:83C6: D0 29     BNE bra_83F1_RTS
C - - - - - 0x0003D8 00:83C8: A5 61     LDA ram_0061_конфиг_уровня
C - - - - - 0x0003DA 00:83CA: D0 1B     BNE bra_83E7
C - - - - - 0x0003DC 00:83CC: A8        TAY
C - - - - - 0x0003DD 00:83CD: A2 01     LDX #$01
bra_83CF_loop:
C - - - - - 0x0003DF 00:83CF: B5 CA     LDA ram_plr_game_over,X
C - - - - - 0x0003E1 00:83D1: D0 08     BNE bra_83DB
C - - - - - 0x0003E3 00:83D3: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0003E6 00:83D6: C9 A0     CMP #$A0
C - - - - - 0x0003E8 00:83D8: 90 01     BCC bra_83DB
C - - - - - 0x0003EA 00:83DA: C8        INY
bra_83DB:
C - - - - - 0x0003EB 00:83DB: CA        DEX
C - - - - - 0x0003EC 00:83DC: 10 F1     BPL bra_83CF_loop
C - - - - - 0x0003EE 00:83DE: 98        TYA
C - - - - - 0x0003EF 00:83DF: D0 0C     BNE bra_83ED
C - - - - - 0x0003F1 00:83E1: F0 04     BEQ bra_83E7    ; jmp
bra_83E3:
C - - - - - 0x0003F3 00:83E3: A5 FD     LDA ram_scroll_X
C - - - - - 0x0003F5 00:83E5: D0 06     BNE bra_83ED
bra_83E7:
C - - - - - 0x0003F7 00:83E7: A9 00     LDA #$00
C - - - - - 0x0003F9 00:83E9: 85 6F     STA ram_006F
C - - - - - 0x0003FB 00:83EB: F0 04     BEQ bra_83F1_RTS    ; jmp
bra_83ED:
C - - - - - 0x0003FD 00:83ED: A9 01     LDA #$01
C - - - - - 0x0003FF 00:83EF: 85 62     STA ram_cam_spd_X
bra_83F1_RTS:
C - - - - - 0x000401 00:83F1: 60        RTS



sub_83F2:
C - - - - - 0x000402 00:83F2: A5 7E     LDA ram_007E
C - - - - - 0x000404 00:83F4: F0 60     BEQ bra_8456_RTS
C - - - - - 0x000406 00:83F6: 29 C0     AND #$C0
C - - - - - 0x000408 00:83F8: 85 00     STA ram_0000
C - - - - - 0x00040A 00:83FA: 45 71     EOR ram_0071_тип_скролла
C - - - - - 0x00040C 00:83FC: 25 00     AND ram_0000
C - - - - - 0x00040E 00:83FE: F0 56     BEQ bra_8456_RTS
C - - - - - 0x000410 00:8400: A5 81     LDA ram_0081
C - - - - - 0x000412 00:8402: 18        CLC
C - - - - - 0x000413 00:8403: 65 7F     ADC ram_007F
C - - - - - 0x000415 00:8405: 85 81     STA ram_0081
C - - - - - 0x000417 00:8407: A9 00     LDA #$00
C - - - - - 0x000419 00:8409: 65 80     ADC ram_номер_анимации_логотипа
C - - - - - 0x00041B 00:840B: 85 72     STA ram_cam_spd_Y
C - - - - - 0x00041D 00:840D: A5 7E     LDA ram_007E
C - - - - - 0x00041F 00:840F: 4A        LSR
C - - - - - 0x000420 00:8410: 90 44     BCC bra_8456_RTS
; C = 1
- - - - - - 0x000422 00:8412: A5 CA     LDA ram_plr_game_over
- - - - - - 0x000424 00:8414: D0 04     BNE bra_841A
- - - - - - 0x000426 00:8416: A5 AE     LDA ram_состояние_игрока_в_полете
- - - - - - 0x000428 00:8418: F0 08     BEQ bra_8422
bra_841A:
- - - - - - 0x00042A 00:841A: A5 CB     LDA ram_plr_game_over + $01
- - - - - - 0x00042C 00:841C: D0 1D     BNE bra_843B
- - - - - - 0x00042E 00:841E: A5 AF     LDA ram_состояние_игрока_в_полете + $01
- - - - - - 0x000430 00:8420: D0 19     BNE bra_843B
bra_8422:
- - - - - - 0x000432 00:8422: A5 7F     LDA ram_007F
- - - - - - 0x000434 00:8424: E9 09     SBC #< $0009
- - - - - - 0x000436 00:8426: 85 7F     STA ram_007F
- - - - - - 0x000438 00:8428: A5 80     LDA ram_номер_анимации_логотипа
- - - - - - 0x00043A 00:842A: E9 00     SBC #> $0009
- - - - - - 0x00043C 00:842C: 85 80     STA ram_номер_анимации_логотипа
- - - - - - 0x00043E 00:842E: C9 FD     CMP #$FD
- - - - - - 0x000440 00:8430: B0 24     BCS bra_8456_RTS
- - - - - - 0x000442 00:8432: A9 FD     LDA #$FD
- - - - - - 0x000444 00:8434: 85 80     STA ram_номер_анимации_логотипа
- - - - - - 0x000446 00:8436: A9 00     LDA #$00
- - - - - - 0x000448 00:8438: 85 7F     STA ram_007F
- - - - - - 0x00044A 00:843A: 60        RTS
bra_843B:
- - - - - - 0x00044B 00:843B: A5 7F     LDA ram_007F
- - - - - - 0x00044D 00:843D: 05 80     ORA ram_номер_анимации_логотипа
- - - - - - 0x00044F 00:843F: F0 15     BEQ bra_8456_RTS
- - - - - - 0x000451 00:8441: A5 7F     LDA ram_007F
- - - - - - 0x000453 00:8443: 18        CLC
- - - - - - 0x000454 00:8444: 69 08     ADC #< $0008
- - - - - - 0x000456 00:8446: 85 7F     STA ram_007F
- - - - - - 0x000458 00:8448: A5 80     LDA ram_номер_анимации_логотипа
- - - - - - 0x00045A 00:844A: 69 00     ADC #> $0008
- - - - - - 0x00045C 00:844C: 85 80     STA ram_номер_анимации_логотипа
- - - - - - 0x00045E 00:844E: 30 06     BMI bra_8456_RTS
- - - - - - 0x000460 00:8450: A9 00     LDA #$00
- - - - - - 0x000462 00:8452: 85 7F     STA ram_007F
- - - - - - 0x000464 00:8454: 85 80     STA ram_номер_анимации_логотипа
bra_8456_RTS:
C - - - - - 0x000466 00:8456: 60        RTS



sub_8457_borrow_lives:
C - - - - - 0x000467 00:8457: A5 20     LDA ram_колво_игроков
C - - - - - 0x000469 00:8459: F0 FB     BEQ bra_8456_RTS    ; if 1 player
; if 2 players
C - - - - - 0x00046B 00:845B: A2 01     LDX #$01
bra_845D_loop:
C - - - - - 0x00046D 00:845D: B5 CA     LDA ram_plr_game_over,X
C - - - - - 0x00046F 00:845F: D0 05     BNE bra_8466_player_dead
C - - - - - 0x000471 00:8461: CA        DEX
C - - - - - 0x000472 00:8462: 10 F9     BPL bra_845D_loop
C - - - - - 0x000474 00:8464: 30 F0     BMI bra_8456_RTS    ; jmp
bra_8466_player_dead:
C - - - - - 0x000476 00:8466: 8A        TXA
C - - - - - 0x000477 00:8467: 49 01     EOR #$01
C - - - - - 0x000479 00:8469: A8        TAY
C - - - - - 0x00047A 00:846A: B9 53 00  LDA ram_жизни,Y
C - - - - - 0x00047D 00:846D: C9 02     CMP #$02
C - - - - - 0x00047F 00:846F: B0 07     BCS bra_8478_enough_lives
C - - - - - 0x000481 00:8471: B9 A0 00  LDA ram_статус_игрока,Y
C - - - - - 0x000484 00:8474: C9 02     CMP #con_plr_status_живой
C - - - - - 0x000486 00:8476: D0 DE     BNE bra_8456_RTS
bra_8478_enough_lives:
C - - - - - 0x000488 00:8478: B5 F1     LDA ram_нажатая_кнопка,X
C - - - - - 0x00048A 00:847A: 29 80     AND #con_btn_A
C - - - - - 0x00048C 00:847C: F0 D8     BEQ bra_8456_RTS
C - - - - - 0x00048E 00:847E: 8A        TXA
C - - - - - 0x00048F 00:847F: 49 01     EOR #$01
C - - - - - 0x000491 00:8481: A8        TAY
C - - - - - 0x000492 00:8482: B9 53 00  LDA ram_жизни,Y
C - - - - - 0x000495 00:8485: F0 CF     BEQ bra_8456_RTS
C - - - - - 0x000497 00:8487: C9 01     CMP #$01
C - - - - - 0x000499 00:8489: D0 07     BNE bra_8492
- - - - - - 0x00049B 00:848B: B9 A0 00  LDA ram_статус_игрока,Y
- - - - - - 0x00049E 00:848E: C9 02     CMP #con_plr_status_живой
- - - - - - 0x0004A0 00:8490: D0 C4     BNE bra_8456_RTS
bra_8492:
C - - - - - 0x0004A2 00:8492: B9 53 00  LDA ram_жизни,Y
C - - - - - 0x0004A5 00:8495: 38        SEC
C - - - - - 0x0004A6 00:8496: E9 01     SBC #$01
C - - - - - 0x0004A8 00:8498: C9 FF     CMP #$FF
C - - - - - 0x0004AA 00:849A: D0 02     BNE bra_849E
- - - - - - 0x0004AC 00:849C: A9 00     LDA #$00
bra_849E:
C - - - - - 0x0004AE 00:849E: 99 53 00  STA ram_жизни,Y
C - - - - - 0x0004B1 00:84A1: A9 01     LDA #$01
C - - - - - 0x0004B3 00:84A3: 95 53     STA ram_жизни,X
C - - - - - 0x0004B5 00:84A5: 4C 60 86  JMP loc_8660



sub_84A8_проверка_напарника_на_gameover:
C - - - - - 0x0004B8 00:84A8: A4 11     LDY ram_0011
C - - - - - 0x0004BA 00:84AA: B9 CA 00  LDA ram_plr_game_over,Y
C - - - - - 0x0004BD 00:84AD: D0 06     BNE bra_84B5
C - - - - - 0x0004BF 00:84AF: B9 A0 00  LDA ram_статус_игрока,Y
C - - - - - 0x0004C2 00:84B2: C9 02     CMP #$02
C - - - - - 0x0004C4 00:84B4: 60        RTS
bra_84B5:
C - - - - - 0x0004C5 00:84B5: 18        CLC
C - - - - - 0x0004C6 00:84B6: 60        RTS



sub_84B7_уменьшить_таймеры_инвиза_и_бессмертия:
C - - - - - 0x0004C7 00:84B7: B5 C4     LDA ram_инвиз_игрока,X
C - - - - - 0x0004C9 00:84B9: F0 02     BEQ bra_84BD
C - - - - - 0x0004CB 00:84BB: D6 C4     DEC ram_инвиз_игрока,X
bra_84BD:
                                    .if con_режим_читера <> $00 ; если не равно 00
                                        LDA ram_режим_бессмертия,X
                                        BEQ bra_84BE_не_бессмертный
; требуется регулярная запись, так как перед началом нового уровня таймер очищается
                                        STA ram_бессмертие_игрока,X
                                        BNE bra_84C9_RTS    ; jmp
bra_84BE_не_бессмертный:
                                    .endif
C - - - - - 0x0004CD 00:84BD: B5 D4     LDA ram_бессмертие_игрока,X
C - - - - - 0x0004CF 00:84BF: F0 08     BEQ bra_84C9_RTS
C - - - - - 0x0004D1 00:84C1: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x0004D3 00:84C3: 29 03     AND #$03
C - - - - - 0x0004D5 00:84C5: D0 02     BNE bra_84C9_RTS
C - - - - - 0x0004D7 00:84C7: D6 D4     DEC ram_бессмертие_игрока,X
bra_84C9_RTS:
C - - - - - 0x0004D9 00:84C9: 60        RTS



sub_84D6:
C - - - - - 0x0004E6 00:84D6: A9 00     LDA #$00
C - - - - - 0x0004E8 00:84D8: 9D 18 05  STA ram_кадр_игрока,X
C - - - - - 0x0004EB 00:84DB: 9D 66 05  STA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x0004EE 00:84DE: 95 A2     STA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x0004F0 00:84E0: 95 A4     STA ram_00A4_spd_X_fr_plr,X
C - - - - - 0x0004F2 00:84E2: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x0004F4 00:84E4: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x0004F6 00:84E6: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x0004F8 00:84E8: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x0004FA 00:84EA: 95 AE     STA ram_состояние_игрока_в_полете,X
C - - - - - 0x0004FC 00:84EC: 95 B0     STA ram_00B0_копия_удержанная_кнопка,X
C - - - - - 0x0004FE 00:84EE: 95 B2     STA ram_поверхность_под_игроком,X
C - - - - - 0x000500 00:84F0: 95 B4     STA ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000502 00:84F2: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000504 00:84F4: 95 BA     STA ram_угол_выстрела_игрока,X
C - - - - - 0x000506 00:84F6: 95 BC     STA ram_счетчик_тряска_при_выстреле,X
C - - - - - 0x000508 00:84F8: 95 BE     STA ram_кд_оружия_m,X
C - - - - - 0x00050A 00:84FA: 95 C0     STA ram_таймер_респавна_игрока,X
C - - - - - 0x00050C 00:84FC: 95 C2     STA ram_флаг_мертвого_игрока,X
C - - - - - 0x00050E 00:84FE: 95 C6     STA ram_хитбоксы_игрока,X
C - - - - - 0x000510 00:8500: 95 C8     STA ram_чарж_оружия_игрока,X
C - - - - - 0x000512 00:8502: 95 CA     STA ram_plr_game_over,X
C - - - - - 0x000514 00:8504: 95 CC     STA ram_копия_позиция_x_спрайта_игрока,X
C - - - - - 0x000516 00:8506: 95 CE     STA ram_копия_позиция_y_спрайта_игрока,X
C - - - - - 0x000518 00:8508: 95 D2     STA ram_00D2_коллизии_игрока,X
C - - - - - 0x00051A 00:850A: 95 D0     STA ram_00D0_направление_игрока_вид_сверху,X
C - - - - - 0x00051C 00:850C: 95 D4     STA ram_бессмертие_игрока,X
C - - - - - 0x00051E 00:850E: 95 D6     STA ram_00D6_шаги_игрока,X
C - - - - - 0x000520 00:8510: 95 D8     STA ram_00D8_относительное_положение_игрока,X
C - - - - - 0x000522 00:8512: 60        RTS



sub_8513_обработка_статуса_игрока__правее:
C - - - - - 0x000523 00:8513: A9 00     LDA #$00    ; игрок правее другого
C - - - - - 0x000525 00:8515: F0 02     BEQ bra_8519    ; jmp



sub_8517_обработка_статуса_игрока___левее:
C - - - - - 0x000527 00:8517: A9 01     LDA #$01    ; игрок левее другого
bra_8519:
C - - - - - 0x000529 00:8519: 95 D8     STA ram_00D8_относительное_положение_игрока,X
                                        DEC ram_кд_оружия_m,X
                                        BPL bra_851B
                                        INC ram_кд_оружия_m,X
bra_851B:
C - - - - - 0x00052B 00:851B: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x00052E 00:851E: 95 CC     STA ram_копия_позиция_x_спрайта_игрока,X
C - - - - - 0x000530 00:8520: A5 5D     LDA ram_конфиг_уровня_вид
C - - - - - 0x000532 00:8522: F0 03     BEQ bra_8527_вид_сбоку
; вид сверху
C - - - - - 0x000534 00:8524: 4C 24 8A  JMP loc_8A24_обработка_статуса_игрока_на_уровне_с_видом_сверху
bra_8527_вид_сбоку:
; leon опт
                                        LDY ram_статус_игрока,X
                                        LDA tbl_852C_lo,y
                                        STA ram_0000
                                        LDA tbl_852C_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_852C_lo:
- D 0 - I - 0x00053C 00:852C: 3E 85     .byte < ofs_000_853E_00_мертвый
- D 0 - I - 0x00053E 00:852E: 5B 85     .byte < ofs_000_855B_01_респавн
- D 0 - I - 0x000540 00:8530: 99 85     .byte < ofs_000_8599_02_живой
- D 0 - I - 0x000542 00:8532: A9 85     .byte < ofs_000_85A9_03_зафиксирована_смерть
- D 0 - I - 0x000544 00:8534: C6 85     .byte < ofs_000_85C6_04_анимация_смерти
- D 0 - I - 0x000546 00:8536: 46 86     .byte < ofs_000_8646_05_лежит_на_земле_мертвый
- D 0 - I - 0x000548 00:8538: 71 86     .byte < ofs_000_8671_06_внутри_вертолета
- D 0 - I - 0x00054A 00:853A: 82 86     .byte < ofs_000_8682_07_спускается_по_веревке
- D 0 - I - 0x00054C 00:853C: 4E 85     .byte < ofs_000_854E_08_добежал_до_выхода
tbl_852C_hi:
- D 0 - I - 0x00053C 00:852C: 3E 85     .byte > ofs_000_853E_00_мертвый
- D 0 - I - 0x00053E 00:852E: 5B 85     .byte > ofs_000_855B_01_респавн
- D 0 - I - 0x000540 00:8530: 99 85     .byte > ofs_000_8599_02_живой
- D 0 - I - 0x000542 00:8532: A9 85     .byte > ofs_000_85A9_03_зафиксирована_смерть
- D 0 - I - 0x000544 00:8534: C6 85     .byte > ofs_000_85C6_04_анимация_смерти
- D 0 - I - 0x000546 00:8536: 46 86     .byte > ofs_000_8646_05_лежит_на_земле_мертвый
- D 0 - I - 0x000548 00:8538: 71 86     .byte > ofs_000_8671_06_внутри_вертолета
- D 0 - I - 0x00054A 00:853A: 82 86     .byte > ofs_000_8682_07_спускается_по_веревке
- D 0 - I - 0x00054C 00:853C: 4E 85     .byte > ofs_000_854E_08_добежал_до_выхода


ofs_000_853E_00_мертвый:
ofs_003_853E_00_мертвый:
C - - J - - 0x00054E 00:853E: A9 01     LDA #$01
C - - - - - 0x000550 00:8540: 95 CA     STA ram_plr_game_over,X
C - - - - - 0x000552 00:8542: 95 C2     STA ram_флаг_мертвого_игрока,X
C - - - - - 0x000554 00:8544: A9 FF     LDA #$FF
C - - - - - 0x000556 00:8546: 24 71     BIT ram_0071_тип_скролла
C - - - - - 0x000558 00:8548: 10 02     BPL bra_854C
C - - - - - 0x00055A 00:854A: A9 00     LDA #$00
bra_854C:
C - - - - - 0x00055C 00:854C: 95 CE     STA ram_копия_позиция_y_спрайта_игрока,X
ofs_000_854E_08_добежал_до_выхода:
ofs_003_854E_08_добежал_до_выхода:
C - - J - - 0x00055E 00:854E: A9 F0     LDA #$F0
C - - - - - 0x000560 00:8550: 9D 32 05  STA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000563 00:8553: A9 00     LDA #$00
C - - - - - 0x000565 00:8555: 9D 18 05  STA ram_кадр_игрока,X
C - - - - - 0x000568 00:8558: 95 CC     STA ram_копия_позиция_x_спрайта_игрока,X
C - - - - - 0x00056A 00:855A: 60        RTS



ofs_000_855B_01_респавн:
C - - J - - 0x00056B 00:855B: 20 D6 84  JSR sub_84D6
C - - - - - 0x00056E 00:855E: A9 60     LDA #$60
C - - - - - 0x000570 00:8560: 9D 32 05  STA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000573 00:8563: A5 50     LDA ram_номер_уровня
C - - - - - 0x000575 00:8565: 0A        ASL
C - - - - - 0x000576 00:8566: 85 00     STA ram_0000
C - - - - - 0x000578 00:8568: 8A        TXA
C - - - - - 0x000579 00:8569: 18        CLC
C - - - - - 0x00057A 00:856A: 65 00     ADC ram_0000
C - - - - - 0x00057C 00:856C: A8        TAY
C - - - - - 0x00057D 00:856D: A5 FD     LDA ram_scroll_X
C - - - - - 0x00057F 00:856F: 29 0F     AND #$0F
C - - - - - 0x000581 00:8571: 85 00     STA ram_0000
C - - - - - 0x000583 00:8573: B9 89 85  LDA tbl_8589,Y
C - - - - - 0x000586 00:8576: 38        SEC
C - - - - - 0x000587 00:8577: E5 00     SBC ram_0000
C - - - - - 0x000589 00:8579: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x00058C 00:857C: 20 6F 82  JSR sub_826F
C - - - - - 0x00058F 00:857F: 90 07     BCC bra_8588_RTS
sub_8581:
C - - - - - 0x000591 00:8581: 20 D6 84  JSR sub_84D6
                                    .if con_режим_читера <> $00 ; если не равно 00
                                        LDA ram_режим_бессмертия,X
                                        BNE bra_8586_игрок_бессмертный
                                    .endif
C - - - - - 0x000594 00:8584: D6 53     DEC ram_жизни,X
bra_8586_игрок_бессмертный:
C D 0 - - - 0x000596 00:8586: F6 A0     INC ram_статус_игрока,X
bra_8588_RTS:
C - - - - - 0x000598 00:8588: 60        RTS



tbl_8589:
- D 0 - - - 0x000599 00:8589: 48        .byte $48   ; 00 
- D 0 - - - 0x00059A 00:858A: 30        .byte $30   ; 01 
- - - - - - 0x00059B 00:858B: 48        .byte $48   ; 02 
- - - - - - 0x00059C 00:858C: 30        .byte $30   ; 03 
- D 0 - - - 0x00059D 00:858D: 48        .byte $48   ; 04 
- D 0 - - - 0x00059E 00:858E: 30        .byte $30   ; 05 
- D 0 - - - 0x00059F 00:858F: 48        .byte $48   ; 06 
- D 0 - - - 0x0005A0 00:8590: 30        .byte $30   ; 07 
- D 0 - - - 0x0005A1 00:8591: 3C        .byte $3C   ; 08 
- D 0 - - - 0x0005A2 00:8592: 24        .byte $24   ; 09 
- - - - - - 0x0005A3 00:8593: 48        .byte $48   ; 0A 
- - - - - - 0x0005A4 00:8594: 30        .byte $30   ; 0B 
- D 0 - - - 0x0005A5 00:8595: 48        .byte $48   ; 0C 
- D 0 - - - 0x0005A6 00:8596: 30        .byte $30   ; 0D 
- D 0 - - - 0x0005A7 00:8597: 48        .byte $48   ; 0E 
- D 0 - - - 0x0005A8 00:8598: 30        .byte $30   ; 0F 



ofs_000_8599_02_живой:
; уровни с видом сбоку
                                    .if con_режим_читера <> $00 ; если не равно 00
                                        JSR sub_0x000000_чтение_комбинаций_кнопок_для_читов
                                    .endif
C - - - - - 0x0005AC 00:859C: 20 C9 86  JSR sub_86C9_обработка_движения_игрока
C - - - - - 0x0005AF 00:859F: 20 B5 80  JSR sub_80B5_обработка_анимации_игрока
C - - - - - 0x0005B2 00:85A2: 20 24 82  JSR sub_8224_угол_выстрела_игрока
C - - J - - 0x0005A9 00:8599: 20 EE 8C  JSR sub_8CEE_обработка_стрельбы_игрока
                                        LDX ram_0010
                                        RTS
;C - - - - - 0x0005B5 00:85A5: 4C 13 83  JMP loc_8313_убить_игрока_если_застрял_в_стене



ofs_000_85A9_03_зафиксирована_смерть:
C - - J - - 0x0005B9 00:85A9: A9 80     LDA #$80
C - - - - - 0x0005BB 00:85AB: 95 AE     STA ram_состояние_игрока_в_полете,X
C - - - - - 0x0005BD 00:85AD: A9 C0     LDA #$C0
C - - - - - 0x0005BF 00:85AF: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x0005C1 00:85B1: A9 FD     LDA #$FD
C - - - - - 0x0005C3 00:85B3: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x0005C5 00:85B5: A9 00     LDA #$00
C - - - - - 0x0005C7 00:85B7: 95 B4     STA ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x0005C9 00:85B9: A9 06     LDA #$06
C - - - - - 0x0005CB 00:85BB: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x0005CD 00:85BD: 20 34 86  JSR sub_8634
C - - - - - 0x0005D0 00:85C0: 20 9B 87  JSR sub_879B
C - - - - - 0x0005D3 00:85C3: 4C 86 85  LDA #con_plr_status_death_anim
                                        STA ram_статус_игрока,X
                                        RTS



ofs_000_85C6_04_анимация_смерти:
C - - J - - 0x0005D6 00:85C6: A0 02     LDY #$02
C - - - - - 0x0005D8 00:85C8: BD 66 05  LDA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x0005DB 00:85CB: 0A        ASL
C - - - - - 0x0005DC 00:85CC: 10 02     BPL bra_85D0
C - - - - - 0x0005DE 00:85CE: A0 00     LDY #$00
bra_85D0:
C - - - - - 0x0005E0 00:85D0: B9 3C 86  LDA tbl_863C,Y
C - - - - - 0x0005E3 00:85D3: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x0005E5 00:85D5: B9 3D 86  LDA tbl_863C + $01,Y
C - - - - - 0x0005E8 00:85D8: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x0005EA 00:85DA: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0005ED 00:85DD: C9 F0     CMP #$F0
C - - - - - 0x0005EF 00:85DF: 90 08     BCC bra_85E9
C - - - - - 0x0005F1 00:85E1: A9 00     LDA #$00
C - - - - - 0x0005F3 00:85E3: 20 39 86  JSR sub_81CC
C - - - - - 0x0005F6 00:85E6: 4C 0E 86  JMP loc_860E
bra_85E9:
C - - - - - 0x0005F9 00:85E9: B5 A6     LDA ram_скорость_игрока_y_младш,X
C - - - - - 0x0005FB 00:85EB: 18        CLC
C - - - - - 0x0005FC 00:85EC: 69 20     ADC #< $0020
C - - - - - 0x0005FE 00:85EE: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000600 00:85F0: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000602 00:85F2: 69 00     ADC #> $0020
C - - - - - 0x000604 00:85F4: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x000606 00:85F6: 30 0C     BMI bra_8604
C - - - - - 0x000608 00:85F8: C9 04     CMP #$04
C - - - - - 0x00060A 00:85FA: 90 08     BCC bra_8604
C - - - - - 0x00060C 00:85FC: A9 00     LDA #$00
C - - - - - 0x00060E 00:85FE: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000610 00:8600: A9 04     LDA #$04
C - - - - - 0x000612 00:8602: 95 A8     STA ram_скорость_игрока_y_старш,X
bra_8604:
C - - - - - 0x000614 00:8604: 20 20 86  JSR sub_8620
C - - - - - 0x000617 00:8607: 20 9B 87  JSR sub_879B
C - - - - - 0x00061A 00:860A: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x00061C 00:860C: F0 11     BEQ bra_861F_RTS
loc_860E:
C D 0 - - - 0x00061E 00:860E: A9 00     LDA #$00
C - - - - - 0x000620 00:8610: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000622 00:8612: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x000624 00:8614: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x000626 00:8616: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x000628 00:8618: A9 60     LDA #$60
C - - - - - 0x00062A 00:861A: 95 C0     STA ram_таймер_респавна_игрока,X
C - - - - - 0x00062C 00:861C: 4C 86 85  LDA #con_plr_status_лежит_мертвый
                                        STA ram_статус_игрока,X
bra_861F_RTS:
C - - - - - 0x00062F 00:861F: 60        RTS



sub_8620:
C - - - - - 0x000630 00:8620: D6 B6     DEC ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000632 00:8622: D0 FB     BNE bra_861F_RTS
C - - - - - 0x000634 00:8624: A9 06     LDA #$06
C - - - - - 0x000636 00:8626: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000638 00:8628: F6 B4     INC ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x00063A 00:862A: B5 B4     LDA ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x00063C 00:862C: C9 05     CMP #$05
C - - - - - 0x00063E 00:862E: 90 02     BCC bra_8632
C - - - - - 0x000640 00:8630: A9 05     LDA #$05
bra_8632:
C - - - - - 0x000642 00:8632: 95 B4     STA ram_00B4_счетчик_анимаций_игрока,X
sub_8634:
C - - - - - 0x000644 00:8634: B4 B4     LDY ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000646 00:8636: B9 40 86  LDA tbl_8640,Y
C - - - - - 0x000649 00:8639: 4C CC 81  JMP loc_81CC



tbl_863C:
- D 0 - - - 0x00064C 00:863C: 40        .word $0140 ; 00 
- D 0 - - - 0x00064E 00:863E: C0        .word $FEC0 ; 02 



tbl_8640:
- D 0 - - - 0x000650 00:8640: 1E        .byte $1E   ; 00 
- D 0 - - - 0x000651 00:8641: 1F        .byte $1F   ; 01 
- D 0 - - - 0x000652 00:8642: 20        .byte $20   ; 02 
- D 0 - - - 0x000653 00:8643: 21        .byte $21   ; 03 
- D 0 - - - 0x000654 00:8644: 1E        .byte $1E   ; 04 
- D 0 - - - 0x000655 00:8645: 22        .byte $22   ; 05 



ofs_000_8646_05_лежит_на_земле_мертвый:
C - - J - - 0x000656 00:8646: 20 20 86  JSR sub_8620
loc_8649:
C D 0 - - - 0x000659 00:8649: A9 00     LDA #$00
C - - - - - 0x00065B 00:864B: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x00065D 00:864D: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x00065F 00:864F: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x000661 00:8651: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x000663 00:8653: 20 9B 87  JSR sub_879B
C - - - - - 0x000666 00:8656: D6 C0     DEC ram_таймер_респавна_игрока,X
C - - - - - 0x000668 00:8658: D0 C5     BNE bra_861F_RTS
C - - - - - 0x00066A 00:865A: A9 00     LDA #con_plr_status_мертвый
C - - - - - 0x00066C 00:865C: B4 53     LDY ram_жизни,X
C - - - - - 0x00066E 00:865E: F0 0A     BEQ bra_866A
loc_8660:
C D 0 - - - 0x000670 00:8660: A9 00     LDA #con_weapon_default
C - - - - - 0x000672 00:8662: 95 B8     STA ram_оружие_игрока,X
C - - - - - 0x000674 00:8664: A9 80     LDA #$80
C - - - - - 0x000676 00:8666: 95 C4     STA ram_инвиз_игрока,X
C - - - - - 0x000678 00:8668: A9 01     LDA #con_plr_status_респавн
bra_866A:
C - - - - - 0x00067A 00:866A: 95 A0     STA ram_статус_игрока,X
C - - - - - 0x00067C 00:866C: A9 00     LDA #$00
C - - - - - 0x00067E 00:866E: 95 C0     STA ram_таймер_респавна_игрока,X
bra_8670_RTS:
C - - - - - 0x000680 00:8670: 60        RTS



ofs_000_8671_06_внутри_вертолета:
C - - J - - 0x000681 00:8671: D6 C0     DEC ram_таймер_респавна_игрока,X
C - - - - - 0x000683 00:8673: D0 FB     BNE bra_8670_RTS
C - - - - - 0x000685 00:8675: 20 81 85  JSR sub_8581
C - - - - - 0x000688 00:8678: A9 40     LDA #$40
C - - - - - 0x00068A 00:867A: 9D 66 05  STA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x00068D 00:867D: A9 34     LDA #$34
C - - - - - 0x00068F 00:867F: 95 C0     STA ram_таймер_респавна_игрока,X
C - - - - - 0x000691 00:8681: 60        RTS



ofs_000_8682_07_спускается_по_веревке:
C - - J - - 0x000692 00:8682: A9 00     LDA #$00
C - - - - - 0x000694 00:8684: 95 F3     STA ram_удержанная_кнопка,X
C - - - - - 0x000696 00:8686: 20 C9 86  JSR sub_86C9_обработка_движения_игрока
C - - - - - 0x000699 00:8689: 20 B5 80  JSR sub_80B5_обработка_анимации_игрока
C - - - - - 0x00069C 00:868C: D6 C0     DEC ram_таймер_респавна_игрока,X
C - - - - - 0x00069E 00:868E: F0 20     BEQ bra_86B0
C - - - - - 0x0006A0 00:8690: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x0006A2 00:8692: 30 08     BMI bra_869C
C - - - - - 0x0006A4 00:8694: C9 03     CMP #$03
C - - - - - 0x0006A6 00:8696: 90 04     BCC bra_869C
C - - - - - 0x0006A8 00:8698: A9 03     LDA #$03
C - - - - - 0x0006AA 00:869A: 95 A8     STA ram_скорость_игрока_y_старш,X
bra_869C:
C - - - - - 0x0006AC 00:869C: B5 C0     LDA ram_таймер_респавна_игрока,X
C - - - - - 0x0006AE 00:869E: C9 24     CMP #$24
C - - - - - 0x0006B0 00:86A0: B0 0D     BCS bra_86AF_RTS
C - - - - - 0x0006B2 00:86A2: A9 73     LDA #$73
C - - - - - 0x0006B4 00:86A4: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0006B7 00:86A7: BD 66 05  LDA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x0006BA 00:86AA: 29 BF     AND #$BF
C - - - - - 0x0006BC 00:86AC: 9D 66 05  STA ram_атрибуты_спрайта_игрока,X
bra_86AF_RTS:
C - - - - - 0x0006BF 00:86AF: 60        RTS
bra_86B0:
C - - - - - 0x0006C0 00:86B0: A9 01     LDA #$01    ; con_btn_Right ?
C - - - - - 0x0006C2 00:86B2: 95 B0     STA ram_00B0_копия_удержанная_кнопка,X
C - - - - - 0x0006C4 00:86B4: 8A        TXA
C - - - - - 0x0006C5 00:86B5: 0A        ASL
C - - - - - 0x0006C6 00:86B6: A8        TAY
C - - - - - 0x0006C7 00:86B7: B9 C5 86  LDA tbl_86C5_spd_Y,Y
C - - - - - 0x0006CA 00:86BA: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x0006CC 00:86BC: B9 C6 86  LDA tbl_86C5_spd_Y + $01,Y
C - - - - - 0x0006CF 00:86BF: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x0006D1 00:86C1: A9 02     LDA #$02
C - - - - - 0x0006D3 00:86C3: D0 A5     BNE bra_866A    ; jmp



tbl_86C5_spd_Y:
- D 0 - - - 0x0006D5 00:86C5: 40 FF     .word $FF40 ; 00 
- D 0 - - - 0x0006D7 00:86C7: 00 00     .word $0000 ; 01 

bra_86C8_RTS:
                                        RTS

sub_86C9_обработка_движения_игрока:
C - - - - - 0x0006D9 00:86C9: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x0006DB 00:86CB: C9 04     CMP #$04
C - - - - - 0x0006DD 00:86CD: D0 0C     BNE bra_86DB
; вода
C - - - - - 0x0006DF 00:86CF: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x0006E1 00:86D1: 29 04     AND #con_btn_Down
C - - - - - 0x0006E3 00:86D3: F0 06     BEQ bra_86DB
C - - - - - 0x0006E5 00:86D5: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x0006E7 00:86D7: 29 FC     AND #con_btns_LR ^ $FF
C - - - - - 0x0006E9 00:86D9: 95 F3     STA ram_удержанная_кнопка,X
bra_86DB:
C - - - - - 0x0006EB 00:86DB: 20 B7 84  JSR sub_84B7_уменьшить_таймеры_инвиза_и_бессмертия
C - - - - - 0x0006EE 00:86DE: B5 AE     LDA ram_состояние_игрока_в_полете,X
C - - - - - 0x0006F0 00:86E0: D0 58     BNE bra_873A
C - - - - - 0x0006F2 00:86E2: B5 F1     LDA ram_нажатая_кнопка,X
C - - - - - 0x0006F4 00:86E4: 29 80     AND #con_btn_A
C - - - - - 0x0006F6 00:86E6: D0 03     BNE bra_86EB
C - - - - - 0x0006F8 00:86E8: 4C 6D 87  JMP loc_876D
bra_86EB:
C - - - - - 0x0006FB 00:86EB: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x0006FD 00:86ED: 29 0F     AND #con_btns_Dpad
C - - - - - 0x0006FF 00:86EF: C9 04     CMP #con_btn_Down
C - - - - - 0x000701 00:86F1: D0 27     BNE bra_871A
; если игрок пытается спрыгнуть с платформы
C - - - - - 0x000703 00:86F3: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x000705 00:86F5: C9 01     CMP #$01
C - - - - - 0x000707 00:86F7: D0 21     BNE bra_86C8_RTS
; если игрок находится на платформе
C - - - - - 0x000709 00:86F9: 24 71     BIT ram_0071_тип_скролла
C - - - - - 0x00070B 00:86FB: 50 0E     BVC bra_870B
C - - - - - 0x00070D 00:86FD: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000710 00:8700: 18        CLC
C - - - - - 0x000711 00:8701: 69 15     ADC #$25
C - - - - - 0x000716 00:8706: 20 DB 82  JSR sub_82DB_проверка_возможности_прыжка_с_платформы
C - - - - - 0x000719 00:8709: B0 0F     BCS bra_86C8_RTS
bra_870B:
C - - - - - 0x00071B 00:870B: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x00071E 00:870E: 18        CLC
C - - - - - 0x00071F 00:870F: 69 10     ADC #$10
C - - - - - 0x000721 00:8711: 9D 32 05  STA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000724 00:8714: 20 ED 89  JSR sub_89ED
C - - - - - 0x000727 00:8717: 4C 3A 87  JMP loc_873A
bra_871A:
C - - - - - 0x00072A 00:871A: A0 00     LDY #$00
C - - - - - 0x00072C 00:871C: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x00072E 00:871E: C9 04     CMP #$04
C - - - - - 0x000730 00:8720: D0 02     BNE bra_8724
C - - - - - 0x000732 00:8722: A0 02     LDY #$02
bra_8724:
C - - - - - 0x000734 00:8724: B9 4F 88  LDA tbl_884F_spd_Y,Y
C - - - - - 0x000737 00:8727: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000739 00:8729: B9 50 88  LDA tbl_884F_spd_Y + $01,Y
C - - - - - 0x00073C 00:872C: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x00073E 00:872E: A9 00     LDA #$00
C - - - - - 0x000740 00:8730: 95 B4     STA ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000742 00:8732: A9 80     LDA #$80
                                        STA ram_индикатор_прыжка_игрока,X
C - - - - - 0x000744 00:8734: 95 AE     STA ram_состояние_игрока_в_полете,X
C - - - - - 0x000746 00:8736: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000748 00:8738: 95 B0     STA ram_00B0_копия_удержанная_кнопка,X
bra_873A:
loc_873A:
; 1путин
                                        LDY #$00    ; дефолт гравитация
                                        LDA ram_демка
                                        CMP #$04
                                        BNE bra_873C
; игра людей
                                        BIT ram_статус_завершения_уровня
                                        BMI bra_873C
                                        LDA ram_скорость_игрока_y_старш,X
                                        BPL bra_873C
; подымается
                                        LDA ram_состояние_игрока_в_полете,X
                                        BPL bra_873C
                                        AND ram_удержанная_кнопка,X
                                        AND ram_индикатор_прыжка_игрока,X
                                        STA ram_индикатор_прыжка_игрока,X
                                        BMI bra_873C
                                        INY     ; сильная гравитация
bra_873C:
                                        LDA tbl_8850_сила_гравитации,Y
                                        CLC
C D 0 - - - 0x00074A 00:873A: B5 A6     ADC ram_скорость_игрока_y_младш,X
C - - - - - 0x00074F 00:873F: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000751 00:8741: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000753 00:8743: 69 00     ADC #$00
C - - - - - 0x000755 00:8745: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x000757 00:8747: 30 0C     BMI bra_8755
; проверка на лимит скорости
C - - - - - 0x000759 00:8749: C9 05     CMP #$05
C - - - - - 0x00075B 00:874B: 90 08     BCC bra_8755
; лимит превышен
C - - - - - 0x00075D 00:874D: A9 05     LDA #$05
C - - - - - 0x00075F 00:874F: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x000761 00:8751: A9 00     LDA #$00
C - - - - - 0x000763 00:8753: 95 A6     STA ram_скорость_игрока_y_младш,X
bra_8755:
C - - - - - 0x000765 00:8755: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000767 00:8757: 29 03     AND #con_btns_LR
C - - - - - 0x000769 00:8759: F0 02     BEQ bra_875D
C - - - - - 0x00076B 00:875B: 95 B0     STA ram_00B0_копия_удержанная_кнопка,X
bra_875D:
C - - - - - 0x00076D 00:875D: A9 04     LDA #$04
C - - - - - 0x00076F 00:875F: 85 08     STA ram_0008
C - - - - - 0x000771 00:8761: A9 08     LDA #$08
C - - - - - 0x000773 00:8763: 85 09     STA ram_0009
C - - - - - 0x000775 00:8765: B5 B0     LDA ram_00B0_копия_удержанная_кнопка,X
C - - - - - 0x000777 00:8767: 20 53 88  JSR sub_8853
C - - - - - 0x00077A 00:876A: 4C 7F 87  JMP loc_877F
loc_876D:
C D 0 - - - 0x00077D 00:876D: 20 88 88  JSR sub_8888
C - - - - - 0x000780 00:8770: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000782 00:8772: 20 53 88  JSR sub_8853
C - - - - - 0x000785 00:8775: B9 6E 88  LDA tbl_886C_speed + $02,Y
C - - - - - 0x000788 00:8778: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x00078A 00:877A: B9 6F 88  LDA tbl_886C_speed + $03,Y
C - - - - - 0x00078D 00:877D: 95 A8     STA ram_скорость_игрока_y_старш,X
loc_877F:
C D 0 - - - 0x00078F 00:877F: A0 FC     LDY #$FC
C - - - - - 0x000791 00:8781: A5 13     LDA ram_0013
C - - - - - 0x000793 00:8783: 29 03     AND #$03
C - - - - - 0x000795 00:8785: F0 07     BEQ bra_878E
C - - - - - 0x000797 00:8787: A0 3C     LDY #$3C
C - - - - - 0x000799 00:8789: 4A        LSR
C - - - - - 0x00079A 00:878A: A9 40     LDA #$40
C - - - - - 0x00079C 00:878C: 90 02     BCC bra_8790
bra_878E:
C - - - - - 0x00079E 00:878E: A9 00     LDA #$00
bra_8790:
C - - - - - 0x0007A0 00:8790: 85 08     STA ram_0008
C - - - - - 0x0007A2 00:8792: 98        TYA
C - - - - - 0x0007A3 00:8793: 3D 66 05  AND ram_атрибуты_спрайта_игрока,X
C - - - - - 0x0007A6 00:8796: 05 08     ORA ram_0008
C - - - - - 0x0007A8 00:8798: 9D 66 05  STA ram_атрибуты_спрайта_игрока,X
sub_879B:
C - - - - - 0x0007AB 00:879B: B5 D2     LDA ram_00D2_коллизии_игрока,X
C - - - - - 0x0007AD 00:879D: D0 31     BNE bra_87D0
C - - - - - 0x0007AF 00:879F: A9 0C     LDA #$0C
C - - - - - 0x0007B1 00:87A1: 85 0F     STA ram_000F
C - - - - - 0x0007B3 00:87A3: A9 04     LDA #$04
C - - - - - 0x0007B5 00:87A5: A4 AE     LDY ram_состояние_игрока_в_полете,X
C - - - - - 0x0007B7 00:87A7: F0 02     BEQ bra_87AB
C - - - - - 0x0007B9 00:87A9: A9 08     LDA #$08
bra_87AB:
C - - - - - 0x0007BB 00:87AB: 18        CLC
C - - - - - 0x0007BC 00:87AC: 7D 32 05  ADC ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0007BF 00:87AF: A8        TAY
C - - - - - 0x0007C0 00:87B0: B5 AC     LDA ram_скорость_игрока_x_старш,X
C - - - - - 0x0007C2 00:87B2: 15 AA     ORA ram_скорость_игрока_x_младш,X
C - - - - - 0x0007C4 00:87B4: F0 1A     BEQ bra_87D0
C - - - - - 0x0007C6 00:87B6: B5 AC     LDA ram_скорость_игрока_x_старш,X
C - - - - - 0x0007C8 00:87B8: 0A        ASL
C - - - - - 0x0007C9 00:87B9: A9 0A     LDA #$05
C - - - - - 0x0007CB 00:87BB: 90 02     BCC bra_87BF
C - - - - - 0x0007CD 00:87BD: A9 F6     LDA #$FB
bra_87BF:
C - - - - - 0x0007CF 00:87BF: 18        CLC
C - - - - - 0x0007D0 00:87C0: 7D 4C 05  ADC ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0007D3 00:87C3: 20 7F BB  JSR sub_0x007B8F
C - - - - - 0x0007D6 00:87C6: 90 08     BCC bra_87D0
C - - - - - 0x0007D8 00:87C8: A9 00     LDA #$00
C - - - - - 0x0007DA 00:87CA: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x0007DC 00:87CC: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x0007DE 00:87CE: 95 CC     STA ram_копия_позиция_x_спрайта_игрока,X
bra_87D0:
C - - - - - 0x0007E0 00:87D0: B5 AC     LDA ram_скорость_игрока_x_старш,X
C - - - - - 0x0007E2 00:87D2: 38        SEC
C - - - - - 0x0007E3 00:87D3: E5 62     SBC ram_cam_spd_X
C - - - - - 0x0007E5 00:87D5: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x0007E7 00:87D7: BC 4C 05  LDY ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0007EA 00:87DA: 15 AA     ORA ram_скорость_игрока_x_младш,X
C - - - - - 0x0007EC 00:87DC: F0 6D     BEQ bra_884B_RTS
C - - - - - 0x0007EE 00:87DE: B5 AC     LDA ram_скорость_игрока_x_старш,X
C - - - - - 0x0007F0 00:87E0: 10 13     BPL bra_87F5
C - - - - - 0x0007F2 00:87E2: C0 14     CPY #$14    ; левый край экрана
C - - - - - 0x0007F4 00:87E4: 90 65     BCC bra_884B_RTS
C - - - - - 0x0007F6 00:87E6: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0007F9 00:87E9: C9 16     CMP #$16
C - - - - - 0x0007FB 00:87EB: B0 49     BCS bra_8836_двигать_игрока
C - - - - - 0x0007FD 00:87ED: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x0007FF 00:87EF: C9 09     CMP #$09
C - - - - - 0x000801 00:87F1: B0 58     BCS bra_884B_RTS
C - - - - - 0x000803 00:87F3: 90 41     BCC bra_8836_двигать_игрока    ; jmp
bra_87F5:
C - - - - - 0x000805 00:87F5: 98        TYA
C - - - - - 0x00080C 00:87FC: D9 4C 88  CMP #$80    ; граница экрана X, до начала скрола
C - - - - - 0x00080F 00:87FF: 90 35     BCC bra_8836_двигать_игрока
; предел X превышен
C - - - - - 0x000811 00:8801: A5 61     LDA ram_0061_конфиг_уровня
C - - - - - 0x000813 00:8803: D0 20     BNE bra_8825
C - - - - - 0x000815 00:8805: B5 D8     LDA ram_00D8_относительное_положение_игрока,X
C - - - - - 0x000817 00:8807: D0 2D     BNE bra_8834_двигать_игрока_вправо
C - - - - - 0x000819 00:8809: 20 A8 84  JSR sub_84A8_проверка_напарника_на_gameover
C - - - - - 0x00081C 00:880C: 90 07     BCC bra_8815_двигать_камеру
; напарник живой
C - - - - - 0x00081E 00:880E: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x000821 00:8811: C9 14     CMP #$14    ; левый край экрана
C - - - - - 0x000823 00:8813: 90 36     BCC bra_8834_двигать_игрока_вправо
; можно двигать
bra_8815_двигать_камеру:
C - - - - - 0x000825 00:8815: B5 A4     LDA ram_00A4_spd_X_fr_plr,X
C - - - - - 0x000827 00:8817: 18        CLC
C - - - - - 0x000828 00:8818: 75 AA     ADC ram_скорость_игрока_x_младш,X
C - - - - - 0x00082A 00:881A: 95 A4     STA ram_00A4_spd_X_fr_plr,X
C - - - - - 0x00082C 00:881C: A9 00     LDA #$00
C - - - - - 0x00082E 00:881E: 75 AC     ADC ram_скорость_игрока_x_старш,X
C - - - - - 0x000830 00:8820: 85 62     STA ram_cam_spd_X
C - - - - - 0x000832 00:8822: 4C 4B 88  RTS
bra_8825:
C - - - - - 0x000835 00:8825: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000838 00:8828: C9 16     CMP #$16
C - - - - - 0x00083A 00:882A: B0 0A     BCS bra_8834_двигать_игрока_вправо
C - - - - - 0x00083C 00:882C: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x00083E 00:882E: C9 06     CMP #$06
C - - - - - 0x000840 00:8830: 90 04     BCC bra_8834_двигать_игрока_вправо
- - - - - - 0x000842 00:8832: C9 09     CMP #$09
- - - - - - 0x000844 00:8834: 90 15     BCC bra_884B_RTS
bra_8834_двигать_игрока_вправо:
                                        LDA ram_позиция_x_спрайта_игрока,X
                                        CMP #$EC    ; позиция_x_спрайта_игрока (правый край экрана)
                                        BCS bra_884B_RTS
bra_8836_двигать_игрока:
C - - - - - 0x000846 00:8836: B5 A4     LDA ram_00A4_spd_X_fr_plr,X
C - - - - - 0x000848 00:8838: 18        CLC
C - - - - - 0x000849 00:8839: 75 AA     ADC ram_скорость_игрока_x_младш,X
C - - - - - 0x00084B 00:883B: 95 A4     STA ram_00A4_spd_X_fr_plr,X
C - - - - - 0x00084D 00:883D: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000850 00:8840: 75 AC     ADC ram_скорость_игрока_x_старш,X
C - - - - - 0x000852 00:8842: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000855 00:8845: B4 CC     LDY ram_копия_позиция_x_спрайта_игрока,X
C - - - - - 0x000857 00:8847: F0 02     BEQ bra_884B_RTS
C - - - - - 0x000859 00:8849: 95 CC     STA ram_копия_позиция_x_спрайта_игрока,X
bra_884B_RTS:
C D 0 - - - 0x00085B 00:884B: 60        RTS



tbl_884F_spd_Y:
- D 0 - - - 0x00085F 00:884F: F0 FB     .word $FBF0 ; 00 
- D 0 - - - 0x000861 00:8851: 00 FD     .word $FD00 ; 02 


tbl_8850_сила_гравитации:
                                        .byte $23 ; 00 высокий прыжок
                                        .byte $46 ; 01 низкий прыжок



sub_8853:
C - - - - - 0x000863 00:8853: 85 13     STA ram_0013
C - - - - - 0x000865 00:8855: A4 08     LDY ram_0008
C - - - - - 0x000867 00:8857: 4A        LSR
C - - - - - 0x000868 00:8858: B0 07     BCS bra_8861    ; if was 00
C - - - - - 0x00086A 00:885A: A4 09     LDY ram_0009
C - - - - - 0x00086C 00:885C: 4A        LSR
C - - - - - 0x00086D 00:885D: B0 02     BCS bra_8861    ; if was 00
C - - - - - 0x00086F 00:885F: A0 00     LDY # off_886C_00 - tbl_886C    ; default
bra_8861:
C - - - - - 0x000871 00:8861: B9 6C 88  LDA tbl_886C_speed,Y
C - - - - - 0x000874 00:8864: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x000876 00:8866: B9 6D 88  LDA tbl_886C_speed + $01,Y
C - - - - - 0x000879 00:8869: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x00087B 00:886B: 60        RTS


tbl_886C:
tbl_886C_speed:
; on different surfaces
off_886C_00:
- D 0 - - - 0x00087C 00:886C: 00 00     .word $0000 ; X
- D 0 - - - 0x00087E 00:886E: 00 00     .word $0000 ; Y

off_8870_04:
- D 0 - - - 0x000880 00:8870: 00 01     .word $0100 ; X
- D 0 - - - 0x000882 00:8872: 00 00     .word $0000 ; Y

off_8874_08:
- D 0 - - - 0x000884 00:8874: 00 FF     .word $FF00 ; X
- D 0 - - - 0x000886 00:8876: 00 00     .word $0000 ; Y

off_8878_0C:
- D 0 - - - 0x000888 00:8878: E0 00     .word $00E0 ; X
- D 0 - - - 0x00088A 00:887A: 70 00     .word $0070 ; Y

off_887C_10:
- D 0 - - - 0x00088C 00:887C: 20 FF     .word $FF20 ; X
- D 0 - - - 0x00088E 00:887E: 70 00     .word $0070 ; Y

off_8880_14:
- D 0 - - - 0x000890 00:8880: E0 00     .word $00E0 ; X
- D 0 - - - 0x000892 00:8882: 90 FF     .word $FF90 ; Y

off_8884_18:
- D 0 - - - 0x000894 00:8884: 20 FF     .word $FF20 ; X
- D 0 - - - 0x000896 00:8886: 90 FF     .word $FF90 ; Y



sub_8888:
C - - - - - 0x000898 00:8888: B4 B2     LDY ram_поверхность_под_игроком,X
C - - - - - 0x00089A 00:888A: C0 06     CPY #$06
C - - - - - 0x00089C 00:888C: B0 09     BCS bra_8897_diagonal
C - - - - - 0x00089E 00:888E: A9 04     LDA # off_8870_04 - tbl_886C
C - - - - - 0x0008A0 00:8890: 85 08     STA ram_0008
C - - - - - 0x0008A2 00:8892: A9 08     LDA # off_8874_08 - tbl_886C
C - - - - - 0x0008A4 00:8894: 85 09     STA ram_0009
C - - - - - 0x0008A6 00:8896: 60        RTS
bra_8897_diagonal:
C - - - - - 0x0008A7 00:8897: B9 9C 88  LDA tbl_88A2_index_1 - $06,Y
C - - - - - 0x0008AA 00:889A: 85 08     STA ram_0008
C - - - - - 0x0008AC 00:889C: B9 A2 88  LDA tbl_88A8_index_2 - $06,Y
C - - - - - 0x0008AF 00:889F: 85 09     STA ram_0009
C - - - - - 0x0008B1 00:88A1: 60        RTS



tbl_88A2_index_1:
- D 0 - - - 0x0008B2 00:88A2: 14        .byte off_8880_14 - tbl_886C   ; 06 
- D 0 - - - 0x0008B3 00:88A3: 14        .byte off_8880_14 - tbl_886C   ; 07 
- D 0 - - - 0x0008B4 00:88A4: 14        .byte off_8880_14 - tbl_886C   ; 08 
- D 0 - - - 0x0008B5 00:88A5: 0C        .byte off_8878_0C - tbl_886C   ; 09 
- D 0 - - - 0x0008B6 00:88A6: 0C        .byte off_8878_0C - tbl_886C   ; 0A 
- D 0 - - - 0x0008B7 00:88A7: 0C        .byte off_8878_0C - tbl_886C   ; 0B 



tbl_88A8_index_2:
- D 0 - - - 0x0008B8 00:88A8: 10        .byte off_887C_10 - tbl_886C   ; 06 
- D 0 - - - 0x0008B9 00:88A9: 10        .byte off_887C_10 - tbl_886C   ; 07 
- D 0 - - - 0x0008BA 00:88AA: 10        .byte off_887C_10 - tbl_886C   ; 08 
- D 0 - - - 0x0008BB 00:88AB: 18        .byte off_8884_18 - tbl_886C   ; 09 
- D 0 - - - 0x0008BC 00:88AC: 18        .byte off_8884_18 - tbl_886C   ; 0A 
- D 0 - - - 0x0008BD 00:88AD: 18        .byte off_8884_18 - tbl_886C   ; 0B 



sub_88AE_обработка_статуса_игрока__выше:
C - - - - - 0x0008BE 00:88AE: A9 00     LDA #$00    ; игрок выше другого
C - - - - - 0x0008C0 00:88B0: F0 02     BEQ bra_88B4    ; jmp


sub_88B2_обработка_статуса_игрока__ниже:
C - - - - - 0x0008C2 00:88B2: A9 01     LDA #$01    ; игрок ниже другого
bra_88B4:
C - - - - - 0x0008C4 00:88B4: 95 D8     STA ram_00D8_относительное_положение_игрока,X
C - - - - - 0x0008C6 00:88B6: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0008C9 00:88B9: 95 CE     STA ram_копия_позиция_y_спрайта_игрока,X
C - - - - - 0x0008CB 00:88BB: A5 5D     LDA ram_конфиг_уровня_вид
C - - - - - 0x0008CD 00:88BD: F0 03     BEQ bra_88C2_вид_сбоку
; вид сверху
C - - - - - 0x0008CF 00:88BF: 4C 28 8C  JMP loc_8C28_обработка_статуса_игрока_на_уровне_с_видом_сверху
bra_88C2_вид_сбоку:
; leon опт
                                        LDY ram_статус_игрока,X
                                        LDA tbl_88C7_lo,y
                                        STA ram_0000
                                        LDA tbl_88C7_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_88C7_lo:
- D 0 - I - 0x0008D7 00:88C7: F5 88     .byte < _общий_RTS ; 00 мертвый
- D 0 - I - 0x0008D9 00:88C9: F5 88     .byte < _общий_RTS ; 01 респавн
- D 0 - I - 0x0008DB 00:88CB: DD 88     .byte < ofs_001_88DD_02_живой
- D 0 - I - 0x0008DD 00:88CD: E3 88     .byte < ofs_001_88E3_03_зафиксирована_смерть
- D 0 - I - 0x0008DF 00:88CF: E3 88     .byte < ofs_001_88E3_04_анимация_смерти
- D 0 - I - 0x0008E1 00:88D1: E9 88     .byte < ofs_001_88E9_05_лежит_на_земле_мертвый
- D 0 - I - 0x0008E3 00:88D3: F5 88     .byte < _общий_RTS ; 06 внутри вертолета
- D 0 - I - 0x0008E5 00:88D5: D9 88     .byte < ofs_001_88D9_07_спускается_по_веревке
- D 0 - I - 0x0008E7 00:88D7: F5 88     .byte < _общий_RTS ; 08 добежал до выхода
tbl_88C7_hi:
- D 0 - I - 0x0008D7 00:88C7: F5 88     .byte > _общий_RTS ; 00 мертвый
- D 0 - I - 0x0008D9 00:88C9: F5 88     .byte > _общий_RTS ; 01 респавн
- D 0 - I - 0x0008DB 00:88CB: DD 88     .byte > ofs_001_88DD_02_живой
- D 0 - I - 0x0008DD 00:88CD: E3 88     .byte > ofs_001_88E3_03_зафиксирована_смерть
- D 0 - I - 0x0008DF 00:88CF: E3 88     .byte > ofs_001_88E3_04_анимация_смерти
- D 0 - I - 0x0008E1 00:88D1: E9 88     .byte > ofs_001_88E9_05_лежит_на_земле_мертвый
- D 0 - I - 0x0008E3 00:88D3: F5 88     .byte > _общий_RTS ; 06 внутри вертолета
- D 0 - I - 0x0008E5 00:88D5: D9 88     .byte > ofs_001_88D9_07_спускается_по_веревке
- D 0 - I - 0x0008E7 00:88D7: F5 88     .byte > _общий_RTS ; 08 добежал до выхода


ofs_001_88D9_07_спускается_по_веревке:
C - - J - - 0x0008E9 00:88D9: A9 00     LDA #$00
C - - - - - 0x0008EB 00:88DB: 95 F3     STA ram_удержанная_кнопка,X
ofs_001_88DD_02_живой:
C - - - - - 0x0008ED 00:88DD: 20 F6 88  JSR sub_88F6
C - - - - - 0x0008F0 00:88E0: 4C C3 89  JMP loc_89C3



bra_88E3:
ofs_001_88E3_03_зафиксирована_смерть:
ofs_001_88E3_04_анимация_смерти:
C - - J - - 0x0008F3 00:88E3: 20 00 89  JSR sub_8900
C - - - - - 0x0008F6 00:88E6: 4C C3 89  JMP loc_89C3



ofs_001_88E9_05_лежит_на_земле_мертвый:
C - - J - - 0x0008F9 00:88E9: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0008FC 00:88EC: C9 E0     CMP #$E0
C - - - - - 0x0008FE 00:88EE: 90 F3     BCC bra_88E3
C - - - - - 0x000900 00:88F0: A9 00     LDA #$00
C - - - - - 0x000902 00:88F2: 9D 18 05  STA ram_кадр_игрока,X
C - - J - - 0x000905 00:88F5: 60        RTS



sub_88F6:
C - - - - - 0x000906 00:88F6: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000909 00:88F9: C9 E0     CMP #$E0
C - - - - - 0x00090B 00:88FB: 90 03     BCC bra_8900
C - - - - - 0x00090D 00:88FD: 4C AD F6  JMP loc_0x01F6BD_убить_игрока
bra_8900:
sub_8900:
C - - - - - 0x000910 00:8900: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000912 00:8902: 38        SEC
C - - - - - 0x000913 00:8903: E5 72     SBC ram_cam_spd_Y
C - - - - - 0x000915 00:8905: 85 14     STA ram_0014
C - - - - - 0x000917 00:8907: 15 A6     ORA ram_скорость_игрока_y_младш,X
C - - - - - 0x000919 00:8909: D0 03     BNE bra_890E
C - - - - - 0x00091B 00:890B: 4C A0 89  RTS
bra_890E:
C - - - - - 0x00091E 00:890E: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000921 00:8911: A4 14     LDY ram_0014
C - - - - - 0x000923 00:8913: 10 3B     BPL bra_8950
C - - - - - 0x000925 00:8915: 20 A1 89  JSR sub_89A1
C - - - - - 0x000928 00:8918: F0 0F     BEQ bra_8929
C - - - - - 0x00092A 00:891A: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x00092D 00:891D: 18        CLC
C - - - - - 0x00092E 00:891E: 65 9A     ADC ram_009A
C - - - - - 0x000930 00:8920: 9D 32 05  STA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000933 00:8923: A9 00     LDA #$00
C - - - - - 0x000935 00:8925: 95 CE     STA ram_копия_позиция_y_спрайта_игрока,X
C - - - - - 0x000937 00:8927: F0 77     BEQ bra_89A0_RTS    ; jmp
bra_8929:
C - - - - - 0x000939 00:8929: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x00093C 00:892C: C9 12     CMP #$12
C - - - - - 0x00093E 00:892E: 90 70     BCC bra_89A0_RTS
C - - - - - 0x000940 00:8930: C9 60     CMP #$60
C - - - - - 0x000942 00:8932: B0 5B     BCS bra_898F
C - - - - - 0x000944 00:8934: B5 D8     LDA ram_00D8_относительное_положение_игрока,X
C - - - - - 0x000946 00:8936: D0 57     BNE bra_898F
C - - - - - 0x000948 00:8938: A5 71     LDA ram_0071_тип_скролла
C - - - - - 0x00094A 00:893A: 30 53     BMI bra_898F
C - - - - - 0x00094C 00:893C: A5 7E     LDA ram_007E
C - - - - - 0x00094E 00:893E: D0 4F     BNE bra_898F
C - - - - - 0x000950 00:8940: B5 A2     LDA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x000952 00:8942: 18        CLC
C - - - - - 0x000953 00:8943: 75 A6     ADC ram_скорость_игрока_y_младш,X
C - - - - - 0x000955 00:8945: 95 A2     STA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x000957 00:8947: A9 00     LDA #$00
C - - - - - 0x000959 00:8949: 65 14     ADC ram_0014
C - - - - - 0x00095B 00:894B: 85 72     STA ram_cam_spd_Y
C - - - - - 0x00095D 00:894D: 4C A0 89  RTS
bra_8950:
C - - - - - 0x000960 00:8950: A4 9A     LDY ram_009A
C - - - - - 0x000962 00:8952: F0 0F     BEQ bra_8963
C - - - - - 0x000964 00:8954: 20 A1 89  JSR sub_89A1
C - - - - - 0x000967 00:8957: F0 07     BEQ bra_8960
C - - - - - 0x000969 00:8959: A5 14     LDA ram_0014
C - - - - - 0x00096B 00:895B: 18        CLC
C - - - - - 0x00096C 00:895C: 65 9A     ADC ram_009A
C - - - - - 0x00096E 00:895E: 85 14     STA ram_0014
bra_8960:
C - - - - - 0x000970 00:8960: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
bra_8963:
C - - - - - 0x000973 00:8963: C5 97     CMP ram_0097_конфиг_уровня
C - - - - - 0x000975 00:8965: 90 28     BCC bra_898F
C - - - - - 0x000977 00:8967: A4 72     LDY ram_cam_spd_Y
C - - - - - 0x000979 00:8969: D0 24     BNE bra_898F
C - - - - - 0x00097B 00:896B: 24 71     BIT ram_0071_тип_скролла
C - - - - - 0x00097D 00:896D: 70 20     BVS bra_898F
C - - - - - 0x00097F 00:896F: A5 7E     LDA ram_007E
C - - - - - 0x000981 00:8971: D0 1C     BNE bra_898F
C - - - - - 0x000983 00:8973: 20 A8 84  JSR sub_84A8_проверка_напарника_на_gameover
C - - - - - 0x000986 00:8976: 90 07     BCC bra_897F
; напарник живой
C - - - - - 0x000988 00:8978: B9 32 05  LDA ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x00098B 00:897B: C9 22     CMP #$22
C - - - - - 0x00098D 00:897D: 90 10     BCC bra_898F
bra_897F:
C - - - - - 0x00098F 00:897F: B5 A2     LDA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x000991 00:8981: 18        CLC
C - - - - - 0x000992 00:8982: 75 A6     ADC ram_скорость_игрока_y_младш,X
C - - - - - 0x000994 00:8984: 95 A2     STA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x000996 00:8986: A9 00     LDA #$00
C - - - - - 0x000998 00:8988: 65 14     ADC ram_0014
C - - - - - 0x00099A 00:898A: 85 72     STA ram_cam_spd_Y
C - - - - - 0x00099C 00:898C: 4C A0 89  RTS
bra_898F:
C - - - - - 0x00099F 00:898F: B5 A2     LDA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x0009A1 00:8991: 18        CLC
C - - - - - 0x0009A2 00:8992: 75 A6     ADC ram_скорость_игрока_y_младш,X
C - - - - - 0x0009A4 00:8994: 95 A2     STA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x0009A6 00:8996: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0009A9 00:8999: 65 14     ADC ram_0014
C - - - - - 0x0009AB 00:899B: 9D 32 05  STA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0009AE 00:899E: 95 CE     STA ram_копия_позиция_y_спрайта_игрока,X
bra_89A0_RTS:
C D 0 - - - 0x0009B0 00:89A0: 60        RTS


sub_89A1:
C - - - - - 0x0009B1 00:89A1: 18        CLC
C - - - - - 0x0009B2 00:89A2: 69 F6     ADC #$F6
C - - - - - 0x0009B4 00:89A4: A8        TAY
C - - - - - 0x0009B5 00:89A5: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0009B8 00:89A8: 20 AA BA  JSR sub_0x007ABA_calculate_surface_type
C - - - - - 0x0009BB 00:89AB: C9 06     CMP #$06
C - - - - - 0x0009BD 00:89AD: 90 08     BCC bra_89B7
C - - - - - 0x0009BF 00:89AF: A9 02     LDA #$02
C - - - - - 0x0009C1 00:89B1: A4 8F     LDY ram_008F_конфиг_уровня
C - - - - - 0x0009C3 00:89B3: D0 02     BNE bra_89B7
C - - - - - 0x0009C5 00:89B5: A9 00     LDA #$00
bra_89B7:
C - - - - - 0x0009C7 00:89B7: A8        TAY
C - - - - - 0x0009C8 00:89B8: B9 BC 89  LDA tbl_89BC,Y
C - - - - - 0x0009CB 00:89BB: 60        RTS



tbl_89BC:
- D 0 - - - 0x0009CC 00:89BC: 00        .byte $00   ; 00 
- D 0 - - - 0x0009CD 00:89BD: 00        .byte $00   ; 01 
- D 0 - - - 0x0009CE 00:89BE: 01        .byte $01   ; 02 
- D 0 - - - 0x0009CF 00:89BF: 01        .byte $01   ; 03 
- - - - - - 0x0009D0 00:89C0: 01        .byte $01   ; 04 
- - - - - - 0x0009D1 00:89C1: 00        .byte $00   ; 05 



bra_89C2_RTS:
C - - - - - 0x0009D2 00:89C2: 60        RTS



loc_89C3:
C D 0 - - - 0x0009D3 00:89C3: A9 00     LDA #$00
C - - - - - 0x0009D5 00:89C5: 95 B2     STA ram_поверхность_под_игроком,X
C - - - - - 0x0009D7 00:89C7: B5 AE     LDA ram_состояние_игрока_в_полете,X
C - - - - - 0x0009D9 00:89C9: 10 06     BPL bra_89D1
; в прыжке (сам)
C - - - - - 0x0009DB 00:89CB: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x0009DD 00:89CD: 30 F3     BMI bra_89C2_RTS
C - - - - - 0x0009DF 00:89CF: F0 F1     BEQ bra_89C2_RTS
; опускается
; 1путин: попытка фикса застревания в углу для 2д уровней
                                        LDY ram_номер_уровня
                                        LDA tbl_8A20_доп_y_спрайта,Y
                                        BNE bra_89D3    ; jmp
bra_89D1:
                                        LDA #$15
bra_89D3:
C - - - - - 0x0009E3 00:89D3: 85 07     STA ram_0007
C - - - - - 0x0009E5 00:89D5: 18        CLC
C - - - - - 0x0009E6 00:89D6: 7D 32 05  ADC ram_позиция_y_спрайта_игрока,X
C - - - - - 0x0009E9 00:89D9: A8        TAY
C - - - - - 0x0009EA 00:89DA: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x0009ED 00:89DD: 18        CLC
C - - - - - 0x0009EE 00:89DE: 65 62     ADC ram_cam_spd_X
C - - - - - 0x0009F0 00:89E0: 20 AA BA  JSR sub_0x007ABA_calculate_surface_type
C - - - - - 0x0009F3 00:89E3: 95 B2     STA ram_поверхность_под_игроком,X
C - - - - - 0x0009F5 00:89E5: 85 09     STA ram_0009
C - - - - - 0x0009F7 00:89E7: D0 0D     BNE bra_89F6
C - - - - - 0x0009F9 00:89E9: B5 AE     LDA ram_состояние_игрока_в_полете,X
C - - - - - 0x0009FB 00:89EB: D0 D5     BNE bra_89C2_RTS
sub_89ED:
C - - - - - 0x0009FD 00:89ED: A9 40     LDA #$40
C - - - - - 0x0009FF 00:89EF: 95 AE     STA ram_состояние_игрока_в_полете,X
C - - - - - 0x000A01 00:89F1: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000A03 00:89F3: 95 B0     STA ram_00B0_копия_удержанная_кнопка,X
C - - - - - 0x000A05 00:89F5: 60        RTS
bra_89F6:
C - - - - - 0x000A06 00:89F6: B5 AE     LDA ram_состояние_игрока_в_полете,X
C - - - - - 0x000A08 00:89F8: F0 0B     BEQ bra_8A05
C - - - - - 0x000A0A 00:89FA: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x000A0C 00:89FC: C9 04     CMP #$04
C - - - - - 0x000A0E 00:89FE: F0 05     BEQ bra_8A05
C - - - - - 0x000A10 00:8A00: A9 06     LDA #con_sound_06
C - - - - - 0x000A12 00:8A02: 20 DE FD  JSR sub_0x01FDEE_play_sound
bra_8A05:
C - - - - - 0x000A15 00:8A05: A9 00     LDA #$00
                                        STA ram_индикатор_прыжка_игрока,X
C - - - - - 0x000A17 00:8A07: 95 AE     STA ram_состояние_игрока_в_полете,X
C - - - - - 0x000A19 00:8A09: 95 B0     STA ram_00B0_копия_удержанная_кнопка,X
C - - - - - 0x000A1B 00:8A0B: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000A1D 00:8A0D: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x000A1F 00:8A0F: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x000A21 00:8A11: C9 04     CMP #$04
C - - - - - 0x000A23 00:8A13: D0 08     BNE bra_8A1D
C - - - - - 0x000A25 00:8A15: A5 5B     LDA ram_счетчик_кадров
C - - - - - 0x000A27 00:8A17: 29 10     AND #$10
C - - - - - 0x000A29 00:8A19: F0 02     BEQ bra_8A1D
C - - - - - 0x000A2B 00:8A1B: C6 07     DEC ram_0007
bra_8A1D:
C - - - - - 0x000A2D 00:8A1D: 20 50 F8  JSR sub_0x01F860
C - - - - - 0x000A30 00:8A20: 9D 32 05  STA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000A33 00:8A23: 60        RTS


tbl_8A20_доп_y_спрайта:
                                        .byte $13   ; 00 level 1
                                        .byte $15   ; 01 level 2
                                        .byte $15   ; 02 level 3
                                        .byte $15   ; 03 level 4
                                        .byte $15   ; 04 level 5
                                        .byte $15   ; 05 level 6
                                        .byte $15   ; 06 level 7
                                        .byte $15   ; 07 level 8

loc_8A24_обработка_статуса_игрока_на_уровне_с_видом_сверху:
; leon опт
                                        LDY ram_статус_игрока,X
                                        LDA tbl_8A29_lo,y
                                        STA ram_0000
                                        LDA tbl_8A29_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_8A29_lo:
- D 0 - I - 0x000A39 00:8A29: 3E 85     .byte < ofs_003_853E_00_мертвый
- D 0 - I - 0x000A3B 00:8A2B: 3B 8A     .byte < ofs_003_8A3B_01_респавн
- D 0 - I - 0x000A3D 00:8A2D: 4E 8A     .byte < ofs_003_8A4E_02_живой
- D 0 - I - 0x000A3F 00:8A2F: 5E 8A     .byte < ofs_003_8A5E_03_зафиксирована_смерть
- D 0 - I - 0x000A41 00:8A31: 81 8A     .byte < ofs_003_8A81_04_анимация_смерти
- D 0 - I - 0x000A43 00:8A33: 9F 8A     .byte < ofs_003_8A9F_05_лежит_на_земле_мертвый
- - - - - - 0x000A45 00:8A35: 5D 8A     .byte < _общий_RTS ; 06 внутри вертолета
- - - - - - 0x000A47 00:8A37: 5D 8A     .byte < _общий_RTS ; 07 спускается по веревке
- D 0 - I - 0x000A49 00:8A39: 4E 85     .byte < ofs_003_854E_08_добежал_до_выхода
tbl_8A29_hi:
- D 0 - I - 0x000A39 00:8A29: 3E 85     .byte > ofs_003_853E_00_мертвый
- D 0 - I - 0x000A3B 00:8A2B: 3B 8A     .byte > ofs_003_8A3B_01_респавн
- D 0 - I - 0x000A3D 00:8A2D: 4E 8A     .byte > ofs_003_8A4E_02_живой
- D 0 - I - 0x000A3F 00:8A2F: 5E 8A     .byte > ofs_003_8A5E_03_зафиксирована_смерть
- D 0 - I - 0x000A41 00:8A31: 81 8A     .byte > ofs_003_8A81_04_анимация_смерти
- D 0 - I - 0x000A43 00:8A33: 9F 8A     .byte > ofs_003_8A9F_05_лежит_на_земле_мертвый
- - - - - - 0x000A45 00:8A35: 5D 8A     .byte > _общий_RTS ; 06 внутри вертолета
- - - - - - 0x000A47 00:8A37: 5D 8A     .byte > _общий_RTS ; 07 спускается по веревке
- D 0 - I - 0x000A49 00:8A39: 4E 85     .byte > ofs_003_854E_08_добежал_до_выхода



ofs_003_8A3B_01_респавн:
C - - J - - 0x000A4B 00:8A3B: 20 81 85  JSR sub_8581
C - - - - - 0x000A4E 00:8A3E: A9 B0     LDA #$B0
C - - - - - 0x000A50 00:8A40: 9D 32 05  STA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000A53 00:8A43: BD 4C 8A  LDA tbl_8A4C_pos_X,X
C - - - - - 0x000A56 00:8A46: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000A59 00:8A49: 4C 35 83  JMP loc_8335



tbl_8A4C_pos_X:
- D 0 - - - 0x000A5C 00:8A4C: 98        .byte $98   ; 00 player 1
- D 0 - - - 0x000A5D 00:8A4D: 68        .byte $68   ; 01 player 2



ofs_003_8A4E_02_живой:
; уровни с видом сверху
                                    .if con_режим_читера <> $00 ; если не равно 00
                                        JSR sub_0x000000_чтение_комбинаций_кнопок_для_читов
                                    .endif
C - - - - - 0x000A61 00:8A51: 20 BF 8A  JSR sub_8ABF_обработка_движения_игрока
C - - - - - 0x000A64 00:8A54: 20 AA 8B  JSR sub_8BAA_обработка_анимации_игрока
C - - - - - 0x000A67 00:8A57: 20 18 8C  JSR sub_8C18_запись_угла_стрельбы_игрока
C - - J - - 0x000A5E 00:8A4E: 20 EE 8C  JSR sub_8CEE_обработка_стрельбы_игрока
                                        LDX ram_0010
                                        RTS
;C - - - - - 0x000A6A 00:8A5A: 4C 13 83  JMP loc_8313_убить_игрока_если_застрял_в_стене



ofs_003_8A5E_03_зафиксирована_смерть:
C - - J - - 0x000A6E 00:8A5E: A9 80     LDA #$80
C - - - - - 0x000A70 00:8A60: 95 AE     STA ram_состояние_игрока_в_полете,X
C - - - - - 0x000A72 00:8A62: A9 00     LDA #$00
C - - - - - 0x000A74 00:8A64: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x000A76 00:8A66: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x000A78 00:8A68: A9 C0     LDA #$C0
C - - - - - 0x000A7A 00:8A6A: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000A7C 00:8A6C: A9 FD     LDA #$FD
C - - - - - 0x000A7E 00:8A6E: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x000A80 00:8A70: A9 0C     LDA #$0C
C - - - - - 0x000A82 00:8A72: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000A84 00:8A74: A9 00     LDA #$00
C - - - - - 0x000A86 00:8A76: 95 B4     STA ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000A88 00:8A78: 20 B9 8A  JSR sub_8AB9
C - - - - - 0x000A8B 00:8A7B: 20 05 8B  JSR sub_8B05
C - - - - - 0x000A8E 00:8A7E: F6 A0     INC ram_статус_игрока,X ; con_plr_status_death_init -> con_plr_status_death_anim
bra_8A80_RTS:
C - - - - - 0x000A90 00:8A80: 60        RTS



ofs_003_8A81_04_анимация_смерти:
C - - J - - 0x000A91 00:8A81: 20 A5 8A  JSR sub_8AA5
C - - - - - 0x000A94 00:8A84: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000A96 00:8A86: 30 07     BMI bra_8A8F
C - - - - - 0x000A98 00:8A88: C9 03     CMP #$03
C - - - - - 0x000A9A 00:8A8A: 90 03     BCC bra_8A8F
C - - - - - 0x000A9C 00:8A8C: 4C 0E 86  JMP loc_860E
bra_8A8F:
C - - - - - 0x000A9F 00:8A8F: B5 A6     LDA ram_скорость_игрока_y_младш,X
C - - - - - 0x000AA1 00:8A91: 18        CLC
C - - - - - 0x000AA2 00:8A92: 69 20     ADC #< $0020
C - - - - - 0x000AA4 00:8A94: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000AA6 00:8A96: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000AA8 00:8A98: 69 00     ADC #> $0020
C - - - - - 0x000AAA 00:8A9A: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x000AAC 00:8A9C: 4C 05 8B  JMP loc_8B05



ofs_003_8A9F_05_лежит_на_земле_мертвый:
C - - J - - 0x000AAF 00:8A9F: 20 A5 8A  JSR sub_8AA5
C - - - - - 0x000AB2 00:8AA2: 4C 49 86  JMP loc_8649



sub_8AA5:
C - - - - - 0x000AB5 00:8AA5: D6 B6     DEC ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000AB7 00:8AA7: D0 D7     BNE bra_8A80_RTS
C - - - - - 0x000AB9 00:8AA9: A9 08     LDA #$08
C - - - - - 0x000ABB 00:8AAB: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000ABD 00:8AAD: F6 B4     INC ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000ABF 00:8AAF: B5 B4     LDA ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000AC1 00:8AB1: C9 02     CMP #$02
C - - - - - 0x000AC3 00:8AB3: 90 02     BCC bra_8AB7
C - - - - - 0x000AC5 00:8AB5: A9 02     LDA #$02
bra_8AB7:
C - - - - - 0x000AC7 00:8AB7: 95 B4     STA ram_00B4_счетчик_анимаций_игрока,X
sub_8AB9:
C - - - - - 0x000AC9 00:8AB9: 18        CLC
C - - - - - 0x000ACA 00:8ABA: 69 3B     ADC #$3B
C - - - - - 0x000ACC 00:8ABC: 4C E0 8B  JMP loc_81CC    ; обработка с уровней видом сбоку



sub_8ABF_обработка_движения_игрока:
C - - - - - 0x000ACF 00:8ABF: 20 B7 84  JSR sub_84B7_уменьшить_таймеры_инвиза_и_бессмертия
C - - - - - 0x000AD2 00:8AC2: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000AD4 00:8AC4: 29 0F     AND #con_btns_Dpad                                 
C - - - - - 0x000ADE 00:8ACE: A8        TAY
                                        AND #con_btns_LR
                                        BEQ bra_8ACE
                                        AND #$01
                                        STA ram_сторона_игрока_вид_сверху,X  ; индекс, временное хранение куда смотрит игрок
bra_8ACE:
                                        TYA
C - - - - - 0x000ADF 00:8ACF: F0 05     BNE bra_8AD1
                                        LDA #$08
                                        BNE bra_8AEE_скорость_игрока    ; jmp
bra_8AD1:
C - - - - - 0x000AE1 00:8AD1: B9 73 8B  LDA tbl_8B74_угол_игрока - $01,Y
C - - - - - 0x000AE4 00:8AD4: 95 D0     STA ram_00D0_направление_игрока_вид_сверху,X
C - - - - - 0x000AEC 00:8ADC: B4 D0     LDY ram_00D0_направление_игрока_вид_сверху,X
C - - - - - 0x000AF3 00:8AE3: BD 66 05  LDA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x000AF6 00:8AE6: 29 3C     AND #$3C
C - - - - - 0x000AF8 00:8AE8: 05 08     ORA tbl_8B7E_атрибуты_спрайта,Y
C - - - - - 0x000AFA 00:8AEA: 9D 66 05  STA ram_атрибуты_спрайта_игрока,X
C - - - - - 0x000AFD 00:8AED: 98        TYA
bra_8AEE_скорость_игрока:
C - - - - - 0x000AFE 00:8AEE: 0A        ASL
C - - - - - 0x000AFF 00:8AEF: 0A        ASL
C - - - - - 0x000B00 00:8AF0: A8        TAY
C - - - - - 0x000B01 00:8AF1: B9 86 8B  LDA tbl_8B86_speed,Y
C - - - - - 0x000B04 00:8AF4: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x000B06 00:8AF6: B9 87 8B  LDA tbl_8B86_speed + $01,Y
C - - - - - 0x000B09 00:8AF9: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x000B0B 00:8AFB: B9 88 8B  LDA tbl_8B86_speed + $02,Y
C - - - - - 0x000B0E 00:8AFE: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000B10 00:8B00: B9 89 8B  LDA tbl_8B86_speed + $03,Y
C - - - - - 0x000B13 00:8B03: 95 A8     STA ram_скорость_игрока_y_старш,X
sub_8B05:
loc_8B05:
C D 0 - - - 0x000B15 00:8B05: A5 F9     LDA ram_00F9
C - - - - - 0x000B17 00:8B07: C9 FF     CMP #$FF
C - - - - - 0x000B19 00:8B09: D0 1D     BNE bra_8B28
C - - - - - 0x000B1B 00:8B0B: A5 45     LDA ram_номер_сканлинии
C - - - - - 0x000B1D 00:8B0D: 38        SEC
C - - - - - 0x000B1E 00:8B0E: E9 10     SBC #$10
C - - - - - 0x000B20 00:8B10: DD 32 05  CMP ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000B23 00:8B13: B0 13     BCS bra_8B28
C - - - - - 0x000B25 00:8B15: BC 4C 05  LDY ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000B28 00:8B18: B5 AC     LDA ram_скорость_игрока_x_старш,X
C - - - - - 0x000B2A 00:8B1A: 10 06     BPL bra_8B22
C - - - - - 0x000B2C 00:8B1C: C0 28     CPY #$28
C - - - - - 0x000B2E 00:8B1E: 90 53     BCC bra_8B73_RTS
C - - - - - 0x000B30 00:8B20: B0 42     BCS bra_8B64    ; jmp
bra_8B22:
C - - - - - 0x000B32 00:8B22: C0 D8     CPY #$D8
C - - - - - 0x000B34 00:8B24: B0 4D     BCS bra_8B73_RTS
C - - - - - 0x000B36 00:8B26: 90 3C     BCC bra_8B64    ; jmp
bra_8B28:
C - - - - - 0x000B38 00:8B28: A9 12     LDA #$12
C - - - - - 0x000B3A 00:8B2A: 85 0F     STA ram_000F
C - - - - - 0x000B3C 00:8B2C: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000B3F 00:8B2F: 18        CLC
C - - - - - 0x000B40 00:8B30: 69 0F     ADC #$0F
C - - - - - 0x000B42 00:8B32: A8        TAY
C - - - - - 0x000B43 00:8B33: B5 AC     LDA ram_скорость_игрока_x_старш,X
C - - - - - 0x000B45 00:8B35: 15 AA     ORA ram_скорость_игрока_x_младш,X
C - - - - - 0x000B47 00:8B37: F0 3A     BEQ bra_8B73_RTS
C - - - - - 0x000B49 00:8B39: B5 AC     LDA ram_скорость_игрока_x_старш,X
C - - - - - 0x000B4B 00:8B3B: 0A        ASL
C - - - - - 0x000B4C 00:8B3C: A9 07     LDA #$07
C - - - - - 0x000B4E 00:8B3E: 90 02     BCC bra_8B42
C - - - - - 0x000B50 00:8B40: A9 F8     LDA #$F8
bra_8B42:
C - - - - - 0x000B52 00:8B42: 18        CLC
C - - - - - 0x000B53 00:8B43: 7D 4C 05  ADC ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000B56 00:8B46: 20 7F BB  JSR sub_0x007B8F
C - - - - - 0x000B59 00:8B49: 90 08     BCC bra_8B53
C - - - - - 0x000B5B 00:8B4B: A9 00     LDA #$00
C - - - - - 0x000B5D 00:8B4D: 95 AA     STA ram_скорость_игрока_x_младш,X
C - - - - - 0x000B5F 00:8B4F: 95 AC     STA ram_скорость_игрока_x_старш,X
C - - - - - 0x000B61 00:8B51: F0 20     BEQ bra_8B73_RTS    ; jmp
bra_8B53:
C - - - - - 0x000B63 00:8B53: BC 4C 05  LDY ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000B66 00:8B56: B5 AC     LDA ram_скорость_игрока_x_старш,X
C - - - - - 0x000B68 00:8B58: 10 06     BPL bra_8B60
C - - - - - 0x000B6A 00:8B5A: C0 14     CPY #$14
C - - - - - 0x000B6C 00:8B5C: 90 15     BCC bra_8B73_RTS
C - - - - - 0x000B6E 00:8B5E: B0 04     BCS bra_8B64    ; jmp
bra_8B60:
C - - - - - 0x000B70 00:8B60: C0 EC     CPY #$EC
C - - - - - 0x000B72 00:8B62: B0 0F     BCS bra_8B73_RTS
bra_8B64:
C - - - - - 0x000B74 00:8B64: B5 A4     LDA ram_00A4_spd_X_fr_plr,X
C - - - - - 0x000B76 00:8B66: 18        CLC
C - - - - - 0x000B77 00:8B67: 75 AA     ADC ram_скорость_игрока_x_младш,X
C - - - - - 0x000B79 00:8B69: 95 A4     STA ram_00A4_spd_X_fr_plr,X
C - - - - - 0x000B7B 00:8B6B: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000B7E 00:8B6E: 75 AC     ADC ram_скорость_игрока_x_старш,X
C - - - - - 0x000B80 00:8B70: 9D 4C 05  STA ram_позиция_x_спрайта_игрока,X
bra_8B73_RTS:
C - - - - - 0x000B83 00:8B73: 60        RTS


;     08
;   0A  09
; 02 DPAD 01
;   06  05
;     04
tbl_8B74_угол_игрока:
;                                       .byte $00   ; нет нажатия                            
                                        .byte $00   ; 01 Right
                                        .byte $04   ; 02 Left 
                                        .byte $00   ; 03 Right+LEFT (не возможен)
                                        .byte $02   ; 04 Down
                                        .byte $01   ; 05 RIGHT+DOWN
                                        .byte $03   ; 06 LEFT+DOWN
                                        .byte $00   ; 07 Right+LEFT+DOWN (не возможен)
                                        .byte $06   ; 08 Up
                                        .byte $07   ; 09 RIGHT+UP
                                        .byte $05   ; 0A LEFT+UP


tbl_8B7E_атрибуты_спрайта:
- D 0 - - - 0x000B8E 00:8B7E: 00        .byte $40   ; 00 Right
- D 0 - - - 0x000B8F 00:8B7F: 40        .byte $40   ; 01 RIGHT+DOWN
- D 0 - - - 0x000B90 00:8B80: 40        .byte $00   ; 02 Down
- D 0 - - - 0x000B91 00:8B81: 40        .byte $00   ; 03 LEFT+DOWN
- D 0 - - - 0x000B92 00:8B82: 00        .byte $00   ; 04 Left
- D 0 - - - 0x000B93 00:8B83: 00        .byte $00   ; 05 LEFT+UP
- D 0 - - - 0x000B94 00:8B84: 00        .byte $00   ; 06 Up
- D 0 - - - 0x000B95 00:8B85: 00        .byte $40   ; 07 RIGHT+UP


tbl_8B86_speed:
; 00 Right
- D 0 - - - 0x000B9E 00:8B8E: 00 01     .word $0100 ; X
- D 0 - - - 0x000BA0 00:8B90: 00 00     .word $0000 ; Y
; 01 RIGHT+DOWN
- D 0 - - - 0x000BA2 00:8B92: B5 00     .word $00B5 ; X
- D 0 - - - 0x000BA4 00:8B94: B5 00     .word $00B5 ; Y
; 02 Down
- D 0 - - - 0x000BA6 00:8B96: 00 00     .word $0000 ; X
- D 0 - - - 0x000BA8 00:8B98: 00 01     .word $0100 ; YE
; 03 LEFT+DOWN
- D 0 - - - 0x000BAA 00:8B9A: 4B FF     .word $FF4B ; X
- D 0 - - - 0x000BAC 00:8B9C: B5 00     .word $00B5 ; Y
; 04 Left
- D 0 - - - 0x000BAE 00:8B9E: 00 FF     .word $FF00 ; X
- D 0 - - - 0x000BB0 00:8BA0: 00 00     .word $0000 ; Y
; 05 LEFT+UP
- D 0 - - - 0x000BB2 00:8BA2: 4B FF     .word $FF4B ; X
- D 0 - - - 0x000BB4 00:8BA4: 4B FF     .word $FF4B ; Y
; 06 Up
- D 0 - - - 0x000B96 00:8B86: 00 00     .word $0000 ; X
- D 0 - - - 0x000B98 00:8B88: 00 FF     .word $FF00 ; Y
; 07 RIGHT+UP
- D 0 - - - 0x000B9A 00:8B8A: B5 00     .word $00B5 ; X
- D 0 - - - 0x000B9C 00:8B8C: 4B FF     .word $FF4B ; Y
; 08 NONE
- D 0 - - - 0x000BB6 00:8BA6: 00 00     .word $0000 ; X
- D 0 - - - 0x000BB8 00:8BA8: 00 00     .word $0000 ; Y



sub_8BAA_обработка_анимации_игрока:
C - - - - - 0x000BBA 00:8BAA: A9 BF     LDA #$BF
C - - - - - 0x000BBC 00:8BAC: 95 C6     STA ram_хитбоксы_игрока,X
C - - - - - 0x000BBE 00:8BAE: B5 F3     LDA ram_удержанная_кнопка,X
C - - - - - 0x000BC0 00:8BB0: 29 0F     AND #con_btns_Dpad
C - - - - - 0x000BC2 00:8BB2: F0 18     BEQ bra_8BCC
C - - - - - 0x000BC4 00:8BB4: F6 B6     INC ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000BC6 00:8BB6: B5 B6     LDA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000BC8 00:8BB8: C9 09     CMP #$09
C - - - - - 0x000BCA 00:8BBA: 90 18     BCC bra_8BD4
C - - - - - 0x000BCC 00:8BBC: A9 00     LDA #$00
C - - - - - 0x000BCE 00:8BBE: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000BD0 00:8BC0: F6 B4     INC ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000BD2 00:8BC2: B4 B4     LDY ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000BD4 00:8BC4: C0 04     CPY #$04
C - - - - - 0x000BD6 00:8BC6: 90 0C     BCC bra_8BD4
C - - - - - 0x000BD8 00:8BC8: A0 00     LDY #$00
C - - - - - 0x000BDA 00:8BCA: F0 06     BEQ bra_8BD2    ; jmp
bra_8BCC:
C - - - - - 0x000BDC 00:8BCC: A9 00     LDA #$00
C - - - - - 0x000BDE 00:8BCE: 95 B6     STA ram_00B6_таймер_анимации_игрока,X
C - - - - - 0x000BE0 00:8BD0: A0 01     LDY #$01
bra_8BD2:
C - - - - - 0x000BE2 00:8BD2: 94 B4     STY ram_00B4_счетчик_анимаций_игрока,X
bra_8BD4:
C - - - - - 0x000BE4 00:8BD4: B4 D0     LDY ram_00D0_направление_игрока_вид_сверху,X
C - - - - - 0x000BE6 00:8BD6: B9 FC 8B  LDA tbl_8BFC_index,Y
C - - - - - 0x000BE9 00:8BD9: 18        CLC
C - - - - - 0x000BEA 00:8BDA: 75 B4     ADC ram_00B4_счетчик_анимаций_игрока,X
C - - - - - 0x000BEC 00:8BDC: A8        TAY
C - - - - - 0x000BED 00:8BDD: B9 04 8C  LDA tbl_8C04,Y
; удалена оригинальная обработка с уровней видом сверху
                                        JMP loc_81CC    ; обработка с уровней видом сбоку                               


tbl_8BFC_index:
- D 0 - - - 0x000C0E 00:8BFE: 0C        .byte off_8C10_0C - tbl_8C04   ; 02 00
- D 0 - - - 0x000C0F 00:8BFF: 04        .byte off_8C08_04 - tbl_8C04   ; 03 01
- D 0 - - - 0x000C10 00:8C00: 00        .byte off_8C04_00 - tbl_8C04   ; 04 02
- D 0 - - - 0x000C11 00:8C01: 04        .byte off_8C08_04 - tbl_8C04   ; 05 03
- D 0 - - - 0x000C12 00:8C02: 0C        .byte off_8C10_0C - tbl_8C04   ; 06 04
- D 0 - - - 0x000C13 00:8C03: 08        .byte off_8C0C_08 - tbl_8C04   ; 07 05
- D 0 - - - 0x000C0C 00:8BFC: 10        .byte off_8C14_10 - tbl_8C04   ; 00 06
- D 0 - - - 0x000C0D 00:8BFD: 08        .byte off_8C0C_08 - tbl_8C04   ; 01 07



tbl_8C04:
off_8C04_00:
- D 0 - - - 0x000C14 00:8C04: 2C        .byte $2C   ; 00 
- D 0 - - - 0x000C15 00:8C05: 2D        .byte $2D   ; 01 
- D 0 - - - 0x000C16 00:8C06: 2E        .byte $2E   ; 02 
- D 0 - - - 0x000C17 00:8C07: 2D        .byte $2D   ; 03 

off_8C08_04:
- D 0 - - - 0x000C18 00:8C08: 2F        .byte $2F   ; 00 
- D 0 - - - 0x000C19 00:8C09: 30        .byte $30   ; 01 
- D 0 - - - 0x000C1A 00:8C0A: 31        .byte $31   ; 02 
- D 0 - - - 0x000C1B 00:8C0B: 30        .byte $30   ; 03 

off_8C0C_08:
- D 0 - - - 0x000C1C 00:8C0C: 32        .byte $32   ; 00 
- D 0 - - - 0x000C1D 00:8C0D: 33        .byte $33   ; 01 
- D 0 - - - 0x000C1E 00:8C0E: 34        .byte $34   ; 02 
- D 0 - - - 0x000C1F 00:8C0F: 33        .byte $33   ; 03 

off_8C10_0C:
- D 0 - - - 0x000C20 00:8C10: 35        .byte $35   ; 00 
- D 0 - - - 0x000C21 00:8C11: 36        .byte $36   ; 01 
- D 0 - - - 0x000C22 00:8C12: 37        .byte $37   ; 02 
- D 0 - - - 0x000C23 00:8C13: 36        .byte $36   ; 03 

off_8C14_10:
- D 0 - - - 0x000C24 00:8C14: 38        .byte $38   ; 00 
- D 0 - - - 0x000C25 00:8C15: 39        .byte $39   ; 01 
- D 0 - - - 0x000C26 00:8C16: 3A        .byte $3A   ; 02 
- D 0 - - - 0x000C27 00:8C17: 39        .byte $39   ; 03 



sub_8C18_запись_угла_стрельбы_игрока:
                                        LDA ram_00D0_направление_игрока_вид_сверху,X
                                        ASL
                                        CLC
                                        ADC ram_сторона_игрока_вид_сверху,X   ; 00 left, 01 right
                                        TAY
C - - - - - 0x000C2A 00:8C1A: B9 20 8C  LDA tbl_8C20_угол_выстрела,Y
C - - - - - 0x000C2D 00:8C1D: 95 BA     STA ram_угол_выстрела_игрока,X
C - - - - - 0x000C2F 00:8C1F: 60        RTS



tbl_8C20_угол_выстрела:
;                                              ----------- LEFT
;                                              |    ------ RIGHT
;                                              |    |
- D 0 - - - 0x000C30 00:8C20: 00        .byte $1F, $1F   ; 00 Right
- D 0 - - - 0x000C31 00:8C21: 01        .byte $20, $20   ; 01 RIGHT+DOWN
- D 0 - - - 0x000C32 00:8C22: 02        .byte $22, $21   ; 02 Down
- D 0 - - - 0x000C33 00:8C23: 03        .byte $23, $03   ; 03 LEFT+DOWN
- D 0 - - - 0x000C34 00:8C24: 06        .byte $24, $04   ; 04 Left
- D 0 - - - 0x000C35 00:8C25: 09        .byte $25, $25   ; 05 LEFT+UP
- D 0 - - - 0x000C36 00:8C26: 0A        .byte $1C, $1D   ; 06 Up
- D 0 - - - 0x000C37 00:8C27: 0B        .byte $1E, $1E   ; 07 RIGHT+UP



loc_8C28_обработка_статуса_игрока_на_уровне_с_видом_сверху:
; leon опт
                                        LDY ram_статус_игрока,X
                                        LDA tbl_8C2D_lo,y
                                        STA ram_0000
                                        LDA tbl_8C2D_hi,y
                                        STA ram_0001
                                        JMP (ram_0000)
tbl_8C2D_lo:
- D 0 - I - 0x000C3D 00:8C2D: 52 8C     .byte < _общий_RTS ; 00 мертвый
- D 0 - I - 0x000C3F 00:8C2F: 52 8C     .byte < _общий_RTS ; 01 респавн
- D 0 - I - 0x000C41 00:8C31: 53 8C     .byte < ofs_004_8C53_02_живой
- D 0 - I - 0x000C43 00:8C33: 3F 8C     .byte < ofs_004_8C3F_03_зафиксирована_смерть
- D 0 - I - 0x000C45 00:8C35: 3F 8C     .byte < ofs_004_8C3F_04_анимация_смерти
- D 0 - I - 0x000C47 00:8C37: 4F 8C     .byte < ofs_004_8C4F_05_лежит_на_земле_мертвый
- - - - - - 0x000C49 00:8C39: 52 8C     .byte < _общий_RTS ; 06 внутри вертолета
- - - - - - 0x000C4B 00:8C3B: 52 8C     .byte < _общий_RTS ; 07 спускается по веревке
- D 0 - I - 0x000C4D 00:8C3D: 52 8C     .byte < _общий_RTS ; 08 добежал до выхода
tbl_8C2D_hi:
- D 0 - I - 0x000C3D 00:8C2D: 52 8C     .byte > _общий_RTS ; 00 мертвый
- D 0 - I - 0x000C3F 00:8C2F: 52 8C     .byte > _общий_RTS ; 01 респавн
- D 0 - I - 0x000C41 00:8C31: 53 8C     .byte > ofs_004_8C53_02_живой
- D 0 - I - 0x000C43 00:8C33: 3F 8C     .byte > ofs_004_8C3F_03_зафиксирована_смерть
- D 0 - I - 0x000C45 00:8C35: 3F 8C     .byte > ofs_004_8C3F_04_анимация_смерти
- D 0 - I - 0x000C47 00:8C37: 4F 8C     .byte > ofs_004_8C4F_05_лежит_на_земле_мертвый
- - - - - - 0x000C49 00:8C39: 52 8C     .byte > _общий_RTS ; 06 внутри вертолета
- - - - - - 0x000C4B 00:8C3B: 52 8C     .byte > _общий_RTS ; 07 спускается по веревке
- D 0 - I - 0x000C4D 00:8C3D: 52 8C     .byte > _общий_RTS ; 08 добежал до выхода


ofs_004_8C3F_03_зафиксирована_смерть:
ofs_004_8C3F_04_анимация_смерти:
C - - J - - 0x000C4F 00:8C3F: 20 53 8C  JSR sub_8C53
C - - - - - 0x000C52 00:8C42: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000C54 00:8C44: 30 0C     BMI bra_8C52_RTS
C - - - - - 0x000C56 00:8C46: B5 CE     LDA ram_копия_позиция_y_спрайта_игрока,X
C - - - - - 0x000C58 00:8C48: C9 FF     CMP #$FF
C - - - - - 0x000C5A 00:8C4A: D0 06     BNE bra_8C52_RTS
C - - - - - 0x000C5C 00:8C4C: 4C 0E 86  JMP loc_860E
bra_8C52_RTS:
C - - - - - 0x000C62 00:8C52: 60        RTS



sub_8C53:
ofs_004_8C53_02_живой:
ofs_004_8C4F_05_лежит_на_земле_мертвый:
C D 0 J - - 0x000C63 00:8C53: A9 0C     LDA #$0C
C - - - - - 0x000C65 00:8C55: 85 0F     STA ram_000F
C - - - - - 0x000C67 00:8C57: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000C69 00:8C59: 15 A6     ORA ram_скорость_игрока_y_младш,X
C - - - - - 0x000C6B 00:8C5B: F0 27     BEQ bra_8C84
C - - - - - 0x000C6D 00:8C5D: B5 D2     LDA ram_00D2_коллизии_игрока,X
C - - - - - 0x000C6F 00:8C5F: D0 23     BNE bra_8C84
C - - - - - 0x000C71 00:8C61: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000C73 00:8C63: 0A        ASL
C - - - - - 0x000C74 00:8C64: A9 10     LDA #$10
C - - - - - 0x000C76 00:8C66: 90 02     BCC bra_8C6A
C - - - - - 0x000C78 00:8C68: A9 F9     LDA #$F9
bra_8C6A:
C - - - - - 0x000C7A 00:8C6A: 18        CLC
C - - - - - 0x000C7B 00:8C6B: 7D 32 05  ADC ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000C7E 00:8C6E: A8        TAY
C - - - - - 0x000C7F 00:8C6F: BD 4C 05  LDA ram_позиция_x_спрайта_игрока,X
C - - - - - 0x000C82 00:8C72: 18        CLC
C - - - - - 0x000C83 00:8C73: 69 05     ADC #$05
C - - - - - 0x000C85 00:8C75: 20 34 BB  JSR sub_0x007B44
C - - - - - 0x000C88 00:8C78: 90 0A     BCC bra_8C84
C - - - - - 0x000C8A 00:8C7A: A9 00     LDA #$00
C - - - - - 0x000C8C 00:8C7C: 95 A6     STA ram_скорость_игрока_y_младш,X
C - - - - - 0x000C8E 00:8C7E: 95 A8     STA ram_скорость_игрока_y_старш,X
C - - - - - 0x000C90 00:8C80: A9 FF     LDA #$FF
C - - - - - 0x000C92 00:8C82: 95 CE     STA ram_копия_позиция_y_спрайта_игрока,X
bra_8C84:
C - - - - - 0x000C94 00:8C84: B5 A8     LDA ram_скорость_игрока_y_старш,X
C - - - - - 0x000C96 00:8C86: 38        SEC
C - - - - - 0x000C97 00:8C87: E5 72     SBC ram_cam_spd_Y
C - - - - - 0x000C99 00:8C89: 85 14     STA ram_0014
C - - - - - 0x000C9B 00:8C8B: 15 A6     ORA ram_скорость_игрока_y_младш,X
C - - - - - 0x000C9D 00:8C8D: F0 55     BEQ bra_8CE4_RTS
C - - - - - 0x000C9F 00:8C8F: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000CA2 00:8C92: A4 14     LDY ram_0014
C - - - - - 0x000CA4 00:8C94: 10 33     BMI bra_8C9E_автобег_игрока
C - - - - - 0x000CD9 00:8CC9: C9 D8     CMP #$D8    ; нижний край экрана
C - - - - - 0x000CDB 00:8CCB: B0 17     BCS bra_8CE4_RTS
                                        BCC bra_8CCD_двигать_игрока ; jmp
bra_8C9E_автобег_игрока:
C - - - - - 0x000CB0 00:8CA0: D9 EB 8C  CMP #$80    ; граница экарана Y, до начала скрола
C - - - - - 0x000CB3 00:8CA3: B0 28     BCS bra_8CCB_двигать_игрока_вверх
C - - - - - 0x000CB5 00:8CA5: B5 D8     LDA ram_00D8_относительное_положение_игрока,X
C - - - - - 0x000CB7 00:8CA7: D0 24     BNE bra_8CCB_двигать_игрока_вверх
C - - - - - 0x000CB9 00:8CA9: A5 71     LDA ram_0071_тип_скролла
C - - - - - 0x000CBB 00:8CAB: 30 20     BMI bra_8CCB_двигать_игрока_вверх
C - - - - - 0x000CBD 00:8CAD: 20 A8 84  JSR sub_84A8_проверка_напарника_на_gameover
C - - - - - 0x000CC0 00:8CB0: 90 07     BCC bra_8CB9_двигать_камеру
; напарник живой
C - - - - - 0x000CC2 00:8CB2: B9 32 05  LDA ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x000CC5 00:8CB5: C9 D8     CMP #$D8    ; нижний край экрана
C - - - - - 0x000CC7 00:8CB7: B0 2B     BCS bra_8CCB_двигать_игрока_вверх
bra_8CB9_двигать_камеру:
C - - - - - 0x000CC9 00:8CB9: B5 A2     LDA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x000CCB 00:8CBB: 18        CLC
C - - - - - 0x000CCC 00:8CBC: 75 A6     ADC ram_скорость_игрока_y_младш,X
C - - - - - 0x000CCE 00:8CBE: 95 A2     STA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x000CD0 00:8CC0: A9 00     LDA #$00
C - - - - - 0x000CD2 00:8CC2: 65 14     ADC ram_0014
C - - - - - 0x000CD4 00:8CC4: 85 72     STA ram_cam_spd_Y
C - - - - - 0x000CD6 00:8CC6: 4C E4 8C  RTS
bra_8CCB_двигать_игрока_вверх:
                                        BIT ram_статус_завершения_уровня
                                        BVS bra_8CCD_двигать_игрока
                                        LDA ram_позиция_y_спрайта_игрока,X
                                        CMP #$12    ; верхний край экрана
                                        BCC bra_8CE4_RTS
bra_8CCD_двигать_игрока:
C - - - - - 0x000CDD 00:8CCD: B5 A2     LDA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x000CDF 00:8CCF: 18        CLC
C - - - - - 0x000CE0 00:8CD0: 75 A6     ADC ram_скорость_игрока_y_младш,X
C - - - - - 0x000CE2 00:8CD2: 95 A2     STA ram_00A2_spd_Y_fr_plr,X
C - - - - - 0x000CE4 00:8CD4: BD 32 05  LDA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000CE7 00:8CD7: 65 14     ADC ram_0014
C - - - - - 0x000CE9 00:8CD9: 9D 32 05  STA ram_позиция_y_спрайта_игрока,X
C - - - - - 0x000CEC 00:8CDC: B4 CE     LDY ram_копия_позиция_y_спрайта_игрока,X
C - - - - - 0x000CEE 00:8CDE: C0 FF     CPY #$FF
C - - - - - 0x000CF0 00:8CE0: F0 02     BEQ bra_8CE4_RTS
C - - - - - 0x000CF2 00:8CE2: 95 CE     STA ram_копия_позиция_y_спрайта_игрока,X
bra_8CE4_RTS:
C D 0 - - - 0x000CF4 00:8CE4: 60        RTS




sub_8CEE_обработка_стрельбы_игрока:
                                        LDA ram_оружие_игрока,X
                                        STA ram_0007    ; тип оружия текущего игрока
                                        ASL
                                        EOR ram_0010    ; индекс текущего игрока
                                        STA ram_0006    ; индекс оружия текущего игрока

                                        TXA
                                        BEQ bra_8CFB
; для 2го игрока
                                        LDA ram_оружие_игрока   ; 1й 
                                        ASL
                                        TAY
                                        LDA ram_лимит_пуль_оружия,Y ; 1й
bra_8CFB:
                                        STA ram_000B    ; индекс лимита пуль для начало проверок

                                        LDA ram_нажатая_кнопка,X
                                        STA ram_0004    ; нажатая кнопка
                                        LDA ram_удержанная_кнопка,X
                                        STA ram_0005    ; удержанная кнопка
                                        LDY ram_0007    ; тип оружия текущего игрока
                                        LDA tbl_8CFC_lo,y
                                        STA ram_0000
                                        LDA tbl_8CFC_hi,y
                                        STA ram_0001
                                        LDY ram_0006    ; индекс оружия текущего игрока
                                        JMP (ram_0000)

tbl_8CFC_lo:
                                        .byte < ofs_035_8D00_00_default
                                        .byte < ofs_035_8D10_01_flame_thrower
                                        .byte < ofs_035_8D20_02_spread
                                        .byte < ofs_035_8D30_03_laser
                                        .byte < ofs_035_8D40_04_flame
                                        .byte < ofs_035_8D50_05_fire_ball
                                        .byte < ofs_035_8D60_06_grenade_launcher
                                        .byte < ofs_035_8D70_07_secret_weapon
tbl_8CFC_hi:
                                        .byte > ofs_035_8D00_00_default
                                        .byte > ofs_035_8D10_01_flame_thrower
                                        .byte > ofs_035_8D20_02_spread
                                        .byte > ofs_035_8D30_03_laser
                                        .byte > ofs_035_8D40_04_flame
                                        .byte > ofs_035_8D50_05_fire_ball
                                        .byte > ofs_035_8D60_06_grenade_launcher
                                        .byte > ofs_035_8D70_07_secret_weapon

;ram_0000   ; свободно до начала обработки                     
;ram_0001   ; свободно до начала обработки
;ram_0002   ; свободно до начала обработки
;ram_0003   ; свободно до начала обработки
;ram_0004   ; нажатая кнопка игрока
;ram_0005   ; удержанная кнопка игрока
;ram_0006   ; свободно полностью Индекс оружия текущего игрока

;ram_0007   ; Тип Оружия без R

;ram_0008   ; свободно до начала обработки
;ram_0009   ; свободно до начала обработки
;ram_000A   ; свободно до начала обработки
;ram_000B   ; индекс от куда начинать проверки
;ram_000C   ; ДОБАВОЧНЫЙ ИНДЕКС ДЛЯ ОБРАБОТКИ ВЫСТРЕЛА
;ram_000D   ; занято

;ram_000E   ; свободный
;ram_000F   ; свободный

;ram_0010   ; индекс текущего игрока
;ram_0011   ; индекс другова игрока

;ram_0013   ; индекс другова игрока
;ram_0014   ; индекс другова игрока







ofs_035_8D00_00_default:
                                        LDA ram_кд_оружия_m,X
                                        BNE bra_8D04_RTS
                                        LDA ram_прокачка_характеристик_оружия,Y
                                        AND #$0F
                                        CMP #$02
                                        BCS bra_8D01
                                        LDA ram_0004    ; нажатая кнопка
                                        JMP loc_8D02
bra_8D01:
                                        LDA ram_0005    ; удержанная кнопка
loc_8D02:
                                        AND #con_btn_B
                                        BEQ bra_8D04_RTS
loc_8D03:
                                        JSR sub_8D90_одиночный_выстрел
                                        BCS bra_8D04_RTS
                                        JMP loc_8DA0_обработка_колво_патронов
bra_8D04_RTS:
                                        RTS







ofs_035_8D10_01_flame_thrower:
                                        LDY ram_угол_выстрела_игрока,X
                                        LDA ram_0005    ; удержанная кнопка
                                        ASL
                                        ASL
                                        LDA tbl_8EF0_вращение_пули,Y
                                        BCS bra_8D11
                                        STA ram_счетчик_поворота_игрока,X
                                        RTS
bra_8D11:
                                        SEC
                                        SBC ram_счетчик_поворота_игрока,X   ; угол вращения огнемета
                                        BEQ bra_8D15    ; углы совпали, выход
                                        LDY #$00
                                        BCC bra_8D12    ; отрицательно
                                        CMP #$10    ; середина между вращением
                                        BEQ bra_8D16
                                        BCC bra_8D13    ; +
                                        INY
                                        BCS bra_8D13    ; - jump
bra_8D12:
                                        CMP #$F0
                                        BEQ bra_8D16
                                        BCC bra_8D13    ; +
                                        INY
bra_8D13:
                                        LDA tbl_8D18,Y
bra_8D14:                                        
                                        CLC
                                        ADC ram_счетчик_поворота_игрока,X
                                        AND #$1F
                                        STA ram_счетчик_поворота_игрока,X
bra_8D15:
                                        LDY ram_0006    ; индекс оружия игрока
                                        JMP loc_8D03
bra_8D16:
                                        LDY ram_сторона_игрока_вид_сверху,X
                                        LDA tbl_8D19,Y
                                        CLC
                                        ADC ram_счетчик_поворота_игрока,X
                                        LSR
                                        LSR
                                        TAY ; 00-0F
                                        LDA tbl_8D17,Y
                                        BNE bra_8D14    ; jmp

tbl_8D17:
                                        .byte $01   ; 00
                                        .byte $01   ; 01
                                        .byte $FF   ; 02
                                        .byte $FF   ; 03
                                        .byte $FF   ; 04
                                        .byte $FF   ; 05
                                        .byte $01   ; 06
                                        .byte $01   ; 07
                                        .byte $01   ; 08
                                        .byte $01   ; 09
                                        .byte $01   ; 0A
                                        .byte $FF   ; 0B
                                        .byte $FF   ; 0C
                                        .byte $FF   ; 0D
                                        .byte $FF   ; 0E
                                        .byte $01   ; 0F

tbl_8D18:
                                        .byte $01   ; 00
                                        .byte $FF   ; 01

tbl_8D19:
                                        .byte $20   ; 00 LEFT
                                        .byte $00   ; 01 RIGHT




ofs_035_8D20_02_spread:
                                        LDA ram_кд_оружия_m,X
                                        BNE bra_8D23_RTS
                                        LDA ram_0004    ; нажатая кнопка
                                        AND #con_btn_B
                                        BEQ bra_8D23_RTS

                                        LDA #$02
                                        STA ram_0001    ;   кол-во проходов выстрелов
loc_8D21_loop:
                                        JSR sub_8D80_выстрел_несколькими_пулями
                                        BCC bra_8D22

                                        DEC ram_0001    ;   кол-во проходов выстрелов
                                        BEQ bra_8D23_RTS
; проверка следующего выстрела
                                        LDY ram_0006   ; индекс оружия текущего игрока
                                        LDA ram_лимит_пуль_оружия,Y
                                        CLC
                                        ADC ram_000B    ; индекс от куда начинать проверки
                                        STA ram_000B    ; индекс от куда начинать проверки
                                        JMP loc_8D21_loop
bra_8D22:
                                        JMP loc_8DA0_обработка_колво_патронов
bra_8D23_RTS:                        
                                        RTS







ofs_035_8D30_03_laser:
ofs_035_8D60_06_grenade_launcher:
                                        LDA ram_кд_оружия_m,X
                                        BNE bra_8D31_RTS
                                        LDA ram_0004    ; нажатая кнопка
                                        AND #con_btn_B
                                        BEQ bra_8D31_RTS

                                        JSR sub_8D90_одиночный_выстрел
                                        BCS bra_8D31_RTS
                                        JMP loc_8DA0_обработка_колво_патронов
bra_8D31_RTS:
                                        RTS









ofs_035_8D40_04_flame:
                                        LDA ram_0004    ; нажатая кнопка
                                        AND #con_btn_B
                                        BEQ bra_8D42
; кнопка 1 раз нажата
                                        LDA #$00
                                        STA ram_чарж_оружия_игрока,X
                                        LDA ram_кд_оружия_m,X
                                        BNE bra_8D43_RTS
bra_8D41:
                                        JSR sub_8D90_одиночный_выстрел
                                        BCS bra_8D43_RTS
                                        JMP loc_8DA0_обработка_колво_патронов
bra_8D42:
                                        LDA ram_0005    ; удержанная кнопка
                                        AND #con_btn_B
                                        BNE bra_8D44
; кнопка не удержана
                                        LDA ram_чарж_оружия_игрока,X
                                        CMP #$30
                                        BCS bra_8D41
                                        LDA #$00
                                        STA ram_чарж_оружия_игрока,X
bra_8D43_RTS:
                                        RTS
bra_8D44:
                                        LDA ram_чарж_оружия_игрока,X
                                        BMI bra_8D45
                                        CLC
                                        ADC #$02
                                        STA ram_чарж_оружия_игрока,X
                                        CMP #$30
                                        BCC bra_8D43_RTS
bra_8D45:
                                        LDA ram_счетчик_кадров
                                        LSR
                                        BCS bra_8D43_RTS
; чарж
                                        JSR sub_8D90_одиночный_выстрел
                                        BCS bra_8D43_RTS

                                        LDA ram_кадр_игрока,X
                                        CMP #$27    ; нырнул под воду
                                        BEQ bra_8D43_RTS

                                        LDA ram_угол_выстрела_игрока,X
                                        STA ram_0001    ; угол выстрела игрока

                                        LDA ram_позиция_y_спрайта_игрока,X
                                        STA ram_0002    ; позиция_y_спрайта

                                        LDA ram_позиция_x_спрайта_игрока,X
                                        STA ram_0003    ; позиция_x_спрайта

                                        LDA ram_кадр_игрока,X
                                        BEQ bra_8D47
                                        CMP #$06
                                        BCS bra_8D47
; кадры 01-05 анимация бега игрока
                                        LDY #$45    ; 00 right
                                        LDA ram_атрибуты_спрайта_игрока,X
                                        ASL
                                        BPL bra_8D46
                                        LDY #$4A    ; 01 left
bra_8D46:
                                        TYA
                                        CLC
                                        ADC ram_кадр_игрока,X
                                        STA ram_0001    ; угол выстрела игрока
bra_8D47:
                                        LDA ram_чарж_оружия_игрока,X
                                        BMI bra_8D48

                                        LDA #$03
                                        BNE bra_8D49
bra_8D48:
                                        LDA #$1A
bra_8D49:
                                        LDY ram_0001    ; угол выстрела игрока
                                        LDX ram_000B    ; индекс пули

                                        STA ram_кадр_анимации,X
                                        LDA #$02
                                        STA ram_пули_игрока_счетчик_жизни,X
                                        LDA #$03
                                        STA ram_пули_игрока_аттрибуты,X

                                        LDA tbl_911C_spr_attr_пули,Y
                                        STA ram_атрибуты_спрайта,X

                                        LDA ram_0002    ; позиция_y_спрайта
                                        CLC
                                        ADC tbl_9119_Y_пули,Y
                                        STA ram_позиция_y_спрайта,X

                                        LDA ram_0003    ; позиция_x_спрайта
                                        CLC
                                        ADC tbl_911A_X_пули,Y
                                        STA ram_позиция_x_спрайта,X
                                        RTS



ofs_035_8D50_05_fire_ball:
                                        LDA ram_кд_оружия_m,X
                                        BNE bra_8D51_RTS
                                        LDA ram_0005    ; удержанная кнопка
                                        AND #con_btn_B
                                        BEQ bra_8D51_RTS

                                        JSR sub_8D80_выстрел_несколькими_пулями
                                        BCS bra_8D51_RTS
                                        JMP loc_8DA0_обработка_колво_патронов
bra_8D51_RTS:
                                        RTS






ofs_035_8D70_07_secret_weapon:
                                        RTS

sub_8D80_выстрел_несколькими_пулями:
                                        LDA ram_лимит_пуль_оружия,Y
                                        BEQ bra_8D83_RTS
                                        STA ram_0000    ; кол-во пуль выстрела
                                        LDY ram_000B    ; индекс от куда начинать проверки
                                        LDA #$00
                                        STA ram_000A    ; кол-во разрешенных выстрелов
bra_8D81_loop:
                                        LDA ram_пули_игрока_аттрибуты,Y
                                        BNE bra_8D83_RTS
                                        INC ram_000A    ; кол-во разрешенных выстрелов
                                        CPY ram_макс_индекс_пули_игрока
                                        BCS bra_8D82_выстрел
                                        INY
                                        DEC ram_0000    ; кол-во пуль выстрела
                                        BNE bra_8D81_loop
bra_8D82_выстрел:
                                        CLC
                                        RTS
bra_8D83_RTS:
                                        SEC
                                        RTS



sub_8D90_одиночный_выстрел:
                                        LDA ram_лимит_пуль_оружия,Y
                                        BEQ bra_8D92_RTS
                                        STA ram_0000    ; кол-во пуль выстрела
                                        LDY ram_000B    ; индекс от куда начинать проверки
                                        LDA #$00
                                        STA ram_000A    ; кол-во разрешенных выстрелов
bra_8D91_loop:
                                        LDA ram_пули_игрока_аттрибуты,Y
                                        BEQ bra_8D93_выстрел
; занято
                                        CPY ram_макс_индекс_пули_игрока
                                        BCS bra_8D92_RTS
                                        
                                        INY
                                        INC ram_000B    ; индекс проверок
                                        DEC ram_0000    ; кол-во пуль выстрела
                                        BNE bra_8D91_loop
bra_8D92_RTS:
                                        SEC
                                        RTS
bra_8D93_выстрел:
                                        INC ram_000A    ; кол-во разрешенных выстрелов
                                        CLC
                                        RTS
                                






loc_8DA0_обработка_колво_патронов:
                                        LDX ram_0010   ; индекс текущего игрока
                                        LDA ram_option_бесконечные_патроны
                                        BEQ bra_8DA1    ; 00 выкл
                                        LDA ram_000A    ; кол-во потенциальных выстрелов
                                        STA ram_000C    ; кол-во разрешенных выстрелов
                                        BNE bra_8DB0_выстрел
bra_8DA1:
                                        LDY ram_0007    ; оружие игрока
                                        LDA #$00
                                        STA ram_000C    ; кол-во разрешенных выстрелов
bra_8DA2_loop:
                                        LDA ram_колво_патронов_игрока_lo,X
                                        SEC
                                        SBC tbl_8D8A_цена_за_выстрел,Y
                                        STA ram_колво_патронов_игрока_lo,X
                                        BCS bra_8DA5_патронов_хватает
; переполнение lo патронов вниз
                                        LDA ram_колво_патронов_игрока_hi,X
                                        SBC #$00
                                        BCS bra_8DA3
; нет патронов
                                        LDA #$00
                                        STA ram_колво_патронов_игрока_lo,X
bra_8DA3:
                                        STA ram_колво_патронов_игрока_hi,X
                                        LDA ram_000C    ; кол-во разрешенных выстрелов
                                        BNE bra_8DB0_выстрел
bra_8DA4_RTS:
                                        RTS
bra_8DA5_патронов_хватает:
                                        INC ram_000C    ; кол-во разрешенных выстрелов
                                        DEC ram_000A    ; кол-во потенциальных выстрелов
                                        BNE bra_8DA2_loop





bra_8DB0_выстрел:
C - - - - - 0x000D92 00:8D82: A0 11     LDY #$11
C - - - - - 0x000D94 00:8D84: B5 B2     LDA ram_поверхность_под_игроком,X
C - - - - - 0x000D96 00:8D86: C9 04     CMP #$04
C - - - - - 0x000D98 00:8D88: F0 08     BEQ bra_8DB1
C - - - - - 0x000D9A 00:8D8A: B5 F3     LDA ram_0005    ; удержанная кнопка
C - - - - - 0x000D9C 00:8D8C: 29 03     AND #con_btns_LR
C - - - - - 0x000D9E 00:8D8E: D0 02     BNE bra_8DB1
C - - - - - 0x000DA0 00:8D90: A0 05     LDY #$05
bra_8DB1:
C - - - - - 0x000DA2 00:8D92: 98        TYA
C - - - - - 0x000DA3 00:8D93: 95 BC     STA ram_счетчик_тряска_при_выстреле,X

                                        LDY ram_0006    ; Индекс оружия текущего игрока
                                        LDA ram_кд_пуль_оружия,Y
                                        STA ram_кд_оружия_m,X

                                        LDA ram_кадр_игрока,X
                                        CMP #$27    ; нырнул под воду
                                        BEQ bra_8DA4_RTS

                                        LDY ram_0007    ; оружие игрока
                                        LDA tbl_8DD9_lo,Y
                                        STA ram_000E
                                        LDA tbl_8DD9_hi,Y
                                        STA ram_000F

                                        CPY #$05    ; тип оружия игрока
                                        BNE bra_8DB3
; f_ball
                                        LDA ram_угол_выстрела_игрока,X
                                        STA ram_0001    ; угол выстрела игрока
                                        LDY ram_0006    ; индекс оружия
                                        LDA ram_прокачка_характеристик_оружия,Y
                                        AND #$0F
                                        STA ram_0008    ; прокачка оружия для f_ball
                                        LDA #$00
                                        STA ram_0000    ; номер пули для обработчика
                                        LDX ram_000B    ; индекс пустого слота пули
                                        JMP (ram_000E)
bra_8DB3:
                                        LDA ram_угол_выстрела_игрока,X
                                        STA ram_0001    ; угол выстрела игрока

                                        LDA ram_позиция_y_спрайта_игрока,X
                                        STA ram_0002    ; позиция_y_спрайта

                                        LDA ram_позиция_x_спрайта_игрока,X
                                        STA ram_0003    ; позиция_x_спрайта

; смена 2й половины банка
                                        LDY ram_0006    ; индекс оружия текущего игрока
                                        LDA ram_скорость_пуль_оружия,Y
; сохранить текущий банк
                                        LDY $BFFF
                                        STY ram_prg_bank + $01
                                        LDY #con_prg_bank + $2C
                                        CMP #$08
                                        BCC bra_8DB5
                                        INY ; con_prg_bank + $2B
                                        CMP #$10
                                        BCC bra_8DB4
                                        INY ; con_prg_bank + $2C
bra_8DB4:
                                        AND #$07
bra_8DB5:
                                        STY $5115
                                        ASL
                                        ASL
                                        ORA #$A0    ; старший байт
                                        STA ram_0009
                                        LDA #$00
                                        STA ram_0000    ; номер пули для обработчика
                                        STA ram_0008    ; младший байт
                                        STA ram_000A    ; добавочный байт смещения

                                        LDX ram_000B    ; индекс пустого слота пули
bra_8DBF_loop:
C - - - - - 0x000DD8 00:8DC8: 20 0B 8E  JSR sub_8E0B_регистрация_выстрела
C - - - - - 0x000DDF 00:8DCF: E6 00     INC ram_0000    ; номер пули для обработчика
                                        INX ; индекс пустого слота пули
C - - - - - 0x000DE1 00:8DD1: D9 F7 8D  DEC ram_000C    ; кол-во разрешенных выстрелов
C - - - - - 0x000DE4 00:8DD4: 90 E9     BNE bra_8DBF_loop
; возвращаем банк
                                        LDA ram_prg_bank + $01
                                        STA $5115
                                        LDA tbl_8F03_звук_пуль,Y
                                        JMP loc_0x01FDEE_play_sound ; exit

tbl_8DD9_lo:
                                        .byte < ofs_036_8E00_00_default
                                        .byte < ofs_036_8E10_01_flame_thrower
                                        .byte < ofs_036_8E20_02_spread
                                        .byte < ofs_036_8E30_03_laser
                                        .byte < ofs_036_8E40_04_flame
                                        .byte < ofs_036_8E50_05_fire_ball
                                        .byte < ofs_036_8E60_06_grenade_launcher
                                        .byte > ofs_036_8E70_07_secret_weapon
tbl_8DD9_hi:
                                        .byte > ofs_036_8E00_00_default
                                        .byte > ofs_036_8E10_01_flame_thrower
                                        .byte > ofs_036_8E20_02_spread
                                        .byte > ofs_036_8E30_03_laser
                                        .byte > ofs_036_8E40_04_flame
                                        .byte > ofs_036_8E50_05_fire_ball
                                        .byte > ofs_036_8E60_06_grenade_launcher
                                        .byte > ofs_036_8E70_07_secret_weapon 

sub_8E0B_регистрация_выстрела:
                                        JMP (ram_000E)



ofs_036_8E00_00_default:
                                        LDY ram_0006    ; индекс оружия текущего игрока
                                        LDA ram_прокачка_характеристик_оружия,Y
                                        TAY
                                        CMP #$02
                                        BCC bra_8E01
; 02 M
                                        LDA ram_0004    ; нажатая кнопка
                                        ASL
                                        ASL
                                        BCS bra_8E01
bra_8E02_machine_gun:
                                        LDA ram_рандом_байт
                                        AND tbl_0024_фильтры - $02,Y
                                        CLC
                                        BIT ram_рандом_байт
                                        BMI bra_8E03
                                        EOR #$FF
                                        ADC #$01
bra_8E03:
                                        STA ram_000A    ; добавочный байт смещения
bra_8E01:
                                        LDA tbl_0025_начальный_кадр,Y
                                        STA ram_кадр_анимации,X
                                        JMP loc_8E6C


tbl_0024_фильтры:
                                        .byte $03   ; 02
                                        .byte $07   ; 03

tbl_0025_начальный_кадр:
                                        .byte $C6   ; 00
                                        .byte $C6   ; 01
                                        .byte $05   ; 02
                                        .byte $19   ; 03


ofs_036_8E10_01_flame_thrower:
                                        LDY ram_0010    ; индекс текущего игрока
                                        LDA ram_счетчик_поворота_игрока,Y    ; угол вращения огнемета
                                        LDY ram_0001    ; угол выстрела игрока
                                        CMP tbl_8EF0_вращение_пули,Y
                                        BEQ bra_0020
; углы не совпали, круговой выстрел
                                        CLC
                                        ADC #$26    ; смещение на таблицу кругового движения
                                        PHA
                                        LDA #$0C    ; добавочное смещение для позы лежа
                                        CPY #$04    ; лежа
                                        BEQ bra_0021
                                        CPY #$05    ; лежа
                                        BEQ bra_0021
                                        LDA #$06    ; добавочное смещение для позы сидя
                                        CPY #$0E    ; сидя
                                        BEQ bra_0021
                                        CPY #$0F    ; сидя
                                        BNE bra_0022
bra_0021:
                                        CLC
                                        ADC ram_0002    ; позиция_y_спрайта`    
                                        STA ram_0002    ; позиция_y_спрайта
bra_0022:
                                        PLA
                                        TAY
bra_0020:
                                        LDA ram_счетчик_кадров
                                        AND #$02
                                        BNE bra_8EB7
                                        LDA #$42
bra_8EB7:
                                        STA ram_атрибуты_спрайта,X
                                        LDA #$C7    ; спрайт огнемета
                                        STA ram_кадр_анимации,X
                                        JMP loc_8E6D


ofs_036_8E20_02_spread:
                                        LDY ram_0000    ; номер пули обработчика
                                        LDA tbl_8F0A_байты_смещения_S,Y
                                        STA ram_000A    ; добавочный байт смещения
                                        LDA #$06    ;   спрайт S
                                        STA ram_кадр_анимации,X
                                        JMP loc_8E6C


tbl_8F0A_байты_смещения_S:
- D 0 - - - 0x000F1A 00:8F0A: 00        .byte $00   ; 00 
- D 0 - - - 0x000F1B 00:8F0B: FC        .byte $F8   ; 01 
- D 0 - - - 0x000F1C 00:8F0C: 04        .byte $08   ; 02 
- D 0 - - - 0x000F1D 00:8F0D: F8        .byte $F0   ; 03 
- D 0 - - - 0x000F1E 00:8F0E: 08        .byte $10   ; 04 
                                        .byte $E8   ; 05 
                                        .byte $18   ; 06 
                                        .byte $E0   ; 07 
                                        .byte $20   ; 08 
                                        .byte $D8   ; 09
                                        .byte $28   ; 0A 
                                        .byte $D0   ; 0B


ofs_036_8E30_03_laser:
                                        LDY ram_0001    ; угол выстрела игрока
                                        LDA tbl_911C_spr_attr_пули,Y
                                        STA ram_атрибуты_спрайта,X
                                        LDA tbl_9312_offset_лазер,Y
                                        STA ram_000A    ; байт смещения

                                        LDA tbl_8EE8_направление_пули,Y
                                        TAY
                                        LDA tbl_9311_laser_спрайты,Y
                                        STA ram_кадр_анимации,X

                                        LDY ram_0001    ; угол выстрела игрока
                                        JMP loc_8E6D

tbl_9311_laser_спрайты:
- D 0 - - - 0x001321 00:9311: 16        .byte $15   ; 00 
- D 0 - - - 0x001322 00:9312: 18        .byte $17   ; 01 
- D 0 - - - 0x001323 00:9313: 15        .byte $16   ; 02 
- D 0 - - - 0x001324 00:9314: 18        .byte $18   ; 03 
- D 0 - - - 0x001325 00:9315: 16        .byte $15   ; 04 
- D 0 - - - 0x001326 00:9316: 17        .byte $18   ; 05 
- D 0 - - - 0x001327 00:9317: 15        .byte $16   ; 06 
- D 0 - - - 0x001328 00:9318: 17        .byte $17   ; 07 



tbl_9312_offset_лазер:
; на земле
; ровная поверхность
; смотрит вправо
                                        .byte $00, $00, $00, $00, $00 
; смотрит влево
                                        .byte $00, $00, $00, $00, $00 
; на земле
; диагональная поверхность
; смотрит вправо
                                        .byte $00, $F4, $00, $0C, $00 
; смотрит влево
                                        .byte $00, $F4, $00, $0C, $00 
; в прыжке +14
; 8 направлений
                                        .byte $00, $00, $00, $00 
                                        .byte $00, $00, $00, $00
; уровни с видом сверху +1C
                                        .byte $00, $00, $00, $00, $00 
                                        .byte $00, $00, $00, $00, $00 


ofs_036_8E40_04_flame:
                                        LDA #$00
                                        STA ram_тип_пули_игрока,X   ; 00 обычный выстрел
                                        LDY ram_0010    ; индекс игрока
                                        LDA ram_чарж_оружия_игрока,Y
                                        BPL bra_8E41
; чарж                                    
                                        INC ram_тип_пули_игрока,X   ; 01 чарж
                                        LDA #$1A
                                        BNE bra_8E42
bra_8E41:
                                        LDA #$03
bra_8E42:
                                        STA ram_кадр_анимации,X
                                        LDA #$00
                                        STA ram_чарж_оружия_игрока,Y
                                        STA ram_пули_игрока_счетчики_движения,X
                                        JMP loc_8E6C


ofs_036_8E50_05_fire_ball:
bra_8DE0_loop:
                                        LDY ram_0008    ; прокачка оружия для f_ball
                                        LDA tbl_8E6A_fire_ball_индексы,Y
                                        CLC
                                        ADC ram_0000    ; номер пули обработчика
                                        TAY
                                        LDA tbl_8E6B_fire_ball,Y
                                        STA ram_пули_игрока_счетчики_анимации,X

                                        LDA #$08    ; спрайт fire_ball
                                        STA ram_кадр_анимации,X

                                        LDY ram_0001    ; угол выстрела игрока
                                        LDA tbl_911C_spr_attr_пули,Y
                                        STA ram_атрибуты_спрайта,X

                                        LDA #$00
                                        STA ram_пули_игрока_сумма_скорости_x_младш,X
                                        STA ram_пули_игрока_скорость_x_младш,X
                                        STA ram_пули_игрока_сумма_скорости_y_младш,X
                                        STA ram_пули_игрока_скорость_y_младш,X
                                        STA ram_пули_игрока_счетчики_движения,X

                                        JSR sub_8E8C
                                        INC ram_0000    ; номер пули для обработчика
                                        INX ; индекс пустого слота пули
                                        DEC ram_000C    ; кол-во разрешенных выстрелов
                                        BNE bra_8DE0_loop
                                        LDA tbl_8F03_звук_пуль,Y
                                        JMP loc_0x01FDEE_play_sound ; exit

tbl_8E6A_fire_ball_индексы:
                                        .byte $00, $02, $06, $0C  ; индексы
tbl_8E6B_fire_ball:
                                        .byte $00, $20                                 ; 02 пули  00
                                        .byte $00, $20, $10, $30                       ; 04 пули  02
                                        .byte $00, $20, $0A, $16, $2A, $36             ; 06 пули  06
                                        .byte $00, $20, $10, $30, $08, $18, $28, $38   ; 08 пули  0C


ofs_036_8E60_06_grenade_launcher:
                                        LDA #00
                                        STA ram_пули_игрока_счетчики_движения,X
                                        STA ram_тип_пули_игрока,X
                                        LDA #$01
                                        STA ram_пули_игрока_счетчики_анимации,X

                                        LDY ram_0001    ; угол выстрела игрока
                                        LDA tbl_8EE8_направление_пули,Y
                                        STA ram_позиция_x_главной_пули,X
                                        TAY
                                        LDA tbl_8E62,Y
                                        STA ram_000A   ; байт смещения

                                        LDA #$B8
                                        STA ram_кадр_анимации,X
bra_8E61:
                                        JMP loc_8E6C

tbl_8E62:
                                        .byte $00, $F8, $F8, $F8, $00, $08, $08, $08    ;










ofs_036_8E70_07_secret_weapon:
                                        RTS




; общие данные
loc_8E6C:
                                        LDY ram_0001    ; угол выстрела игрока
                                        LDA tbl_911C_spr_attr_пули,Y
                                        STA ram_атрибуты_спрайта,X
loc_8E6D:
                                        LDA ram_0002    ; позиция_y_спрайта
                                        CLC
                                        ADC tbl_9119_Y_пули,Y
                                        STA ram_позиция_y_спрайта,X

                                        LDA ram_0003    ; позиция_x_спрайта
                                        CLC
                                        ADC tbl_911A_X_пули,Y
                                        STA ram_позиция_x_спрайта,X

                                        LDA tbl_911B_offset_пули,Y
                                        CLC
                                        ADC ram_000A    ; байт смещения
                                        TAY








 ;                                       LDY ram_000A   ; байт смещения
loc_8E7A:
                                        LDA (ram_0008),Y
                                        STA ram_пули_игрока_скорость_x_младш,X
                                        INC ram_0009
                                        LDA (ram_0008),Y
                                        STA ram_пули_игрока_скорость_x_старш,X
                                        INC ram_0009
                                        LDA (ram_0008),Y
                                        STA ram_пули_игрока_скорость_y_младш,X
                                        INC ram_0009
                                        LDA (ram_0008),Y
                                        STA ram_пули_игрока_скорость_y_старш,X
                                        DEC ram_0009
                                        DEC ram_0009
                                        DEC ram_0009
loc_8E8C:
sub_8E8C:
                                        LDA ram_0006    ; индекс оружия текущего игрока
C - - - - - 0x000EAC 00:8E9C: 9D B8 05  STA ram_пули_игрока_индексы,X  ; для подсчета очков кто убил врага
                                        TAY
                                        LDA ram_урон_пуль_оружия,Y
                                        STA ram_пули_игрока_урон,X
                                        
                                        LDA ram_прокачка_характеристик_оружия,Y
                                        STA ram_пули_игрока_характеристики_прокачки,X

                                        LDY ram_0007    ; тип оружия
                                        LDA #$FF
                                        STA ram_пули_игрока_счетчик_жизни,X
                                        LDA tbl_8ED0_атрибуты_пуль,Y
                                        STA ram_пули_игрока_аттрибуты,X
                                        RTS


tbl_8D8A_цена_за_выстрел:
                                        .byte $01  ; 00 default
                                        .byte $01  ; 01 flame_thrower
                                        .byte $01  ; 02 spread
                                        .byte $01  ; 03 laser
                                        .byte $01  ; 04 flame
                                        .byte $01  ; 05 fire_ball
                                        .byte $01  ; 06 rocket_launcher
                                        .byte $01  ; 07 secret_weapon


tbl_8ED0_атрибуты_пуль:
                                        .byte $04   ; default
                                        .byte $04   ; flame_thrower
                                        .byte $04   ; spread
                                        .byte $04   ; laser
                                        .byte $04   ; flame
                                        .byte $01   ; fire_ball
                                        .byte $04   ; rocket_launcher
                                        .byte $04   ; secret_weapon


;              00
;         <-  0000  ->
;           07    01
;         06        02
;           05    03
;         <-  0602  ->
;              04

tbl_8EE8_направление_пули:
; на земле
; ровная поверхность
; смотрит вправо
                                        .byte $00, $01, $02, $03, $02 
; смотрит влево
                                        .byte $06, $05, $06, $07, $00 
; на земле
; диагональная поверхность
; смотрит вправо
                                        .byte $00, $01, $02, $03, $02 
; смотрит влево
                                        .byte $06, $05, $06, $07, $00 
; в прыжке
; смотрит вправо
                                        .byte $00, $01, $02, $03 
; смотрит влево
                                        .byte $04, $05, $06, $07
; уровни с видом сверху +1C
                                        .byte $00, $00, $01, $02, $03
                                        .byte $04, $04, $05, $06, $07
; круговое движение +26
                                        .byte $E7, $F2, $FD, $04, $0B, $0B, $04, $FD    ; RIGHT/UP 
                                        .byte $E7, $F2, $FD, $04, $0B, $0B, $04, $FD    ; UP/LEFT
                                        .byte $E7, $F2, $FD, $04, $0B, $0B, $04, $FD    ; LEFT/DOWN
                                        .byte $E7, $F2, $FD, $04, $0B, $0B, $04, $FD    ; DOWN/RIGHT



tbl_8EF0_вращение_пули:
; на земле
; ровная поверхность
; смотрит вправо ->
                                        .byte $08   ; 00 UP
                                        .byte $04   ; 01 UP+RIGHT
                                        .byte $00   ; 02 RIGHT
                                        .byte $1C   ; 03 DOWN+RIGHT
                                        .byte $00   ; 04 DOWN лежа
; на земле
; ровная поверхность
; <- смотрит лево
                                        .byte $10   ; 05 DOWN лежа
                                        .byte $14   ; 06 DOWN+LEFT 
                                        .byte $10   ; 07 LEFT
                                        .byte $0C   ; 08 UP+LEFT
                                        .byte $08   ; 09 UP
; на земле
; диагональная поверхность
; смотрит вправо ->
                                        .byte $08   ; 0A UP
                                        .byte $04   ; 0B UP+RIGHT
                                        .byte $00   ; 0C RIGHT
                                        .byte $1C   ; 0D DOWN+RIGHT
                                        .byte $00   ; 0E DOWN сидя
; на земле
; диагональная поверхность
; <- смотрит лево
                                        .byte $10   ; 0F DOWN сидя
                                        .byte $14   ; 10 DOWN+LEFT 
                                        .byte $10   ; 11 LEFT
                                        .byte $0C   ; 12 UP+LEFT
                                        .byte $08   ; 13 UP
; в прыжке
                                        .byte $08   ; 14 UP
                                        .byte $04   ; 15 UP+RIGHT
                                        .byte $00   ; 16 RIGHT
                                        .byte $1C   ; 17 DOWN+RIGHT
                                        .byte $18   ; 18 DOWN
                                        .byte $14   ; 19 DOWN+LEFT 
                                        .byte $10   ; 1A LEFT
                                        .byte $0C   ; 1B UP+LEFT
; уровни с видом сверху
                                        .byte $08   ; 1C UP
                                        .byte $08   ; 1D UP
                                        .byte $04   ; 1E UP+RIGHT
                                        .byte $00   ; 1F RIGHT
                                        .byte $1C   ; 20 DOWN+RIGHT
                                        .byte $18   ; 21 DOWN
                                        .byte $18   ; 22 DOWN
                                        .byte $14   ; 23 DOWN+LEFT 
                                        .byte $10   ; 24 LEFT
                                        .byte $0C   ; 25 UP+LEFT



;tbl_8EF5_кадр_пуль:
;- D 0 - - - 0x000F05 00:8EF5: 05        .byte $C6   ; 00 default
;- D 0 - - - 0x000F06 00:8EF6: 19        .byte $C7   ; 01 flame_thrower
;- D 0 - - - 0x000F07 00:8EF7: 06        .byte $06   ; 02 spread
;- D 0 - - - 0x000F08 00:8EF8: 00        .byte $00   ; 03 laser
;- D 0 - - - 0x000F09 00:8EF9: 19        .byte $19   ; 04 flame
;- D 0 - - - 0x000F0A 00:8EFA: 19        .byte $08   ; 05 fire_ball
;- D 0 - - - 0x000F0B 00:8EFB: 03        .byte $C7   ; 06 rocket_launcher
;                                        .byte $C8   ; 07 secret_weapon



tbl_8F03_звук_пуль:
- D 0 - - - 0x000F13 00:8F03: 0B        .byte con_sound_0B   ; 00 default
- D 0 - - - 0x000F14 00:8F04: 0C        .byte con_sound_0C   ; 01 flame_thrower
- D 0 - - - 0x000F15 00:8F05: 0E        .byte con_sound_0E   ; 02 spread
- D 0 - - - 0x000F16 00:8F06: 0D        .byte con_sound_10   ; 03 laser
- D 0 - - - 0x000F17 00:8F07: 0F        .byte con_sound_0F   ; 04 flame
- D 0 - - - 0x000F18 00:8F08: 0F        .byte con_sound_0F   ; 05 fire_ball
- D 0 - - - 0x000F19 00:8F09: 0F        .byte con_sound_0F   ; 06 rocket_launcher
                                        .byte con_sound_0F   ; 07 secret_weapon




tbl_9119_Y_пули:
; на земле
; ровная поверхность
; смотрит вправо
                                        .byte $E7, $F2, $FD, $04, $0B 
; смотрит влево
                                        .byte $0B, $04, $FD, $F2, $E7 
; на земле
; диагональная поверхность
; смотрит вправо
                                        .byte $E7, $F2, $FD, $04, $05 
; смотрит влево
                                        .byte $05, $04, $FD, $F2, $E7 
; в прыжке +14
; 8 направлений
                                        .byte $F6, $F9, $00, $07 
                                        .byte $0A, $07, $00, $F9 
; уровни с видом сверху +1C
                                        .byte $F2, $F2, $F5, $FB, $03
                                        .byte $04, $04, $02, $FB, $F5 
; круговое движение +26
                                        .byte $00, $FE, $FC, $FA, $F9, $F8, $F7, $F6    ; RIGHT/UP 
                                        .byte $F6, $F6, $F7, $F8, $F9, $FA, $FC, $FE    ; UP/LEFT
                                        .byte $00, $02, $04, $06, $07, $08, $09, $0A    ; LEFT/DOWN
                                        .byte $0A, $0A, $09, $08, $07, $06, $04, $02    ; DOWN/RIGHT
; 5 доп для flame +46
                                        .byte $F1, $F5, $F7, $F7, $F1  ; right
                                        .byte $F1, $F5, $F7, $F7, $F8  ; left


tbl_911A_X_пули:
; на земле
; ровная поверхность
; смотрит вправо
                                        .byte $02, $09, $0D, $0A, $0F 
; смотрит влево
                                        .byte $F1, $F6, $F3, $F7, $FE 
; на земле
; диагональная поверхность
; смотрит вправо
                                        .byte $02, $09, $0D, $0A, $0E 
; смотрит влево
                                        .byte $F2, $F6, $F3, $F7, $FE 
; в прыжке +14
; 8 направлений
                                        .byte $00, $07, $0A, $07 
                                        .byte $00, $F9, $F6, $F9 
; уровни с видом сверху +1C
                                        .byte $04, $04, $06, $09, $09
                                        .byte $FD, $FD, $F8, $F7, $FA 
; круговое движение +26
                                        .byte $0A, $0A, $09, $08, $07, $06, $04, $02    ; RIGHT/UP 
                                        .byte $00, $FE, $FC, $FA, $F9, $F8, $F7, $F6    ; UP/LEFT
                                        .byte $F6, $F6, $F7, $F8, $F9, $FA, $FC, $FE    ; LEFT/DOWN
                                        .byte $00, $02, $04, $06, $07, $08, $09, $0A    ; DOWN/RIGHT
; 5 доп для flame +46
                                        .byte $09, $0B, $08, $08, $08  ; right
                                        .byte $F7, $F5, $F8, $F8, $F8  ; left

tbl_911B_offset_пули:
; на земле
; ровная поверхность
; смотрит вправо
                                        .byte $C0, $E0, $00, $20, $00 
; смотрит влево
                                        .byte $80, $60, $80, $A0, $C0 
; на земле
; диагональная поверхность
; смотрит вправо
                                        .byte $C0, $EC, $00, $14, $00 
; смотрит влево
                                        .byte $80, $6C, $80, $94, $C0 
; в прыжке +14
; 8 направлений
                                        .byte $C0, $E0, $00, $20 
                                        .byte $40, $60, $80, $A0 
; уровни с видом сверху +1C
                                        .byte $C0, $C0, $E0, $00, $20
                                        .byte $40, $40, $60, $80, $A0
; круговое движение +26
                                        .byte $00, $F8, $F0, $E8, $E0, $D8, $D0, $C8    ; RIGHT/UP 
                                        .byte $C0, $B8, $B0, $A8, $A0, $98, $90, $88    ; UP/LEFT
                                        .byte $80, $78, $70, $68, $60, $58, $50, $48    ; LEFT/DOWN
                                        .byte $40, $38, $30, $28, $20, $18, $10, $08    ; DOWN/RIGHT
; 5 доп для flame +46
                                        .byte $00, $00, $00, $00, $00, $00  ; right
                                        .byte $00, $00, $00, $00, $00, $00  ; left

tbl_911C_spr_attr_пули:
; на земле
; ровная поверхность
; смотрит вправо
                                        .byte $02, $02, $02, $02, $02 
; смотрит влево
                                        .byte $42, $42, $42, $42, $42 
; на земле
; диагональная поверхность
; смотрит вправо
                                        .byte $02, $02, $02, $02, $02 
; смотрит влево
                                        .byte $42, $42, $42, $42, $42 
; в прыжке +14
; 8 направлений
                                        .byte $02, $02, $02, $02 
                                        .byte $02, $42, $42, $42 
; уровни с видом сверху +1C
                                        .byte $42, $02, $02, $02, $02
                                        .byte $02, $42, $42, $42, $42 
; круговое движение +26
                                        .byte $02, $02, $02, $02, $02, $02, $02, $02    ; RIGHT/UP 
                                        .byte $02, $02, $02, $02, $02, $02, $02, $02    ; UP/LEFT
                                        .byte $02, $02, $02, $02, $02, $02, $02, $02    ; LEFT/DOWN
                                        .byte $02, $02, $02, $02, $02, $02, $02, $02    ; DOWN/RIGHT
; 5 доп для flame +46
                                        .byte $02, $02, $02, $02, $02, $02  ; right
                                        .byte $42, $42, $42, $42, $42, $42  ; left


 




loc_F801_обнуление_пуль_игрока:
C D 3 - - - 0x01F811 07:F801: A9 00     LDA #$00
C - - - - - 0x01F816 07:F806: 9D 68 05  STA ram_кадр_анимации,X
C - - - - - 0x01F813 07:F803: 9D A8 05  STA ram_пули_игрока_аттрибуты,X
                                        STA ram_пули_игрока_сумма_скорости_y_младш,X
                                        STA ram_пули_игрока_сумма_скорости_x_младш,X
                                        STA ram_пули_игрока_хитбокс,X
C - - - - - 0x01F81F 07:F80F: 60        RTS




loc_0x001191_обработка_пуль_игроков:
C D 0 - - - 0x001191 00:9181: A2 0F     LDX ram_макс_индекс_пули_игрока
bra_9183_loop:
C - - - - - 0x001193 00:9183: 20 B1 91  JSR sub_91B1_обработка_пуль_игроков
C - - - - - 0x001196 00:9186: CA        DEX
C - - - - - 0x001197 00:9187: 10 FA     BPL bra_9183_loop
                                        RTS


sub_91B1_обработка_пуль_игроков:
C - - - - - 0x0011C8 00:91B8: BC A8 05  LDY ram_пули_игрока_аттрибуты,X
C - - - - - 0x0011CB 00:91BB: D0 28     BNE bra_91E5_начало_обработки
bra_91BD:
C - - - - - 0x0011CD 00:91BD: A9 00     LDA #$00
C - - - - - 0x0011CF 00:91BF: 9D 38 06  STA ram_пули_игрока_хитбокс,X
C - - - - - 0x0011D2 00:91C2: 60        RTS
bra_91C3:
                                        DEY
                                        BNE bra_91CB
; 03 атрибут, очистить спрайт через 1 кадр
C - - - - - 0x0011D3 00:91C3: 20 8C 92  JSR sub_928C_Y_X_старш
C - - - - - 0x0011D6 00:91C6: DE 28 06  DEC ram_пули_игрока_счетчик_жизни,X
C - - - - - 0x0011D9 00:91C9: D0 F2     BNE bra_91BD
                                        JMP loc_F801_обнуление_пуль_игрока
; 04 атрибут, задержка 1 кадр чтобы пуля создалась в автомате
bra_91CB:
C - - - - - 0x0011DB 00:91CB: A9 01     LDA #$01
C - - - - - 0x0011DD 00:91CD: 9D A8 05  STA ram_пули_игрока_аттрибуты,X
C - - - - - 0x0011E0 00:91D0: D0 EB     BNE bra_91BD    ; jmp
bra_91D2:
C - - - - - 0x0011E2 00:91D2: 88        DEY
C - - - - - 0x0011E3 00:91D3: D0 EE     BNE bra_91C3
; 02 атрибут, пуля врезалась
C - - - - - 0x0011E5 00:91D5: 20 8C 92  JSR sub_928C_Y_X_старш
C - - - - - 0x0011E8 00:91D8: A9 04     LDA #$04
C - - - - - 0x0011EA 00:91DA: 9D 68 05  STA ram_кадр_анимации,X
C - - - - - 0x0011ED 00:91DD: DE 28 06  DEC ram_пули_игрока_счетчик_жизни,X
C - - - - - 0x0011F0 00:91E0: D0 DB     BNE bra_91BD
C - - - - - 0x0011F2 00:91E2: 4C 01 F8  JMP loc_F801_обнуление_пуль_игрока
bra_91E5_начало_обработки:
C - - - - - 0x0011F5 00:91E5: 88        DEY
C - - - - - 0x0011F6 00:91E6: D0 EA     BNE bra_91D2
; 01 атрибут
C - - - - - 0x0011F8 00:91E8: FE 28 06  INC ram_пули_игрока_счетчик_жизни,X

                                        LDA #$9F
                                        STA ram_пули_игрока_хитбокс,X

                                        LDA ram_пули_игрока_индексы,X
                                        STA ram_0013    ; индекс оружия
                                        LSR
                                        STA ram_0012    ; номер оружия
                                        TAY
                                        LDA tbl_91F7_weapon_lo,Y
                                        STA ram_0002
                                        LDA tbl_91F7_weapon_hi,Y
                                        STA ram_0003
                                        JMP (ram_0002)
tbl_91F7_weapon_lo:
                                        .byte < ofs_005_9200_00_default
                                        .byte < ofs_005_9210_01_flame_thrower
                                        .byte < ofs_005_9220_02_spread
                                        .byte < ofs_005_9230_03_laser
                                        .byte < ofs_005_9240_04_flame
                                        .byte < ofs_005_9250_05_fire_ball
                                        .byte < ofs_005_9260_06_grenade_launcher
                                        .byte < ofs_005_9270_07_secret_weapon
tbl_91F7_weapon_hi:
                                        .byte > ofs_005_9200_00_default
                                        .byte > ofs_005_9210_01_flame_thrower
                                        .byte > ofs_005_9220_02_spread
                                        .byte > ofs_005_9230_03_laser
                                        .byte > ofs_005_9240_04_flame
                                        .byte > ofs_005_9250_05_fire_ball
                                        .byte > ofs_005_9260_06_grenade_launcher
                                        .byte > ofs_005_9270_07_secret_weapon

; ОБРАБОТКА ПУЛЬ
; ram_0000  ; позиция_x_спрайта
; ram_0001  ; позиция_y_спрайта
; ram_0002  ; свободно
; ram_0003  ; свободно
; ram_0004  ; не понятно
; ram_0005  ; свободно
; ram_0006  ; свободно
; ram_0007  ; свободно
; ram_0008  ; занято
; ram_0009  ; занято
; ram_000A
; ram_000B
; ram_000C
; ram_000D
; ram_000E
; ram_000F
; ram_0010
; ram_0011
; ram_0012
; ram_0013
; ram_0014



ofs_005_9200_00_default:
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        LDY ram_конфиг_уровня_вид
                                        BEQ bra_9201
                                        CMP #$18
                                        BCC bra_9201
                                        JMP loc_9272_пуля_врезалась
bra_9201:
                                        CMP #$04
                                        BNE bra_91F7
                                        LDA ram_пули_игрока_характеристики_прокачки,Y
                                        AND #$0F
                                        TAY
                                        LDA tbl_9334_default_кадры_анимации,Y
                                        STA ram_кадр_анимации,X
bra_91F7:
                                        JMP loc_91FB

tbl_9334_default_кадры_анимации:
                                        .byte $C6   ; 00 кадр подмены
                                        .byte $05   ; 01 кадр подмены
                                        .byte $19   ; 02 кадр подмены
                                        .byte $06   ; 03 кадр подмены



ofs_005_9210_01_flame_thrower:
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        CMP #$07
                                        BCS bra_9204
                                        CMP #$06    ;
                                        BCC bra_9209
                                        LDA #$C8
                                        STA ram_кадр_анимации,X
bra_9209:
                                        JMP loc_91FB
bra_9204:
                                        JMP loc_F801_обнуление_пуль_игрока











ofs_005_9240_04_flame:
                                        LDA ram_тип_пули_игрока,X
                                        BPL bra_9241
; 80 бит что пуля разорвалась
                                        AND #$01    ; 00 обычный выстрел, 01 чарж
                                        BNE bra_9243
; обычный разрыв
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        BEQ bra_9242
                                        CMP #$08
                                        BCS bra_9204
                                        
                                        JMP loc_91FB    ; выход
bra_9241:
                                        AND #$01    ; 00 обычный выстрел, 01 чарж
                                        BEQ bra_9244
                                        LDA #$DF
                                        STA ram_пули_игрока_хитбокс,X
bra_9244:
                                        LDA ram_конфиг_уровня_вид
                                        BEQ bra_9245
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        CMP #$18
                                        BCC bra_9245
                                        JMP loc_9297_flame
bra_9245:
                                        JMP loc_91FB    ; выход
bra_9242:
                                        JSR sub_9280_обработка_вращения_пуль
                                        JMP loc_91FB    ; выход
bra_9243:
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        CMP #$2A
                                        BCS bra_9204
                                        DEC ram_пули_игрока_счетчики_анимации,X
                                        DEC ram_пули_игрока_счетчики_анимации,X
                                        LSR
                                        TAY
                                        LDA tbl_9243_индексы_вращения,Y
                                        STA ram_пули_игрока_счетчики_движения,X

                                        JSR sub_9280_обработка_вращения_пуль
                                        LDA ram_позиция_y_главной_пули,X
                                        SEC
                                        SBC ram_cam_spd_Y
                                        STA ram_позиция_y_главной_пули,X
                                        STA ram_позиция_y_спрайта,X

                                        LDA ram_позиция_x_главной_пули,X
                                        SEC
                                        SBC ram_cam_spd_X
                                        STA ram_позиция_x_главной_пули,X
                                        STA ram_позиция_x_спрайта,X

                                        JMP loc_91FB    ; выход


tbl_9243_индексы_вращения:
;                                              00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F
                                        .byte $00, $10, $20, $30, $40, $50, $60, $70, $80, $90, $90, $90, $80, $70, $60, $50    ; 00
                                        .byte $40, $30, $20, $10, $00 ; 10







ofs_005_9250_05_fire_ball:
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        LSR
                                        BCC bra_9251
                                        LDA ram_атрибуты_спрайта,X
                                        EOR #$40
                                        STA ram_атрибуты_спрайта,X
bra_9251:
                                        LDA ram_пули_игрока_счетчики_движения,X
                                        BPL bra_9252

                                        LDA ram_конфиг_уровня_вид
                                        BEQ bra_925C
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        CMP #$08
                                        BCC bra_925C
                                        JMP loc_9272_пуля_врезалась
bra_925C:
                                        JMP loc_91FB    ; выход
bra_9252:
                                        LDA ram_0013    ; индекс оружия
                                        AND #$01
                                        TAY
                                        LDA ram_статус_игрока,Y
                                        CMP #$02    ; живой
                                        BNE bra_9253
                                        LDA ram_удержанная_кнопка,Y
                                        AND #con_btn_B
                                        BNE bra_9254
bra_9253:
                                        LDA #$A0    ; игрок мертвый или отпустил кнопку
                                        STA ram_пули_игрока_счетчики_движения,X
                                        LDA #$FF
                                        STA ram_пули_игрока_счетчик_жизни,X
                                        JSR sub_9280_обработка_вращения_пуль
                                        JMP loc_91FB    ; выход
; вращение пуль вокруг игрока
bra_9254:
                                        JSR sub_9280_обработка_вращения_пуль
                                        LDA ram_0013    ; индекс оружия
                                        AND #$01
                                        TAY
; x hi
                                        LDA ram_пули_игрока_скорость_x_старш,X
                                        SEC
                                        SBC ram_cam_spd_X
                                        CLC
                                        BMI bra_9255
                                        ADC ram_позиция_x_спрайта_игрока,Y
                                        STA ram_позиция_x_спрайта,X
                                        BCS bra_9259_спрятать_спрайт
                                        BCC bra_9256   ; jmp
bra_9255:
                                        ADC ram_позиция_x_спрайта_игрока,Y
                                        STA ram_позиция_x_спрайта,X
                                        BCC bra_9259_спрятать_спрайт
bra_9256:
                                        CMP #$08
                                        BCC bra_9259_спрятать_спрайт
; y hi
                                        LDA ram_пули_игрока_скорость_y_старш,X
                                        SEC
                                        SBC ram_cam_spd_Y
                                        CLC
                                        BMI bra_9257
                                        ADC ram_позиция_y_спрайта_игрока,Y
                                        STA ram_позиция_y_спрайта,X
                                        BCS bra_9259_спрятать_спрайт
                                        BCC bra_9258    ; jmp
bra_9257:
                                        ADC ram_позиция_y_спрайта_игрока,Y
                                        STA ram_позиция_y_спрайта,X
                                        BCC bra_9259_спрятать_спрайт  ; jmp
bra_9258:
                                        LDA #$08    ; спрайт f_ball
                                        BNE bra_925A
bra_9259_спрятать_спрайт:
                                        LDA #$00
                                        STA ram_пули_игрока_хитбокс,X
bra_925A:
                                        STA ram_кадр_анимации,X
                                        
                                        LDA ram_пули_игрока_счетчики_движения,X
                                        CLC
                                        ADC #$10
                                        BMI bra_925B
                                        STA ram_пули_игрока_счетчики_движения,X
bra_925B:
                                        DEC ram_пули_игрока_счетчики_анимации,X

                                        JMP loc_91FF    ; выход







sub_9280_обработка_вращения_пуль:
                                        LDA ram_пули_игрока_счетчики_анимации,X
                                        AND #$0F
                                        CLC
                                        ADC ram_пули_игрока_счетчики_движения,X
                                        TAY
                                        LDA ram_пули_игрока_счетчики_анимации,X
                                        AND #$10
                                        BNE bra_9282
                                        LDA tbl_9299_fire_ball_круговое_движение_hi,Y
                                        STA ram_пули_игрока_скорость_x_старш,X
                                        TYA
                                        AND #$0F
                                        BEQ bra_9281
                                        DEY
                                        TYA
                                        EOR #$0F
                                        TAY
                                        LDA tbl_9299_fire_ball_круговое_движение_hi,Y
bra_9281:
                                        STA ram_пули_игрока_скорость_y_старш,X
                                        JMP loc_9284

bra_9282:
                                        LDA tbl_9299_fire_ball_круговое_движение_hi,Y
                                        STA ram_пули_игрока_скорость_y_старш,X
                                        TYA
                                        AND #$0F
                                        BEQ bra_9283
                                        DEY
                                        TYA
                                        EOR #$0F
                                        TAY
                                        LDA tbl_9299_fire_ball_круговое_движение_hi,Y
bra_9283:
                                        STA ram_пули_игрока_скорость_x_старш,X
loc_9284:
                                        LDA ram_пули_игрока_счетчики_анимации,X
                                        AND #$30
                                        BEQ bra_9286_RTS
                                        CMP #$10
                                        BEQ bra_9288_10
                                        CMP #$30
                                        BEQ bra_9285_30
                                        JSR sub_9287
bra_9285_30:
                                        LDA ram_пули_игрока_скорость_y_старш,X
                                        BEQ bra_9286_RTS
                                        EOR #$FF
                                        CLC
                                        ADC #$01
                                        STA ram_пули_игрока_скорость_y_старш,X
bra_9286_RTS:
                                        RTS
sub_9287:
bra_9288_10:
                                        LDA ram_пули_игрока_скорость_x_старш,X
                                        BEQ bra_9286_RTS
                                        EOR #$FF
                                        CLC
                                        ADC #$01
                                        STA ram_пули_игрока_скорость_x_старш,X
                                        RTS



tbl_9299_fire_ball_круговое_движение_hi:
;                                              00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F
                                        .byte $05, $04, $04, $04, $04, $04, $04, $03, $03, $03, $02, $02, $01, $01, $00, $00    ; 00
                                        .byte $08, $07, $07, $07, $07, $07, $06, $06, $05, $05, $04, $03, $03, $02, $01, $00    ; 10
                                        .byte $0B, $0A, $0A, $0A, $0A, $09, $09, $08, $07, $06, $06, $05, $04, $03, $02, $01    ; 20
                                        .byte $0E, $0D, $0D, $0D, $0C, $0C, $0B, $0A, $09, $08, $07, $06, $05, $04, $02, $01    ; 30
                                        .byte $11, $10, $10, $10, $0F, $0E, $0E, $0D, $0C, $0A, $09, $08, $06, $04, $03, $01    ; 40
                                        .byte $14, $13, $13, $13, $12, $11, $10, $0F, $0E, $0C, $0B, $09, $07, $05, $03, $01    ; 50
                                        .byte $17, $16, $16, $16, $15, $14, $13, $11, $10, $0E, $0C, $0A, $08, $06, $04, $02    ; 60
                                        .byte $1A, $19, $19, $18, $18, $16, $15, $14, $12, $10, $0E, $0C, $09, $07, $05, $02    ; 70
                                        .byte $1D, $1C, $1C, $1B, $1A, $19, $18, $16, $14, $12, $10, $0D, $0B, $08, $05, $02    ; 80
                                        .byte $20, $1F, $1F, $1E, $1D, $1C, $1A, $18, $16, $14, $11, $0F, $0C, $09, $06, $03    ; 90
                                        .byte $08, $07, $07, $07, $07, $07, $06, $06, $05, $05, $04, $03, $03, $02, $01, $00    ; A0 -  копия 10 для разлета пуль f_ball









ofs_005_9260_06_grenade_launcher:
                                        LDA ram_тип_пули_игрока,X
                                        BMI bra_9362
                                        
                                        LDA ram_конфиг_уровня_вид
                                        BEQ bra_9361
; уровни с видом сверху
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        CMP #$20
                                        BCC bra_9365
                                        JMP loc_9296_grenade_launcher
bra_9361:
                                        LDA #$20
                                        JSR sub_9367_отнять_y
bra_9365:
                                        LDY ram_позиция_x_главной_пули,X
                                        LDA tbl_9297_y,Y
                                        BEQ bra_9366
                                        JSR sub_9367_отнять_y
bra_9366:
                                        LDA tbl_9298_x,Y
                                        BEQ bra_936D
                                        JSR sub_9368_отнять_x
bra_936D:
                                        JMP loc_91FB
bra_9362:
                                        JSR sub_928C_Y_X_старш
                                        LDA #$DF
                                        STA ram_пули_игрока_хитбокс,X
                                        DEC ram_пули_игрока_счетчики_анимации,X
                                        BNE bra_9363_RTS
                                        INC ram_пули_игрока_счетчики_движения,X
                                        LDA ram_пули_игрока_счетчики_движения,X
                                        CMP #$04
                                        BCS bra_91E2_обнуление
                                        TAY
                                        LDA #$03
                                        STA ram_пули_игрока_счетчики_анимации,X
                                        LDA tbl_A351 - $01,Y
                                        STA ram_кадр_анимации,X
bra_9363_RTS:
                                        RTS

tbl_A351:
- D 1 - - - 0x006361 01:A351: 12        .byte $12   ; 00 
- D 1 - - - 0x006362 01:A352: 13        .byte $13   ; 01 
- D 1 - - - 0x006363 01:A353: 14        .byte $14   ; 02

tbl_9297_y:
                                        .byte $08, $0C, $0C, $03, $F8, $03, $0C, $0C    ;

tbl_9298_x:
                                        .byte $00, $03, $FB, $F4, $00, $0C, $06, $FD    ;


ofs_005_9220_02_spread:
                                        LDA ram_конфиг_уровня_вид
                                        BEQ bra_91FB
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        CMP #$18
                                        BCC bra_91FB
                                        JMP loc_9272_пуля_врезалась

ofs_005_9230_03_laser:
                                        LDA ram_конфиг_уровня_вид
                                        BEQ bra_91FB
                                        LDA ram_пули_игрока_счетчик_жизни,X
                                        CMP #$18
                                        BCC bra_91FB
bra_91E2_обнуление:
                                        JMP loc_F801_обнуление_пуль_игрока
ofs_005_9270_07_secret_weapon:
loc_91FB:
bra_91FB:
; x lo
                                        LDA ram_пули_игрока_сумма_скорости_x_младш,X
                                        CLC
                                        ADC ram_пули_игрока_скорость_x_младш,X
                                        STA ram_пули_игрока_сумма_скорости_x_младш,X
; x hi
                                        LDA ram_пули_игрока_скорость_x_старш,X
                                        ADC #$00
                                        SEC
                                        SBC ram_cam_spd_X
                                        CLC
                                        BMI bra_91FE
                                        ADC ram_позиция_x_спрайта,X

                                        BCS bra_91E2_обнуление
                                        BCC bra_91E3   ; jmp
bra_91FE:
                                        ADC ram_позиция_x_спрайта,X
                                        BCC bra_91E2_обнуление
bra_91E3:
                                        CMP #$08
                                        BCC bra_91E2_обнуление
                                        STA ram_позиция_x_спрайта,X
; y lo
                                        LDA ram_пули_игрока_сумма_скорости_y_младш,X
                                        CLC
                                        ADC ram_пули_игрока_скорость_y_младш,X
                                        STA ram_пули_игрока_сумма_скорости_y_младш,X
; y hi
                                        LDA ram_пули_игрока_скорость_y_старш,X
                                        ADC #$00
                                        SEC
                                        SBC ram_cam_spd_Y
                                        CLC
                                        BMI bra_9200
                                        ADC ram_позиция_y_спрайта,X
                                        BCS bra_91E2_обнуление
                                        BCC bra_91FF    ; jmp
bra_9200:
                                        ADC ram_позиция_y_спрайта,X
                                        BCC bra_91E2_обнуление  ; jmp
bra_91FF:
                                        CMP #$F0
                                        BCS bra_91E2_обнуление
                                        STA ram_позиция_y_спрайта,X
loc_91FF:
                                        LDA ram_пули_игрока_характеристики_прокачки,X
                                        AND #$10    ; пролет насквозь стен
                                        BNE bra_9281_RTS

C - - - - - 0x00124A 00:923A: BD 78 05  LDA ram_позиция_y_спрайта,X
C - - - - - 0x00124D 00:923D: C9 0C     CMP #$0C
C - - - - - 0x00124F 00:923F: 90 40     BCC bra_9281_RTS
; 0C+
C - - - - - 0x001251 00:9241: E9 04     SBC #$04
C - - - - - 0x001253 00:9243: A8        TAY
C - - - - - 0x001254 00:9244: BD 88 05  LDA ram_позиция_x_спрайта,X
C - - - - - 0x001257 00:9247: 20 AA BA  JSR sub_0x007ABA_calculate_surface_type
C - - - - - 0x00125A 00:924A: C9 06     CMP #$06
C - - - - - 0x00125C 00:924C: 90 06     BCC bra_9254_2D
C - - - - - 0x00125E 00:924E: A4 8F     LDY ram_008F_конфиг_уровня
C - - - - - 0x001260 00:9250: D0 02     BNE bra_9254_2D
C - - - - - 0x001262 00:9252: A9 00     LDA #$00
bra_9254_2D:
C - - - - - 0x001264 00:9254: A8        TAY
C - - - - - 0x001265 00:9255: B9 CC F8  LDA tbl_0x01F8DC,Y
C - - - - - 0x001268 00:9258: F0 27     BEQ bra_9281_RTS
C - - - - - 0x00126A 00:925A: C0 03     CPY #$03
C - - - - - 0x00126C 00:925C: D0 03     BNE bra_9261
C - - - - - 0x00126E 00:925E: 20 3B 93  JSR sub_933B
; пуля врезалась
loc_9261:
bra_9261:
                                        LDA ram_0012    ; номер пули оружия
C - - - - - 0x001278 00:9268: C9 04     CMP #$04    ; flame
C - - - - - 0x00127A 00:926A: F0 2A     BEQ bra_9297_flame
                                        CMP #$06    ; grenade launcher
                                        BEQ bra_9296_grenade_launcher
loc_9272_пуля_врезалась:
C D 0 - - - 0x001282 00:9272: A9 06     LDA #$03
bra_9274:
C - - - - - 0x001284 00:9274: 9D 28 06  STA ram_пули_игрока_счетчик_жизни,X
C - - - - - 0x001287 00:9277: A9 02     LDA #$02
C - - - - - 0x001289 00:9279: 9D A8 05  STA ram_пули_игрока_аттрибуты,X
C - - - - - 0x00128C 00:927C: A9 00     LDA #$00
C - - - - - 0x00128E 00:927E: 9D 38 06  STA ram_пули_игрока_хитбокс,X
bra_9281_RTS:
C - - - - - 0x001291 00:9281: 60        RTS








bra_9296_grenade_launcher:
loc_9296_grenade_launcher:
                                        LDA #$80
                                        STA ram_тип_пули_игрока,X
                                        LDA ram_пули_игрока_характеристики_прокачки,X   ; главной пули
                                        ORA #$30    ; бит игнорировая стен и врагов
                                        STA ram_пули_игрока_характеристики_прокачки,X   ; новой пули
                                        LDA #$12
                                        STA ram_кадр_анимации,X
                                        RTS


; con_weapon_F_normal
; con_weapon_F_charged
bra_9297_flame:
loc_9297_flame:
sub_0x001271:

                                        STX ram_000D    ; save индекс главной пули

                                        LDA #$00
                                        STA ram_000C    ; номер пули loop

                                        LDA ram_пули_игрока_индексы,X
                                        AND #$01
                                        TAY
                                        LDA ram_лимит_пуль_оружия,Y
                                        STA ram_000A    ; кол-во потенциальных пуль для обработчика

                                        LDA ram_пули_игрока_характеристики_прокачки,X
                                        AND #$0F
                                        ASL
                                        CLC
                                        ADC #$02    ; дефолт кол-во пуль при разрыве
                                        STA ram_0000    ; кол-во разрывных пуль

                                        STX ram_000B    ; индекс лимита пуль для начало проверок
bra_9298_loop:
                                        JSR sub_92A0_проверка_слотов
                                        BCS bra_9299_пуля_врезалась
                                        JSR sub_92C0_подготовка_разрывной_пули
                                        INC ram_000C    ; номер пули loop
                                        DEC ram_0000    ; кол-во разрывных пуль
                                        BNE bra_9298_loop
bra_9299_пуля_врезалась:
                                        JMP loc_9272_пуля_врезалась


sub_92A0_проверка_слотов:
                                        LDY ram_000B    ; индекс от куда начинать проверки
bra_92A1_loop:
                                        LDA ram_пули_игрока_аттрибуты,Y
                                        BEQ bra_92A3_выстрел
; занято
                                        CPY ram_макс_индекс_пули_игрока
                                        BCS bra_92A2_RTS
                                        
                                        CPY ram_000A    ; кол-во потенциальных пуль
                                        BCS bra_92A2_RTS
                                        
                                        INY
                                        INC ram_000B    ; индекс проверок
                                        BNE bra_92A1_loop
bra_92A2_RTS:
                                        SEC
                                        RTS
bra_92A3_выстрел:
                                        INC ram_000B    ; индекс проверок
                                        CLC
                                        RTS

;ram_000C   ПУСТО ; y главной пули
;ram_000D   ПУСТО ; x главной пули



sub_92C0_подготовка_разрывной_пули:
                                        LDA #$03    ; спрайт flame
                                        STA ram_кадр_анимации,Y ; новой пули

                                        LDA ram_пули_игрока_индексы,X   ; главной пули
                                        STA ram_пули_игрока_индексы,Y   ; для подсчета очков кто убил врага
                                        
                                        LDA ram_тип_пули_игрока,X   ; главной пули
                                        ORA #$80    ; бит что пуля разорвалась
                                        STA ram_тип_пули_игрока,Y   ; новой пули

                                        LDA ram_пули_игрока_урон,X  ; главной пули
                                        STA ram_пули_игрока_урон,Y  ; новой пули

                                        LDA #$FF
                                        STA ram_пули_игрока_счетчик_жизни,Y ; новой пули

                                        LDA #$01
                                        STA ram_пули_игрока_аттрибуты,Y ; новой пули

                                        LDA ram_атрибуты_спрайта,X  ; атрибут главной пули
                                        STA ram_атрибуты_спрайта,Y  ; атрибут новой пули

                                        LDA ram_позиция_y_спрайта,X ; y главной пули
                                        STA ram_позиция_y_главной_пули,Y    ; y пустой пули
                                        STA ram_позиция_y_спрайта,Y ; y новой пули

                                        LDA ram_позиция_x_спрайта,X ; x главной пули
                                        STA ram_позиция_x_главной_пули,Y    ; x пустой пули
                                        STA ram_позиция_x_спрайта,Y ; x новой пули

                                        LDA #$00
                                        STA ram_пули_игрока_сумма_скорости_x_младш,Y
                                        STA ram_пули_игрока_скорость_x_младш,Y
                                        STA ram_пули_игрока_сумма_скорости_y_младш,Y
                                        STA ram_пули_игрока_скорость_y_младш,Y
                                        STA ram_пули_игрока_счетчики_движения,Y

                                        LDA ram_пули_игрока_характеристики_прокачки,X   ; главной пули
                                        ORA #$10    ; бит игнорировая стен
                                        STA ram_пули_игрока_характеристики_прокачки,Y   ; новой пули

                                        AND #$0F
                                        TAX
                                        LDA tbl_8E6A_fire_ball_индексы,X
                                        CLC
                                        ADC ram_000C    ; номер пули обработчика
                                        TAX
                                        LDA tbl_8E6B_fire_ball,X
                                        STA ram_пули_игрока_счетчики_анимации,Y ; новой пули
                                        LDX ram_000D    ; индекс главной пули
                                        RTS


sub_928C_Y_X_старш:
C - - - - - 0x00129C 00:928C: BD 78 05  LDA ram_позиция_y_спрайта,X
C - - - - - 0x00129F 00:928F: 38        SEC
C - - - - - 0x0012A0 00:9290: E5 72     SBC ram_cam_spd_Y
C - - - - - 0x0012A2 00:9292: 9D 78 05  STA ram_позиция_y_спрайта,X
                                        LDA ram_позиция_x_спрайта,X
                                        SEC
                                        SBC ram_cam_spd_X
                                        STA ram_позиция_x_спрайта,X
C - - - - - 0x0012A5 00:9295: 60        RTS



sub_9367_отнять_y:
                                        CLC 
                                        BMI bra_9367_прибавить_y
                                        ADC ram_пули_игрока_скорость_y_младш,X
                                        STA ram_пули_игрока_скорость_y_младш,X
                                        LDA ram_пули_игрока_скорость_y_старш,X
                                        ADC #$00
                                        STA ram_пули_игрока_скорость_y_старш,X
                                        RTS                                        
bra_9367_прибавить_y:
                                        ADC ram_пули_игрока_скорость_y_младш,X
                                        STA ram_пули_игрока_скорость_y_младш,X
                                        LDA ram_пули_игрока_скорость_y_старш,X
                                        SBC #$00
                                        STA ram_пули_игрока_скорость_y_старш,X
                                        RTS 
sub_9368_отнять_x:
                                        CLC
                                        BMI bra_9368_прибавить_x
                                        ADC ram_пули_игрока_скорость_x_младш,X
                                        STA ram_пули_игрока_скорость_x_младш,X
                                        LDA ram_пули_игрока_скорость_x_старш,X
                                        ADC #$00
                                        STA ram_пули_игрока_скорость_x_старш,X
                                        RTS                                        
                                        
bra_9368_прибавить_x:
                                        ADC ram_пули_игрока_скорость_x_младш,X
                                        STA ram_пули_игрока_скорость_x_младш,X
                                        LDA ram_пули_игрока_скорость_x_старш,X
                                        SBC #$00
                                        STA ram_пули_игрока_скорость_x_старш,X
                                        RTS 








bra_933A:
                                        RTS
sub_933B:
; triggers during area 4 boss attacking
; 1путин опт
                                        LDA ram_index_ppu_buffer
                                        CMP #$40
                                        BCS bra_933A
C - - - - - 0x00134B 00:933B: BD 88 05  LDA ram_позиция_x_спрайта,X
C - - - - - 0x00134E 00:933E: 4A        LSR
C - - - - - 0x00134F 00:933F: 4A        LSR
C - - - - - 0x001350 00:9340: 4A        LSR
C - - - - - 0x001351 00:9341: 85 00     STA ram_0000
C - - - - - 0x001353 00:9343: A9 08     LDA #$08
C - - - - - 0x001355 00:9345: 85 01     STA ram_0001
C - - - - - 0x001357 00:9347: BD 78 05  LDA ram_позиция_y_спрайта,X
C - - - - - 0x00135A 00:934A: 18        CLC
C - - - - - 0x00135B 00:934B: 69 FC     ADC #$FC
C - - - - - 0x00135D 00:934D: 18        CLC
C - - - - - 0x00135E 00:934E: 65 FC     ADC ram_scroll_Y
C - - - - - 0x001360 00:9350: B0 04     BCS bra_9356
C - - - - - 0x001362 00:9352: C9 F0     CMP #$F0
C - - - - - 0x001364 00:9354: 90 02     BCC bra_9358
bra_9356:
C - - - - - 0x001366 00:9356: 69 0F     ADC #$0F
bra_9358:
C - - - - - 0x001368 00:9358: 29 F0     AND #$F0
C - - - - - 0x00136A 00:935A: 0A        ASL
C - - - - - 0x00136B 00:935B: 26 01     ROL ram_0001
C - - - - - 0x00136D 00:935D: 0A        ASL
C - - - - - 0x00136E 00:935E: 26 01     ROL ram_0001
C - - - - - 0x001370 00:9360: 05 00     ORA ram_0000
C - - - - - 0x001372 00:9362: 29 FE     AND #$FE
C - - - - - 0x001374 00:9364: 85 00     STA ram_0000
C - - - - - 0x001376 00:9366: 86 10     STX ram_0010
C - - - - - 0x001378 00:9368: A6 1E     LDX ram_index_ppu_buffer
; if buffer is not too loaded
C - - - - - 0x00137E 00:936E: A9 06     LDA #con_buf_mode_06
C - - - - - 0x001380 00:9370: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x001383 00:9373: E8        INX
C - - - - - 0x001384 00:9374: A5 04     LDA ram_0004
C - - - - - 0x001386 00:9376: 49 80     EOR #$80
C - - - - - 0x001388 00:9378: A8        TAY
C - - - - - 0x001389 00:9379: 20 1B BB  JSR sub_0x007B2B
C - - - - - 0x00138C 00:937C: 0A        ASL
C - - - - - 0x00138D 00:937D: 0A        ASL
C - - - - - 0x00138E 00:937E: A8        TAY
C - - - - - 0x00138F 00:937F: A9 02     LDA #$02
C - - - - - 0x001391 00:9381: 85 02     STA ram_0002
bra_9383_loop:
C - - - - - 0x001393 00:9383: A5 01     LDA ram_0001    ; ppu hi
C - - - - - 0x001395 00:9385: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x001398 00:9388: E8        INX
C - - - - - 0x001399 00:9389: A5 00     LDA ram_0000    ; ppu lo
C - - - - - 0x00139B 00:938B: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x00139E 00:938E: E8        INX
C - - - - - 0x00139F 00:938F: A9 02     LDA #$02    ; counter
C - - - - - 0x0013A1 00:9391: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0013A4 00:9394: E8        INX
C - - - - - 0x0013A5 00:9395: B9 BA 93  LDA tbl_93BE - $04,Y
C - - - - - 0x0013A8 00:9398: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0013AB 00:939B: C8        INY
C - - - - - 0x0013AC 00:939C: E8        INX
C - - - - - 0x0013AD 00:939D: B9 BA 93  LDA tbl_93BE - $04,Y
C - - - - - 0x0013B0 00:93A0: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0013B3 00:93A3: C8        INY
C - - - - - 0x0013B4 00:93A4: E8        INX
C - - - - - 0x0013B5 00:93A5: A5 00     LDA ram_0000
C - - - - - 0x0013B7 00:93A7: 18        CLC
C - - - - - 0x0013B8 00:93A8: 69 20     ADC #$20
C - - - - - 0x0013BA 00:93AA: 85 00     STA ram_0000
C - - - - - 0x0013BC 00:93AC: C6 02     DEC ram_0002
C - - - - - 0x0013BE 00:93AE: D0 D3     BNE bra_9383_loop
; close buffer
C - - - - - 0x0013C0 00:93B0: A9 FF     LDA #$FF
C - - - - - 0x0013C2 00:93B2: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0013C5 00:93B5: E8        INX
C - - - - - 0x0013C6 00:93B6: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x0013C8 00:93B8: 20 CA 93  JSR sub_93CA
C - - - - - 0x0013CB 00:93BB: A6 10     LDX ram_0010
C - - - - - 0x0013CD 00:93BD: 60        RTS



tbl_93BE:
; 01 
- D 0 - - - 0x0013CE 00:93BE: 00        .byte $00, $00   ; 
- D 0 - - - 0x0013D0 00:93C0: 00        .byte $00, $00   ; 
; 02 
- D 0 - - - 0x0013D2 00:93C2: 6E        .byte $6E, $6F   ; 
- D 0 - - - 0x0013D4 00:93C4: 70        .byte $70, $71   ; 
; 03 
- D 0 - - - 0x0013D6 00:93C6: 6A        .byte $6A, $6B   ; 
- D 0 - - - 0x0013D8 00:93C8: 6C        .byte $6C, $6D   ; 



sub_93CA:
C - - - - - 0x0013DA 00:93CA: A5 04     LDA ram_0004
C - - - - - 0x0013DC 00:93CC: 49 80     EOR #$80
C - - - - - 0x0013DE 00:93CE: AA        TAX
C - - - - - 0x0013DF 00:93CF: A5 03     LDA ram_0003
C - - - - - 0x0013E1 00:93D1: 29 01     AND #$01
C - - - - - 0x0013E3 00:93D3: A8        TAY
C - - - - - 0x0013E4 00:93D4: BD 00 04  LDA ram_0400,X
C - - - - - 0x0013E7 00:93D7: 38        SEC
C - - - - - 0x0013E8 00:93D8: F9 F8 93  SBC tbl_93F8,Y
C - - - - - 0x0013EB 00:93DB: 9D 00 04  STA ram_0400,X
C - - - - - 0x0013EE 00:93DE: 39 FA 93  AND tbl_93FA,Y
C - - - - - 0x0013F1 00:93E1: D0 14     BNE bra_93F7_RTS
C - - - - - 0x0013F3 00:93E3: BD 00 04  LDA ram_0400,X
C - - - - - 0x0013F6 00:93E6: 19 FE 93  ORA tbl_93FE,Y
C - - - - - 0x0013F9 00:93E9: 9D 00 04  STA ram_0400,X
C - - - - - 0x0013FC 00:93EC: A6 04     LDX ram_0004
C - - - - - 0x0013FE 00:93EE: BD 00 04  LDA ram_0400,X
C - - - - - 0x001401 00:93F1: 39 FC 93  AND tbl_93FC,Y
C - - - - - 0x001404 00:93F4: 9D 00 04  STA ram_0400,X
bra_93F7_RTS:
C - - - - - 0x001407 00:93F7: 60        RTS



tbl_93F8:
- D 0 - - - 0x001408 00:93F8: 10        .byte $10   ; 00 
- D 0 - - - 0x001409 00:93F9: 01        .byte $01   ; 01 



tbl_93FA:
- D 0 - - - 0x00140A 00:93FA: F0        .byte $F0   ; 00 
- D 0 - - - 0x00140B 00:93FB: 0F        .byte $0F   ; 01 



tbl_93FC:
- D 0 - - - 0x00140C 00:93FC: 0F        .byte $0F   ; 00 
- D 0 - - - 0x00140D 00:93FD: F0        .byte $F0   ; 01 



tbl_93FE:
- D 0 - - - 0x00140E 00:93FE: 30        .byte $30   ; 00 
- D 0 - - - 0x00140F 00:93FF: 03        .byte $03   ; 01 


_off004_0x002B55_01_area_2:
- D 1 - I - 0x002B55 00:AB45: 02        .byte $02   ; столбцы
- D 1 - I - 0x002B56 00:AB46: 0D        .byte $0D   ; строки

;                                              00   01
- D 1 - I - 0x002B57 00:AB47: 0D        .byte $0D, $00   ; 00 
- D 1 - I - 0x002B59 00:AB49: 0C        .byte $0C, $0E   ; 01 
- D 1 - I - 0x002B5B 00:AB4B: 0B        .byte $0B, $00   ; 02 
- D 1 - I - 0x002B5D 00:AB4D: 0A        .byte $0A, $00   ; 03 
- D 1 - I - 0x002B5F 00:AB4F: 09        .byte $09, $00   ; 04 
- D 1 - I - 0x002B61 00:AB51: 08        .byte $08, $00   ; 05 
- D 1 - I - 0x002B63 00:AB53: 07        .byte $07, $00   ; 06 
- D 1 - I - 0x002B65 00:AB55: 06        .byte $06, $00   ; 07 
- D 1 - I - 0x002B67 00:AB57: 05        .byte $05, $00   ; 08 
- D 1 - I - 0x002B69 00:AB59: 04        .byte $04, $00   ; 09 
- D 1 - I - 0x002B6B 00:AB5B: 03        .byte $03, $00   ; 0A 
- D 1 - I - 0x002B6D 00:AB5D: 02        .byte $02, $00   ; 0B 
- D 1 - I - 0x002B6F 00:AB5F: 01        .byte $01, $0F   ; 0C 



_off005_0x002B71_01_area_2:
- D 1 - I - 0x002B71 00:AB61: 7F AB     .word _off018_01_AB7F_00
- D 1 - I - 0x002B73 00:AB63: BF AB     .word _off018_01_ABBF_01
- D 1 - I - 0x002B75 00:AB65: FF AB     .word _off018_01_ABFF_02
- D 1 - I - 0x002B77 00:AB67: 3F AC     .word _off018_01_AC3F_03
- D 1 - I - 0x002B79 00:AB69: 7F AC     .word _off018_01_AC7F_04
- D 1 - I - 0x002B7B 00:AB6B: BF AC     .word _off018_01_ACBF_05
- D 1 - I - 0x002B7D 00:AB6D: FF AC     .word _off018_01_ACFF_06
- D 1 - I - 0x002B7F 00:AB6F: 3F AD     .word _off018_01_AD3F_07
- D 1 - I - 0x002B81 00:AB71: 7F AD     .word _off018_01_AD7F_08
- D 1 - I - 0x002B83 00:AB73: BF AD     .word _off018_01_ADBF_09
- D 1 - I - 0x002B85 00:AB75: FF AD     .word _off018_01_ADFF_0A
- D 1 - I - 0x002B87 00:AB77: 3F AE     .word _off018_01_AE3F_0B
- D 1 - I - 0x002B89 00:AB79: 7F AE     .word _off018_01_AE7F_0C
- D 1 - I - 0x002B8B 00:AB7B: BF AE     .word _off018_01_AEBF_0D
- D 1 - I - 0x002B8D 00:AB7D: FF AE     .word _off018_01_AEFF_0E



_off018_01_AB7F_00:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002B8F 00:AB7F: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 00 
- - - - - - 0x002B97 00:AB87: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 01 
- - - - - - 0x002B9F 00:AB8F: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 02 
- - - - - - 0x002BA7 00:AB97: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 03 
- D 1 - I - 0x002BAF 00:AB9F: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 04 
- D 1 - I - 0x002BB7 00:ABA7: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 05 
- D 1 - I - 0x002BBF 00:ABAF: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 06 
- D 1 - I - 0x002BC7 00:ABB7: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 07 



_off018_01_ABBF_01:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002BCF 00:ABBF: 01        .byte $01, $01, $02, $1F, $10, $11, $12, $12   ; 00 
- D 1 - I - 0x002BD7 00:ABC7: 02        .byte $02, $01, $01, $1F, $14, $15, $16, $0B   ; 01 
- D 1 - I - 0x002BDF 00:ABCF: 01        .byte $01, $01, $01, $1F, $18, $19, $1A, $08   ; 02 
- D 1 - I - 0x002BE7 00:ABD7: 01        .byte $01, $01, $02, $1F, $1C, $1D, $1E, $0F   ; 03 
- D 1 - I - 0x002BEF 00:ABDF: 0C        .byte $0C, $01, $01, $01, $06, $07, $07, $00   ; 04 
- D 1 - I - 0x002BF7 00:ABE7: 04        .byte $04, $05, $01, $02, $01, $06, $07, $00   ; 05 
- D 1 - I - 0x002BFF 00:ABEF: 08        .byte $08, $09, $0A, $01, $01, $02, $06, $03   ; 06 
- D 1 - I - 0x002C07 00:ABF7: 08        .byte $08, $0D, $0E, $01, $01, $01, $01, $06   ; 07 



_off018_01_ABFF_02:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002C0F 00:ABFF: 31        .byte $31, $32, $30, $30, $30, $30, $30, $23   ; 00 
- D 1 - I - 0x002C17 00:AC07: 20        .byte $20, $21, $22, $22, $22, $36, $3E, $33   ; 01 
- D 1 - I - 0x002C1F 00:AC0F: 24        .byte $24, $25, $26, $27, $34, $35, $3E, $30   ; 02 
- D 1 - I - 0x002C27 00:AC17: 28        .byte $28, $29, $2A, $2B, $38, $39, $30, $23   ; 03 
- D 1 - I - 0x002C2F 00:AC1F: 2C        .byte $2C, $28, $2E, $2F, $3C, $3D, $37, $33   ; 04 
- D 1 - I - 0x002C37 00:AC27: 13        .byte $13, $17, $1B, $3A, $3A, $3A, $3B, $37   ; 05 
- D 1 - I - 0x002C3F 00:AC2F: 3A        .byte $3A, $3A, $3A, $3A, $3A, $3A, $3A, $3B   ; 06 
- D 1 - I - 0x002C47 00:AC37: 30        .byte $30, $30, $30, $30, $22, $22, $22, $22   ; 07 



_off018_01_AC3F_03:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002C4F 00:AC3F: 3F        .byte $3F, $3F, $3F, $3F, $3F, $3F, $3F, $3F   ; 00 
- D 1 - I - 0x002C57 00:AC47: 01        .byte $01, $01, $01, $01, $01, $01, $01, $01   ; 01 
- D 1 - I - 0x002C5F 00:AC4F: 01        .byte $01, $01, $01, $01, $01, $01, $01, $01   ; 02 
- D 1 - I - 0x002C67 00:AC57: 01        .byte $01, $01, $01, $01, $01, $01, $01, $01   ; 03 
- D 1 - I - 0x002C6F 00:AC5F: 01        .byte $01, $01, $01, $01, $01, $01, $01, $01   ; 04 
- D 1 - I - 0x002C77 00:AC67: 01        .byte $01, $01, $01, $01, $01, $01, $01, $01   ; 05 
- D 1 - I - 0x002C7F 00:AC6F: 01        .byte $01, $01, $01, $01, $01, $01, $01, $01   ; 06 
- D 1 - I - 0x002C87 00:AC77: 01        .byte $01, $01, $01, $01, $01, $01, $01, $01   ; 07 



_off018_01_AC7F_04:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002C8F 00:AC7F: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 00 
- D 1 - I - 0x002C97 00:AC87: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 01 
- D 1 - I - 0x002C9F 00:AC8F: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 02 
- D 1 - I - 0x002CA7 00:AC97: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 03 
- D 1 - I - 0x002CAF 00:AC9F: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 04 
- D 1 - I - 0x002CB7 00:ACA7: 40        .byte $40, $40, $41, $42, $43, $44, $40, $40   ; 05 
- D 1 - I - 0x002CBF 00:ACAF: 40        .byte $40, $40, $45, $46, $47, $48, $40, $40   ; 06 
- D 1 - I - 0x002CC7 00:ACB7: 40        .byte $40, $40, $49, $4A, $4A, $4B, $40, $40   ; 07 



_off018_01_ACBF_05:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002CCF 00:ACBF: 5C        .byte $5C, $54, $55, $40, $40, $56, $57, $51   ; 00 
- D 1 - I - 0x002CD7 00:ACC7: 5D        .byte $5D, $58, $59, $40, $40, $5A, $5B, $52   ; 01 
- D 1 - I - 0x002CDF 00:ACCF: 4C        .byte $4C, $4D, $4E, $4F, $40, $5E, $5F, $4C   ; 02 
- D 1 - I - 0x002CE7 00:ACD7: 64        .byte $64, $64, $64, $64, $4F, $63, $64, $64   ; 03 
- D 1 - I - 0x002CEF 00:ACDF: 64        .byte $64, $64, $64, $64, $64, $4F, $63, $64   ; 04 
- D 1 - I - 0x002CF7 00:ACE7: 41        .byte $41, $42, $43, $44, $41, $42, $43, $44   ; 05 
- D 1 - I - 0x002CFF 00:ACEF: 45        .byte $45, $46, $47, $48, $45, $46, $47, $48   ; 06 
- D 1 - I - 0x002D07 00:ACF7: 49        .byte $49, $4A, $4A, $4B, $49, $4A, $4A, $4B   ; 07 



_off018_01_ACFF_06:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002D0F 00:ACFF: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 00 
- D 1 - I - 0x002D17 00:AD07: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 01 
- D 1 - I - 0x002D1F 00:AD0F: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 02 
- D 1 - I - 0x002D27 00:AD17: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 03 
- D 1 - I - 0x002D2F 00:AD1F: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 04 
- D 1 - I - 0x002D37 00:AD27: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 05 
- D 1 - I - 0x002D3F 00:AD2F: 61        .byte $61, $60, $40, $40, $40, $40, $62, $61   ; 06 
- D 1 - I - 0x002D47 00:AD37: 6F        .byte $6F, $50, $40, $40, $40, $40, $53, $6F   ; 07 



_off018_01_AD3F_07:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002D4F 00:AD3F: 40        .byte $40, $40, $90, $91, $6B, $6F, $6F, $6F   ; 00 
- D 1 - I - 0x002D57 00:AD47: 40        .byte $40, $40, $94, $95, $78, $79, $80, $79   ; 01 
- D 1 - I - 0x002D5F 00:AD4F: 40        .byte $40, $40, $40, $40, $7C, $7D, $81, $82   ; 02 
- D 1 - I - 0x002D67 00:AD57: 40        .byte $40, $40, $40, $40, $7E, $7F, $4C, $5F   ; 03 
- D 1 - I - 0x002D6F 00:AD5F: 90        .byte $90, $91, $40, $40, $63, $64, $64, $64   ; 04 
- D 1 - I - 0x002D77 00:AD67: 94        .byte $94, $95, $40, $40, $40, $63, $64, $64   ; 05 
- D 1 - I - 0x002D7F 00:AD6F: 40        .byte $40, $40, $40, $40, $40, $40, $63, $64   ; 06 
- D 1 - I - 0x002D87 00:AD77: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 07 



_off018_01_AD7F_08:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002D8F 00:AD7F: 5C        .byte $5C, $54, $55, $40, $40, $56, $57, $51   ; 00 
- D 1 - I - 0x002D97 00:AD87: 5D        .byte $5D, $58, $59, $40, $40, $5A, $5B, $52   ; 01 
- D 1 - I - 0x002D9F 00:AD8F: 4C        .byte $4C, $4D, $4E, $4F, $40, $5E, $5F, $4C   ; 02 
- D 1 - I - 0x002DA7 00:AD97: 64        .byte $64, $64, $64, $64, $4F, $63, $64, $64   ; 03 
- D 1 - I - 0x002DAF 00:AD9F: 64        .byte $64, $64, $64, $64, $64, $4F, $63, $64   ; 04 
- D 1 - I - 0x002DB7 00:ADA7: 40        .byte $40, $40, $40, $40, $70, $71, $71, $71   ; 05 
- D 1 - I - 0x002DBF 00:ADAF: 40        .byte $40, $40, $40, $40, $6E, $6F, $6F, $6F   ; 06 
- D 1 - I - 0x002DC7 00:ADB7: 40        .byte $40, $40, $40, $40, $70, $71, $71, $71   ; 07 



_off018_01_ADBF_09:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002DCF 00:ADBF: A4        .byte $A4, $A4, $72, $C7, $C7, $73, $A4, $A4   ; 00 
- D 1 - I - 0x002DD7 00:ADC7: A4        .byte $A4, $A4, $A4, $72, $73, $A4, $A4, $A4   ; 01 
- D 1 - I - 0x002DDF 00:ADCF: A4        .byte $A4, $A4, $A4, $72, $73, $A4, $A4, $A4   ; 02 
- D 1 - I - 0x002DE7 00:ADD7: A4        .byte $A4, $A4, $A4, $72, $73, $A4, $A4, $A4   ; 03 
- D 1 - I - 0x002DEF 00:ADDF: A4        .byte $A4, $A4, $A4, $72, $73, $A4, $A4, $A4   ; 04 
- D 1 - I - 0x002DF7 00:ADE7: 40        .byte $40, $40, $40, $40, $40, $40, $40, $40   ; 05 
- D 1 - I - 0x002DFF 00:ADEF: 61        .byte $61, $60, $40, $40, $40, $40, $62, $61   ; 06 
- D 1 - I - 0x002E07 00:ADF7: 6F        .byte $6F, $50, $40, $40, $40, $40, $53, $6F   ; 07 



_off018_01_ADFF_0A:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002E0F 00:ADFF: 90        .byte $90, $91, $40, $40, $40, $40, $90, $91   ; 00 
- D 1 - I - 0x002E17 00:AE07: 94        .byte $94, $95, $40, $84, $85, $40, $94, $95   ; 01 
- D 1 - I - 0x002E1F 00:AE0F: 76        .byte $76, $76, $76, $74, $75, $83, $77, $77   ; 02 
- D 1 - I - 0x002E27 00:AE17: 7A        .byte $7A, $7A, $7A, $74, $75, $AB, $7B, $7B   ; 03 
- D 1 - I - 0x002E2F 00:AE1F: A4        .byte $A4, $A4, $A4, $74, $75, $A4, $A4, $A4   ; 04 
- D 1 - I - 0x002E37 00:AE27: A4        .byte $A4, $A4, $9C, $9D, $9E, $9F, $A4, $A4   ; 05 
- D 1 - I - 0x002E3F 00:AE2F: A4        .byte $A4, $A4, $99, $9B, $9B, $9A, $A4, $A4   ; 06 
- D 1 - I - 0x002E47 00:AE37: A4        .byte $A4, $A4, $99, $9B, $9B, $75, $A4, $A4   ; 07 



_off018_01_AE3F_0B:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002E4F 00:AE3F: 86        .byte $86, $87, $88, $89, $AC, $AD, $AE, $86   ; 00 
- D 1 - I - 0x002E57 00:AE47: 8A        .byte $8A, $8B, $8C, $8D, $AF, $B0, $B1, $B2   ; 01 
- D 1 - I - 0x002E5F 00:AE4F: 8E        .byte $8E, $8F, $A0, $C1, $C2, $B3, $B4, $B5   ; 02 
- D 1 - I - 0x002E67 00:AE57: 8E        .byte $8E, $A1, $A2, $64, $64, $B6, $B7, $AE   ; 03 
- D 1 - I - 0x002E6F 00:AE5F: A3        .byte $A3, $A1, $A2, $64, $40, $B8, $B9, $BA   ; 04 
- D 1 - I - 0x002E77 00:AE67: A5        .byte $A5, $A6, $A2, $64, $40, $B8, $BB, $BC   ; 05 
- D 1 - I - 0x002E7F 00:AE6F: A7        .byte $A7, $A7, $A8, $64, $40, $BD, $BE, $BF   ; 06 
- D 1 - I - 0x002E87 00:AE77: A9        .byte $A9, $A9, $AA, $64, $40, $C0, $A9, $A9   ; 07 



_off018_01_AE7F_0C:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002E8F 00:AE7F: D2        .byte $D2, $D2, $D3, $40, $40, $D1, $D2, $D2   ; 00 
- D 1 - I - 0x002E97 00:AE87: D0        .byte $D0, $D0, $F0, $E2, $E3, $F1, $D0, $D0   ; 01 
- D 1 - I - 0x002E9F 00:AE8F: D0        .byte $D0, $D0, $E4, $E5, $E6, $E7, $D0, $D0   ; 02 
- D 1 - I - 0x002EA7 00:AE97: D0        .byte $D0, $D0, $E8, $E9, $EA, $EB, $D0, $D0   ; 03 
- D 1 - I - 0x002EAF 00:AE9F: D0        .byte $D0, $D0, $EC, $ED, $EE, $EF, $D0, $D0   ; 04 
- D 1 - I - 0x002EB7 00:AEA7: D0        .byte $D0, $D0, $D0, $D0, $D0, $D0, $D0, $D0   ; 05 
- D 1 - I - 0x002EBF 00:AEAF: CA        .byte $CA, $C8, $D5, $CE, $CE, $CE, $C9, $CA   ; 06 
- D 1 - I - 0x002EC7 00:AEB7: 86        .byte $86, $CC, $CB, $64, $64, $CF, $CD, $86   ; 07 



_off018_01_AEBF_0D:
;                                              00   01   02   03   04   05   06   07
- - - - - - 0x002ECF 00:AEBF: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 00 
- - - - - - 0x002ED7 00:AEC7: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 01 
- - - - - - 0x002EDF 00:AECF: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00   ; 02 
- - - - - - 0x002EE7 00:AED7: 86        .byte $86, $86, $86, $86, $86, $86, $86, $86   ; 03 
- D 1 - I - 0x002EEF 00:AEDF: 86        .byte $86, $86, $86, $86, $86, $86, $86, $86   ; 04 
- D 1 - I - 0x002EF7 00:AEE7: 86        .byte $86, $D8, $D9, $D6, $D6, $DA, $DB, $86   ; 05 
- D 1 - I - 0x002EFF 00:AEEF: D7        .byte $D7, $DC, $DD, $00, $00, $DE, $DF, $D7   ; 06 
- D 1 - I - 0x002F07 00:AEF7: D2        .byte $D2, $D2, $E0, $64, $64, $E1, $D2, $D2   ; 07 



_off018_01_AEFF_0E:
;                                              00   01   02   03   04   05   06   07
- D 1 - I - 0x002F0F 00:AEFF: D0        .byte $D0, $D0, $D0, $D0, $D0, $D0, $D0, $D0   ; 00 
- D 1 - I - 0x002F17 00:AF07: D0        .byte $D0, $D0, $F0, $E2, $E3, $F1, $D0, $D0   ; 01 
- D 1 - I - 0x002F1F 00:AF0F: D0        .byte $D0, $D0, $E4, $E5, $E6, $E7, $D0, $D0   ; 02 
- D 1 - I - 0x002F27 00:AF17: D0        .byte $D0, $D0, $E8, $E9, $EA, $EB, $D0, $D0   ; 03 
- D 1 - I - 0x002F2F 00:AF1F: D0        .byte $D0, $D0, $EC, $ED, $EE, $EF, $D0, $D0   ; 04 
- D 1 - I - 0x002F37 00:AF27: D0        .byte $D0, $D0, $D0, $D0, $D0, $D0, $D0, $D0   ; 05 
- D 1 - I - 0x002F3F 00:AF2F: D0        .byte $D0, $D0, $D0, $D0, $D0, $D0, $D0, $D0   ; 06 
- D 1 - I - 0x002F47 00:AF37: D0        .byte $D0, $D0, $D0, $D0, $D0, $D0, $D0, $D0   ; 07 



_off006_0x002F4F_01_area_2:
; 00 
- D 1 - I - 0x002F4F 00:AF3F: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x002F53 00:AF43: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x002F57 00:AF47: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x002F5B 00:AF4B: 00        .byte $00, $00, $00, $00   ; 
; 01 
- D 1 - I - 0x002F5F 00:AF4F: 05        .byte $05, $06, $06, $5D   ; 
- D 1 - I - 0x002F63 00:AF53: 07        .byte $07, $08, $5E, $5F   ; 
- D 1 - I - 0x002F67 00:AF57: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x002F6B 00:AF5B: 60        .byte $60, $65, $65, $55   ; 
; 02 
- D 1 - I - 0x002F6F 00:AF5F: 05        .byte $05, $66, $14, $5D   ; 
- D 1 - I - 0x002F73 00:AF63: 67        .byte $67, $68, $69, $6A   ; 
- D 1 - I - 0x002F77 00:AF67: 15        .byte $15, $6B, $16, $6C   ; 
- D 1 - I - 0x002F7B 00:AF6B: 60        .byte $60, $6D, $6E, $55   ; 
; 03 
- D 1 - I - 0x002F7F 00:AF6F: 0F        .byte $0F, $18, $00, $00   ; 
- D 1 - I - 0x002F83 00:AF73: 10        .byte $10, $00, $00, $00   ; 
- D 1 - I - 0x002F87 00:AF77: 10        .byte $10, $00, $00, $00   ; 
- D 1 - I - 0x002F8B 00:AF7B: 71        .byte $71, $00, $00, $00   ; 
; 04 
- D 1 - I - 0x002F8F 00:AF7F: 79        .byte $79, $82, $3F, $00   ; 
- D 1 - I - 0x002F93 00:AF83: 83        .byte $83, $83, $37, $82   ; 
- D 1 - I - 0x002F97 00:AF87: 40        .byte $40, $40, $49, $37   ; 
- D 1 - I - 0x002F9B 00:AF8B: 40        .byte $40, $40, $40, $49   ; 
; 05 
- D 1 - I - 0x002F9F 00:AF8F: 0F        .byte $0F, $12, $12, $5D   ; 
- D 1 - I - 0x002FA3 00:AF93: 00        .byte $00, $11, $5E, $5F   ; 
- D 1 - I - 0x002FA7 00:AF97: 00        .byte $00, $00, $11, $5F   ; 
- D 1 - I - 0x002FAB 00:AF9B: 82        .byte $82, $00, $00, $55   ; 
; 06 
- D 1 - I - 0x002FAF 00:AF9F: 17        .byte $17, $18, $18, $00   ; 
- D 1 - I - 0x002FB3 00:AFA3: 07        .byte $07, $19, $00, $00   ; 
- D 1 - I - 0x002FB7 00:AFA7: 07        .byte $07, $5E, $19, $00   ; 
- D 1 - I - 0x002FBB 00:AFAB: 60        .byte $60, $65, $65, $6F   ; 
; 07 
- D 1 - I - 0x002FBF 00:AFAF: 0F        .byte $0F, $18, $18, $00   ; 
- D 1 - I - 0x002FC3 00:AFB3: 10        .byte $10, $00, $00, $00   ; 
- D 1 - I - 0x002FC7 00:AFB7: 10        .byte $10, $00, $00, $00   ; 
- D 1 - I - 0x002FCB 00:AFBB: 71        .byte $71, $00, $00, $00   ; 
; 08 
- D 1 - I - 0x002FCF 00:AFBF: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x002FD3 00:AFC3: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x002FD7 00:AFC7: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x002FDB 00:AFCB: 40        .byte $40, $40, $40, $40   ; 
; 09 
- D 1 - I - 0x002FDF 00:AFCF: 49        .byte $49, $00, $00, $55   ; 
- D 1 - I - 0x002FE3 00:AFD3: 4A        .byte $4A, $82, $00, $00   ; 
- D 1 - I - 0x002FE7 00:AFD7: 4A        .byte $4A, $37, $00, $00   ; 
- D 1 - I - 0x002FEB 00:AFDB: 40        .byte $40, $37, $82, $00   ; 
; 0A 
- D 1 - I - 0x002FEF 00:AFDF: 0F        .byte $0F, $06, $06, $5D   ; 
- D 1 - I - 0x002FF3 00:AFE3: 11        .byte $11, $08, $5E, $5F   ; 
- D 1 - I - 0x002FF7 00:AFE7: 00        .byte $00, $5E, $08, $5F   ; 
- D 1 - I - 0x002FFB 00:AFEB: 00        .byte $00, $11, $65, $55   ; 
; 0B 
- D 1 - I - 0x002FFF 00:AFEF: 50        .byte $50, $50, $50, $50   ; 
- D 1 - I - 0x003003 00:AFF3: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003007 00:AFF7: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x00300B 00:AFFB: E4        .byte $E4, $40, $40, $40   ; 
; 0C 
- D 1 - I - 0x00300F 00:AFFF: 05        .byte $05, $06, $06, $5D   ; 
- D 1 - I - 0x003013 00:B003: 07        .byte $07, $08, $5E, $5F   ; 
- D 1 - I - 0x003017 00:B007: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x00301B 00:B00B: 55        .byte $55, $55, $65, $55   ; 
; 0D 
- D 1 - I - 0x00301F 00:B00F: 40        .byte $40, $49, $79, $00   ; 
- D 1 - I - 0x003023 00:B013: 40        .byte $40, $40, $37, $00   ; 
- - - - - - 0x003027 00:B017: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x00302B 00:B01B: 00        .byte $00, $00, $00, $00   ; 
; 0E 
- D 1 - I - 0x00302F 00:B01F: 00        .byte $00, $00, $06, $5D   ; 
- D 1 - I - 0x003033 00:B023: 00        .byte $00, $00, $5E, $5F   ; 
- - - - - - 0x003037 00:B027: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x00303B 00:B02B: 00        .byte $00, $00, $00, $00   ; 
; 0F 
- D 1 - I - 0x00303F 00:B02F: 4F        .byte $4F, $E4, $40, $40   ; 
- D 1 - I - 0x003043 00:B033: 4D        .byte $4D, $4F, $40, $40   ; 
- D 1 - I - 0x003047 00:B037: 35        .byte $35, $4E, $4C, $4C   ; 
- D 1 - I - 0x00304B 00:B03B: 00        .byte $00, $00, $35, $4E   ; 
; 10 
- D 1 - I - 0x00304F 00:B03F: 4D        .byte $4D, $E5, $33, $E5   ; 
- D 1 - I - 0x003053 00:B043: 36        .byte $36, $40, $40, $40   ; 
- D 1 - I - 0x003057 00:B047: 36        .byte $36, $40, $40, $40   ; 
- D 1 - I - 0x00305B 00:B04B: 34        .byte $34, $4C, $40, $40   ; 
; 11 
- D 1 - I - 0x00305F 00:B04F: 33        .byte $33, $E5, $33, $E5   ; 
- D 1 - I - 0x003063 00:B053: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003067 00:B057: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x00306B 00:B05B: 4C        .byte $4C, $E4, $40, $40   ; 
; 12 
- D 1 - I - 0x00306F 00:B05F: 33        .byte $33, $E5, $33, $E5   ; 
- D 1 - I - 0x003073 00:B063: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003077 00:B067: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x00307B 00:B06B: 4C        .byte $4C, $40, $40, $40   ; 
; 13 
- D 1 - I - 0x00307F 00:B06F: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003083 00:B073: EB        .byte $EB, $EB, $EB, $EB   ; 
- D 1 - I - 0x003087 00:B077: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x00308B 00:B07B: 00        .byte $00, $00, $00, $00   ; 
; 14 
- D 1 - I - 0x00308F 00:B07F: 34        .byte $34, $E7, $37, $E7   ; 
- D 1 - I - 0x003093 00:B083: E8        .byte $E8, $35, $E6, $E6   ; 
- D 1 - I - 0x003097 00:B087: 3A        .byte $3A, $38, $39, $39   ; 
- D 1 - I - 0x00309B 00:B08B: 3A        .byte $3A, $41, $41, $41   ; 
; 15 
- D 1 - I - 0x00309F 00:B08F: 37        .byte $37, $E7, $37, $E7   ; 
- D 1 - I - 0x0030A3 00:B093: 35        .byte $35, $35, $E6, $35   ; 
- D 1 - I - 0x0030A7 00:B097: 38        .byte $38, $39, $39, $38   ; 
- D 1 - I - 0x0030AB 00:B09B: 41        .byte $41, $41, $41, $41   ; 
; 16 
- D 1 - I - 0x0030AF 00:B09F: 37        .byte $37, $7B, $50, $50   ; 
- D 1 - I - 0x0030B3 00:B0A3: 4E        .byte $4E, $4E, $40, $40   ; 
- D 1 - I - 0x0030B7 00:B0A7: 3F        .byte $3F, $7A, $40, $40   ; 
- D 1 - I - 0x0030BB 00:B0AB: 7E        .byte $7E, $35, $4F, $E4   ; 
; 17 
- D 1 - I - 0x0030BF 00:B0AF: 41        .byte $41, $41, $47, $EF   ; 
- D 1 - I - 0x0030C3 00:B0B3: EB        .byte $EB, $EB, $EB, $D6   ; 
- D 1 - I - 0x0030C7 00:B0B7: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x0030CB 00:B0BB: 00        .byte $00, $00, $00, $00   ; 
; 18 
- D 1 - I - 0x0030CF 00:B0BF: 3A        .byte $3A, $41, $41, $41   ; 
- D 1 - I - 0x0030D3 00:B0C3: 3B        .byte $3B, $41, $41, $41   ; 
- D 1 - I - 0x0030D7 00:B0C7: 3B        .byte $3B, $41, $41, $41   ; 
- D 1 - I - 0x0030DB 00:B0CB: 3B        .byte $3B, $41, $41, $41   ; 
; 19 
- D 1 - I - 0x0030DF 00:B0CF: 41        .byte $41, $41, $41, $3D   ; 
- D 1 - I - 0x0030E3 00:B0D3: 41        .byte $41, $41, $41, $E9   ; 
- D 1 - I - 0x0030E7 00:B0D7: 41        .byte $41, $41, $3D, $3E   ; 
- D 1 - I - 0x0030EB 00:B0DB: 41        .byte $41, $41, $E9, $41   ; 
; 1A 
- D 1 - I - 0x0030EF 00:B0DF: 30        .byte $30, $00, $4E, $32   ; 
- D 1 - I - 0x0030F3 00:B0E3: 81        .byte $81, $00, $7A, $4C   ; 
- D 1 - I - 0x0030F7 00:B0E7: 31        .byte $31, $00, $35, $4D   ; 
- D 1 - I - 0x0030FB 00:B0EB: 41        .byte $41, $7F, $00, $4F   ; 
; 1B 
- D 1 - I - 0x0030FF 00:B0EF: 41        .byte $41, $41, $48, $90   ; 
- D 1 - I - 0x003103 00:B0F3: EB        .byte $EB, $EB, $EB, $91   ; 
- D 1 - I - 0x003107 00:B0F7: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x00310B 00:B0FB: 00        .byte $00, $00, $00, $00   ; 
; 1C 
- D 1 - I - 0x00310F 00:B0FF: 3C        .byte $3C, $41, $41, $41   ; 
- D 1 - I - 0x003113 00:B103: 3C        .byte $3C, $41, $41, $41   ; 
- D 1 - I - 0x003117 00:B107: 3C        .byte $3C, $41, $41, $41   ; 
- D 1 - I - 0x00311B 00:B10B: EA        .byte $EA, $EB, $EB, $EB   ; 
; 1D 
- D 1 - I - 0x00311F 00:B10F: 41        .byte $41, $3D, $3E, $41   ; 
- D 1 - I - 0x003123 00:B113: 41        .byte $41, $E9, $41, $41   ; 
- D 1 - I - 0x003127 00:B117: 3D        .byte $3D, $3E, $41, $41   ; 
- D 1 - I - 0x00312B 00:B11B: EC        .byte $EC, $EB, $EB, $EB   ; 
; 1E 
- D 1 - I - 0x00312F 00:B11F: 41        .byte $41, $80, $3F, $4E   ; 
- D 1 - I - 0x003133 00:B123: 41        .byte $41, $81, $00, $35   ; 
- D 1 - I - 0x003137 00:B127: 41        .byte $41, $31, $3F, $00   ; 
- D 1 - I - 0x00313B 00:B12B: EB        .byte $EB, $EB, $7D, $00   ; 
; 1F 
- D 1 - I - 0x00313F 00:B12F: 05        .byte $05, $06, $06, $5D   ; 
- D 1 - I - 0x003143 00:B133: 07        .byte $07, $08, $5E, $55   ; 
- D 1 - I - 0x003147 00:B137: 07        .byte $07, $5E, $08, $55   ; 
- D 1 - I - 0x00314B 00:B13B: 60        .byte $60, $65, $65, $55   ; 
; 20 
- D 1 - I - 0x00314F 00:B13F: 40        .byte $40, $40, $4A, $37   ; 
- D 1 - I - 0x003153 00:B143: 40        .byte $40, $40, $40, $37   ; 
- D 1 - I - 0x003157 00:B147: 42        .byte $42, $43, $42, $43   ; 
- D 1 - I - 0x00315B 00:B14B: 40        .byte $40, $40, $40, $40   ; 
; 21 
- D 1 - I - 0x00315F 00:B14F: 00        .byte $00, $00, $08, $5F   ; 
- D 1 - I - 0x003163 00:B153: 82        .byte $82, $00, $11, $55   ; 
- D 1 - I - 0x003167 00:B157: 42        .byte $42, $ED, $4B, $43   ; 
- D 1 - I - 0x00316B 00:B15B: 40        .byte $40, $EE, $84, $40   ; 
; 22 
- D 1 - I - 0x00316F 00:B15F: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x003173 00:B163: 65        .byte $65, $65, $65, $55   ; 
- D 1 - I - 0x003177 00:B167: 43        .byte $43, $42, $43, $42   ; 
- D 1 - I - 0x00317B 00:B16B: 40        .byte $40, $40, $40, $40   ; 
; 23 
- D 1 - I - 0x00317F 00:B16F: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x003183 00:B173: 60        .byte $60, $65, $65, $55   ; 
- D 1 - I - 0x003187 00:B177: 05        .byte $05, $66, $14, $5D   ; 
- D 1 - I - 0x00318B 00:B17B: 67        .byte $67, $68, $69, $6A   ; 
; 24 
- D 1 - I - 0x00318F 00:B17F: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003193 00:B183: 40        .byte $40, $40, $4C, $E4   ; 
- D 1 - I - 0x003197 00:B187: 44        .byte $44, $45, $44, $44   ; 
- D 1 - I - 0x00319B 00:B18B: 41        .byte $41, $41, $41, $41   ; 
; 25 
- D 1 - I - 0x00319F 00:B18F: 40        .byte $40, $EE, $5C, $85   ; 
- D 1 - I - 0x0031A3 00:B193: 40        .byte $40, $EE, $D9, $84   ; 
- D 1 - I - 0x0031A7 00:B197: 44        .byte $44, $D7, $46, $5C   ; 
- D 1 - I - 0x0031AB 00:B19B: 41        .byte $41, $41, $D8, $D9   ; 
; 26 
- D 1 - I - 0x0031AF 00:B19F: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x0031B3 00:B1A3: 4C        .byte $4C, $40, $40, $40   ; 
- D 1 - I - 0x0031B7 00:B1A7: 51        .byte $51, $45, $45, $44   ; 
- D 1 - I - 0x0031BB 00:B1AB: 8A        .byte $8A, $52, $41, $41   ; 
; 27 
- D 1 - I - 0x0031BF 00:B1AF: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x0031C3 00:B1B3: 40        .byte $40, $40, $40, $4C   ; 
- D 1 - I - 0x0031C7 00:B1B7: 44        .byte $44, $45, $44, $8B   ; 
- D 1 - I - 0x0031CB 00:B1BB: 41        .byte $41, $41, $41, $8C   ; 
; 28 
- D 1 - I - 0x0031CF 00:B1BF: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x0031D3 00:B1C3: EF        .byte $EF, $41, $41, $41   ; 
- D 1 - I - 0x0031D7 00:B1C7: 47        .byte $47, $EF, $41, $41   ; 
- D 1 - I - 0x0031DB 00:B1CB: 41        .byte $41, $47, $EF, $41   ; 
; 29 
- D 1 - I - 0x0031DF 00:B1CF: 41        .byte $41, $41, $48, $46   ; 
- D 1 - I - 0x0031E3 00:B1D3: 41        .byte $41, $41, $41, $D8   ; 
- D 1 - I - 0x0031E7 00:B1D7: 41        .byte $41, $41, $41, $48   ; 
- D 1 - I - 0x0031EB 00:B1DB: 41        .byte $41, $41, $41, $41   ; 
; 2A 
- D 1 - I - 0x0031EF 00:B1DF: 53        .byte $53, $54, $52, $41   ; 
- D 1 - I - 0x0031F3 00:B1E3: D9        .byte $D9, $8A, $00, $52   ; 
- D 1 - I - 0x0031F7 00:B1E7: 46        .byte $46, $53, $54, $00   ; 
- D 1 - I - 0x0031FB 00:B1EB: D8        .byte $D8, $D9, $8A, $00   ; 
; 2B 
- D 1 - I - 0x0031FF 00:B1EF: 41        .byte $41, $41, $41, $8C   ; 
- D 1 - I - 0x003203 00:B1F3: 41        .byte $41, $41, $41, $8C   ; 
- D 1 - I - 0x003207 00:B1F7: 52        .byte $52, $41, $41, $8C   ; 
- D 1 - I - 0x00320B 00:B1FB: 00        .byte $00, $52, $41, $8C   ; 
; 2C 
- D 1 - I - 0x00320F 00:B1FF: 41        .byte $41, $41, $47, $EF   ; 
- D 1 - I - 0x003213 00:B203: 41        .byte $41, $41, $41, $47   ; 
- D 1 - I - 0x003217 00:B207: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x00321B 00:B20B: 41        .byte $41, $41, $41, $41   ; 
; 2D 
- - - - - - 0x00321F 00:B20F: 41        .byte $41, $41, $41, $41   ; 
- - - - - - 0x003223 00:B213: EF        .byte $EF, $41, $41, $41   ; 
- - - - - - 0x003227 00:B217: 47        .byte $47, $EF, $41, $41   ; 
- - - - - - 0x00322B 00:B21B: 41        .byte $41, $47, $EF, $41   ; 
; 2E 
- D 1 - I - 0x00322F 00:B21F: 48        .byte $48, $46, $53, $54   ; 
- D 1 - I - 0x003233 00:B223: 41        .byte $41, $D8, $D9, $8A   ; 
- D 1 - I - 0x003237 00:B227: 41        .byte $41, $48, $46, $8E   ; 
- D 1 - I - 0x00323B 00:B22B: 41        .byte $41, $41, $D8, $8F   ; 
; 2F 
- D 1 - I - 0x00323F 00:B22F: 3F        .byte $3F, $00, $52, $8C   ; 
- D 1 - I - 0x003243 00:B233: 00        .byte $00, $00, $00, $8D   ; 
- D 1 - I - 0x003247 00:B237: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x00324B 00:B23B: 00        .byte $00, $00, $00, $00   ; 
; 30 
- D 1 - I - 0x00324F 00:B23F: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x003253 00:B243: 60        .byte $60, $65, $65, $55   ; 
- D 1 - I - 0x003257 00:B247: 05        .byte $05, $06, $06, $5D   ; 
- D 1 - I - 0x00325B 00:B24B: 07        .byte $07, $08, $5E, $5F   ; 
; 31 
- D 1 - I - 0x00325F 00:B24F: 3F        .byte $3F, $00, $11, $5D   ; 
- D 1 - I - 0x003263 00:B253: 37        .byte $37, $82, $00, $11   ; 
- D 1 - I - 0x003267 00:B257: 40        .byte $40, $49, $79, $00   ; 
- D 1 - I - 0x00326B 00:B25B: 40        .byte $40, $40, $49, $82   ; 
; 32 
- D 1 - I - 0x00326F 00:B25F: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x003273 00:B263: 55        .byte $55, $65, $65, $55   ; 
- D 1 - I - 0x003277 00:B267: 11        .byte $11, $12, $06, $5D   ; 
- D 1 - I - 0x00327B 00:B26B: 00        .byte $00, $11, $5E, $55   ; 
; 33 
- D 1 - I - 0x00327F 00:B26F: 15        .byte $15, $6B, $16, $6C   ; 
- D 1 - I - 0x003283 00:B273: 60        .byte $60, $6D, $6E, $55   ; 
- D 1 - I - 0x003287 00:B277: 05        .byte $05, $06, $06, $5D   ; 
- D 1 - I - 0x00328B 00:B27B: 07        .byte $07, $08, $5E, $5F   ; 
; 34 
- D 1 - I - 0x00328F 00:B27F: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003293 00:B283: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003297 00:B287: 44        .byte $44, $45, $45, $45   ; 
- D 1 - I - 0x00329B 00:B28B: 41        .byte $41, $41, $41, $41   ; 
; 35 
- D 1 - I - 0x00329F 00:B28F: 40        .byte $40, $40, $40, $88   ; 
- D 1 - I - 0x0032A3 00:B293: 40        .byte $40, $40, $86, $89   ; 
- D 1 - I - 0x0032A7 00:B297: 44        .byte $44, $45, $57, $72   ; 
- D 1 - I - 0x0032AB 00:B29B: 41        .byte $41, $41, $73, $75   ; 
; 36 
- D 1 - I - 0x0032AF 00:B29F: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x0032B3 00:B2A3: 65        .byte $65, $65, $65, $55   ; 
- D 1 - I - 0x0032B7 00:B2A7: 43        .byte $43, $42, $42, $87   ; 
- D 1 - I - 0x0032BB 00:B2AB: 40        .byte $40, $40, $40, $88   ; 
; 37 
- D 1 - I - 0x0032BF 00:B2AF: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x0032C3 00:B2B3: 60        .byte $60, $65, $65, $55   ; 
- D 1 - I - 0x0032C7 00:B2B7: 0F        .byte $0F, $12, $06, $5D   ; 
- D 1 - I - 0x0032CB 00:B2BB: 00        .byte $00, $11, $5E, $5F   ; 
; 38 
- D 1 - I - 0x0032CF 00:B2BF: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x0032D3 00:B2C3: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x0032D7 00:B2C7: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x0032DB 00:B2CB: 41        .byte $41, $41, $41, $41   ; 
; 39 
- D 1 - I - 0x0032DF 00:B2CF: 57        .byte $57, $57, $56, $5F   ; 
- D 1 - I - 0x0032E3 00:B2D3: 57        .byte $57, $73, $74, $55   ; 
- D 1 - I - 0x0032E7 00:B2D7: 57        .byte $57, $56, $12, $5D   ; 
- D 1 - I - 0x0032EB 00:B2DB: 73        .byte $73, $75, $5E, $5F   ; 
; 3A 
- D 1 - I - 0x0032EF 00:B2DF: 10        .byte $10, $00, $00, $00   ; 
- D 1 - I - 0x0032F3 00:B2E3: 71        .byte $71, $00, $00, $00   ; 
- D 1 - I - 0x0032F7 00:B2E7: 0F        .byte $0F, $18, $18, $00   ; 
- D 1 - I - 0x0032FB 00:B2EB: 00        .byte $00, $00, $00, $00   ; 
; 3B 
- D 1 - I - 0x0032FF 00:B2EF: 00        .byte $00, $00, $11, $5F   ; 
- D 1 - I - 0x003303 00:B2F3: 00        .byte $00, $00, $00, $11   ; 
- D 1 - I - 0x003307 00:B2F7: 0F        .byte $0F, $18, $18, $00   ; 
- D 1 - I - 0x00330B 00:B2FB: 10        .byte $10, $00, $00, $00   ; 
; 3C 
- D 1 - I - 0x00330F 00:B2FF: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003313 00:B303: EB        .byte $EB, $EB, $EB, $EB   ; 
- D 1 - I - 0x003317 00:B307: 0F        .byte $0F, $18, $18, $00   ; 
- D 1 - I - 0x00331B 00:B30B: 10        .byte $10, $00, $00, $00   ; 
; 3D 
- D 1 - I - 0x00331F 00:B30F: 7C        .byte $7C, $00, $11, $5F   ; 
- D 1 - I - 0x003323 00:B313: 76        .byte $76, $00, $00, $77   ; 
- D 1 - I - 0x003327 00:B317: 0F        .byte $0F, $18, $18, $00   ; 
- D 1 - I - 0x00332B 00:B31B: 10        .byte $10, $00, $00, $00   ; 
; 3E 
- D 1 - I - 0x00332F 00:B31F: 08        .byte $08, $5E, $08, $5F   ; 
- D 1 - I - 0x003333 00:B323: 65        .byte $65, $65, $65, $55   ; 
- D 1 - I - 0x003337 00:B327: 08        .byte $08, $06, $06, $5D   ; 
- D 1 - I - 0x00333B 00:B32B: 08        .byte $08, $08, $5E, $5F   ; 
; 3F 
- D 1 - I - 0x00333F 00:B32F: 13        .byte $13, $13, $13, $13   ; 
- D 1 - I - 0x003343 00:B333: 78        .byte $78, $78, $78, $78   ; 
- D 1 - I - 0x003347 00:B337: 07        .byte $07, $5E, $08, $5F   ; 
- D 1 - I - 0x00334B 00:B33B: 60        .byte $60, $65, $65, $55   ; 
; 40 
- D 1 - I - 0x00334F 00:B33F: 01        .byte $01, $02, $02, $61   ; 
- D 1 - I - 0x003353 00:B343: 62        .byte $62, $63, $63, $64   ; 
- D 1 - I - 0x003357 00:B347: 01        .byte $01, $02, $02, $61   ; 
- D 1 - I - 0x00335B 00:B34B: 62        .byte $62, $63, $63, $64   ; 
; 41 
- D 1 - I - 0x00335F 00:B34F: 01        .byte $01, $02, $2A, $E3   ; 
- D 1 - I - 0x003363 00:B353: 62        .byte $62, $63, $A7, $A8   ; 
- D 1 - I - 0x003367 00:B357: 01        .byte $01, $02, $1B, $1C   ; 
- D 1 - I - 0x00336B 00:B35B: 62        .byte $62, $63, $AE, $AF   ; 
; 42 
- D 1 - I - 0x00336F 00:B35F: 2B        .byte $2B, $2A, $1A, $BE   ; 
- D 1 - I - 0x003373 00:B363: A8        .byte $A8, $A9, $BF, $C0   ; 
- D 1 - I - 0x003377 00:B367: 1C        .byte $1C, $AC, $23, $C3   ; 
- D 1 - I - 0x00337B 00:B36B: AF        .byte $AF, $C5, $C6, $C7   ; 
; 43 
- D 1 - I - 0x00337F 00:B36F: 22        .byte $22, $A6, $2A, $E3   ; 
- D 1 - I - 0x003383 00:B373: C1        .byte $C1, $C2, $AA, $A8   ; 
- D 1 - I - 0x003387 00:B377: 24        .byte $24, $C4, $1D, $1C   ; 
- D 1 - I - 0x00338B 00:B37B: C8        .byte $C8, $C9, $CA, $AF   ; 
; 44 
- D 1 - I - 0x00338F 00:B37F: 2B        .byte $2B, $2A, $02, $61   ; 
- D 1 - I - 0x003393 00:B383: A8        .byte $A8, $AB, $63, $64   ; 
- D 1 - I - 0x003397 00:B387: 1C        .byte $1C, $AD, $03, $61   ; 
- D 1 - I - 0x00339B 00:B38B: AF        .byte $AF, $B0, $00, $64   ; 
; 45 
- D 1 - I - 0x00339F 00:B38F: 01        .byte $01, $02, $1E, $1F   ; 
- D 1 - I - 0x0033A3 00:B393: 62        .byte $62, $63, $B2, $B3   ; 
- D 1 - I - 0x0033A7 00:B397: 01        .byte $01, $02, $20, $21   ; 
- D 1 - I - 0x0033AB 00:B39B: 62        .byte $62, $63, $B8, $B9   ; 
; 46 
- D 1 - I - 0x0033AF 00:B39F: 1F        .byte $1F, $CB, $25, $CC   ; 
- D 1 - I - 0x0033B3 00:B3A3: B3        .byte $B3, $B4, $CE, $CF   ; 
- D 1 - I - 0x0033B7 00:B3A7: 21        .byte $21, $21, $28, $D2   ; 
- D 1 - I - 0x0033BB 00:B3AB: BA        .byte $BA, $BB, $BA, $BB   ; 
; 47 
- D 1 - I - 0x0033BF 00:B3AF: 26        .byte $26, $CD, $27, $1F   ; 
- D 1 - I - 0x0033C3 00:B3B3: D0        .byte $D0, $D1, $B5, $B3   ; 
- D 1 - I - 0x0033C7 00:B3B7: 29        .byte $29, $D3, $21, $21   ; 
- D 1 - I - 0x0033CB 00:B3BB: BA        .byte $BA, $BB, $BA, $BB   ; 
; 48 
- D 1 - I - 0x0033CF 00:B3BF: 1F        .byte $1F, $B1, $03, $61   ; 
- D 1 - I - 0x0033D3 00:B3C3: B3        .byte $B3, $B6, $00, $64   ; 
- D 1 - I - 0x0033D7 00:B3C7: 21        .byte $21, $B7, $03, $61   ; 
- D 1 - I - 0x0033DB 00:B3CB: BC        .byte $BC, $BD, $00, $64   ; 
; 49 
- D 1 - I - 0x0033DF 00:B3CF: 01        .byte $01, $02, $09, $00   ; 
- D 1 - I - 0x0033E3 00:B3D3: 62        .byte $62, $63, $63, $64   ; 
- - - - - - 0x0033E7 00:B3D7: 01        .byte $01, $02, $02, $61   ; 
- - - - - - 0x0033EB 00:B3DB: 62        .byte $62, $63, $63, $64   ; 
; 4A 
- D 1 - I - 0x0033EF 00:B3DF: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x0033F3 00:B3E3: 62        .byte $62, $63, $63, $64   ; 
- - - - - - 0x0033F7 00:B3E7: 01        .byte $01, $02, $02, $61   ; 
- - - - - - 0x0033FB 00:B3EB: 62        .byte $62, $63, $63, $64   ; 
; 4B 
- D 1 - I - 0x0033FF 00:B3EF: 00        .byte $00, $03, $03, $61   ; 
- D 1 - I - 0x003403 00:B3F3: 62        .byte $62, $63, $63, $64   ; 
- - - - - - 0x003407 00:B3F7: 01        .byte $01, $02, $02, $61   ; 
- - - - - - 0x00340B 00:B3FB: 62        .byte $62, $63, $63, $64   ; 
; 4C 
- D 1 - I - 0x00340F 00:B3FF: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003413 00:B403: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003417 00:B407: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x00341B 00:B40B: EB        .byte $EB, $EB, $EB, $EB   ; 
; 4D 
- D 1 - I - 0x00341F 00:B40F: 47        .byte $47, $EF, $41, $41   ; 
- D 1 - I - 0x003423 00:B413: 41        .byte $41, $47, $EF, $41   ; 
- D 1 - I - 0x003427 00:B417: 41        .byte $41, $41, $47, $EF   ; 
- D 1 - I - 0x00342B 00:B41B: EB        .byte $EB, $EB, $EB, $D6   ; 
; 4E 
- D 1 - I - 0x00342F 00:B41F: 41        .byte $41, $48, $46, $F2   ; 
- D 1 - I - 0x003433 00:B423: 41        .byte $41, $41, $D8, $F3   ; 
- D 1 - I - 0x003437 00:B427: 41        .byte $41, $41, $48, $F4   ; 
- D 1 - I - 0x00343B 00:B42B: EB        .byte $EB, $EB, $EB, $F5   ; 
; 4F 
- D 1 - I - 0x00343F 00:B42F: 0E        .byte $0E, $02, $02, $61   ; 
- D 1 - I - 0x003443 00:B433: 0C        .byte $0C, $F6, $63, $64   ; 
- D 1 - I - 0x003447 00:B437: 0B        .byte $0B, $03, $04, $61   ; 
- D 1 - I - 0x00344B 00:B43B: 0C        .byte $0C, $00, $00, $E2   ; 
; 50 
- D 1 - I - 0x00344F 00:B43F: 40        .byte $40, $EE, $5C, $59   ; 
- D 1 - I - 0x003453 00:B443: 40        .byte $40, $EE, $D9, $F0   ; 
- - - - - - 0x003457 00:B447: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x00345B 00:B44B: 00        .byte $00, $00, $00, $00   ; 
; 51 
- D 1 - I - 0x00345F 00:B44F: 44        .byte $44, $45, $44, $45   ; 
- D 1 - I - 0x003463 00:B453: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003467 00:B457: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x00346B 00:B45B: 41        .byte $41, $41, $41, $E1   ; 
; 52 
- D 1 - I - 0x00346F 00:B45F: 41        .byte $41, $41, $E1, $FD   ; 
- D 1 - I - 0x003473 00:B463: 41        .byte $41, $E1, $FD, $41   ; 
- D 1 - I - 0x003477 00:B467: E1        .byte $E1, $FD, $41, $41   ; 
- D 1 - I - 0x00347B 00:B46B: FD        .byte $FD, $41, $41, $41   ; 
; 53 
- D 1 - I - 0x00347F 00:B46F: 5A        .byte $5A, $DA, $DE, $40   ; 
- D 1 - I - 0x003483 00:B473: F7        .byte $F7, $F9, $DE, $40   ; 
- - - - - - 0x003487 00:B477: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x00348B 00:B47B: 00        .byte $00, $00, $00, $00   ; 
; 54 
- D 1 - I - 0x00348F 00:B47F: 45        .byte $45, $D7, $46, $5C   ; 
- D 1 - I - 0x003493 00:B483: 41        .byte $41, $41, $D8, $D9   ; 
- D 1 - I - 0x003497 00:B487: 41        .byte $41, $41, $48, $46   ; 
- D 1 - I - 0x00349B 00:B48B: 41        .byte $41, $41, $41, $D8   ; 
; 55 
- D 1 - I - 0x00349F 00:B48F: 58        .byte $58, $02, $02, $61   ; 
- D 1 - I - 0x0034A3 00:B493: F1        .byte $F1, $63, $63, $64   ; 
- D 1 - I - 0x0034A7 00:B497: 5C        .byte $5C, $58, $02, $61   ; 
- D 1 - I - 0x0034AB 00:B49B: D9        .byte $D9, $F1, $63, $64   ; 
; 56 
- D 1 - I - 0x0034AF 00:B49F: 01        .byte $01, $02, $D5, $5B   ; 
- D 1 - I - 0x0034B3 00:B4A3: 62        .byte $62, $63, $63, $F8   ; 
- D 1 - I - 0x0034B7 00:B4A7: 01        .byte $01, $02, $5B, $DA   ; 
- D 1 - I - 0x0034BB 00:B4AB: 62        .byte $62, $63, $F8, $F9   ; 
; 57 
- D 1 - I - 0x0034BF 00:B4AF: DA        .byte $DA, $DC, $DF, $45   ; 
- D 1 - I - 0x0034C3 00:B4B3: F9        .byte $F9, $FC, $41, $41   ; 
- D 1 - I - 0x0034C7 00:B4B7: DC        .byte $DC, $E0, $41, $41   ; 
- D 1 - I - 0x0034CB 00:B4BB: FC        .byte $FC, $41, $41, $41   ; 
; 58 
- D 1 - I - 0x0034CF 00:B4BF: 41        .byte $41, $41, $41, $48   ; 
- D 1 - I - 0x0034D3 00:B4C3: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x0034D7 00:B4C7: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x0034DB 00:B4CB: EF        .byte $EF, $41, $41, $41   ; 
; 59 
- D 1 - I - 0x0034DF 00:B4CF: 46        .byte $46, $5C, $58, $61   ; 
- D 1 - I - 0x0034E3 00:B4D3: D8        .byte $D8, $D9, $F1, $64   ; 
- D 1 - I - 0x0034E7 00:B4D7: 48        .byte $48, $46, $5C, $59   ; 
- D 1 - I - 0x0034EB 00:B4DB: 41        .byte $41, $D8, $D9, $F0   ; 
; 5A 
- D 1 - I - 0x0034EF 00:B4DF: 01        .byte $01, $5B, $DA, $DC   ; 
- D 1 - I - 0x0034F3 00:B4E3: 62        .byte $62, $F8, $F9, $FC   ; 
- D 1 - I - 0x0034F7 00:B4E7: 5A        .byte $5A, $DA, $DC, $E0   ; 
- D 1 - I - 0x0034FB 00:B4EB: F7        .byte $F7, $F9, $FC, $41   ; 
; 5B 
- D 1 - I - 0x0034FF 00:B4EF: E0        .byte $E0, $41, $41, $41   ; 
- D 1 - I - 0x003503 00:B4F3: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003507 00:B4F7: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x00350B 00:B4FB: 41        .byte $41, $41, $41, $E1   ; 
; 5C 
- D 1 - I - 0x00350F 00:B4FF: 45        .byte $45, $44, $45, $44   ; 
- D 1 - I - 0x003513 00:B503: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003517 00:B507: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x00351B 00:B50B: EF        .byte $EF, $41, $41, $41   ; 
; 5D 
- D 1 - I - 0x00351F 00:B50F: 47        .byte $47, $EF, $41, $41   ; 
- D 1 - I - 0x003523 00:B513: 41        .byte $41, $47, $EF, $41   ; 
- D 1 - I - 0x003527 00:B517: 41        .byte $41, $41, $47, $EF   ; 
- D 1 - I - 0x00352B 00:B51B: 41        .byte $41, $41, $41, $47   ; 
; 5E 
- D 1 - I - 0x00352F 00:B51F: DB        .byte $DB, $DC, $E0, $41   ; 
- D 1 - I - 0x003533 00:B523: FA        .byte $FA, $FC, $41, $41   ; 
- D 1 - I - 0x003537 00:B527: FB        .byte $FB, $E0, $41, $41   ; 
- D 1 - I - 0x00353B 00:B52B: FE        .byte $FE, $EB, $EB, $EB   ; 
; 5F 
- D 1 - I - 0x00353F 00:B52F: 41        .byte $41, $41, $E1, $FD   ; 
- D 1 - I - 0x003543 00:B533: 41        .byte $41, $E1, $FD, $41   ; 
- D 1 - I - 0x003547 00:B537: E1        .byte $E1, $FD, $41, $41   ; 
- D 1 - I - 0x00354B 00:B53B: FF        .byte $FF, $EB, $EB, $EB   ; 
; 60 
- D 1 - I - 0x00354F 00:B53F: 01        .byte $01, $02, $02, $61   ; 
- D 1 - I - 0x003553 00:B543: 62        .byte $62, $63, $63, $64   ; 
- D 1 - I - 0x003557 00:B547: 43        .byte $43, $ED, $58, $61   ; 
- D 1 - I - 0x00355B 00:B54B: 40        .byte $40, $EE, $F1, $64   ; 
; 61 
- D 1 - I - 0x00355F 00:B54F: 01        .byte $01, $02, $02, $61   ; 
- D 1 - I - 0x003563 00:B553: 62        .byte $62, $63, $63, $64   ; 
- D 1 - I - 0x003567 00:B557: 43        .byte $43, $42, $43, $42   ; 
- D 1 - I - 0x00356B 00:B55B: 40        .byte $40, $40, $40, $40   ; 
; 62 
- D 1 - I - 0x00356F 00:B55F: 01        .byte $01, $02, $02, $61   ; 
- D 1 - I - 0x003573 00:B563: 62        .byte $62, $63, $63, $64   ; 
- D 1 - I - 0x003577 00:B567: D4        .byte $D4, $5B, $DD, $42   ; 
- D 1 - I - 0x00357B 00:B56B: 62        .byte $62, $F8, $DE, $40   ; 
; 63 
- D 1 - I - 0x00357F 00:B56F: 0D        .byte $0D, $03, $03, $03   ; 
- D 1 - I - 0x003583 00:B573: 62        .byte $62, $09, $00, $00   ; 
- D 1 - I - 0x003587 00:B577: 01        .byte $01, $02, $0A, $03   ; 
- D 1 - I - 0x00358B 00:B57B: 62        .byte $62, $63, $63, $09   ; 
; 64 
- D 1 - I - 0x00358F 00:B57F: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x003593 00:B583: 0C        .byte $0C, $00, $00, $00   ; 
- D 1 - I - 0x003597 00:B587: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x00359B 00:B58B: 0C        .byte $0C, $00, $00, $00   ; 
; 65 
- D 1 - I - 0x00359F 00:B58F: 2B        .byte $2B, $2A, $2A, $E3   ; 
- D 1 - I - 0x0035A3 00:B593: A8        .byte $A8, $A8, $A8, $A8   ; 
- D 1 - I - 0x0035A7 00:B597: 1C        .byte $1C, $1C, $9A, $9B   ; 
- D 1 - I - 0x0035AB 00:B59B: AF        .byte $AF, $AF, $9E, $9F   ; 
; 66 
- D 1 - I - 0x0035AF 00:B59F: 2B        .byte $2B, $2A, $2A, $E3   ; 
- D 1 - I - 0x0035B3 00:B5A3: A8        .byte $A8, $A8, $A8, $A8   ; 
- D 1 - I - 0x0035B7 00:B5A7: 9C        .byte $9C, $9D, $1C, $1C   ; 
- D 1 - I - 0x0035BB 00:B5AB: A0        .byte $A0, $A1, $AF, $AF   ; 
; 67 
- D 1 - I - 0x0035BF 00:B5AF: 1F        .byte $1F, $1F, $A2, $A3   ; 
- D 1 - I - 0x0035C3 00:B5B3: B3        .byte $B3, $B3, $B3, $B3   ; 
- D 1 - I - 0x0035C7 00:B5B7: 21        .byte $21, $21, $21, $21   ; 
- D 1 - I - 0x0035CB 00:B5BB: BA        .byte $BA, $BB, $BA, $BB   ; 
; 68 
- D 1 - I - 0x0035CF 00:B5BF: A4        .byte $A4, $A5, $1F, $1F   ; 
- D 1 - I - 0x0035D3 00:B5C3: B3        .byte $B3, $B3, $B3, $B3   ; 
- D 1 - I - 0x0035D7 00:B5C7: 21        .byte $21, $21, $21, $21   ; 
- D 1 - I - 0x0035DB 00:B5CB: BA        .byte $BA, $BB, $BA, $BB   ; 
; 69 
- D 1 - I - 0x0035DF 00:B5CF: 1F        .byte $1F, $CB, $25, $CC   ; 
- D 1 - I - 0x0035E3 00:B5D3: B3        .byte $B3, $B4, $CE, $CF   ; 
- D 1 - I - 0x0035E7 00:B5D7: 21        .byte $21, $21, $2C, $2D   ; 
- D 1 - I - 0x0035EB 00:B5DB: BA        .byte $BA, $BB, $BA, $BB   ; 
; 6A 
- D 1 - I - 0x0035EF 00:B5DF: 26        .byte $26, $CD, $27, $1F   ; 
- D 1 - I - 0x0035F3 00:B5E3: D0        .byte $D0, $D1, $B5, $B3   ; 
- D 1 - I - 0x0035F7 00:B5E7: 2E        .byte $2E, $2F, $21, $21   ; 
- D 1 - I - 0x0035FB 00:B5EB: BA        .byte $BA, $BB, $BA, $BB   ; 
; 6B 
- D 1 - I - 0x0035FF 00:B5EF: 51        .byte $51, $40, $40, $40   ; 
- D 1 - I - 0x003603 00:B5F3: 51        .byte $51, $40, $40, $40   ; 
- D 1 - I - 0x003607 00:B5F7: 36        .byte $36, $40, $40, $40   ; 
- D 1 - I - 0x00360B 00:B5FB: 34        .byte $34, $4C, $40, $40   ; 
; 6C 
- D 1 - I - 0x00360F 00:B5FF: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x003613 00:B603: 0C        .byte $0C, $00, $00, $00   ; 
- D 1 - I - 0x003617 00:B607: 70        .byte $70, $03, $03, $03   ; 
- D 1 - I - 0x00361B 00:B60B: 71        .byte $71, $00, $00, $00   ; 
; 6D 
- D 1 - I - 0x00361F 00:B60F: 70        .byte $70, $03, $03, $03   ; 
- D 1 - I - 0x003623 00:B613: 71        .byte $71, $00, $00, $00   ; 
- D 1 - I - 0x003627 00:B617: 72        .byte $72, $03, $03, $03   ; 
- D 1 - I - 0x00362B 00:B61B: 00        .byte $00, $00, $00, $00   ; 
; 6E 
- D 1 - I - 0x00362F 00:B61F: 51        .byte $51, $40, $40, $40   ; 
- D 1 - I - 0x003633 00:B623: 51        .byte $51, $40, $40, $40   ; 
- D 1 - I - 0x003637 00:B627: 51        .byte $51, $40, $40, $40   ; 
- D 1 - I - 0x00363B 00:B62B: 36        .byte $36, $40, $40, $40   ; 
; 6F 
- D 1 - I - 0x00363F 00:B62F: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003643 00:B633: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003647 00:B637: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x00364B 00:B63B: 4C        .byte $4C, $E4, $40, $40   ; 
; 70 
- D 1 - I - 0x00364F 00:B63F: 80        .byte $80, $E5, $E5, $E5   ; 
- D 1 - I - 0x003653 00:B643: 51        .byte $51, $40, $40, $40   ; 
- D 1 - I - 0x003657 00:B647: 51        .byte $51, $40, $40, $40   ; 
- D 1 - I - 0x00365B 00:B64B: 51        .byte $51, $40, $40, $40   ; 
; 71 
- D 1 - I - 0x00365F 00:B64F: E5        .byte $E5, $E5, $E5, $E5   ; 
- D 1 - I - 0x003663 00:B653: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003667 00:B657: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x00366B 00:B65B: 40        .byte $40, $40, $40, $40   ; 
; 72 
- D 1 - I - 0x00366F 00:B65F: 05        .byte $05, $06, $06, $06   ; 
- D 1 - I - 0x003673 00:B663: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003677 00:B667: 07        .byte $07, $40, $07, $40   ; 
- D 1 - I - 0x00367B 00:B66B: 52        .byte $52, $53, $53, $53   ; 
; 73 
- D 1 - I - 0x00367F 00:B66F: 06        .byte $06, $06, $06, $C2   ; 
- D 1 - I - 0x003683 00:B673: 40        .byte $40, $40, $40, $C3   ; 
- D 1 - I - 0x003687 00:B677: 07        .byte $07, $40, $07, $C3   ; 
- D 1 - I - 0x00368B 00:B67B: 53        .byte $53, $53, $53, $C4   ; 
; 74 
- D 1 - I - 0x00368F 00:B67F: 07        .byte $07, $40, $07, $40   ; 
- D 1 - I - 0x003693 00:B683: 52        .byte $52, $53, $53, $53   ; 
- D 1 - I - 0x003697 00:B687: 05        .byte $05, $06, $06, $06   ; 
- D 1 - I - 0x00369B 00:B68B: 40        .byte $40, $40, $40, $40   ; 
; 75 
- D 1 - I - 0x00369F 00:B68F: 07        .byte $07, $40, $07, $C3   ; 
- D 1 - I - 0x0036A3 00:B693: 53        .byte $53, $53, $53, $C4   ; 
- D 1 - I - 0x0036A7 00:B697: 06        .byte $06, $06, $06, $C2   ; 
- D 1 - I - 0x0036AB 00:B69B: 40        .byte $40, $40, $40, $C3   ; 
; 76 
- D 1 - I - 0x0036AF 00:B69F: 24        .byte $24, $24, $24, $24   ; 
- D 1 - I - 0x0036B3 00:B6A3: 7D        .byte $7D, $7D, $7D, $7D   ; 
- D 1 - I - 0x0036B7 00:B6A7: 21        .byte $21, $20, $1F, $83   ; 
- D 1 - I - 0x0036BB 00:B6AB: 83        .byte $83, $83, $20, $22   ; 
; 77 
- D 1 - I - 0x0036BF 00:B6AF: 24        .byte $24, $24, $24, $24   ; 
- D 1 - I - 0x0036C3 00:B6B3: 7D        .byte $7D, $7D, $7D, $7D   ; 
- D 1 - I - 0x0036C7 00:B6B7: 1B        .byte $1B, $85, $1C, $81   ; 
- D 1 - I - 0x0036CB 00:B6BB: 1D        .byte $1D, $1C, $1B, $1B   ; 
; 78 
- D 1 - I - 0x0036CF 00:B6BF: 34        .byte $34, $E7, $37, $E7   ; 
- D 1 - I - 0x0036D3 00:B6C3: E8        .byte $E8, $35, $E6, $E6   ; 
- D 1 - I - 0x0036D7 00:B6C7: 3A        .byte $3A, $38, $39, $39   ; 
- D 1 - I - 0x0036DB 00:B6CB: 3A        .byte $3A, $41, $41, $41   ; 
; 79 
- D 1 - I - 0x0036DF 00:B6CF: 37        .byte $37, $E7, $37, $E7   ; 
- D 1 - I - 0x0036E3 00:B6D3: 35        .byte $35, $35, $E6, $35   ; 
- D 1 - I - 0x0036E7 00:B6D7: 38        .byte $38, $39, $39, $38   ; 
- D 1 - I - 0x0036EB 00:B6DB: 41        .byte $41, $41, $41, $41   ; 
; 7A 
- D 1 - I - 0x0036EF 00:B6DF: 22        .byte $22, $22, $20, $84   ; 
- D 1 - I - 0x0036F3 00:B6E3: 84        .byte $84, $23, $22, $84   ; 
- D 1 - I - 0x0036F7 00:B6E7: 23        .byte $23, $84, $23, $00   ; 
- D 1 - I - 0x0036FB 00:B6EB: 00        .byte $00, $00, $00, $23   ; 
; 7B 
- D 1 - I - 0x0036FF 00:B6EF: 1E        .byte $1E, $1C, $1D, $1D   ; 
- D 1 - I - 0x003703 00:B6F3: 1E        .byte $1E, $82, $82, $1E   ; 
- D 1 - I - 0x003707 00:B6F7: 30        .byte $30, $82, $1E, $82   ; 
- D 1 - I - 0x00370B 00:B6FB: 82        .byte $82, $00, $00, $00   ; 
; 7C 
- D 1 - I - 0x00370F 00:B6FF: 3A        .byte $3A, $41, $41, $41   ; 
- D 1 - I - 0x003713 00:B703: 3B        .byte $3B, $41, $41, $41   ; 
- D 1 - I - 0x003717 00:B707: 3B        .byte $3B, $41, $41, $41   ; 
- D 1 - I - 0x00371B 00:B70B: 3B        .byte $3B, $41, $41, $41   ; 
; 7D 
- D 1 - I - 0x00371F 00:B70F: 41        .byte $41, $41, $41, $3D   ; 
- D 1 - I - 0x003723 00:B713: 41        .byte $41, $41, $41, $E9   ; 
- D 1 - I - 0x003727 00:B717: 41        .byte $41, $41, $3D, $3E   ; 
- D 1 - I - 0x00372B 00:B71B: 41        .byte $41, $41, $E9, $41   ; 
; 7E 
- D 1 - I - 0x00372F 00:B71F: 3C        .byte $3C, $41, $41, $41   ; 
- D 1 - I - 0x003733 00:B723: 3C        .byte $3C, $41, $41, $41   ; 
- D 1 - I - 0x003737 00:B727: 3C        .byte $3C, $41, $41, $41   ; 
- D 1 - I - 0x00373B 00:B72B: EA        .byte $EA, $EB, $EB, $EB   ; 
; 7F 
- D 1 - I - 0x00373F 00:B72F: 41        .byte $41, $3D, $3E, $41   ; 
- D 1 - I - 0x003743 00:B733: 41        .byte $41, $E9, $41, $41   ; 
- D 1 - I - 0x003747 00:B737: 3D        .byte $3D, $3E, $41, $41   ; 
- D 1 - I - 0x00374B 00:B73B: EC        .byte $EC, $EB, $EB, $EB   ; 
; 80 
- D 1 - I - 0x00374F 00:B73F: 37        .byte $37, $E7, $37, $E7   ; 
- D 1 - I - 0x003753 00:B743: 35        .byte $35, $35, $E6, $35   ; 
- D 1 - I - 0x003757 00:B747: 3F        .byte $3F, $00, $39, $38   ; 
- D 1 - I - 0x00375B 00:B74B: E9        .byte $E9, $41, $41, $41   ; 
; 81 
- D 1 - I - 0x00375F 00:B74F: 3E        .byte $3E, $41, $41, $41   ; 
- D 1 - I - 0x003763 00:B753: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003767 00:B757: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x00376B 00:B75B: 41        .byte $41, $41, $41, $41   ; 
; 82 
- D 1 - I - 0x00376F 00:B75F: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003773 00:B763: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003777 00:B767: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x00377B 00:B76B: 41        .byte $41, $41, $41, $E1   ; 
; 83 
- D 1 - I - 0x00377F 00:B76F: 25        .byte $25, $24, $24, $24   ; 
- D 1 - I - 0x003783 00:B773: 00        .byte $00, $54, $7D, $7D   ; 
- D 1 - I - 0x003787 00:B777: 30        .byte $30, $00, $1D, $1C   ; 
- D 1 - I - 0x00378B 00:B77B: 00        .byte $00, $00, $82, $1D   ; 
; 84 
- D 1 - I - 0x00378F 00:B77F: 01        .byte $01, $02, $02, $61   ; 
- D 1 - I - 0x003793 00:B783: 62        .byte $62, $63, $63, $64   ; 
- D 1 - I - 0x003797 00:B787: 05        .byte $05, $06, $06, $06   ; 
- D 1 - I - 0x00379B 00:B78B: 40        .byte $40, $40, $40, $40   ; 
; 85 
- D 1 - I - 0x00379F 00:B78F: 01        .byte $01, $02, $02, $61   ; 
- D 1 - I - 0x0037A3 00:B793: 62        .byte $62, $63, $63, $64   ; 
- D 1 - I - 0x0037A7 00:B797: 06        .byte $06, $06, $06, $C2   ; 
- D 1 - I - 0x0037AB 00:B79B: 40        .byte $40, $40, $40, $C3   ; 
; 86 
- D 1 - I - 0x0037AF 00:B79F: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x0037B3 00:B7A3: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x0037B7 00:B7A7: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x0037BB 00:B7AB: 40        .byte $40, $40, $40, $40   ; 
; 87 
- D 1 - I - 0x0037BF 00:B7AF: 40        .byte $40, $40, $40, $7B   ; 
- D 1 - I - 0x0037C3 00:B7B3: 40        .byte $40, $40, $40, $7B   ; 
- D 1 - I - 0x0037C7 00:B7B7: 40        .byte $40, $40, $40, $7B   ; 
- D 1 - I - 0x0037CB 00:B7BB: 40        .byte $40, $40, $40, $7B   ; 
; 88 
- D 1 - I - 0x0037CF 00:B7BF: 41        .byte $41, $49, $3F, $00   ; 
- D 1 - I - 0x0037D3 00:B7C3: 65        .byte $65, $65, $65, $65   ; 
- D 1 - I - 0x0037D7 00:B7C7: 68        .byte $68, $41, $41, $41   ; 
- D 1 - I - 0x0037DB 00:B7CB: 6C        .byte $6C, $6A, $41, $41   ; 
; 89 
- D 1 - I - 0x0037DF 00:B7CF: 3F        .byte $3F, $00, $3F, $00   ; 
- D 1 - I - 0x0037E3 00:B7D3: 65        .byte $65, $65, $65, $6B   ; 
- D 1 - I - 0x0037E7 00:B7D7: 41        .byte $41, $41, $41, $6D   ; 
- D 1 - I - 0x0037EB 00:B7DB: 41        .byte $41, $41, $41, $6D   ; 
; 8A 
- D 1 - I - 0x0037EF 00:B7DF: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x0037F3 00:B7E3: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x0037F7 00:B7E7: 40        .byte $40, $40, $69, $68   ; 
- D 1 - I - 0x0037FB 00:B7EB: 40        .byte $40, $40, $69, $6C   ; 
; 8B 
- D 1 - I - 0x0037FF 00:B7EF: 40        .byte $40, $40, $40, $7B   ; 
- D 1 - I - 0x003803 00:B7F3: 40        .byte $40, $40, $40, $7B   ; 
- D 1 - I - 0x003807 00:B7F7: 41        .byte $41, $41, $41, $4A   ; 
- D 1 - I - 0x00380B 00:B7FB: 6A        .byte $6A, $41, $41, $26   ; 
; 8C 
- D 1 - I - 0x00380F 00:B7FF: 41        .byte $41, $49, $6A, $41   ; 
- D 1 - I - 0x003813 00:B803: 41        .byte $41, $6C, $00, $6A   ; 
- D 1 - I - 0x003817 00:B807: 41        .byte $41, $41, $49, $00   ; 
- D 1 - I - 0x00381B 00:B80B: 41        .byte $41, $41, $6C, $00   ; 
; 8D 
- D 1 - I - 0x00381F 00:B80F: 41        .byte $41, $41, $41, $6D   ; 
- D 1 - I - 0x003823 00:B813: 41        .byte $41, $41, $41, $6D   ; 
- D 1 - I - 0x003827 00:B817: 6A        .byte $6A, $41, $41, $6D   ; 
- D 1 - I - 0x00382B 00:B81B: 00        .byte $00, $6A, $41, $6D   ; 
; 8E 
- D 1 - I - 0x00382F 00:B81F: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x003833 00:B823: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x003837 00:B827: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x00383B 00:B82B: 40        .byte $40, $40, $69, $41   ; 
; 8F 
- D 1 - I - 0x00383F 00:B82F: 49        .byte $49, $6A, $41, $41   ; 
- D 1 - I - 0x003843 00:B833: 6C        .byte $6C, $00, $6A, $41   ; 
- D 1 - I - 0x003847 00:B837: 41        .byte $41, $49, $3F, $6A   ; 
- D 1 - I - 0x00384B 00:B83B: 41        .byte $41, $76, $00, $00   ; 
; 90 
- D 1 - I - 0x00384F 00:B83F: 1A        .byte $1A, $C1, $10, $10   ; 
- D 1 - I - 0x003853 00:B843: 12        .byte $12, $87, $88, $89   ; 
- D 1 - I - 0x003857 00:B847: 12        .byte $12, $87, $13, $8D   ; 
- D 1 - I - 0x00385B 00:B84B: 12        .byte $12, $87, $8F, $BE   ; 
; 91 
- D 1 - I - 0x00385F 00:B84F: 10        .byte $10, $10, $11, $86   ; 
- D 1 - I - 0x003863 00:B853: 8A        .byte $8A, $8B, $15, $15   ; 
- D 1 - I - 0x003867 00:B857: 14        .byte $14, $8E, $15, $15   ; 
- D 1 - I - 0x00386B 00:B85B: BF        .byte $BF, $91, $15, $15   ; 
; 92 
- D 1 - I - 0x00386F 00:B85F: 88        .byte $88, $89, $8A, $8B   ; 
- D 1 - I - 0x003873 00:B863: 9D        .byte $9D, $9E, $14, $8E   ; 
- D 1 - I - 0x003877 00:B867: 9F        .byte $9F, $A0, $90, $91   ; 
- D 1 - I - 0x00387B 00:B86B: A1        .byte $A1, $A2, $93, $94   ; 
; 93 
- D 1 - I - 0x00387F 00:B86F: 88        .byte $88, $89, $8A, $8B   ; 
- D 1 - I - 0x003883 00:B873: A3        .byte $A3, $A4, $14, $8E   ; 
- D 1 - I - 0x003887 00:B877: A5        .byte $A5, $A6, $90, $91   ; 
- D 1 - I - 0x00388B 00:B87B: A7        .byte $A7, $A8, $93, $94   ; 
; 94 
- D 1 - I - 0x00388F 00:B87F: 12        .byte $12, $87, $16, $C0   ; 
- D 1 - I - 0x003893 00:B883: 12        .byte $12, $95, $96, $96   ; 
- D 1 - I - 0x003897 00:B887: 12        .byte $12, $98, $18, $19   ; 
- D 1 - I - 0x00389B 00:B88B: 99        .byte $99, $9A, $9A, $9B   ; 
; 95 
- D 1 - I - 0x00389F 00:B88F: 17        .byte $17, $94, $15, $15   ; 
- D 1 - I - 0x0038A3 00:B893: 96        .byte $96, $96, $97, $15   ; 
- D 1 - I - 0x0038A7 00:B897: 19        .byte $19, $18, $2E, $15   ; 
- D 1 - I - 0x0038AB 00:B89B: 9B        .byte $9B, $9A, $9A, $9C   ; 
; 96 
- D 1 - I - 0x0038AF 00:B89F: 88        .byte $88, $89, $8A, $8B   ; 
- D 1 - I - 0x0038B3 00:B8A3: 8C        .byte $8C, $8D, $A9, $AA   ; 
- D 1 - I - 0x0038B7 00:B8A7: 8F        .byte $8F, $14, $AB, $AD   ; 
- D 1 - I - 0x0038BB 00:B8AB: 16        .byte $16, $92, $AC, $AE   ; 
; 97 
- D 1 - I - 0x0038BF 00:B8AF: 88        .byte $88, $89, $8A, $8B   ; 
- D 1 - I - 0x0038C3 00:B8B3: 8C        .byte $8C, $8D, $AF, $B0   ; 
- D 1 - I - 0x0038C7 00:B8B7: 8F        .byte $8F, $14, $14, $B1   ; 
- D 1 - I - 0x0038CB 00:B8BB: 16        .byte $16, $92, $93, $94   ; 
; 98 
- D 1 - I - 0x0038CF 00:B8BF: 88        .byte $88, $B2, $B3, $B4   ; 
- D 1 - I - 0x0038D3 00:B8C3: B5        .byte $B5, $00, $B6, $B7   ; 
- D 1 - I - 0x0038D7 00:B8C7: B8        .byte $B8, $B9, $BA, $BB   ; 
- D 1 - I - 0x0038DB 00:B8CB: 16        .byte $16, $BC, $BD, $94   ; 
; 99 
- D 1 - I - 0x0038DF 00:B8CF: 07        .byte $07, $40, $07, $40   ; 
- D 1 - I - 0x0038E3 00:B8D3: 52        .byte $52, $53, $53, $53   ; 
- D 1 - I - 0x0038E7 00:B8D7: 05        .byte $05, $06, $06, $06   ; 
- D 1 - I - 0x0038EB 00:B8DB: 40        .byte $40, $40, $40, $40   ; 
; 9A 
- D 1 - I - 0x0038EF 00:B8DF: 07        .byte $07, $40, $07, $C3   ; 
- D 1 - I - 0x0038F3 00:B8E3: 53        .byte $53, $53, $53, $C4   ; 
- D 1 - I - 0x0038F7 00:B8E7: 06        .byte $06, $06, $06, $C2   ; 
- D 1 - I - 0x0038FB 00:B8EB: 40        .byte $40, $40, $40, $C3   ; 
; 9B 
- D 1 - I - 0x0038FF 00:B8EF: 07        .byte $07, $40, $07, $40   ; 
- D 1 - I - 0x003903 00:B8F3: 53        .byte $53, $53, $53, $53   ; 
- D 1 - I - 0x003907 00:B8F7: 06        .byte $06, $06, $06, $06   ; 
- D 1 - I - 0x00390B 00:B8FB: 40        .byte $40, $40, $40, $40   ; 
; 9C 
- D 1 - I - 0x00390F 00:B8FF: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003913 00:B903: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003917 00:B907: 05        .byte $05, $06, $06, $06   ; 
- D 1 - I - 0x00391B 00:B90B: 40        .byte $40, $40, $40, $40   ; 
; 9D 
- D 1 - I - 0x00391F 00:B90F: 07        .byte $07, $40, $07, $40   ; 
- D 1 - I - 0x003923 00:B913: 52        .byte $52, $53, $53, $53   ; 
- D 1 - I - 0x003927 00:B917: 06        .byte $06, $06, $06, $06   ; 
- D 1 - I - 0x00392B 00:B91B: 40        .byte $40, $40, $40, $40   ; 
; 9E 
- D 1 - I - 0x00392F 00:B91F: 07        .byte $07, $40, $07, $C3   ; 
- D 1 - I - 0x003933 00:B923: 53        .byte $53, $53, $53, $C4   ; 
- D 1 - I - 0x003937 00:B927: 06        .byte $06, $06, $06, $06   ; 
- D 1 - I - 0x00393B 00:B92B: 40        .byte $40, $40, $40, $40   ; 
; 9F 
- D 1 - I - 0x00393F 00:B92F: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003943 00:B933: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003947 00:B937: 06        .byte $06, $06, $06, $C2   ; 
- D 1 - I - 0x00394B 00:B93B: 40        .byte $40, $40, $40, $C3   ; 
; A0 
- D 1 - I - 0x00394F 00:B93F: 4A        .byte $4A, $41, $41, $49   ; 
- D 1 - I - 0x003953 00:B943: 26        .byte $26, $41, $41, $76   ; 
- D 1 - I - 0x003957 00:B947: 41        .byte $41, $4A, $41, $7A   ; 
- D 1 - I - 0x00395B 00:B94B: 2D        .byte $2D, $26, $41, $7A   ; 
; A1 
- D 1 - I - 0x00395F 00:B94F: 41        .byte $41, $7A, $32, $41   ; 
- D 1 - I - 0x003963 00:B953: 41        .byte $41, $7A, $41, $41   ; 
- D 1 - I - 0x003967 00:B957: 41        .byte $41, $7A, $32, $41   ; 
- D 1 - I - 0x00396B 00:B95B: 41        .byte $41, $7A, $41, $41   ; 
; A2 
- D 1 - I - 0x00396F 00:B95F: 32        .byte $32, $69, $32, $7A   ; 
- D 1 - I - 0x003973 00:B963: 41        .byte $41, $69, $41, $7A   ; 
- D 1 - I - 0x003977 00:B967: 32        .byte $32, $69, $32, $7A   ; 
- D 1 - I - 0x00397B 00:B96B: 41        .byte $41, $69, $41, $7A   ; 
; A3 
- D 1 - I - 0x00397F 00:B96F: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x003983 00:B973: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x003987 00:B977: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x00398B 00:B97B: 24        .byte $24, $24, $24, $4A   ; 
; A4 
- D 1 - I - 0x00398F 00:B97F: 30        .byte $30, $00, $30, $00   ; 
- D 1 - I - 0x003993 00:B983: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003997 00:B987: 30        .byte $30, $00, $30, $00   ; 
- D 1 - I - 0x00399B 00:B98B: 00        .byte $00, $00, $00, $00   ; 
; A5 
- D 1 - I - 0x00399F 00:B98F: 41        .byte $41, $41, $41, $26   ; 
- D 1 - I - 0x0039A3 00:B993: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x0039A7 00:B997: 32        .byte $32, $41, $32, $41   ; 
- D 1 - I - 0x0039AB 00:B99B: 7D        .byte $7D, $7D, $7D, $7D   ; 
; A6 
- D 1 - I - 0x0039AF 00:B99F: 41        .byte $41, $7A, $32, $41   ; 
- D 1 - I - 0x0039B3 00:B9A3: 4A        .byte $4A, $7A, $41, $41   ; 
- D 1 - I - 0x0039B7 00:B9A7: 26        .byte $26, $7A, $32, $41   ; 
- D 1 - I - 0x0039BB 00:B9AB: 7D        .byte $7D, $7E, $41, $41   ; 
; A7 
- D 1 - I - 0x0039BF 00:B9AF: 32        .byte $32, $41, $32, $41   ; 
- D 1 - I - 0x0039C3 00:B9B3: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x0039C7 00:B9B7: 31        .byte $31, $40, $31, $40   ; 
- D 1 - I - 0x0039CB 00:B9BB: 24        .byte $24, $24, $24, $24   ; 
; A8 
- D 1 - I - 0x0039CF 00:B9BF: 32        .byte $32, $69, $32, $7A   ; 
- D 1 - I - 0x0039D3 00:B9C3: 41        .byte $41, $69, $41, $7A   ; 
- D 1 - I - 0x0039D7 00:B9C7: 31        .byte $31, $69, $32, $7A   ; 
- D 1 - I - 0x0039DB 00:B9CB: 24        .byte $24, $24, $4A, $7A   ; 
; A9 
- D 1 - I - 0x0039DF 00:B9CF: 32        .byte $32, $41, $32, $41   ; 
- D 1 - I - 0x0039E3 00:B9D3: 7D        .byte $7D, $7D, $7D, $7D   ; 
- - - - - - 0x0039E7 00:B9D7: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x0039EB 00:B9DB: 00        .byte $00, $00, $00, $00   ; 
; AA 
- D 1 - I - 0x0039EF 00:B9DF: 32        .byte $32, $41, $26, $7A   ; 
- D 1 - I - 0x0039F3 00:B9E3: 7D        .byte $7D, $7D, $7D, $7E   ; 
- - - - - - 0x0039F7 00:B9E7: E8        .byte $E8, $E9, $EA, $EB   ; 
- - - - - - 0x0039FB 00:B9EB: F8        .byte $F8, $F9, $FA, $FB   ; 
; AB 
- D 1 - I - 0x0039FF 00:B9EF: 30        .byte $30, $00, $30, $1E   ; 
- D 1 - I - 0x003A03 00:B9F3: 00        .byte $00, $00, $82, $00   ; 
- D 1 - I - 0x003A07 00:B9F7: 30        .byte $30, $00, $30, $82   ; 
- D 1 - I - 0x003A0B 00:B9FB: 00        .byte $00, $00, $00, $00   ; 
; AC 
- D 1 - I - 0x003A0F 00:B9FF: 3F        .byte $3F, $00, $3F, $00   ; 
- D 1 - I - 0x003A13 00:BA03: 65        .byte $65, $65, $65, $65   ; 
- D 1 - I - 0x003A17 00:BA07: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003A1B 00:BA0B: 4B        .byte $4B, $41, $41, $41   ; 
; AD 
- D 1 - I - 0x003A1F 00:BA0F: 3F        .byte $3F, $00, $5F, $40   ; 
- D 1 - I - 0x003A23 00:BA13: 65        .byte $65, $65, $65, $6B   ; 
- D 1 - I - 0x003A27 00:BA17: 41        .byte $41, $41, $41, $6E   ; 
- D 1 - I - 0x003A2B 00:BA1B: 41        .byte $41, $41, $41, $6F   ; 
; AE 
- D 1 - I - 0x003A2F 00:BA1F: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003A33 00:BA23: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003A37 00:BA27: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003A3B 00:BA2B: 40        .byte $40, $2A, $40, $40   ; 
; AF 
- D 1 - I - 0x003A3F 00:BA2F: 4B        .byte $4B, $41, $41, $41   ; 
- D 1 - I - 0x003A43 00:BA33: 4B        .byte $4B, $41, $41, $41   ; 
- D 1 - I - 0x003A47 00:BA37: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003A4B 00:BA3B: 4B        .byte $4B, $41, $41, $41   ; 
; B0 
- D 1 - I - 0x003A4F 00:BA3F: 41        .byte $41, $41, $4D, $50   ; 
- D 1 - I - 0x003A53 00:BA43: 41        .byte $41, $41, $74, $75   ; 
- D 1 - I - 0x003A57 00:BA47: 41        .byte $41, $4D, $4E, $40   ; 
- D 1 - I - 0x003A5B 00:BA4B: 41        .byte $41, $74, $78, $40   ; 
; B1 
- D 1 - I - 0x003A5F 00:BA4F: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003A63 00:BA53: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003A67 00:BA57: 4F        .byte $4F, $41, $41, $41   ; 
- D 1 - I - 0x003A6B 00:BA5B: 67        .byte $67, $41, $41, $41   ; 
; B2 
- D 1 - I - 0x003A6F 00:BA5F: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003A73 00:BA63: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003A77 00:BA67: 4D        .byte $4D, $2A, $40, $40   ; 
- D 1 - I - 0x003A7B 00:BA6B: 6F        .byte $6F, $2A, $40, $40   ; 
; B3 
- D 1 - I - 0x003A7F 00:BA6F: 4D        .byte $4D, $41, $50, $4F   ; 
- D 1 - I - 0x003A83 00:BA73: 79        .byte $79, $41, $75, $67   ; 
- D 1 - I - 0x003A87 00:BA77: 56        .byte $56, $4E, $4F, $41   ; 
- D 1 - I - 0x003A8B 00:BA7B: 56        .byte $56, $78, $67, $41   ; 
; B4 
- D 1 - I - 0x003A8F 00:BA7F: 41        .byte $41, $41, $41, $4D   ; 
- D 1 - I - 0x003A93 00:BA83: 41        .byte $41, $41, $41, $74   ; 
- D 1 - I - 0x003A97 00:BA87: 41        .byte $41, $41, $4D, $4E   ; 
- D 1 - I - 0x003A9B 00:BA8B: 41        .byte $41, $41, $79, $78   ; 
; B5 
- D 1 - I - 0x003A9F 00:BA8F: 50        .byte $50, $2A, $40, $40   ; 
- D 1 - I - 0x003AA3 00:BA93: 75        .byte $75, $2A, $40, $40   ; 
- D 1 - I - 0x003AA7 00:BA97: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003AAB 00:BA9B: 40        .byte $40, $2A, $40, $40   ; 
; B6 
- D 1 - I - 0x003AAF 00:BA9F: 27        .byte $27, $50, $28, $2F   ; 
- D 1 - I - 0x003AB3 00:BAA3: 56        .byte $56, $75, $2A, $2B   ; 
- D 1 - I - 0x003AB7 00:BAA7: 29        .byte $29, $40, $2A, $40   ; 
- D 1 - I - 0x003ABB 00:BAAB: 7C        .byte $7C, $40, $2A, $40   ; 
; B7 
- D 1 - I - 0x003ABF 00:BAAF: 2F        .byte $2F, $2F, $56, $50   ; 
- D 1 - I - 0x003AC3 00:BAB3: 41        .byte $41, $41, $56, $75   ; 
- D 1 - I - 0x003AC7 00:BAB7: 2B        .byte $2B, $41, $57, $40   ; 
- D 1 - I - 0x003ACB 00:BABB: 40        .byte $40, $2B, $7C, $40   ; 
; B8 
- D 1 - I - 0x003ACF 00:BABF: 2C        .byte $2C, $40, $2A, $40   ; 
- D 1 - I - 0x003AD3 00:BAC3: 2C        .byte $2C, $40, $2A, $40   ; 
- D 1 - I - 0x003AD7 00:BAC7: 2C        .byte $2C, $40, $2A, $40   ; 
- D 1 - I - 0x003ADB 00:BACB: 2C        .byte $2C, $40, $2A, $40   ; 
; B9 
- D 1 - I - 0x003ADF 00:BACF: 31        .byte $31, $40, $66, $40   ; 
- D 1 - I - 0x003AE3 00:BAD3: 40        .byte $40, $40, $2C, $40   ; 
- D 1 - I - 0x003AE7 00:BAD7: 31        .byte $31, $40, $66, $40   ; 
- D 1 - I - 0x003AEB 00:BADB: 40        .byte $40, $40, $2C, $40   ; 
; BA 
- D 1 - I - 0x003AEF 00:BADF: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003AF3 00:BAE3: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003AF7 00:BAE7: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003AFB 00:BAEB: 4F        .byte $4F, $24, $24, $24   ; 
; BB 
- D 1 - I - 0x003AFF 00:BAEF: 31        .byte $31, $40, $66, $40   ; 
- D 1 - I - 0x003B03 00:BAF3: 40        .byte $40, $40, $2C, $4F   ; 
- D 1 - I - 0x003B07 00:BAF7: 31        .byte $31, $40, $2C, $67   ; 
- D 1 - I - 0x003B0B 00:BAFB: 40        .byte $40, $40, $7F, $7D   ; 
; BC 
- D 1 - I - 0x003B0F 00:BAFF: 67        .byte $67, $41, $41, $41   ; 
- D 1 - I - 0x003B13 00:BB03: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003B17 00:BB07: 32        .byte $32, $41, $32, $41   ; 
- D 1 - I - 0x003B1B 00:BB0B: 7D        .byte $7D, $7D, $7D, $7D   ; 
; BD 
- D 1 - I - 0x003B1F 00:BB0F: 2C        .byte $2C, $40, $2A, $40   ; 
- D 1 - I - 0x003B23 00:BB13: 2C        .byte $2C, $40, $2A, $40   ; 
- D 1 - I - 0x003B27 00:BB17: 2C        .byte $2C, $40, $2A, $40   ; 
- D 1 - I - 0x003B2B 00:BB1B: 2C        .byte $2C, $4F, $24, $24   ; 
; BE 
- D 1 - I - 0x003B2F 00:BB1F: 31        .byte $31, $40, $2B, $41   ; 
- D 1 - I - 0x003B33 00:BB23: 40        .byte $40, $40, $40, $2B   ; 
- D 1 - I - 0x003B37 00:BB27: 31        .byte $31, $40, $31, $40   ; 
- D 1 - I - 0x003B3B 00:BB2B: 24        .byte $24, $24, $24, $24   ; 
; BF 
- D 1 - I - 0x003B3F 00:BB2F: 32        .byte $32, $41, $32, $41   ; 
- D 1 - I - 0x003B43 00:BB33: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003B47 00:BB37: 31        .byte $31, $40, $31, $40   ; 
- D 1 - I - 0x003B4B 00:BB3B: 24        .byte $24, $24, $24, $24   ; 
; C0 
- D 1 - I - 0x003B4F 00:BB3F: 2C        .byte $2C, $67, $32, $41   ; 
- D 1 - I - 0x003B53 00:BB43: 7F        .byte $7F, $7D, $7D, $7D   ; 
- - - - - - 0x003B57 00:BB47: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x003B5B 00:BB4B: 00        .byte $00, $00, $00, $00   ; 
; C1 
- D 1 - I - 0x003B5F 00:BB4F: 30        .byte $30, $00, $2D, $6D   ; 
- D 1 - I - 0x003B63 00:BB53: 00        .byte $00, $00, $00, $77   ; 
- D 1 - I - 0x003B67 00:BB57: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x003B6B 00:BB5B: 0C        .byte $0C, $00, $00, $00   ; 
; C2 
- D 1 - I - 0x003B6F 00:BB5F: 32        .byte $32, $41, $32, $41   ; 
- D 1 - I - 0x003B73 00:BB63: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003B77 00:BB67: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x003B7B 00:BB6B: 0C        .byte $0C, $00, $00, $00   ; 
; C3 
- D 1 - I - 0x003B7F 00:BB6F: 00        .byte $00, $00, $03, $03   ; 
- D 1 - I - 0x003B83 00:BB73: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003B87 00:BB77: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x003B8B 00:BB7B: 0C        .byte $0C, $00, $00, $00   ; 
; C4 
- D 1 - I - 0x003B8F 00:BB7F: 0B        .byte $0B, $03, $55, $40   ; 
- D 1 - I - 0x003B93 00:BB83: 0C        .byte $0C, $00, $73, $40   ; 
- D 1 - I - 0x003B97 00:BB87: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x003B9B 00:BB8B: 0C        .byte $0C, $00, $00, $00   ; 
; C5 
- D 1 - I - 0x003B9F 00:BB8F: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x003BA3 00:BB93: 0C        .byte $0C, $00, $00, $00   ; 
- D 1 - I - 0x003BA7 00:BB97: 0B        .byte $0B, $03, $03, $73   ; 
- D 1 - I - 0x003BAB 00:BB9B: 0C        .byte $0C, $00, $00, $55   ; 
; C6 
- D 1 - I - 0x003BAF 00:BB9F: 0B        .byte $0B, $03, $03, $55   ; 
- D 1 - I - 0x003BB3 00:BBA3: 0C        .byte $0C, $00, $00, $55   ; 
- D 1 - I - 0x003BB7 00:BBA7: 0B        .byte $0B, $03, $03, $73   ; 
- D 1 - I - 0x003BBB 00:BBAB: 0C        .byte $0C, $00, $73, $40   ; 
; C7 
- D 1 - I - 0x003BBF 00:BBAF: 06        .byte $06, $06, $06, $06   ; 
- D 1 - I - 0x003BC3 00:BBB3: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003BC7 00:BBB7: 07        .byte $07, $40, $07, $40   ; 
- D 1 - I - 0x003BCB 00:BBBB: 53        .byte $53, $53, $53, $53   ; 
; C8 
- D 1 - I - 0x003BCF 00:BBBF: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003BD3 00:BBC3: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003BD7 00:BBC7: 40        .byte $40, $40, $69, $49   ; 
- D 1 - I - 0x003BDB 00:BBCB: 40        .byte $40, $40, $69, $6C   ; 
; C9 
- D 1 - I - 0x003BDF 00:BBCF: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003BE3 00:BBD3: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003BE7 00:BBD7: 5F        .byte $5F, $2A, $40, $40   ; 
- D 1 - I - 0x003BEB 00:BBDB: 60        .byte $60, $2A, $40, $40   ; 
; CA 
- D 1 - I - 0x003BEF 00:BBDF: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003BF3 00:BBE3: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003BF7 00:BBE7: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003BFB 00:BBEB: 40        .byte $40, $40, $40, $40   ; 
; CB 
- D 1 - I - 0x003BFF 00:BBEF: 49        .byte $49, $00, $03, $03   ; 
- D 1 - I - 0x003C03 00:BBF3: 6C        .byte $6C, $00, $00, $00   ; 
- - - - - - 0x003C07 00:BBF7: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x003C0B 00:BBFB: 00        .byte $00, $00, $00, $00   ; 
; CC 
- D 1 - I - 0x003C0F 00:BBFF: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x003C13 00:BC03: 40        .byte $40, $40, $69, $41   ; 
- - - - - - 0x003C17 00:BC07: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x003C1B 00:BC0B: 00        .byte $00, $00, $00, $00   ; 
; CD 
- D 1 - I - 0x003C1F 00:BC0F: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003C23 00:BC13: 40        .byte $40, $2A, $40, $40   ; 
- - - - - - 0x003C27 00:BC17: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x003C2B 00:BC1B: 00        .byte $00, $00, $00, $00   ; 
; CE 
- D 1 - I - 0x003C2F 00:BC1F: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003C33 00:BC23: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003C37 00:BC27: 0B        .byte $0B, $03, $03, $03   ; 
- D 1 - I - 0x003C3B 00:BC2B: 0C        .byte $0C, $00, $00, $00   ; 
; CF 
- D 1 - I - 0x003C3F 00:BC2F: 0B        .byte $0B, $03, $3F, $5F   ; 
- D 1 - I - 0x003C43 00:BC33: 0C        .byte $0C, $00, $00, $60   ; 
- - - - - - 0x003C47 00:BC37: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x003C4B 00:BC3B: 00        .byte $00, $00, $00, $00   ; 
; D0 
- D 1 - I - 0x003C4F 00:BC3F: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003C53 00:BC43: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003C57 00:BC47: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003C5B 00:BC4B: 08        .byte $08, $08, $08, $08   ; 
; D1 
- D 1 - I - 0x003C5F 00:BC4F: 66        .byte $66, $40, $67, $41   ; 
- D 1 - I - 0x003C63 00:BC53: 66        .byte $66, $4F, $41, $41   ; 
- D 1 - I - 0x003C67 00:BC57: 66        .byte $66, $67, $41, $41   ; 
- D 1 - I - 0x003C6B 00:BC5B: 7F        .byte $7F, $7D, $7D, $7D   ; 
; D2 
- D 1 - I - 0x003C6F 00:BC5F: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003C73 00:BC63: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003C77 00:BC67: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003C7B 00:BC6B: 7D        .byte $7D, $7D, $7D, $7D   ; 
; D3 
- D 1 - I - 0x003C7F 00:BC6F: 41        .byte $41, $26, $41, $7A   ; 
- D 1 - I - 0x003C83 00:BC73: 41        .byte $41, $41, $4A, $7A   ; 
- D 1 - I - 0x003C87 00:BC77: 41        .byte $41, $41, $80, $7A   ; 
- D 1 - I - 0x003C8B 00:BC7B: 7D        .byte $7D, $7D, $7D, $7E   ; 
; D4 
- D 1 - I - 0x003C8F 00:BC7F: 88        .byte $88, $89, $8A, $8B   ; 
- D 1 - I - 0x003C93 00:BC83: 13        .byte $13, $8D, $14, $8E   ; 
- D 1 - I - 0x003C97 00:BC87: 8F        .byte $8F, $BE, $BF, $91   ; 
- D 1 - I - 0x003C9B 00:BC8B: 16        .byte $16, $C0, $17, $94   ; 
; D5 
- D 1 - I - 0x003C9F 00:BC8F: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003CA3 00:BC93: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003CA7 00:BC97: 03        .byte $03, $03, $03, $03   ; 
- D 1 - I - 0x003CAB 00:BC9B: 00        .byte $00, $00, $00, $00   ; 
; D6 
- D 1 - I - 0x003CAF 00:BC9F: 0F        .byte $0F, $32, $0F, $32   ; 
- D 1 - I - 0x003CB3 00:BCA3: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003CB7 00:BCA7: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003CBB 00:BCAB: 00        .byte $00, $00, $00, $00   ; 
; D7 
- D 1 - I - 0x003CBF 00:BCAF: 40        .byte $40, $40, $40, $40   ; 
- D 1 - I - 0x003CC3 00:BCB3: 24        .byte $24, $24, $24, $24   ; 
- D 1 - I - 0x003CC7 00:BCB7: 41        .byte $41, $41, $41, $41   ; 
- D 1 - I - 0x003CCB 00:BCBB: 41        .byte $41, $41, $41, $41   ; 
; D8 
- D 1 - I - 0x003CCF 00:BCBF: 40        .byte $40, $40, $69, $68   ; 
- D 1 - I - 0x003CD3 00:BCC3: 40        .byte $40, $40, $69, $6C   ; 
- D 1 - I - 0x003CD7 00:BCC7: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x003CDB 00:BCCB: 40        .byte $40, $40, $69, $41   ; 
; D9 
- D 1 - I - 0x003CDF 00:BCCF: 0F        .byte $0F, $32, $0F, $32   ; 
- D 1 - I - 0x003CE3 00:BCD3: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003CE7 00:BCD7: 49        .byte $49, $00, $00, $00   ; 
- D 1 - I - 0x003CEB 00:BCDB: 5D        .byte $5D, $00, $00, $00   ; 
; DA 
- D 1 - I - 0x003CEF 00:BCDF: 0F        .byte $0F, $32, $0F, $32   ; 
- D 1 - I - 0x003CF3 00:BCE3: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003CF7 00:BCE7: 00        .byte $00, $00, $3F, $5F   ; 
- D 1 - I - 0x003CFB 00:BCEB: 00        .byte $00, $00, $00, $60   ; 
; DB 
- D 1 - I - 0x003CFF 00:BCEF: 6E        .byte $6E, $2A, $40, $40   ; 
- D 1 - I - 0x003D03 00:BCF3: 60        .byte $60, $2A, $40, $40   ; 
- D 1 - I - 0x003D07 00:BCF7: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003D0B 00:BCFB: 40        .byte $40, $2A, $40, $40   ; 
; DC 
- D 1 - I - 0x003D0F 00:BCFF: 40        .byte $40, $40, $69, $41   ; 
- D 1 - I - 0x003D13 00:BD03: 24        .byte $24, $24, $24, $4A   ; 
- D 1 - I - 0x003D17 00:BD07: 41        .byte $41, $41, $41, $26   ; 
- D 1 - I - 0x003D1B 00:BD0B: 41        .byte $41, $41, $41, $41   ; 
; DD 
- D 1 - I - 0x003D1F 00:BD0F: 41        .byte $41, $49, $00, $00   ; 
- D 1 - I - 0x003D23 00:BD13: 41        .byte $41, $5D, $00, $00   ; 
- D 1 - I - 0x003D27 00:BD17: 41        .byte $41, $41, $49, $00   ; 
- D 1 - I - 0x003D2B 00:BD1B: 4A        .byte $4A, $41, $5D, $00   ; 
; DE 
- D 1 - I - 0x003D2F 00:BD1F: 00        .byte $00, $00, $5F, $40   ; 
- D 1 - I - 0x003D33 00:BD23: 00        .byte $00, $00, $60, $40   ; 
- D 1 - I - 0x003D37 00:BD27: 3F        .byte $3F, $5F, $40, $40   ; 
- D 1 - I - 0x003D3B 00:BD2B: 00        .byte $00, $60, $40, $4F   ; 
; DF 
- D 1 - I - 0x003D3F 00:BD2F: 40        .byte $40, $2A, $40, $40   ; 
- D 1 - I - 0x003D43 00:BD33: 4F        .byte $4F, $24, $24, $24   ; 
- D 1 - I - 0x003D47 00:BD37: 67        .byte $67, $41, $41, $41   ; 
- D 1 - I - 0x003D4B 00:BD3B: 41        .byte $41, $41, $41, $41   ; 
; E0 
- D 1 - I - 0x003D4F 00:BD3F: 5E        .byte $5E, $41, $41, $49   ; 
- D 1 - I - 0x003D53 00:BD43: 41        .byte $41, $4A, $41, $76   ; 
- - - - - - 0x003D57 00:BD47: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x003D5B 00:BD4B: 00        .byte $00, $00, $00, $00   ; 
; E1 
- D 1 - I - 0x003D5F 00:BD4F: 5F        .byte $5F, $40, $40, $67   ; 
- D 1 - I - 0x003D63 00:BD53: 81        .byte $81, $40, $4F, $41   ; 
- - - - - - 0x003D67 00:BD57: 00        .byte $00, $00, $00, $00   ; 
- - - - - - 0x003D6B 00:BD5B: 00        .byte $00, $00, $00, $00   ; 
; E2 
- D 1 - I - 0x003D6F 00:BD5F: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003D73 00:BD63: 08        .byte $08, $08, $82, $83   ; 
- D 1 - I - 0x003D77 00:BD67: 86        .byte $86, $87, $88, $89   ; 
- D 1 - I - 0x003D7B 00:BD6B: 8F        .byte $8F, $90, $91, $92   ; 
; E3 
- D 1 - I - 0x003D7F 00:BD6F: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003D83 00:BD73: 84        .byte $84, $85, $08, $08   ; 
- D 1 - I - 0x003D87 00:BD77: 8A        .byte $8A, $8B, $8C, $86   ; 
- D 1 - I - 0x003D8B 00:BD7B: 93        .byte $93, $94, $95, $96   ; 
; E4 
- D 1 - I - 0x003D8F 00:BD7F: 08        .byte $08, $08, $98, $99   ; 
- D 1 - I - 0x003D93 00:BD83: 08        .byte $08, $08, $A3, $A4   ; 
- D 1 - I - 0x003D97 00:BD87: 08        .byte $08, $08, $AD, $AE   ; 
- D 1 - I - 0x003D9B 00:BD8B: 08        .byte $08, $08, $B4, $B5   ; 
; E5 
- D 1 - I - 0x003D9F 00:BD8F: 9A        .byte $9A, $9B, $9C, $9D   ; 
- D 1 - I - 0x003DA3 00:BD93: A5        .byte $A5, $A6, $A7, $00   ; 
- D 1 - I - 0x003DA7 00:BD97: AF        .byte $AF, $B0, $B1, $B2   ; 
- D 1 - I - 0x003DAB 00:BD9B: B6        .byte $B6, $B5, $B7, $B8   ; 
; E6 
- D 1 - I - 0x003DAF 00:BD9F: 9E        .byte $9E, $9F, $A0, $9A   ; 
- D 1 - I - 0x003DB3 00:BDA3: 00        .byte $00, $A8, $A9, $A5   ; 
- D 1 - I - 0x003DB7 00:BDA7: B2        .byte $B2, $B1, $AE, $AF   ; 
- D 1 - I - 0x003DBB 00:BDAB: B8        .byte $B8, $B9, $B5, $B6   ; 
; E7 
- D 1 - I - 0x003DBF 00:BDAF: A1        .byte $A1, $A2, $AC, $08   ; 
- D 1 - I - 0x003DC3 00:BDB3: AA        .byte $AA, $AB, $00, $08   ; 
- D 1 - I - 0x003DC7 00:BDB7: B0        .byte $B0, $B3, $00, $08   ; 
- D 1 - I - 0x003DCB 00:BDBB: B5        .byte $B5, $BA, $00, $08   ; 
; E8 
- D 1 - I - 0x003DCF 00:BDBF: 08        .byte $08, $08, $BB, $A7   ; 
- D 1 - I - 0x003DD3 00:BDC3: 08        .byte $08, $08, $C1, $B1   ; 
- D 1 - I - 0x003DD7 00:BDC7: 08        .byte $08, $08, $C6, $C7   ; 
- D 1 - I - 0x003DDB 00:BDCB: 08        .byte $08, $08, $CD, $CE   ; 
; E9 
- D 1 - I - 0x003DDF 00:BDCF: BC        .byte $BC, $A8, $BD, $BE   ; 
- D 1 - I - 0x003DE3 00:BDD3: 00        .byte $00, $B1, $C2, $C3   ; 
- D 1 - I - 0x003DE7 00:BDD7: C8        .byte $C8, $C7, $C9, $CA   ; 
- D 1 - I - 0x003DEB 00:BDDB: CF        .byte $CF, $D0, $D1, $D2   ; 
; EA 
- D 1 - I - 0x003DEF 00:BDDF: BE        .byte $BE, $BF, $A7, $BC   ; 
- D 1 - I - 0x003DF3 00:BDE3: C3        .byte $C3, $C4, $B1, $00   ; 
- D 1 - I - 0x003DF7 00:BDE7: CA        .byte $CA, $CB, $C7, $C8   ; 
- D 1 - I - 0x003DFB 00:BDEB: D2        .byte $D2, $D1, $D0, $CF   ; 
; EB 
- D 1 - I - 0x003DFF 00:BDEF: A8        .byte $A8, $C0, $00, $08   ; 
- D 1 - I - 0x003E03 00:BDF3: B1        .byte $B1, $C5, $00, $08   ; 
- D 1 - I - 0x003E07 00:BDF7: C7        .byte $C7, $CC, $00, $08   ; 
- D 1 - I - 0x003E0B 00:BDFB: D3        .byte $D3, $D4, $00, $08   ; 
; EC 
- D 1 - I - 0x003E0F 00:BDFF: 08        .byte $08, $08, $D5, $D6   ; 
- D 1 - I - 0x003E13 00:BE03: 08        .byte $08, $08, $DE, $DF   ; 
- D 1 - I - 0x003E17 00:BE07: 08        .byte $08, $08, $00, $00   ; 
- D 1 - I - 0x003E1B 00:BE0B: 08        .byte $08, $08, $08, $08   ; 
; ED 
- D 1 - I - 0x003E1F 00:BE0F: F3        .byte $F3, $D8, $D9, $DA   ; 
- D 1 - I - 0x003E23 00:BE13: E0        .byte $E0, $E0, $E1, $E2   ; 
- D 1 - I - 0x003E27 00:BE17: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003E2B 00:BE1B: 08        .byte $08, $08, $08, $08   ; 
; EE 
- D 1 - I - 0x003E2F 00:BE1F: DA        .byte $DA, $D9, $DB, $F3   ; 
- D 1 - I - 0x003E33 00:BE23: E2        .byte $E2, $E1, $E0, $E0   ; 
- D 1 - I - 0x003E37 00:BE27: 00        .byte $00, $00, $00, $00   ; 
- D 1 - I - 0x003E3B 00:BE2B: 08        .byte $08, $08, $08, $08   ; 
; EF 
- D 1 - I - 0x003E3F 00:BE2F: DC        .byte $DC, $DD, $00, $08   ; 
- D 1 - I - 0x003E43 00:BE33: E3        .byte $E3, $E4, $00, $08   ; 
- D 1 - I - 0x003E47 00:BE37: 00        .byte $00, $00, $00, $08   ; 
- D 1 - I - 0x003E4B 00:BE3B: 08        .byte $08, $08, $08, $08   ; 
; F0 
- D 1 - I - 0x003E4F 00:BE3F: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003E53 00:BE43: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003E57 00:BE47: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003E5B 00:BE4B: 08        .byte $08, $08, $8D, $8E   ; 
; F1 
- D 1 - I - 0x003E5F 00:BE4F: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003E63 00:BE53: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003E67 00:BE57: 08        .byte $08, $08, $08, $08   ; 
- D 1 - I - 0x003E6B 00:BE5B: 8E        .byte $8E, $97, $08, $08   ; 
; F2 
- - - - - - 0x003E6F 00:BE5F: 88        .byte $88, $89, $8A, $8B   ; 
- - - - - - 0x003E73 00:BE63: EB        .byte $EB, $EC, $ED, $EE   ; 
- - - - - - 0x003E77 00:BE67: 00        .byte $00, $EF, $EF, $F0   ; 
- - - - - - 0x003E7B 00:BE6B: EA        .byte $EA, $00, $00, $F1   ; 
; F3 
- - - - - - 0x003E7F 00:BE6F: AD        .byte $AD, $E5, $E6, $E7   ; 
- - - - - - 0x003E83 00:BE73: B4        .byte $B4, $E8, $E9, $E8   ; 
- - - - - - 0x003E87 00:BE77: BB        .byte $BB, $EA, $00, $F1   ; 
- - - - - - 0x003E8B 00:BE7B: C1        .byte $C1, $F2, $00, $F2   ; 
; F4 
- - - - - - 0x003E8F 00:BE7F: E5        .byte $E5, $E6, $E7, $B3   ; 
- - - - - - 0x003E93 00:BE83: E8        .byte $E8, $E9, $E8, $BA   ; 
- - - - - - 0x003E97 00:BE87: EA        .byte $EA, $00, $F1, $C0   ; 
- - - - - - 0x003E9B 00:BE8B: F2        .byte $F2, $00, $F2, $C5   ; 



_off007_0x003E9F_01_area_2:
;                                              00   01   02   03   04   05   06   07   08   09   0A   0B   0C   0D   0E   0F
- D 1 - I - 0x003E9F 00:BE8F: 00        .byte $00, $AA, $BE, $AA, $00, $8A, $AA, $AA, $00, $08, $AA, $00, $AA, $00, $AA, $00   ; 00
- D 1 - I - 0x003EAF 00:BE9F: 00        .byte $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $AA   ; 10
- D 1 - I - 0x003EBF 00:BEAF: 00        .byte $00, $08, $0A, $EA, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00, $00   ; 20
- D 1 - I - 0x003ECF 00:BEBF: AA        .byte $AA, $08, $AA, $AB, $00, $40, $0A, $AA, $00, $95, $AA, $AA, $A0, $A9, $AA, $AA   ; 30
- D 1 - I - 0x003EDF 00:BECF: 55        .byte $55, $D1, $F0, $F0, $74, $DD, $FF, $FF, $77, $55, $55, $55, $AA, $AA, $AA, $55   ; 40
- D 1 - I - 0x003EEF 00:BEDF: 56        .byte $56, $AA, $AA, $A9, $AA, $55, $55, $AA, $AA, $66, $99, $AA, $AA, $AA, $AA, $AA   ; 50
- D 1 - I - 0x003EFF 00:BEEF: 65        .byte $65, $A5, $95, $55, $55, $F0, $F0, $FF, $FF, $FF, $FF, $AA, $55, $55, $AA, $AA   ; 60
- D 1 - I - 0x003F0F 00:BEFF: AA        .byte $AA, $AA, $AA, $AA, $AA, $AA, $0A, $0A, $AA, $AA, $00, $00, $AA, $AA, $AA, $AA   ; 70
- D 1 - I - 0x003F1F 00:BF0F: AA        .byte $AA, $AA, $AA, $0A, $A5, $A5, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA   ; 80
- D 1 - I - 0x003F2F 00:BF1F: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $AA, $AA, $AA, $AA, $AA, $AA, $AA   ; 90
- D 1 - I - 0x003F3F 00:BF2F: AA        .byte $AA, $AA, $AA, $AA, $00, $AA, $AA, $AA, $AA, $AA, $AA, $00, $AA, $AA, $AA, $AA   ; A0
- D 1 - I - 0x003F4F 00:BF3F: AA        .byte $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA   ; B0
- D 1 - I - 0x003F5F 00:BF4F: FE        .byte $FE, $5A, $5A, $55, $55, $55, $55, $AA, $A5, $A5, $A5, $56, $AA, $AA, $55, $59   ; C0
- D 1 - I - 0x003F6F 00:BF5F: 55        .byte $55, $AA, $AA, $AA, $FF, $55, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA, $AA   ; D0
- D 1 - I - 0x003F7F 00:BF6F: FA        .byte $FA, $FA, $35, $C5, $19, $8A, $2A, $46, $99, $AA, $AA, $66, $59, $5A, $5A, $56   ; E0
- D 1 - I - 0x003F8F 00:BF7F: 55        .byte $55, $55, $A0, $A0, $A0                                                          ; F0






.out .sprintf("Free bytes in bank 30: %Xh [%d]", ($BFFF - *), ($BFFF - *))

.segment "BANK_30b"
- D 1 - - - 0x00400F 00:BFFF: 31        .byte con_prg_bank + $31   ; 



