.segment "BANK_2B"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000 ; for listing file
; 0x016010-0x01800F

.export _off001_0x00B586_0A_вращающаяся_пушка
.export _off001_0x00B6E1_0B_скрытая_пушка_уровень_5
.export _off001_0x004011_11_скрытая_пушка_уровень_1
.export _off001_0x014B91_16_движущиеся_пушка
.export _off001_0x004CEA_18_скрытая_пушка_уровень_3
.export _off001_0x004DFF_19_гаубица
.export _off001_0x0100BD_23_скрытая_пушка_2_уровень_5
.export _off001_0x0141FE_46_круглая_турель
.export _off001_0x010881_48_большая_пасть
.export _off001_0x010B24_49_спавнер_большой_пасти
.export _off001_0x010C55_4A_вращающийся_большой_череп
.export _off001_0x010ED2_15_ползающие_синии_пауки
.export _off001_0x014DF0_22_двойные_летающие_шарики
.export _off001_0x0154F3_55_голубой_летающий_шарик
.export _off001_0x0155C1_56_спавнер_голубых_летающих_шариков
.export _off001_0x01510E_20_движущийся_камень
.export _off001_0x008011_35_пасть_автоспавнер_летающих_шипов
.export _off001_0x008138_36_летающий_шип
.export _off001_0x0081B1_1B_летающий_круглый_эмбрион
.export _off001_0x008216_37_пушечный_череп
.export _off001_0x008959_2B_мутант_с_двумя_пастями
.export _off001_0x008AD4_2D_кокан_с_лицехватами
.export _off001_0x008BB0_2E_лицехват

; bzk this byte must be placed at 8000
    .byte con_prg_bank + $2B   ; 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B586_0A_вращающаяся_пушка:
- D 1 - I - 0x007596 01:B586: 96 B5     .word ofs_038_0A_B596_01_активация_объекта ; 
- D 1 - I - 0x007598 01:B588: BD B5     .word ofs_038_0A_B5BD_02 ; 
- D 1 - I - 0x00759A 01:B58A: CC B5     .word ofs_038_0A_B5CC_03 ; 
- D 1 - I - 0x00759C 01:B58C: 07 B6     .word ofs_038_0A_B607_04 ; 
- D 1 - I - 0x00759E 01:B58E: 3A B6     .word ofs_038_0A_B63A_05 ; 
- D 1 - I - 0x0075A0 01:B590: 52 B6     .word ofs_038_0A_B652_06 ; 
- D 1 - I - 0x0075A2 01:B592: FD A2     .word ofs_038_0A_0x00630D_07_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x0075A4 01:B594: 3D A3     .word ofs_038_0A_0x00628A_08_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_0A_B596_01_активация_объекта:
C - - J - - 0x0075A6 01:B596: A9 01     LDA #$01
C - - - - - 0x0075A8 01:B598: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0075AB 01:B59B: A9 07     LDA #$07
C - - - - - 0x0075AD 01:B59D: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x0075B0 01:B5A0: A9 04     LDA #$04    ; Y axis
C - - - - - 0x0075B4 01:B5A4: 20 B9 AA  JSR sub_0x00AAB9_сдвинуть_объект_по_Y_X
C - - - - - 0x0075B7 01:B5A7: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0075BA 01:B5AA: 29 03     AND #$03
C - - - - - 0x0075BC 01:B5AC: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0075BF 01:B5AF: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x0075C2 01:B5B2: A9 03     LDA #$03
C - - - - - 0x0075C4 01:B5B4: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0075C7 01:B5B7: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0075CA 01:B5BA: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0A_B5BD_02:
C - - J - - 0x0075CD 01:B5BD: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0075D0 01:B5C0: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0075D3 01:B5C3: C9 18     CMP #$18
C - - - - - 0x0075D5 01:B5C5: 90 3F     BCC bra_B606_RTS
C - - - - - 0x0075D7 01:B5C7: A9 08     LDA #$08    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0A_B5CC_03:
C - - J - - 0x0075DC 01:B5CC: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0075DF 01:B5CF: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0075E2 01:B5D2: 29 08     AND #$08
C - - - - - 0x0075E4 01:B5D4: F0 1E     BEQ bra_B5F4
C - - - - - 0x0075E6 01:B5D6: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0075E9 01:B5D9: D0 2B     BNE bra_B606_RTS
C - - - - - 0x0075EB 01:B5DB: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0075EE 01:B5DE: B9 D1 B6  LDA tbl_B6D1,Y
C - - - - - 0x0075F1 01:B5E1: 20 9A A8  JSR sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер
C - - - - - 0x0075F4 01:B5E4: A9 01     LDA #$01
C - - - - - 0x0075F6 01:B5E6: B0 1B     BCS bra_B603
C - - - - - 0x0075F8 01:B5E8: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0075FB 01:B5EB: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0075FE 01:B5EE: C9 03     CMP #$03
C - - - - - 0x007600 01:B5F0: A9 0C     LDA #$0C
C - - - - - 0x007602 01:B5F2: 90 0F     BCC bra_B603
bra_B5F4:
C - - - - - 0x007604 01:B5F4: A9 01     LDA #$01
C - - - - - 0x007606 01:B5F6: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x007609 01:B5F9: A9 04     LDA #$04
C - - - - - 0x00760B 01:B5FB: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x00760E 01:B5FE: A9 20     LDA #$20    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_B603:
C - - - - - 0x007613 01:B603: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_B606_RTS:
C - - - - - 0x007616 01:B606: 60        RTS

tbl_B6D1:
- D 1 - - - 0x0076E1 01:B6D1: 0F        .byte $0F   ; 00 
- D 1 - - - 0x0076E2 01:B6D2: 10        .byte $10   ; 01 
- D 1 - - - 0x0076E3 01:B6D3: 01        .byte $01   ; 02 

; ******************************************************************************************************************

ofs_038_0A_B607_04:
C - - J - - 0x007617 01:B607: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00761A 01:B60A: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00761D 01:B60D: C0 18     CPY #$18
C - - - - - 0x00761F 01:B60F: 90 F5     BCC bra_B606_RTS
C - - - - - 0x007621 01:B611: C0 D8     CPY #$D8
C - - - - - 0x007623 01:B613: B0 22     BCS bra_B637
C - - - - - 0x007625 01:B615: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x007628 01:B618: 29 10     AND #$10
C - - - - - 0x00762A 01:B61A: F0 04     BEQ bra_B620
C - - - - - 0x00762C 01:B61C: C0 A0     CPY #$A0
C - - - - - 0x00762E 01:B61E: B0 17     BCS bra_B637
bra_B620:
C - - - - - 0x007630 01:B620: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x007633 01:B623: 84 12     STY ram_0012
C - - - - - 0x007635 01:B625: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x007638 01:B628: D0 35     BNE bra_B65F
C - - - - - 0x00763A 01:B62A: A9 14     LDA #$14
C - - - - - 0x00763C 01:B62C: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x00763F 01:B62F: 20 AB F4  JSR sub_0x01F4BB
C - - - - - 0x007642 01:B632: B0 33     BCS bra_B667
C - - - - - 0x007644 01:B634: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_B637:
C - - - - - 0x007647 01:B637: 4C 75 A2  JMP loc_0x00628A_удалить_объект

; ******************************************************************************************************************

ofs_038_0A_B63A_05:
C - - J - - 0x00764A 01:B63A: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00764D 01:B63D: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007650 01:B640: C9 18     CMP #$18
C - - - - - 0x007652 01:B642: 90 C2     BCC bra_B606_RTS
C - - - - - 0x007654 01:B644: C9 C0     CMP #$C0
C - - - - - 0x007656 01:B646: B0 BE     BCS bra_B606_RTS
C - - - - - 0x007658 01:B648: 20 C8 B6  JSR sub_B6C8
C - - - - - 0x00765B 01:B64B: B0 44     BCS bra_B691_RTS
C - - - - - 0x00765D 01:B64D: A9 04     LDA #$04
C - - - - - 0x00765F 01:B64F: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0A_B652_06:
C - - J - - 0x007662 01:B652: A0 0C     LDY #$0C
C - - - - - 0x007664 01:B654: 20 CB B6  JSR sub_B6CB
C - - - - - 0x007667 01:B657: B0 03     BCS bra_B65C
C - - - - - 0x007669 01:B659: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта
bra_B65C:
C - - - - - 0x00766C 01:B65C: 4C B7 A6  JMP sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
bra_B65F:
C - - - - - 0x00766F 01:B65F: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x007672 01:B662: 20 EC F4  JSR sub_0x01F4FC
C - - - - - 0x007675 01:B665: 10 2A     BPL bra_B691_RTS
bra_B667:
C - - - - - 0x007677 01:B667: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x00767A 01:B66A: D0 25     BNE bra_B691_RTS
C - - - - - 0x00767C 01:B66C: A4 12     LDY ram_0012
C - - - - - 0x00767E 01:B66E: 84 0A     STY ram_000A
C - - - - - 0x007680 01:B670: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x007683 01:B673: A0 02     LDY #$02
C - - - - - 0x007685 01:B675: 20 27 F3  JSR sub_0x01F337
C - - - - - 0x007688 01:B678: 20 92 B6  JSR sub_B692
C - - - - - 0x00768B 01:B67B: A9 10     LDA #$10
C - - - - - 0x00768D 01:B67D: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x007690 01:B680: D0 0C     BNE bra_B68E
C - - - - - 0x007692 01:B682: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x007695 01:B685: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x007698 01:B688: A5 23     LDA ram_рандом_байт
C - - - - - 0x00769A 01:B68A: 29 0F     AND #$0F
C - - - - - 0x00769C 01:B68C: 69 47     ADC #$47
bra_B68E:
C - - - - - 0x00769E 01:B68E: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_B691_RTS:
C - - - - - 0x0076A1 01:B691: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_B692:
C - - - - - 0x0076A2 01:B692: D0 1B     BNE bra_B6AF_RTS
C - - - - - 0x0076A4 01:B694: BC 48 07  LDY ram_скролл_объекта_Y,X
C - - - - - 0x0076A7 01:B697: A6 11     LDX ram_0011
C - - - - - 0x0076A9 01:B699: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0076AC 01:B69C: 18        CLC
C - - - - - 0x0076AD 01:B69D: 79 B0 B6  ADC tbl_B6B0_позиция_Y,Y
C - - - - - 0x0076B0 01:B6A0: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0076B3 01:B6A3: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0076B6 01:B6A6: 18        CLC
C - - - - - 0x0076B7 01:B6A7: 79 BC B6  ADC tbl_B6BC_позиция_X,Y
C - - - - - 0x0076BA 01:B6AA: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0076BD 01:B6AD: A6 10     LDX ram_0010
bra_B6AF_RTS:
C - - - - - 0x0076BF 01:B6AF: 60        RTS

tbl_B6B0_позиция_Y:
- D 1 - - - 0x0076C0 01:B6B0: 00        .byte $00   ; 00 
- D 1 - - - 0x0076C1 01:B6B1: 07        .byte $07   ; 01 
- D 1 - - - 0x0076C2 01:B6B2: 0E        .byte $0E   ; 02 
- D 1 - - - 0x0076C3 01:B6B3: 10        .byte $10   ; 03 
- D 1 - - - 0x0076C4 01:B6B4: 0E        .byte $0E   ; 04 
- D 1 - - - 0x0076C5 01:B6B5: 07        .byte $07   ; 05 
- D 1 - - - 0x0076C6 01:B6B6: 00        .byte $00   ; 06 
- D 1 - - - 0x0076C7 01:B6B7: F9        .byte $F9   ; 07 
- - - - - - 0x0076C8 01:B6B8: F2        .byte $F2   ; 08 
- D 1 - - - 0x0076C9 01:B6B9: F0        .byte $F0   ; 09 
- D 1 - - - 0x0076CA 01:B6BA: F2        .byte $F2   ; 0A 
- D 1 - - - 0x0076CB 01:B6BB: F9        .byte $F9   ; 0B 

tbl_B6BC_позиция_X:
- D 1 - - - 0x0076CC 01:B6BC: 10        .byte $10   ; 00 
- D 1 - - - 0x0076CD 01:B6BD: 0E        .byte $0E   ; 01 
- D 1 - - - 0x0076CE 01:B6BE: 07        .byte $07   ; 02 
- D 1 - - - 0x0076CF 01:B6BF: 00        .byte $00   ; 03 
- D 1 - - - 0x0076D0 01:B6C0: F9        .byte $F9   ; 04 
- D 1 - - - 0x0076D1 01:B6C1: F2        .byte $F2   ; 05 
- D 1 - - - 0x0076D2 01:B6C2: F0        .byte $F0   ; 06 
- D 1 - - - 0x0076D3 01:B6C3: F2        .byte $F2   ; 07 
- - - - - - 0x0076D4 01:B6C4: F9        .byte $F9   ; 08 
- D 1 - - - 0x0076D5 01:B6C5: 00        .byte $00   ; 09 
- D 1 - - - 0x0076D6 01:B6C6: 07        .byte $07   ; 0A 
- D 1 - - - 0x0076D7 01:B6C7: 0E        .byte $0E   ; 0B 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_B6C8:
C - - - - - 0x0076D8 01:B6C8: BC 48 07  LDY ram_скролл_объекта_Y,X
sub_B6CB:
C - - - - - 0x0076DB 01:B6CB: B9 D4 B6  LDA tbl_B6D4,Y
C - - - - - 0x0076DE 01:B6CE: 4C 9A A8  JMP sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер

tbl_B6D4:
- D 1 - - - 0x0076E4 01:B6D4: 0A        .byte $0A   ; 00 
- D 1 - - - 0x0076E5 01:B6D5: 0B        .byte $0B   ; 01 
- D 1 - - - 0x0076E6 01:B6D6: 0C        .byte $0C   ; 02 
- D 1 - - - 0x0076E7 01:B6D7: 01        .byte $01   ; 03 
- D 1 - - - 0x0076E8 01:B6D8: 02        .byte $02   ; 04 
- D 1 - - - 0x0076E9 01:B6D9: 03        .byte $03   ; 05 
- D 1 - - - 0x0076EA 01:B6DA: 04        .byte $04   ; 06 
- D 1 - - - 0x0076EB 01:B6DB: 05        .byte $05   ; 07 
- D 1 - - - 0x0076EC 01:B6DC: 06        .byte $06   ; 08 
- D 1 - - - 0x0076ED 01:B6DD: 07        .byte $07   ; 09 
- D 1 - - - 0x0076EE 01:B6DE: 08        .byte $08   ; 0A 
- D 1 - - - 0x0076EF 01:B6DF: 09        .byte $09   ; 0B 
- D 1 - - - 0x0076F0 01:B6E0: 0D        .byte $0D   ; 0C 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00B6E1_0B_скрытая_пушка_уровень_5:
- D 1 - I - 0x0076F1 01:B6E1: F1 B6     .word ofs_038_0B_B6F1_01 ; 
- D 1 - I - 0x0076F3 01:B6E3: 1D B7     .word ofs_038_0B_B71D_02 ; 
- D 1 - I - 0x0076F5 01:B6E5: 50 B7     .word ofs_038_0B_B750_03 ; 
- D 1 - I - 0x0076F7 01:B6E7: 97 B7     .word ofs_038_0B_B797_04 ; 
- D 1 - I - 0x0076F9 01:B6E9: F2 B7     .word ofs_038_0B_B7F2_05 ; 
- D 1 - I - 0x0076FB 01:B6EB: 10 B8     .word ofs_038_0B_B810_06 ; 
- D 1 - I - 0x0076FD 01:B6ED: FD A2     .word ofs_038_0B_0x00630D_07_обработка_анимации_взрыва_объекта ; 
- D 1 - I - 0x0076FF 01:B6EF: 3D A3     .word ofs_038_0B_0x00628A_08_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_0B_B6F1_01:
C - - J - - 0x007701 01:B6F1: A9 08     LDA #$08
C - - - - - 0x007703 01:B6F3: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x007706 01:B6F6: A9 81     LDA #$81
C - - - - - 0x007708 01:B6F8: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00770B 01:B6FB: A9 04     LDA #$04    ; Y axis
C - - - - - 0x00770F 01:B6FF: 20 B9 AA  JSR sub_0x00AAB9_сдвинуть_объект_по_Y_X
C - - - - - 0x007712 01:B702: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x007715 01:B705: 4A        LSR
C - - - - - 0x007716 01:B706: 29 03     AND #$03
C - - - - - 0x007718 01:B708: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x00771B 01:B70B: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x00771E 01:B70E: A9 00     LDA #$00
C - - - - - 0x007720 01:B710: 90 02     BCC bra_B714
C - - - - - 0x007722 01:B712: A9 06     LDA #$06
bra_B714:
C - - - - - 0x007724 01:B714: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x007727 01:B717: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00772A 01:B71A: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_0B_B71D_02:
C - - J - - 0x00772D 01:B71D: A9 01     LDA #$01
C - - - - - 0x00772F 01:B71F: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x007732 01:B722: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007735 01:B725: 20 DB AA  JSR sub_AADB
C - - - - - 0x007738 01:B728: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00773B 01:B72B: 38        SEC
C - - - - - 0x00773C 01:B72C: F9 4C 05  SBC ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x00773F 01:B72F: B0 04     BCS bra_B735
C - - - - - 0x007741 01:B731: 49 FF     EOR #$FF
C - - - - - 0x007743 01:B733: 69 01     ADC #$01
bra_B735:
C - - - - - 0x007745 01:B735: C9 60     CMP #$60
C - - - - - 0x007747 01:B737: B0 16     BCS bra_B74F_RTS
C - - - - - 0x007749 01:B739: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00774C 01:B73C: 38        SEC
C - - - - - 0x00774D 01:B73D: F9 32 05  SBC ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x007750 01:B740: B0 04     BCS bra_B746
C - - - - - 0x007752 01:B742: 49 FF     EOR #$FF
C - - - - - 0x007754 01:B744: 69 01     ADC #$01
bra_B746:
C - - - - - 0x007756 01:B746: C9 28     CMP #$28
C - - - - - 0x007758 01:B748: B0 05     BCS bra_B74F_RTS
C - - - - - 0x00775A 01:B74A: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_B74F_RTS:
C - - - - - 0x00775F 01:B74F: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_AADB:
C - - - - - 0x006AEB 01:AADB: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x006AEE 01:AADE: 98        TYA
C - - - - - 0x006AEF 01:AADF: 49 01     EOR #$01
C - - - - - 0x006AF1 01:AAE1: 85 0C     STA ram_000C
C - - - - - 0x006AF3 01:AAE3: A5 08     LDA ram_0008
C - - - - - 0x006AF5 01:AAE5: 85 0A     STA ram_000A
C - - - - - 0x006AF7 01:AAE7: A5 09     LDA ram_0009
C - - - - - 0x006AF9 01:AAE9: 85 0B     STA ram_000B
C - - - - - 0x006AFB 01:AAEB: 20 24 AB  JSR sub_0x006B34_выбрать_ближайшего_игрока_по_оси_y
C - - - - - 0x006AFE 01:AAEE: 98        TYA
C - - - - - 0x006AFF 01:AAEF: 49 01     EOR #$01
C - - - - - 0x006B01 01:AAF1: C5 0C     CMP ram_000C
C - - - - - 0x006B03 01:AAF3: D0 03     BNE bra_AAF8
C - - - - - 0x006B05 01:AAF5: 98        TYA
C - - - - - 0x006B06 01:AAF6: 85 0C     STA ram_000C
bra_AAF8:
C - - - - - 0x006B08 01:AAF8: AA        TAX
C - - - - - 0x006B09 01:AAF9: A8        TAY
C - - - - - 0x006B0A 01:AAFA: B5 08     LDA ram_0008,X
C - - - - - 0x006B0C 01:AAFC: A6 0C     LDX ram_000C
C - - - - - 0x006B0E 01:AAFE: D5 0A     CMP ram_000A,X
C - - - - - 0x006B10 01:AB00: 90 04     BCC bra_AB06
C - - - - - 0x006B12 01:AB02: A4 0C     LDY ram_000C
C - - - - - 0x006B14 01:AB04: B5 0A     LDA ram_000A,X
bra_AB06:
C - - - - - 0x006B16 01:AB06: 84 0A     STY ram_000A
C - - - - - 0x006B18 01:AB08: A6 10     LDX ram_0010
C - - - - - 0x006B1A 01:AB0A: 60        RTS

; ******************************************************************************************************************

ofs_038_0B_B750_03:
C - - J - - 0x007760 01:B750: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007763 01:B753: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x007766 01:B756: D0 F7     BNE bra_B74F_RTS
C - - - - - 0x007768 01:B758: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00776B 01:B75B: 4A        LSR
C - - - - - 0x00776C 01:B75C: A9 00     LDA #$00
C - - - - - 0x00776E 01:B75E: A0 4D     LDY #$4D
C - - - - - 0x007770 01:B760: 90 04     BCC bra_B766
; C = 1
C - - - - - 0x007772 01:B762: A9 02     LDA #$02
C - - - - - 0x007774 01:B764: A0 44     LDY #$44
bra_B766:
C - - - - - 0x007776 01:B766: 84 0C     STY ram_000C
C - - - - - 0x007778 01:B768: 7D 10 07  ADC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00777B 01:B76B: A8        TAY
C - - - - - 0x00777C 01:B76C: B9 5A B8  LDA tbl_B85A,Y
C - - - - - 0x00777F 01:B76F: A0 10     LDY #$10
C - - - - - 0x007781 01:B771: 20 A8 A8  JSR sub_0x0068B8
C - - - - - 0x007784 01:B774: A9 01     LDA #$01
C - - - - - 0x007786 01:B776: B0 1B     BCS bra_B793
C - - - - - 0x007788 01:B778: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00778B 01:B77B: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00778E 01:B77E: C9 03     CMP #$03
C - - - - - 0x007790 01:B780: A9 0C     LDA #$0C
C - - - - - 0x007792 01:B782: 90 0F     BCC bra_B793
C - - - - - 0x007794 01:B784: A9 01     LDA #$01
C - - - - - 0x007796 01:B786: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x007799 01:B789: 20 D7 A2  JSR sub_0x0062E7_увеличить_состояние_объекта
C - - - - - 0x00779C 01:B78C: A9 20     LDA #$20
C - - - - - 0x00779E 01:B78E: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0077A1 01:B791: A9 08     LDA #$08
bra_B793:
C - - - - - 0x0077A3 01:B793: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_B796_RTS:
C - - - - - 0x0077A6 01:B796: 60        RTS

tbl_B85A:
- D 1 - - - 0x00786A 01:B85A: 4F        .byte $4F   ; 
- D 1 - - - 0x00786B 01:B85B: 50        .byte $50   ; 
- D 1 - - - 0x00786C 01:B85C: 51        .byte $51   ; 
- D 1 - - - 0x00786D 01:B85D: 48        .byte $48   ; 
- D 1 - - - 0x00786E 01:B85E: 49        .byte $49   ; 
- D 1 - - - 0x00786F 01:B85F: 4A        .byte $4A   ; 

; ******************************************************************************************************************

ofs_038_0B_B797_04:
C - - J - - 0x0077A7 01:B797: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0077AA 01:B79A: C9 D0     CMP #$D0
C - - - - - 0x0077AC 01:B79C: 90 03     BCC bra_B7A1
C - - - - - 0x0077AE 01:B79E: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_B7A1:
C - - - - - 0x0077B1 01:B7A1: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0077B4 01:B7A4: 20 24 AB  JSR sub_0x006B34_выбрать_ближайшего_игрока_по_оси_y
C - - - - - 0x0077B7 01:B7A7: 84 12     STY ram_0012
C - - - - - 0x0077B9 01:B7A9: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0077BC 01:B7AC: D0 7D     BEQ bra_B7AE
                                        JMP loc_B82B
bra_B7AE:
C - - - - - 0x0077BE 01:B7AE: A9 15     LDA #$15
C - - - - - 0x0077C0 01:B7B0: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0077C3 01:B7B3: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x0077C6 01:B7B6: 20 EC F4  JSR sub_0x01F4FC
C - - - - - 0x0077C9 01:B7B9: 30 78     BPL bra_B7BB
                                        JMP loc_B833
bra_B7BB:
C - - - - - 0x0077CB 01:B7BB: 08        PHP
C - - - - - 0x0077CC 01:B7BC: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0077CF 01:B7BF: 29 01     AND #$01
C - - - - - 0x0077D1 01:B7C1: A8        TAY
C - - - - - 0x0077D2 01:B7C2: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0077D5 01:B7C5: 28        PLP
C - - - - - 0x0077D6 01:B7C6: D0 14     BNE bra_B7DC
C - - - - - 0x0077D8 01:B7C8: D9 EE B7  CMP tbl_B7EE,Y
C - - - - - 0x0077DB 01:B7CB: F0 C9     BEQ bra_B796_RTS
C - - - - - 0x0077DD 01:B7CD: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x0077E0 01:B7D0: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0077E3 01:B7D3: C9 0C     CMP #$0C
C - - - - - 0x0077E5 01:B7D5: 90 02     BCC bra_B7D9
C - - - - - 0x0077E7 01:B7D7: A9 00     LDA #$00
bra_B7D9:
C - - - - - 0x0077E9 01:B7D9: 4C E8 B7  JMP loc_B7E8
bra_B7DC:
C - - - - - 0x0077EC 01:B7DC: D9 F0 B7  CMP tbl_B7F0,Y
C - - - - - 0x0077EF 01:B7DF: F0 B5     BEQ bra_B796_RTS
C - - - - - 0x0077F1 01:B7E1: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x0077F4 01:B7E4: 10 05     BPL bra_B7EB
C - - - - - 0x0077F6 01:B7E6: A9 0B     LDA #$0B
loc_B7E8:
C D 1 - - - 0x0077F8 01:B7E8: 9D 48 07  STA ram_скролл_объекта_Y,X
bra_B7EB:
C - - - - - 0x0077FB 01:B7EB: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_B7EE:
- D 1 - - - 0x0077FE 01:B7EE: 00        .byte $00   ; 00 
- D 1 - - - 0x0077FF 01:B7EF: 08        .byte $08   ; 01 

tbl_B7F0:
- D 1 - - - 0x007800 01:B7F0: 0A        .byte $0A   ; 00 
- D 1 - - - 0x007801 01:B7F1: 06        .byte $06   ; 01

; ******************************************************************************************************************

ofs_038_0B_B7F2_05:
C - - J - - 0x007802 01:B7F2: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x007805 01:B7F5: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x007808 01:B7F8: C9 18     CMP #$18
C - - - - - 0x00780A 01:B7FA: 90 5D     BCC bra_B859_RTS
C - - - - - 0x00780C 01:B7FC: C9 C0     CMP #$C0
C - - - - - 0x00780E 01:B7FE: B0 59     BCS bra_B859_RTS
C - - - - - 0x007810 01:B800: BC 48 07  LDY ram_скролл_объекта_Y,X
C - - - - - 0x007813 01:B803: B9 60 B8  LDA tbl_B860,Y
C - - - - - 0x007816 01:B806: 20 9A A8  JSR sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер
C - - - - - 0x007819 01:B809: B0 4E     BCS bra_B859_RTS
C - - - - - 0x00781B 01:B80B: A9 04     LDA #$04
C - - - - - 0x00781D 01:B80D: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

tbl_B860:
- D 1 - - - 0x007870 01:B860: 51        .byte $51   ; 00 
- - - - - - 0x007871 01:B861: 00        .byte $00   ; 01 
- - - - - - 0x007872 01:B862: 00        .byte $00   ; 02 
- - - - - - 0x007873 01:B863: 00        .byte $00   ; 03 
- - - - - - 0x007874 01:B864: 00        .byte $00   ; 04 
- - - - - - 0x007875 01:B865: 00        .byte $00   ; 05 
- - - - - - 0x007876 01:B866: 4A        .byte $4A   ; 06 
- D 1 - - - 0x007877 01:B867: 4B        .byte $4B   ; 07 
- D 1 - - - 0x007878 01:B868: 4C        .byte $4C   ; 08 
- - - - - - 0x007879 01:B869: 00        .byte $00   ; 09 
- D 1 - - - 0x00787A 01:B86A: 53        .byte $53   ; 0A 
- D 1 - - - 0x00787B 01:B86B: 52        .byte $52   ; 0B 

; ******************************************************************************************************************

ofs_038_0B_B810_06:
C - - J - - 0x007820 01:B810: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x007823 01:B813: 4A        LSR
C - - - - - 0x007824 01:B814: A9 4E     LDA #$4E
C - - - - - 0x007826 01:B816: 90 02     BCC bra_B81A
C - - - - - 0x007828 01:B818: A9 45     LDA #$45
bra_B81A:
C - - - - - 0x00782A 01:B81A: 85 0C     STA ram_000C
C - - - - - 0x00782C 01:B81C: A9 00     LDA #$00
C - - - - - 0x00782E 01:B81E: A0 10     LDY #$10
C - - - - - 0x007830 01:B820: 20 A8 A8  JSR sub_0x0068B8
C - - - - - 0x007833 01:B823: B0 03     BCS bra_B828
C - - - - - 0x007835 01:B825: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта
bra_B828:
- - - - - - 0x007838 01:B828: 4C B7 A6  JMP sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
loc_B82B:
C - - - - - 0x00783B 01:B82B: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x00783E 01:B82E: 20 EC F4  JSR sub_0x01F4FC
C - - - - - 0x007841 01:B831: 10 26     BPL bra_B859_RTS
loc_B833:
C - - - - - 0x007843 01:B833: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x007846 01:B836: D0 21     BNE bra_B859_RTS
C - - - - - 0x007848 01:B838: A4 12     LDY ram_0012
C - - - - - 0x00784A 01:B83A: 84 0A     STY ram_000A
C - - - - - 0x00784C 01:B83C: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x00784F 01:B83F: A0 02     LDY #$02
C - - - - - 0x007851 01:B841: 20 27 F3  JSR sub_0x01F337
C - - - - - 0x007854 01:B844: 20 92 B6  JSR sub_B692
C - - - - - 0x007857 01:B847: A9 10     LDA #$10
C - - - - - 0x007859 01:B849: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x00785C 01:B84C: D0 08     BNE bra_B856
C - - - - - 0x00785E 01:B84E: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x007861 01:B851: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x007864 01:B854: A9 60     LDA #$60
bra_B856:
C - - - - - 0x007866 01:B856: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_B859_RTS:
C - - - - - 0x007869 01:B859: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x004011_11_скрытая_пушка_уровень_1:
- D 0 - I - 0x004011 01:8001: 13 80     .word ofs_038_11_8013_01_активация_объекта ; 
- D 0 - I - 0x004013 01:8003: 3A 80     .word ofs_038_11_803A_02 ; 
- D 0 - I - 0x004015 01:8005: 49 80     .word ofs_038_11_8049_03 ; 
- D 0 - I - 0x004017 01:8007: 6C 80     .word ofs_038_11_806C_04 ; 
- D 0 - I - 0x004019 01:8009: 54 A3     .word ofs_038_11_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам ; 
- D 0 - I - 0x00401B 01:800B: 6B A3     .word ofs_038_11_0x00637B_06_маленькие_взрывы_объектов ; 
- D 0 - I - 0x00401D 01:800D: B3 80     .word ofs_038_11_80B3_07 ; 
- D 0 - I - 0x00401F 01:800F: FD A2     .word ofs_038_11_0x00630D_08_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x004021 01:8011: 3D A3     .word ofs_038_11_0x00628A_09_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_11_8013_01_активация_объекта:
C - - J - - 0x004023 01:8013: A9 01     LDA #$01
C - - - - - 0x004025 01:8015: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x004028 01:8018: A9 81     LDA #$81
C - - - - - 0x00402A 01:801A: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00402D 01:801D: A9 0C     LDA #$0C
C - - - - - 0x00402F 01:801F: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x004032 01:8022: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x004035 01:8025: 18        CLC
C - - - - - 0x004036 01:8026: 69 08     ADC #$08
C - - - - - 0x004038 01:8028: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00403B 01:802B: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00403E 01:802E: 38        SEC
C - - - - - 0x00403F 01:802F: E9 08     SBC #$08
C - - - - - 0x004041 01:8031: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004044 01:8034: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004047 01:8037: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_11_803A_02:
C - - J - - 0x00404A 01:803A: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00404D 01:803D: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004050 01:8040: C9 E8     CMP #$E8
C - - - - - 0x004052 01:8042: B0 6E     BCS bra_80B2_RTS
C - - - - - 0x004054 01:8044: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_11_8049_03:
C - - J - - 0x004059 01:8049: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00405C 01:804C: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00405F 01:804F: D0 61     BNE bra_80B2_RTS
C - - - - - 0x004061 01:8051: 20 C0 80  JSR sub_80C0
C - - - - - 0x004064 01:8054: B0 59     BCS bra_80AF
C - - - - - 0x004066 01:8056: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004069 01:8059: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00406C 01:805C: C9 02     CMP #$02
C - - - - - 0x00406E 01:805E: A9 0C     LDA #$0C
C - - - - - 0x004070 01:8060: 90 4D     BCC bra_80AF
C - - - - - 0x004072 01:8062: A9 00     LDA #$00
C - - - - - 0x004074 01:8064: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004077 01:8067: A9 20     LDA #$20    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_11_806C_04:
C - - J - - 0x00407C 01:806C: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00407F 01:806F: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x004082 01:8072: D0 3E     BNE bra_80B2_RTS
C - - - - - 0x004088 01:8078: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00408B 01:807B: 4A        LSR
C - - - - - 0x00408C 01:807C: B0 34     BCS bra_80B2_RTS
C - - - - - 0x00408E 01:807E: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004091 01:8081: C9 30     CMP #$30
C - - - - - 0x004093 01:8083: 90 2D     BCC bra_80B2_RTS
C - - - - - 0x004095 01:8085: A0 02     LDY #con_obj_id_02  ; обычная пуля
C - - - - - 0x004097 01:8087: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x00409A 01:808A: 90 26     BCC bra_80B2_RTS
; C = 1
C - - - - - 0x00409C 01:808C: A4 11     LDY ram_0011
C - - - - - 0x00409E 01:808E: A9 00     LDA #< $FD00
C - - - - - 0x0040A0 01:8090: 99 BC 06  STA ram_скорость_объектов_x_младш,Y
C - - - - - 0x0040A3 01:8093: A9 FD     LDA #> $FD00
C - - - - - 0x0040A5 01:8095: 99 CA 06  STA ram_скорость_объектов_X_старш,Y
C - - - - - 0x0040A8 01:8098: A9 01     LDA #$01
C - - - - - 0x0040AA 01:809A: 99 48 07  STA ram_скролл_объекта_Y,Y
C - - - - - 0x0040AD 01:809D: B9 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x0040B0 01:80A0: E9 10     SBC #$10
C - - - - - 0x0040B2 01:80A2: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x0040B5 01:80A5: B9 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x0040B8 01:80A8: 69 02     ADC #$02
C - - - - - 0x0040BA 01:80AA: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x0040BD 01:80AD: A9 60     LDA #$60
bra_80AF:
C - - - - - 0x0040BF 01:80AF: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_80B2_RTS:
C - - - - - 0x0040C2 01:80B2: 60        RTS

; ******************************************************************************************************************

ofs_038_11_80B3_07:
C - - J - - 0x0040C3 01:80B3: A0 02     LDY #$02
C - - - - - 0x0040C5 01:80B5: 20 C3 80  JSR sub_80C3
C - - - - - 0x0040C8 01:80B8: B0 03     BCS bra_80BD
C - - - - - 0x0040CA 01:80BA: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта
bra_80BD:
- - - - - - 0x0040CD 01:80BD: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_80C0:
C - - - - - 0x0040D0 01:80C0: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
sub_80C3:
C - - - - - 0x0040D3 01:80C3: B9 D6 80  LDA tbl_80D6,Y
C - - - - - 0x0040D6 01:80C6: 85 0C     STA ram_000C
C - - - - - 0x0040D8 01:80C8: B9 D3 80  LDA tbl_80D3,Y
C - - - - - 0x0040DB 01:80CB: A0 10     LDY #$10
C - - - - - 0x0040DD 01:80CD: 20 A8 A8  JSR sub_0x0068B8
C - - - - - 0x0040E0 01:80D0: A9 01     LDA #$01
C - - - - - 0x0040E2 01:80D2: 60        RTS
tbl_80D3:
- D 0 - - - 0x0040E3 01:80D3: F2        .byte $F2   ; 00 
- D 0 - - - 0x0040E4 01:80D4: F3        .byte $F3   ; 01 
- D 0 - - - 0x0040E5 01:80D5: 01        .byte $01   ; 02 

tbl_80D6:
- D 0 - - - 0x0040E6 01:80D6: F1        .byte $F1   ; 00 
- D 0 - - - 0x0040E7 01:80D7: F0        .byte $F0   ; 01 
- D 0 - - - 0x0040E8 01:80D8: 03        .byte $03   ; 02 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x014B91_16_движущиеся_пушка:
- D 0 - I - 0x014B91 05:8B81: 8B 8B     .word ofs_038_16_8B8B_01_активация_объекта ; 
- D 0 - I - 0x014B93 05:8B83: AF 8B     .word ofs_038_16_8BAF_02 ; 
- D 0 - I - 0x014B95 05:8B85: 9A A2     .word ofs_038_16_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x014B97 05:8B87: FD A2     .word ofs_038_16_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x014B99 05:8B89: 3D A3     .word ofs_038_16_0x00628A_05_удалить_объект ;

; ******************************************************************************************************************

ofs_038_16_8B8B_01_активация_объекта:
C - - J - - 0x014B9B 05:8B8B: A9 04     LDA #$04
C - - - - - 0x014B9D 05:8B8D: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x014BA0 05:8B90: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x014BA3 05:8B93: 29 01     AND #$01
C - - - - - 0x014BA5 05:8B95: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x014BA8 05:8B98: 20 41 8C  JSR sub_8C41
C - - - - - 0x014BAB 05:8B9B: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014BAE 05:8B9E: 18        CLC
C - - - - - 0x014BAF 05:8B9F: 69 0A     ADC #$0A
C - - - - - 0x014BB1 05:8BA1: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014BB4 05:8BA4: A9 27     LDA #$27
C - - - - - 0x014BB6 05:8BA6: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x014BB9 05:8BA9: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x014BBC 05:8BAC: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_16_8BAF_02:
C - - J - - 0x014BBF 05:8BAF: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x014BC2 05:8BB2: 98        TYA
C - - - - - 0x014BC3 05:8BB3: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x014BC6 05:8BB6: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x014BC9 05:8BB9: 38        SEC
C - - - - - 0x014BCA 05:8BBA: FD 3C 05  SBC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014BCD 05:8BBD: A0 02     LDY #$02
C - - - - - 0x014BCF 05:8BBF: B0 06     BCS bra_8BC7
C - - - - - 0x014BD1 05:8BC1: A0 00     LDY #$00
C - - - - - 0x014BD3 05:8BC3: 49 FF     EOR #$FF
C - - - - - 0x014BD5 05:8BC5: 69 01     ADC #$01
bra_8BC7:
C - - - - - 0x014BD7 05:8BC7: C9 20     CMP #$20
C - - - - - 0x014BD9 05:8BC9: B0 02     BCS bra_8BCD
C - - - - - 0x014BDB 05:8BCB: A0 01     LDY #$01
bra_8BCD:
C - - - - - 0x014BDD 05:8BCD: 98        TYA
C - - - - - 0x014BDE 05:8BCE: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x014BE1 05:8BD1: B9 2D 8C  LDA tbl_8C2D_кадры_анимации,Y
C - - - - - 0x014BE4 05:8BD4: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x014BE7 05:8BD7: B9 30 8C  LDA tbl_8C30_аттрибуты_спрайта,Y
C - - - - - 0x014BEA 05:8BDA: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x014BED 05:8BDD: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x014BF0 05:8BE0: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x014BF3 05:8BE3: 2A        ROL
C - - - - - 0x014BF4 05:8BE4: 2A        ROL
C - - - - - 0x014BF5 05:8BE5: 29 01     AND #$01
C - - - - - 0x014BF7 05:8BE7: A8        TAY
C - - - - - 0x014BF8 05:8BE8: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014BFB 05:8BEB: D9 2B 8C  CMP tbl_8C2B_позиция_X,Y
C - - - - - 0x014BFE 05:8BEE: 6A        ROR
C - - - - - 0x014BFF 05:8BEF: 5D CA 06  EOR ram_скорость_объектов_X_старш,X
C - - - - - 0x014C02 05:8BF2: 10 03     BPL bra_8BF7
C - - - - - 0x014C04 05:8BF4: 20 39 8C  JSR sub_8C39
bra_8BF7:
C - - - - - 0x014C07 05:8BF7: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x014C0A 05:8BFA: D0 2E     BNE bra_8C2A_RTS
C - - - - - 0x014C0C 05:8BFC: BC 56 07  LDY ram_скролл_объекта_X,X
C - - - - - 0x014C0F 05:8BFF: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014C12 05:8C02: 18        CLC
C - - - - - 0x014C13 05:8C03: 79 33 8C  ADC tbl_8C33_добавочная_позиция_Y,Y
C - - - - - 0x014C16 05:8C06: 85 08     STA ram_0008
C - - - - - 0x014C18 05:8C08: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014C1B 05:8C0B: 18        CLC
C - - - - - 0x014C1C 05:8C0C: 79 36 8C  ADC tbl_8C36_добавочная_позиция_X,Y
C - - - - - 0x014C1F 05:8C0F: 85 09     STA ram_0009
C - - - - - 0x014C21 05:8C11: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x014C24 05:8C14: 84 0A     STY ram_000A
C - - - - - 0x014C26 05:8C16: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014C29 05:8C19: C9 A0     CMP #$A0
C - - - - - 0x014C2B 05:8C1B: B0 0D     BCS bra_8C2A_RTS
C - - - - - 0x014C2D 05:8C1D: D9 32 05  CMP ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x014C30 05:8C20: B0 08     BCS bra_8C2A_RTS
C - - - - - 0x014C32 05:8C22: 20 25 F3  JSR sub_0x01F335    ; рассчитать угол, создать пулю
C - - - - - 0x014C35 05:8C25: A9 37     LDA #$37
C - - - - - 0x014C37 05:8C27: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_8C2A_RTS:
C - - - - - 0x014C3A 05:8C2A: 60        RTS

tbl_8C2B_позиция_X:
- D 0 - - - 0x014C3B 05:8C2B: E0        .byte $E0   ; 00 право
- D 0 - - - 0x014C3C 05:8C2C: 20        .byte $20   ; 01 лево

tbl_8C2D_кадры_анимации:
- D 0 - - - 0x014C3D 05:8C2D: 64        .byte $64   ; 00 
- D 0 - - - 0x014C3E 05:8C2E: 65        .byte $65   ; 01 
- D 0 - - - 0x014C3F 05:8C2F: 64        .byte $64   ; 02 

tbl_8C30_аттрибуты_спрайта:
- D 0 - - - 0x014C40 05:8C30: 03        .byte $03   ; 00 
- D 0 - - - 0x014C41 05:8C31: 03        .byte $03   ; 01 
- D 0 - - - 0x014C42 05:8C32: 43        .byte $43   ; 02 

tbl_8C33_добавочная_позиция_Y:
- D 0 - - - 0x014C43 05:8C33: 0B        .byte $0B   ; 00 
- D 0 - - - 0x014C44 05:8C34: 13        .byte $13   ; 01 
- D 0 - - - 0x014C45 05:8C35: 0B        .byte $0B   ; 02 

tbl_8C36_добавочная_позиция_X:
- D 0 - - - 0x014C46 05:8C36: F5        .byte $F5   ; 00 
- D 0 - - - 0x014C47 05:8C37: 00        .byte $00   ; 01 
- D 0 - - - 0x014C48 05:8C38: 0B        .byte $0B   ; 02 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8C39:
C - - - - - 0x014C49 05:8C39: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014C4C 05:8C3C: 49 01     EOR #$01
C - - - - - 0x014C4E 05:8C3E: 9D 48 07  STA ram_скролл_объекта_Y,X
sub_8C41:
C - - - - - 0x014C51 05:8C41: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x014C54 05:8C44: 0A        ASL
C - - - - - 0x014C55 05:8C45: A8        TAY
C - - - - - 0x014C56 05:8C46: B9 53 8C  LDA tbl_8C53_скорость_X,Y
C - - - - - 0x014C59 05:8C49: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x014C5C 05:8C4C: B9 54 8C  LDA tbl_8C53_скорость_X + $01,Y
C - - - - - 0x014C5F 05:8C4F: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x014C62 05:8C52: 60        RTS

tbl_8C53_скорость_X:
- D 0 - - - 0x014C63 05:8C53: 80 FF     .word $FF80 ; 00 
- D 0 - - - 0x014C65 05:8C55: 80 00     .word $0080 ; 01

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x004CEA_18_скрытая_пушка_уровень_3:
- D 0 - I - 0x004CEA 01:8CDA: E8 8C     .word ofs_038_18_8CE8_01_активация_объекта ; 
- D 0 - I - 0x004CEC 01:8CDC: 12 8D     .word ofs_038_18_8D12_02 ; 
- D 0 - I - 0x004CEE 01:8CDE: 22 8D     .word ofs_038_18_8D22_03 ; 
- D 0 - I - 0x004CF0 01:8CE0: 53 8D     .word ofs_038_18_8D53_04 ; 
- D 0 - I - 0x004CF2 01:8CE2: B3 8D     .word ofs_038_18_8DB3_05 ; 
- D 0 - I - 0x004CF4 01:8CE4: FD A2     .word ofs_038_18_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x004CF6 01:8CE6: 3D A3     .word ofs_038_18_0x00628A_07_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_18_8CE8_01_активация_объекта:
C - - J - - 0x004CF8 01:8CE8: A9 08     LDA #$08
C - - - - - 0x004CFA 01:8CEA: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x004CFD 01:8CED: A9 81     LDA #$81
C - - - - - 0x004CFF 01:8CEF: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004D02 01:8CF2: A9 B0     LDA #$B0
C - - - - - 0x004D04 01:8CF4: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x004D07 01:8CF7: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004D0A 01:8CFA: 38        SEC
C - - - - - 0x004D0B 01:8CFB: E9 04     SBC #$04
C - - - - - 0x004D0D 01:8CFD: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004D10 01:8D00: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x004D13 01:8D03: 4A        LSR
C - - - - - 0x004D14 01:8D04: 29 03     AND #$03
C - - - - - 0x004D16 01:8D06: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x004D19 01:8D09: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x004D1C 01:8D0C: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004D1F 01:8D0F: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_18_8D12_02:
C - - J - - 0x004D22 01:8D12: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004D25 01:8D15: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004D28 01:8D18: C9 D8     CMP #$D8
C - - - - - 0x004D2A 01:8D1A: B0 05     BCS bra_8D21_RTS
C - - - - - 0x004D2C 01:8D1C: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8D21_RTS:
C - - - - - 0x004D31 01:8D21: 60        RTS

; ******************************************************************************************************************

ofs_038_18_8D22_03:
C - - J - - 0x004D32 01:8D22: A9 01     LDA #$01
C - - - - - 0x004D34 01:8D24: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x004D37 01:8D27: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004D3A 01:8D2A: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x004D3D 01:8D2D: D0 F2     BNE bra_8D21_RTS
C - - - - - 0x004D3F 01:8D2F: 20 C9 8D  JSR sub_8DC9
C - - - - - 0x004D42 01:8D32: B0 1B     BCS bra_8D4F
C - - - - - 0x004D44 01:8D34: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004D47 01:8D37: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004D4A 01:8D3A: C9 03     CMP #$03
C - - - - - 0x004D4C 01:8D3C: A9 0C     LDA #$0C
C - - - - - 0x004D4E 01:8D3E: 90 0F     BCC bra_8D4F
C - - - - - 0x004D50 01:8D40: A9 01     LDA #$01
C - - - - - 0x004D52 01:8D42: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004D55 01:8D45: A9 00     LDA #$00
C - - - - - 0x004D57 01:8D47: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004D5A 01:8D4A: 20 D7 A2  JSR sub_0x0062E7_увеличить_состояние_объекта
C - - - - - 0x004D5D 01:8D4D: A9 38     LDA #$38
bra_8D4F:
C D 0 - - - 0x004D5F 01:8D4F: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_8D52_RTS:
C - - - - - 0x004D62 01:8D52: 60        RTS

; ******************************************************************************************************************

ofs_038_18_8D53_04:
C - - J - - 0x004D63 01:8D53: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004D66 01:8D56: C9 40     CMP #$40
C - - - - - 0x004D68 01:8D58: B0 03     BCS bra_8D5D
C - - - - - 0x004D6A 01:8D5A: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_8D5D:
C - - - - - 0x004D6D 01:8D5D: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004D70 01:8D60: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x004D73 01:8D63: D0 ED     BNE bra_8D52_RTS
C - - - - - 0x004D75 01:8D65: 20 C9 8D  JSR sub_8DC9
C - - - - - 0x004D78 01:8D68: B0 E5     BCS bra_8D4F
C - - - - - 0x004D7A 01:8D6A: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004D7D 01:8D6D: 4A        LSR
C - - - - - 0x004D7E 01:8D6E: A9 01     LDA #$01
C - - - - - 0x004D80 01:8D70: 90 02     BCC bra_8D74
C - - - - - 0x004D82 01:8D72: A9 02     LDA #$02
bra_8D74:
C - - - - - 0x004D84 01:8D74: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004D87 01:8D77: B0 11     BCS bra_8D8A
C - - - - - 0x004D89 01:8D79: A9 08     LDA #$08
C - - - - - 0x004D8B 01:8D7B: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x004D8E 01:8D7E: 10 CF     BPL bra_8D4F
C - - - - - 0x004D90 01:8D80: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x004D93 01:8D83: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x004D96 01:8D86: A9 80     LDA #$80
C - - - - - 0x004D98 01:8D88: D0 C5     BNE bra_8D4F    ; jmp
bra_8D8A:
C - - - - - 0x004D9A 01:8D8A: A0 02     LDY #con_obj_id_02
C - - - - - 0x004D9C 01:8D8C: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x004D9F 01:8D8F: 90 C1     BCC bra_8D52_RTS
C - - - - - 0x004DA1 01:8D91: A4 11     LDY ram_0011
C - - - - - 0x004DA3 01:8D93: A9 00     LDA #< $FE00
C - - - - - 0x004DA5 01:8D95: 99 BC 06  STA ram_скорость_объектов_x_младш,Y
C - - - - - 0x004DA8 01:8D98: A9 FE     LDA #> $FE00
C - - - - - 0x004DAA 01:8D9A: 99 CA 06  STA ram_скорость_объектов_X_старш,Y
C - - - - - 0x004DAD 01:8D9D: B9 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x004DB0 01:8DA0: 18        CLC
C - - - - - 0x004DB1 01:8DA1: 69 02     ADC #$02
C - - - - - 0x004DB3 01:8DA3: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x004DB6 01:8DA6: B9 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x004DB9 01:8DA9: 69 FE     ADC #$FE
C - - - - - 0x004DBB 01:8DAB: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x004DBE 01:8DAE: A9 04     LDA #$04
                                        STA ram_счетчики_для_объектов,X
                                        RTS

; ******************************************************************************************************************

ofs_038_18_8DB3_05:
C - - J - - 0x004DC3 01:8DB3: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004DC6 01:8DB6: A0 06     LDY #$03 * $02
C - - - - - 0x004DC8 01:8DB8: 20 CE 8D  JSR sub_8DCE
C - - - - - 0x004DCB 01:8DBB: B0 95     BCS bra_8D52_RTS
C - - - - - 0x004DCD 01:8DBD: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004DD0 01:8DC0: 18        CLC
C - - - - - 0x004DD1 01:8DC1: 69 10     ADC #$10
C - - - - - 0x004DD3 01:8DC3: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004DD6 01:8DC6: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8DC9:
C - - - - - 0x004DD9 01:8DC9: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x004DDC 01:8DCC: 0A        ASL
C - - - - - 0x004DDD 01:8DCD: A8        TAY
sub_8DCE:
C - - - - - 0x004DDE 01:8DCE: B9 E8 8D  LDA tbl_8DE7 + $01,Y
C - - - - - 0x004DE1 01:8DD1: 85 0C     STA ram_000C
C - - - - - 0x004DE3 01:8DD3: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004DE6 01:8DD6: C9 D8     CMP #$D8
C - - - - - 0x004DE8 01:8DD8: B0 0B     BCS bra_8DE5
C - - - - - 0x004DEA 01:8DDA: B9 E7 8D  LDA tbl_8DE7,Y
C - - - - - 0x004DED 01:8DDD: A0 01     LDY #$01
C - - - - - 0x004DEF 01:8DDF: 20 A8 A8  JSR sub_0x0068B8
C - - - - - 0x004DF2 01:8DE2: A9 01     LDA #$01
C - - - - - 0x004DF4 01:8DE4: 60        RTS
bra_8DE5:
- - - - - - 0x004DF5 01:8DE5: 18        CLC
- - - - - - 0x004DF6 01:8DE6: 60        RTS

tbl_8DE7:
;                                              +---------- 
;                                              |    +----- 
;                                              |    |
- D 0 - - - 0x004DF7 01:8DE7: 49        .byte $49, $4A   ; 00 
- D 0 - - - 0x004DF9 01:8DE9: 4B        .byte $4B, $4C   ; 01 
- D 0 - - - 0x004DFB 01:8DEB: 4D        .byte $4D, $4E   ; 02 
- D 0 - - - 0x004DFD 01:8DED: 4F        .byte $4F, $50   ; 03 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x004DFF_19_гаубица:
- D 0 - I - 0x004DFF 01:8DEF: FF 8D     .word ofs_038_19_8DFF_01_активация_объекта ; 
- D 0 - I - 0x004E01 01:8DF1: 18 8E     .word ofs_038_19_8E18_02 ; 
- D 0 - I - 0x004E03 01:8DF3: 4F 8E     .word ofs_038_19_8E4F_03 ; 
- D 0 - I - 0x004E05 01:8DF5: 54 A3     .word ofs_038_19_0x006364_04_поменять_состояние_хитбокса_и_подготовить_к_взрывам ; 
- D 0 - I - 0x004E07 01:8DF7: 6B A3     .word ofs_038_19_0x00637B_05_маленькие_взрывы_объектов ; 
- D 0 - I - 0x004E09 01:8DF9: AC 8E     .word ofs_038_19_8EAC_06 ; 
- D 0 - I - 0x004E0B 01:8DFB: FD A2     .word ofs_038_19_0x00630D_07_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x004E0D 01:8DFD: 3D A3     .word ofs_038_19_0x00628A_08_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_19_8DFF_01_активация_объекта:
C - - J - - 0x004E0F 01:8DFF: A9 20     LDA #$20
C - - - - - 0x004E11 01:8E01: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x004E14 01:8E04: A9 81     LDA #$81
C - - - - - 0x004E16 01:8E06: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004E19 01:8E09: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004E1C 01:8E0C: 38        SEC
C - - - - - 0x004E1D 01:8E0D: E9 02     SBC #$02
C - - - - - 0x004E1F 01:8E0F: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004E22 01:8E12: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004E25 01:8E15: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_19_8E18_02:
C - - J - - 0x004E28 01:8E18: A9 01     LDA #$01
C - - - - - 0x004E2A 01:8E1A: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x004E2D 01:8E1D: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004E30 01:8E20: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004E33 01:8E23: C9 E0     CMP #$E0
C - - - - - 0x004E35 01:8E25: B0 27     BCS bra_8E4E_RTS
C - - - - - 0x004E37 01:8E27: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x004E39 01:8E29: 09 40     ORA #$40
C - - - - - 0x004E3B 01:8E2B: 85 94     STA ram_0094_конфиг_уровня
C - - - - - 0x004E3D 01:8E2D: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x004E40 01:8E30: 18        CLC
C - - - - - 0x004E41 01:8E31: 69 16     ADC #$16
C - - - - - 0x004E43 01:8E33: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x004E46 01:8E36: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004E49 01:8E39: 18        CLC
C - - - - - 0x004E4A 01:8E3A: 69 08     ADC #$08
C - - - - - 0x004E4C 01:8E3C: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004E4F 01:8E3F: A9 00     LDA #$00
C - - - - - 0x004E51 01:8E41: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x004E54 01:8E44: A9 07     LDA #$07
C - - - - - 0x004E56 01:8E46: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x004E59 01:8E49: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8E4E_RTS:
C - - - - - 0x004E5E 01:8E4E: 60        RTS

; ******************************************************************************************************************

ofs_038_19_8E4F_03:
C - - J - - 0x004E5F 01:8E4F: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x004E62 01:8E52: C9 30     CMP #$30
C - - - - - 0x004E64 01:8E54: 90 4D     BCC bra_8EA3
C - - - - - 0x004E66 01:8E56: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x004E69 01:8E59: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x004E6C 01:8E5C: D0 F0     BNE bra_8E4E_RTS
C - - - - - 0x004E6E 01:8E5E: A0 00     LDY #$00
C - - - - - 0x004E70 01:8E60: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x004E73 01:8E63: F0 06     BEQ bra_8E6B
C - - - - - 0x004E75 01:8E65: A0 02     LDY #$02
C - - - - - 0x004E77 01:8E67: C9 07     CMP #$07
C - - - - - 0x004E79 01:8E69: D0 05     BNE bra_8E70
bra_8E6B:
C - - - - - 0x004E7B 01:8E6B: 20 BC 8E  JSR sub_8EBC
C - - - - - 0x004E7E 01:8E6E: B0 DE     BCS bra_8E4E_RTS
bra_8E70:
C - - - - - 0x004E80 01:8E70: A0 29     LDY #con_obj_id_1A  ; пули гаубицы
C - - - - - 0x004E82 01:8E72: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x004E85 01:8E75: 90 1A     BCC bra_8E91
C - - - - - 0x004E87 01:8E77: A4 11     LDY ram_0011
C - - - - - 0x004E89 01:8E79: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x004E8C 01:8E7C: 99 48 07  STA ram_скролл_объекта_Y,Y
C - - - - - 0x004E8F 01:8E7F: B9 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x004E92 01:8E82: 38        SEC
C - - - - - 0x004E93 01:8E83: E9 0E     SBC #$0E
C - - - - - 0x004E95 01:8E85: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x004E98 01:8E88: B9 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x004E9B 01:8E8B: 38        SEC
C - - - - - 0x004E9C 01:8E8C: E9 08     SBC #$08
C - - - - - 0x004E9E 01:8E8E: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
bra_8E91:
C - - - - - 0x004EA1 01:8E91: A9 02     LDA #$02
C - - - - - 0x004EA3 01:8E93: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x004EA6 01:8E96: 10 07     BPL bra_8E9F
C - - - - - 0x004EA8 01:8E98: A9 07     LDA #$07
C - - - - - 0x004EAA 01:8E9A: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x004EAD 01:8E9D: A9 80     LDA #$80
bra_8E9F:
C - - - - - 0x004EAF 01:8E9F: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_8EA2_RTS:
C - - - - - 0x004EB2 01:8EA2: 60        RTS
bra_8EA3:
- - - - - - 0x004EB3 01:8EA3: A5 94     LDA ram_0094_конфиг_уровня
- - - - - - 0x004EB5 01:8EA5: 29 BF     AND #$BF
- - - - - - 0x004EB7 01:8EA7: 85 94     STA ram_0094_конфиг_уровня
- - - - - - 0x004EB9 01:8EA9: 4C 75 A2  JMP loc_0x00628A_удалить_объект

; ******************************************************************************************************************

ofs_038_19_8EAC_06:
C - - J - - 0x004EBC 01:8EAC: A0 04     LDY #$04
C - - - - - 0x004EBE 01:8EAE: 20 BC 8E  JSR sub_8EBC
C - - - - - 0x004EC1 01:8EB1: B0 EF     BCS bra_8EA2_RTS
C - - - - - 0x004EC3 01:8EB3: A5 94     LDA ram_0094_конфиг_уровня
C - - - - - 0x004EC5 01:8EB5: 29 BF     AND #$BF
C - - - - - 0x004EC7 01:8EB7: 85 94     STA ram_0094_конфиг_уровня
C - - - - - 0x004EC9 01:8EB9: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8EBC:
C - - - - - 0x004ECC 01:8EBC: B9 CA 8E  LDA tbl_8EC9 + $01,Y
C - - - - - 0x004ECF 01:8EBF: 85 0C     STA ram_000C
C - - - - - 0x004ED1 01:8EC1: B9 C9 8E  LDA tbl_8EC9,Y
C - - - - - 0x004ED4 01:8EC4: A0 10     LDY #$10
C - - - - - 0x004ED6 01:8EC6: 4C A8 A8  JMP loc_0x0068B8

tbl_8EC9:
;                                              +---------- 
;                                              |    +----- 
;                                              |    |
- D 0 - - - 0x004ED9 01:8EC9: 3E        .byte $3E, $40   ; 00 
- D 0 - - - 0x004EDB 01:8ECB: 46        .byte $46, $47   ; 02 
- D 0 - - - 0x004EDD 01:8ECD: 11        .byte $11, $48   ; 04 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0100BD_23_скрытая_пушка_2_уровень_5:
- D 0 - I - 0x0100BD 04:80AD: BB 80     .word ofs_038_23_80BB_01_активация_объекта ; 
- D 0 - I - 0x0100BF 04:80AF: E2 80     .word ofs_038_23_80E2_02 ; 
- D 0 - I - 0x0100C1 04:80B1: F6 80     .word ofs_038_23_80F6_03 ; 
- D 0 - I - 0x0100C3 04:80B3: 1F 81     .word ofs_038_23_811F_04 ; 
- D 0 - I - 0x0100C5 04:80B5: 52 81     .word ofs_038_23_8152_05 ; 
- D 0 - I - 0x0100C7 04:80B7: FD A2     .word ofs_038_23_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x0100C9 04:80B9: 3D A3     .word ofs_038_23_0x00628A_07_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_23_80BB_01_активация_объекта:
C - - J - - 0x0100CB 04:80BB: A9 81     LDA #$81
C - - - - - 0x0100CD 04:80BD: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0100D0 04:80C0: A9 08     LDA #$08
C - - - - - 0x0100D2 04:80C2: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x0100D5 04:80C5: A9 01     LDA #$01
C - - - - - 0x0100D7 04:80C7: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x0100DA 04:80CA: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0100DD 04:80CD: 38        SEC
C - - - - - 0x0100DE 04:80CE: E9 08     SBC #$08
C - - - - - 0x0100E0 04:80D0: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0100E3 04:80D3: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0100E6 04:80D6: 38        SEC
C - - - - - 0x0100E7 04:80D7: E9 20     SBC #$20
C - - - - - 0x0100E9 04:80D9: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0100EC 04:80DC: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0100EF 04:80DF: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_23_80E2_02:
C - - J - - 0x0100F2 04:80E2: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0100F5 04:80E5: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0100F8 04:80E8: C9 F0     CMP #$F0
C - - - - - 0x0100FA 04:80EA: B0 32     BCS bra_811E_RTS
C - - - - - 0x0100FC 04:80EC: 20 18 84  JSR sub_0x008418
C - - - - - 0x0100FF 04:80EF: B0 2D     BCS bra_811E_RTS
C - - - - - 0x010101 04:80F1: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_23_80F6_03:
C - - J - - 0x010106 04:80F6: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x010109 04:80F9: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x01010C 04:80FC: D0 20     BNE bra_811E_RTS
C - - - - - 0x01010E 04:80FE: 20 5F 81  JSR sub_815F
C - - - - - 0x010111 04:8101: A9 01     LDA #$01
C - - - - - 0x010113 04:8103: B0 16     BCS bra_811B
C - - - - - 0x010115 04:8105: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x010118 04:8108: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01011B 04:810B: C9 02     CMP #$02
C - - - - - 0x01011D 04:810D: A9 0C     LDA #$0C
C - - - - - 0x01011F 04:810F: 90 0A     BCC bra_811B
C - - - - - 0x010121 04:8111: A9 01     LDA #$01
C - - - - - 0x010123 04:8113: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x010126 04:8116: A9 30     LDA #$30    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_811B:
C - - - - - 0x01012B 04:811B: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_811E_RTS:
C - - - - - 0x01012E 04:811E: 60        RTS

; ******************************************************************************************************************

ofs_038_23_811F_04:
C - - J - - 0x01012F 04:811F: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x010132 04:8122: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010135 04:8125: C9 20     CMP #$20
C - - - - - 0x010137 04:8127: B0 03     BCS bra_812C
- - - - - - 0x010139 04:8129: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_812C:
C - - - - - 0x01013C 04:812C: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x01013F 04:812F: D0 ED     BNE bra_811E_RTS
C - - - - - 0x010141 04:8131: A9 50     LDA #$50
C - - - - - 0x010143 04:8133: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x010146 04:8136: A0 33     LDY #con_obj_id_24  ; пуля этой пушки
C - - - - - 0x010148 04:8138: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x01014B 04:813B: 90 E1     BCC bra_811E_RTS
C - - - - - 0x01014D 04:813D: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010150 04:8140: 29 01     AND #$01
C - - - - - 0x010152 04:8142: A8        TAY
C - - - - - 0x010153 04:8143: B9 50 81  LDA tbl_8150_добавочная_позиция_X_спрайта,Y
C - - - - - 0x010156 04:8146: A4 11     LDY ram_0011
C - - - - - 0x010158 04:8148: 18        CLC
C - - - - - 0x010159 04:8149: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01015C 04:814C: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x01015F 04:814F: 60        RTS

tbl_8150_добавочная_позиция_X_спрайта:
- D 0 - - - 0x010160 04:8150: F4        .byte $F4   ; 00 
- - - - - - 0x010161 04:8151: 0C        .byte $0C   ; 01 

; ******************************************************************************************************************

ofs_038_23_8152_05:
C - - J - - 0x010162 04:8152: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x010165 04:8155: A0 02     LDY #$02
C - - - - - 0x010167 04:8157: 20 62 81  JSR sub_8162
C - - - - - 0x01016A 04:815A: B0 C2     BCS bra_811E_RTS
C - - - - - 0x01016C 04:815C: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_815F:
C - - - - - 0x01016F 04:815F: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
sub_8162:
C - - - - - 0x010172 04:8162: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010175 04:8165: 4A        LSR
C - - - - - 0x010176 04:8166: 90 03     BCC bra_816B
- - - - - - 0x010178 04:8168: C8        INY
- - - - - - 0x010179 04:8169: C8        INY
- - - - - - 0x01017A 04:816A: C8        INY
bra_816B:
C - - - - - 0x01017B 04:816B: B9 71 81  LDA tbl_8171,Y
C - - - - - 0x01017E 04:816E: 4C 9A A8  JMP loc_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер

tbl_8171:
; 
- D 0 - - - 0x010181 04:8171: 88        .byte $88   ; 00 
- D 0 - - - 0x010182 04:8172: 89        .byte $89   ; 01 
- D 0 - - - 0x010183 04:8173: 87        .byte $87   ; 02 
; 
- - - - - - 0x010184 04:8174: 8A        .byte $8A   ; 00 
- - - - - - 0x010185 04:8175: 8B        .byte $8B   ; 01 
- - - - - - 0x010186 04:8176: 8C        .byte $8C   ; 02 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0141FE_46_круглая_турель:
- D 0 - I - 0x0141FE 05:81EE: 00 82     .word ofs_038_46_8200_01_активация_объекта ; 
- D 0 - I - 0x014200 05:81F0: 27 82     .word ofs_038_46_8227_02 ; 
- D 0 - I - 0x014202 05:81F2: 44 82     .word ofs_038_46_8244_03 ; 
- D 0 - I - 0x014204 05:81F4: C2 82     .word ofs_038_46_82C2_04 ; 
- D 0 - I - 0x014206 05:81F6: 54 A3     .word ofs_038_46_0x006364_05_поменять_состояние_хитбокса_и_подготовить_к_взрывам ; 
- D 0 - I - 0x014208 05:81F8: 6B A3     .word ofs_038_46_0x00637B_06_маленькие_взрывы_объектов ; 
- D 0 - I - 0x01420A 05:81FA: DA 82     .word ofs_038_46_82DA_07 ; 
- D 0 - I - 0x01420C 05:81FC: FD A2     .word ofs_038_46_0x00630D_08_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x01420E 05:81FE: 3D A3     .word ofs_038_46_0x00628A_09_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_46_8200_01_активация_объекта:
C - - J - - 0x014210 05:8200: A9 01     LDA #$01
C - - - - - 0x014212 05:8202: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x014215 05:8205: A9 08     LDA #$08
C - - - - - 0x014217 05:8207: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x01421A 05:820A: A9 85     LDA #$85
C - - - - - 0x01421C 05:820C: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x01421F 05:820F: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014222 05:8212: 69 08     ADC #$08
C - - - - - 0x014224 05:8214: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014227 05:8217: A9 06     LDA #$06
C - - - - - 0x014229 05:8219: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x01422C 05:821C: A9 02     LDA #$02
C - - - - - 0x01422E 05:821E: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x014231 05:8221: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014234 05:8224: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_46_8227_02:
C - - J - - 0x014237 05:8227: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x01423A 05:822A: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01423D 05:822D: C9 20     CMP #$20
C - - - - - 0x01423F 05:822F: 90 12     BCC bra_8243_RTS
C - - - - - 0x014241 05:8231: A9 05     LDA #$05
C - - - - - 0x014243 05:8233: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x014246 05:8236: A9 02     LDA #$02
C - - - - - 0x014248 05:8238: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x01424B 05:823B: A9 01     LDA #$01
C - - - - - 0x01424D 05:823D: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8243_RTS:
C - - - - - 0x014253 05:8243: 60        RTS

; ******************************************************************************************************************

ofs_038_46_8244_03:
C - - J - - 0x014254 05:8244: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014257 05:8247: C9 C0     CMP #$C0
C - - - - - 0x014259 05:8249: 90 03     BCC bra_824E
C - - - - - 0x01425B 05:824B: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_824E:
C - - - - - 0x01425E 05:824E: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014261 05:8251: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x014264 05:8254: D0 21     BNE bra_8277
C - - - - - 0x014266 05:8256: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x014269 05:8259: 85 0A     STA ram_000A
C - - - - - 0x01426B 05:825B: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x01426E 05:825E: A0 03     LDY #$03
C - - - - - 0x014270 05:8260: 20 E4 F2  JSR sub_0x01F2F4
C - - - - - 0x014273 05:8263: 20 FA 82  JSR sub_82FA
C - - - - - 0x014276 05:8266: A9 10     LDA #$10
C - - - - - 0x014278 05:8268: DE 72 07  DEC ram_0772_obj,X
C - - - - - 0x01427B 05:826B: 10 07     BPL bra_8274
C - - - - - 0x01427D 05:826D: A9 02     LDA #$02
C - - - - - 0x01427F 05:826F: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x014282 05:8272: A9 57     LDA #$57
bra_8274:
C - - - - - 0x014284 05:8274: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_8277:
C - - - - - 0x014287 05:8277: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x01428A 05:827A: D0 38     BNE bra_82B4_RTS
C - - - - - 0x01428C 05:827C: A9 0C     LDA #$0C
C - - - - - 0x01428E 05:827E: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x014291 05:8281: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x014294 05:8284: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014297 05:8287: 38        SEC
C - - - - - 0x014298 05:8288: E9 10     SBC #$10
C - - - - - 0x01429A 05:828A: D9 32 05  CMP ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x01429D 05:828D: 98        TYA
C - - - - - 0x01429E 05:828E: 90 04     BCC bra_8294
C - - - - - 0x0142A0 05:8290: 49 01     EOR #$01
C - - - - - 0x0142A2 05:8292: 85 0A     STA ram_000A
bra_8294:
C - - - - - 0x0142A4 05:8294: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0142A7 05:8297: 20 A2 F4  JSR sub_0x01F4B2
C - - - - - 0x0142AA 05:829A: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0142AD 05:829D: 85 0B     STA ram_000B
C - - - - - 0x0142AF 05:829F: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0142B2 05:82A2: C9 0D     CMP #$0D
C - - - - - 0x0142B4 05:82A4: B0 0E     BCS bra_82B4_RTS
C - - - - - 0x0142B6 05:82A6: A8        TAY
C - - - - - 0x0142B7 05:82A7: B9 B5 82  LDA tbl_82B5,Y
C - - - - - 0x0142BA 05:82AA: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0142BD 05:82AD: C5 0B     CMP ram_000B
C - - - - - 0x0142BF 05:82AF: F0 03     BEQ bra_82B4_RTS
C - - - - - 0x0142C1 05:82B1: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_82B4_RTS:
C - - - - - 0x0142C4 05:82B4: 60        RTS

tbl_82B5:
- D 0 - - - 0x0142C5 05:82B5: 00        .byte $00   ; 00 
- D 0 - - - 0x0142C6 05:82B6: 00        .byte $00   ; 01 
- D 0 - - - 0x0142C7 05:82B7: 01        .byte $01   ; 02 
- D 0 - - - 0x0142C8 05:82B8: 01        .byte $01   ; 03 
- D 0 - - - 0x0142C9 05:82B9: 01        .byte $01   ; 04 
- D 0 - - - 0x0142CA 05:82BA: 02        .byte $02   ; 05 
- D 0 - - - 0x0142CB 05:82BB: 02        .byte $02   ; 06 
- D 0 - - - 0x0142CC 05:82BC: 02        .byte $02   ; 07 
- D 0 - - - 0x0142CD 05:82BD: 03        .byte $03   ; 08 
- D 0 - - - 0x0142CE 05:82BE: 03        .byte $03   ; 09 
- D 0 - - - 0x0142CF 05:82BF: 03        .byte $03   ; 0A 
- D 0 - - - 0x0142D0 05:82C0: 04        .byte $04   ; 0B 
- D 0 - - - 0x0142D1 05:82C1: 04        .byte $04   ; 0C 

; ******************************************************************************************************************

ofs_038_46_82C2_04:
C - - J - - 0x0142D2 05:82C2: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0142D5 05:82C5: BC 56 07  LDY ram_скролл_объекта_X,X
C - - - - - 0x0142D8 05:82C8: B9 D5 82  LDA tbl_82D5,Y
C - - - - - 0x0142DB 05:82CB: 20 E7 82  JSR sub_82E7
C - - - - - 0x0142DE 05:82CE: B0 E4     BCS bra_82B4_RTS
C - - - - - 0x0142E0 05:82D0: A9 03     LDA #$03
C - - - - - 0x0142E2 05:82D2: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

tbl_82D5:
- D 0 - - - 0x0142E5 05:82D5: 97        .byte $97   ; 00 
- D 0 - - - 0x0142E6 05:82D6: 96        .byte $96   ; 01 
- D 0 - - - 0x0142E7 05:82D7: D4        .byte $D4   ; 02 
- D 0 - - - 0x0142E8 05:82D8: 93        .byte $93   ; 03 
- D 0 - - - 0x0142E9 05:82D9: 92        .byte $92   ; 04 

; ******************************************************************************************************************

ofs_038_46_82DA_07:
C - - J - - 0x0142EA 05:82DA: A9 98     LDA #$98
C - - - - - 0x0142EC 05:82DC: 20 E7 82  JSR sub_82E7
C - - - - - 0x0142EF 05:82DF: B0 03     BCS bra_82E4
C - - - - - 0x0142F1 05:82E1: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта
bra_82E4:
C - - - - - 0x0142F4 05:82E4: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_82E7:
C - - - - - 0x0142F7 05:82E7: 85 08     STA ram_0008
C - - - - - 0x0142F9 05:82E9: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0142FC 05:82EC: E9 0C     SBC #$0C
C - - - - - 0x0142FE 05:82EE: A8        TAY
C - - - - - 0x0142FF 05:82EF: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014302 05:82F2: E9 0C     SBC #$0C
C - - - - - 0x014304 05:82F4: 20 95 F0  JSR sub_0x01F0A5
C - - - - - 0x014307 05:82F7: A6 10     LDX ram_0010    ; загрузить индекс объекта
C - - - - - 0x014309 05:82F9: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_82FA:
C - - - - - 0x01430A 05:82FA: D0 1B     BNE bra_8317_RTS
C - - - - - 0x01430C 05:82FC: BC 56 07  LDY ram_скролл_объекта_X,X
C - - - - - 0x01430F 05:82FF: A6 11     LDX ram_0011
C - - - - - 0x014311 05:8301: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x014314 05:8304: 18        CLC
C - - - - - 0x014315 05:8305: 79 18 83  ADC tbl_8318_позиция_Y,Y
C - - - - - 0x014318 05:8308: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01431B 05:830B: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01431E 05:830E: 18        CLC
C - - - - - 0x01431F 05:830F: 79 1D 83  ADC tbl_831D_позиция_X,Y
C - - - - - 0x014322 05:8312: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x014325 05:8315: A6 10     LDX ram_0010    ; загрузить индекс объекта
bra_8317_RTS:
C - - - - - 0x014327 05:8317: 60        RTS

tbl_8318_позиция_Y:
- D 0 - - - 0x014328 05:8318: FB        .byte $FB   ; 00 
- D 0 - - - 0x014329 05:8319: 04        .byte $04   ; 01 
- D 0 - - - 0x01432A 05:831A: 0C        .byte $0C   ; 02 
- D 0 - - - 0x01432B 05:831B: 04        .byte $04   ; 03 
- D 0 - - - 0x01432C 05:831C: FB        .byte $FB   ; 04 

tbl_831D_позиция_X:
- D 0 - - - 0x01432D 05:831D: 12        .byte $12   ; 00 
- D 0 - - - 0x01432E 05:831E: 0D        .byte $0D   ; 01 
- D 0 - - - 0x01432F 05:831F: 00        .byte $00   ; 02 
- D 0 - - - 0x014330 05:8320: F3        .byte $F3   ; 03 
- D 0 - - - 0x014331 05:8321: EE        .byte $EE   ; 04 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x010881_48_большая_пасть:
- D 0 - I - 0x010881 04:8871: 7D 88     .word ofs_038_48_887D_01_активация_объекта ; 
- D 0 - I - 0x010883 04:8873: B8 88     .word ofs_038_48_88B8_02 ; 
- D 0 - I - 0x010885 04:8875: CC 88     .word ofs_038_48_88CC_03 ; 
- D 0 - I - 0x010887 04:8877: 4E 89     .word ofs_038_48_894E_04 ; 
- D 0 - I - 0x010889 04:8879: FD A2     .word ofs_038_48_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x01088B 04:887B: 3D A3     .word ofs_038_48_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_48_887D_01_активация_объекта:
C - - J - - 0x01088D 04:887D: A9 01     LDA #$01
C - - - - - 0x01088F 04:887F: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x010892 04:8882: A9 01     LDA #$01
C - - - - - 0x010894 04:8884: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x010897 04:8887: A9 06     LDA #$06
C - - - - - 0x010899 04:8889: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x01089C 04:888C: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x01089F 04:888F: 4A        LSR
C - - - - - 0x0108A0 04:8890: A9 02     LDA #$02
C - - - - - 0x0108A2 04:8892: 90 14     BCC bra_88A8
C - - - - - 0x0108A4 04:8894: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0108A7 04:8897: 38        SEC
C - - - - - 0x0108A8 04:8898: E9 08     SBC #$08
C - - - - - 0x0108AA 04:889A: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0108AD 04:889D: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0108B0 04:88A0: 18        CLC
C - - - - - 0x0108B1 04:88A1: 69 08     ADC #$08
C - - - - - 0x0108B3 04:88A3: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0108B6 04:88A6: A9 FF     LDA #$FF
bra_88A8:
C - - - - - 0x0108B8 04:88A8: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0108BB 04:88AB: A9 01     LDA #$01
C - - - - - 0x0108BD 04:88AD: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0108C0 04:88B0: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0108C3 04:88B3: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_48_88B8_02:
C - - J - - 0x0108C8 04:88B8: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0108CB 04:88BB: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0108CE 04:88BE: 4A        LSR
C - - - - - 0x0108CF 04:88BF: 90 07     BCC bra_88C8
C - - - - - 0x0108D1 04:88C1: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0108D4 04:88C4: C9 28     CMP #$28
C - - - - - 0x0108D6 04:88C6: 90 03     BCC bra_88CB_RTS
bra_88C8:
C - - - - - 0x0108D8 04:88C8: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_88CB_RTS:
C - - - - - 0x0108DB 04:88CB: 60        RTS

; ******************************************************************************************************************

ofs_038_48_88CC_03:
C - - J - - 0x0108DC 04:88CC: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0108DF 04:88CF: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0108E2 04:88D2: D0 70     BNE bra_8944_RTS
C - - - - - 0x0108E4 04:88D4: 20 5E 89  JSR sub_895E
C - - - - - 0x0108E7 04:88D7: A9 01     LDA #$01
C - - - - - 0x0108E9 04:88D9: B0 5D     BCS bra_8938
C - - - - - 0x0108EB 04:88DB: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0108EE 04:88DE: D0 28     BNE bra_8908
C - - - - - 0x0108F0 04:88E0: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0108F3 04:88E3: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0108F6 04:88E6: C0 C0     CPY #$C0
C - - - - - 0x0108F8 04:88E8: B0 0F     BCS bra_88F9
C - - - - - 0x0108FA 04:88EA: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0108FD 04:88ED: C9 05     CMP #$05
C - - - - - 0x0108FF 04:88EF: B0 08     BCS bra_88F9
C - - - - - 0x010901 04:88F1: C9 02     CMP #$02
C - - - - - 0x010903 04:88F3: D0 41     BNE bra_8936
C - - - - - 0x010905 04:88F5: A9 1E     LDA #$1E
C - - - - - 0x010907 04:88F7: D0 3F     BNE bra_8938    ; jmp
bra_88F9:
C - - - - - 0x010909 04:88F9: A9 01     LDA #$01
C - - - - - 0x01090B 04:88FB: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x01090E 04:88FE: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x010911 04:8901: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x010914 04:8904: A9 0C     LDA #$0C
C - - - - - 0x010916 04:8906: D0 30     BNE bra_8938    ; jmp
bra_8908:
C - - - - - 0x010918 04:8908: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01091B 04:890B: A9 FF     LDA #$FF
C - - - - - 0x01091D 04:890D: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010920 04:8910: C0 C0     CPY #$C0
C - - - - - 0x010922 04:8912: B0 07     BCS bra_891B
C - - - - - 0x010924 04:8914: BC 56 07  LDY ram_скролл_объекта_X,X
C - - - - - 0x010927 04:8917: F0 02     BEQ bra_891B
C - - - - - 0x010929 04:8919: A9 01     LDA #$01
bra_891B:
C - - - - - 0x01092B 04:891B: DD 10 07  CMP ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01092E 04:891E: D0 16     BNE bra_8936
C - - - - - 0x010930 04:8920: A8        TAY
C - - - - - 0x010931 04:8921: 30 22     BMI bra_8945
C - - - - - 0x010933 04:8923: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x010936 04:8926: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x010939 04:8929: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x01093C 04:892C: 30 03     BMI bra_8931
C - - - - - 0x01093E 04:892E: DE 56 07  DEC ram_скролл_объекта_X,X
bra_8931:
C - - - - - 0x010941 04:8931: A9 00     LDA #$00
C - - - - - 0x010943 04:8933: 9D 48 07  STA ram_скролл_объекта_Y,X
bra_8936:
C - - - - - 0x010946 04:8936: A9 08     LDA #$08
bra_8938:
C - - - - - 0x010948 04:8938: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x01094B 04:893B: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01094E 04:893E: B9 48 89  LDA tbl_8948_состояние_хитбоксов,Y
C - - - - - 0x010951 04:8941: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
bra_8944_RTS:
C - - - - - 0x010954 04:8944: 60        RTS
bra_8945:
C - - - - - 0x010955 04:8945: 4C 75 A2  JMP loc_0x00628A_удалить_объект

tbl_8948_состояние_хитбоксов:
- D 0 - - - 0x010958 04:8948: 81        .byte $81   ; 00 
- D 0 - - - 0x010959 04:8949: 01        .byte $01   ; 01 
- D 0 - - - 0x01095A 04:894A: 01        .byte $01   ; 02 
- D 0 - - - 0x01095B 04:894B: 00        .byte $00   ; 03 
- D 0 - - - 0x01095C 04:894C: 00        .byte $00   ; 04 
- - - - - - 0x01095D 04:894D: 81        .byte $81   ; 05 

; ******************************************************************************************************************

ofs_038_48_894E_04:
C - - J - - 0x01095E 04:894E: A9 05     LDA #$05
C - - - - - 0x010960 04:8950: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x010963 04:8953: 20 5E 89  JSR sub_895E
C - - - - - 0x010966 04:8956: B0 03     BCS bra_895B
C - - - - - 0x010968 04:8958: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта
bra_895B:
C - - - - - 0x01096B 04:895B: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_895E:
C - - - - - 0x01096E 04:895E: A5 1E     LDA ram_index_ppu_buffer
C - - - - - 0x010970 04:8960: C9 20     CMP #$20
C - - - - - 0x010974 04:8964: B0 DE     BCS bra_8944_RTS
C - - - - - 0x010976 04:8966: 20 FF 89  JSR sub_89FF
C - - - - - 0x010979 04:8969: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x01097C 04:896C: 0A        ASL
C - - - - - 0x01097D 04:896D: A8        TAY
C - - - - - 0x01097E 04:896E: B9 2E 8A  LDA tbl_8A2E_поинтеры,Y
C - - - - - 0x010981 04:8971: 85 08     STA ram_0008
C - - - - - 0x010983 04:8973: B9 2F 8A  LDA tbl_8A2E_поинтеры + $01,Y
C - - - - - 0x010986 04:8976: 85 09     STA ram_0009
C - - - - - 0x010988 04:8978: A0 00     LDY #$00
C - - - - - 0x01098A 04:897A: A6 1E     LDX ram_index_ppu_buffer
C - - - - - 0x01098C 04:897C: A9 06     LDA #con_buf_mode_06
C - - - - - 0x01098E 04:897E: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x010991 04:8981: E8        INX
bra_8982_loop:
C - - - - - 0x010992 04:8982: B1 08     LDA (ram_0008),Y
C - - - - - 0x010994 04:8984: C9 FF     CMP #$FF
C - - - - - 0x010996 04:8986: F0 26     BEQ bra_89AE_FF
C - - - - - 0x010998 04:8988: 18        CLC
C - - - - - 0x010999 04:8989: 65 00     ADC ram_0000    ; ppu hi
C - - - - - 0x01099B 04:898B: 9D 01 03  STA ram_nmt_buffer + $01,X
C - - - - - 0x01099E 04:898E: A5 01     LDA ram_0001    ; ppu lo
C - - - - - 0x0109A0 04:8990: 69 00     ADC #$00
C - - - - - 0x0109A2 04:8992: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0109A5 04:8995: E8        INX
C - - - - - 0x0109A6 04:8996: E8        INX
C - - - - - 0x0109A7 04:8997: C8        INY
C - - - - - 0x0109A8 04:8998: B1 08     LDA (ram_0008),Y
C - - - - - 0x0109AA 04:899A: 85 0A     STA ram_000A    ; counter
C - - - - - 0x0109AC 04:899C: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0109AF 04:899F: E8        INX
C - - - - - 0x0109B0 04:89A0: C8        INY
bra_89A1_loop:
C - - - - - 0x0109B1 04:89A1: B1 08     LDA (ram_0008),Y
C - - - - - 0x0109B3 04:89A3: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0109B6 04:89A6: E8        INX
C - - - - - 0x0109B7 04:89A7: C8        INY
C - - - - - 0x0109B8 04:89A8: C6 0A     DEC ram_000A
C - - - - - 0x0109BA 04:89AA: D0 F5     BNE bra_89A1_loop
C - - - - - 0x0109BC 04:89AC: F0 D4     BEQ bra_8982_loop    ; jmp
bra_89AE_FF:
C - - - - - 0x0109BE 04:89AE: C8        INY
C - - - - - 0x0109BF 04:89AF: A5 00     LDA ram_0000
C - - - - - 0x0109C1 04:89B1: 0A        ASL
C - - - - - 0x0109C2 04:89B2: 26 01     ROL ram_0001
C - - - - - 0x0109C4 04:89B4: 0A        ASL
C - - - - - 0x0109C5 04:89B5: 0A        ASL
C - - - - - 0x0109C6 04:89B6: 46 01     LSR ram_0001
C - - - - - 0x0109C8 04:89B8: 6A        ROR
C - - - - - 0x0109C9 04:89B9: 46 01     LSR ram_0001
C - - - - - 0x0109CB 04:89BB: 6A        ROR
C - - - - - 0x0109CC 04:89BC: 46 01     LSR ram_0001
C - - - - - 0x0109CE 04:89BE: 6A        ROR
C - - - - - 0x0109CF 04:89BF: 4A        LSR
C - - - - - 0x0109D0 04:89C0: 4A        LSR
C - - - - - 0x0109D1 04:89C1: 09 C0     ORA #$C0
C - - - - - 0x0109D3 04:89C3: 85 00     STA ram_0000
C - - - - - 0x0109D5 04:89C5: A9 02     LDA #$02
C - - - - - 0x0109D7 04:89C7: 85 01     STA ram_0001
bra_89C9_loop:
C - - - - - 0x0109D9 04:89C9: A9 23     LDA #$23    ; ppu hi
C - - - - - 0x0109DB 04:89CB: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0109DE 04:89CE: E8        INX
C - - - - - 0x0109DF 04:89CF: A5 00     LDA ram_0000    ; ppu lo
C - - - - - 0x0109E1 04:89D1: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0109E4 04:89D4: E8        INX
C - - - - - 0x0109E5 04:89D5: A9 02     LDA #$02    ; counter
C - - - - - 0x0109E7 04:89D7: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0109EA 04:89DA: 85 02     STA ram_0002
C - - - - - 0x0109EC 04:89DC: E8        INX
bra_89DD_loop:
C - - - - - 0x0109ED 04:89DD: B1 08     LDA (ram_0008),Y
C - - - - - 0x0109EF 04:89DF: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0109F2 04:89E2: E8        INX
C - - - - - 0x0109F3 04:89E3: C8        INY
C - - - - - 0x0109F4 04:89E4: C6 02     DEC ram_0002
C - - - - - 0x0109F6 04:89E6: D0 F5     BNE bra_89DD_loop
C - - - - - 0x0109F8 04:89E8: A5 00     LDA ram_0000
C - - - - - 0x0109FA 04:89EA: 18        CLC
C - - - - - 0x0109FB 04:89EB: 69 08     ADC #$08
C - - - - - 0x0109FD 04:89ED: 85 00     STA ram_0000
C - - - - - 0x0109FF 04:89EF: C6 01     DEC ram_0001
C - - - - - 0x010A01 04:89F1: D0 D6     BNE bra_89C9_loop
; close buffer
C - - - - - 0x010A03 04:89F3: A9 FF     LDA #$FF
C - - - - - 0x010A05 04:89F5: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x010A08 04:89F8: E8        INX
C - - - - - 0x010A09 04:89F9: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x010A0B 04:89FB: A6 10     LDX ram_0010
C - - - - - 0x010A0D 04:89FD: 18        CLC
C - - - - - 0x010A0E 04:89FE: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_89FF:
C - - - - - 0x010A0F 04:89FF: A9 08     LDA #$08
C - - - - - 0x010A11 04:8A01: 85 01     STA ram_0001
C - - - - - 0x010A13 04:8A03: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010A16 04:8A06: 38        SEC
C - - - - - 0x010A17 04:8A07: E9 10     SBC #$10
C - - - - - 0x010A19 04:8A09: 18        CLC
C - - - - - 0x010A1A 04:8A0A: 65 FC     ADC ram_scroll_Y
C - - - - - 0x010A1C 04:8A0C: B0 04     BCS bra_8A12
C - - - - - 0x010A1E 04:8A0E: C9 F0     CMP #$F0
C - - - - - 0x010A20 04:8A10: 90 02     BCC bra_8A14
bra_8A12:
C - - - - - 0x010A22 04:8A12: 69 0F     ADC #$0F
bra_8A14:
C - - - - - 0x010A24 04:8A14: 29 E0     AND #$E0
C - - - - - 0x010A26 04:8A16: 0A        ASL
C - - - - - 0x010A27 04:8A17: 26 01     ROL ram_0001
C - - - - - 0x010A29 04:8A19: 0A        ASL
C - - - - - 0x010A2A 04:8A1A: 26 01     ROL ram_0001
C - - - - - 0x010A2C 04:8A1C: 85 02     STA ram_0002
C - - - - - 0x010A2E 04:8A1E: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010A31 04:8A21: 38        SEC
C - - - - - 0x010A32 04:8A22: E9 10     SBC #$10
C - - - - - 0x010A34 04:8A24: 4A        LSR
C - - - - - 0x010A35 04:8A25: 4A        LSR
C - - - - - 0x010A36 04:8A26: 4A        LSR
C - - - - - 0x010A37 04:8A27: 29 1C     AND #$1C
C - - - - - 0x010A39 04:8A29: 05 02     ORA ram_0002
C - - - - - 0x010A3B 04:8A2B: 85 00     STA ram_0000
C - - - - - 0x010A3D 04:8A2D: 60        RTS

tbl_8A2E_поинтеры:
- D 0 - - - 0x010A3E 04:8A2E: 3A 8A     .word _off023_8A3A_00
- D 0 - - - 0x010A40 04:8A30: 47 8A     .word _off023_8A47_01
- D 0 - - - 0x010A42 04:8A32: 60 8A     .word _off023_8A60_02
- D 0 - - - 0x010A44 04:8A34: 81 8A     .word _off023_8A81_03
- D 0 - - - 0x010A46 04:8A36: B2 8A     .word _off023_8AB2_04
- D 0 - - - 0x010A48 04:8A38: E3 8A     .word _off023_8AE3_05

; _________________________________________________________________________________________________________________

_off023_8A3A_00:
- D 0 - I - 0x010A4A 04:8A3A: 63        .byte $63   ; ppu address offset
- D 0 - I - 0x010A4B 04:8A3B: 02        .byte $02   ; counter
- D 0 - I - 0x010A4C 04:8A3C: 09        .byte $09, $0B   ; tiles

- D 0 - I - 0x010A4E 04:8A3E: 83        .byte $83   ; ppu address offset
- D 0 - I - 0x010A4F 04:8A3F: 02        .byte $02   ; counter
- D 0 - I - 0x010A50 04:8A40: 47        .byte $47, $0B   ; tiles

- D 0 - I - 0x010A52 04:8A42: FF        .byte $FF   ; end token + last 4 tiles
- D 0 - I - 0x010A53 04:8A43: 00        .byte $00, $00   ; 
- D 0 - I - 0x010A55 04:8A45: 00        .byte $00, $00   ; 

; _________________________________________________________________________________________________________________

_off023_8A47_01:
- D 0 - I - 0x010A57 04:8A47: 43        .byte $43   ; ppu address offset
- D 0 - I - 0x010A58 04:8A48: 02        .byte $02   ; counter
- D 0 - I - 0x010A59 04:8A49: 0C        .byte $0C, $0A   ; tiles

- D 0 - I - 0x010A5B 04:8A4B: 62        .byte $62   ; ppu address offset
- D 0 - I - 0x010A5C 04:8A4C: 04        .byte $04   ; counter
- D 0 - I - 0x010A5D 04:8A4D: 0A        .byte $0A, $88, $89, $0C   ; tiles

- D 0 - I - 0x010A61 04:8A51: 82        .byte $82   ; ppu address offset
- D 0 - I - 0x010A62 04:8A52: 04        .byte $04   ; counter
- D 0 - I - 0x010A63 04:8A53: 0A        .byte $0A, $8A, $8B, $0C   ; tiles

- D 0 - I - 0x010A67 04:8A57: A3        .byte $A3   ; ppu address offset
- D 0 - I - 0x010A68 04:8A58: 02        .byte $02   ; counter
- D 0 - I - 0x010A69 04:8A59: 0C        .byte $0C, $0A   ; tiles

- D 0 - I - 0x010A6B 04:8A5B: FF        .byte $FF   ; end token + last 4 tiles
- D 0 - I - 0x010A6C 04:8A5C: 00        .byte $00, $00   ; 
- D 0 - I - 0x010A6E 04:8A5E: 00        .byte $00, $00   ; 

; _________________________________________________________________________________________________________________

_off023_8A60_02:
- D 0 - I - 0x010A70 04:8A60: 42        .byte $42   ; ppu address offset
- D 0 - I - 0x010A71 04:8A61: 04        .byte $04   ; counter
- D 0 - I - 0x010A72 04:8A62: 0B        .byte $0B, $8C, $8D, $47   ; tiles

- D 0 - I - 0x010A76 04:8A66: 61        .byte $61   ; ppu address offset
- D 0 - I - 0x010A77 04:8A67: 06        .byte $06   ; counter
- D 0 - I - 0x010A78 04:8A68: 0C        .byte $0C, $8E, $8F, $90, $91, $0A   ; tiles

- D 0 - I - 0x010A7E 04:8A6E: 81        .byte $81   ; ppu address offset
- D 0 - I - 0x010A7F 04:8A6F: 06        .byte $06   ; counter
- D 0 - I - 0x010A80 04:8A70: 0C        .byte $0C, $92, $93, $94, $95, $0A   ; tiles

- D 0 - I - 0x010A86 04:8A76: A2        .byte $A2   ; ppu address offset
- D 0 - I - 0x010A87 04:8A77: 04        .byte $04   ; counter
- D 0 - I - 0x010A88 04:8A78: 0B        .byte $0B, $96, $97, $09   ; tiles

- D 0 - I - 0x010A8C 04:8A7C: FF        .byte $FF   ; end token + last 4 tiles
- D 0 - I - 0x010A8D 04:8A7D: 00        .byte $00, $00   ; 
- D 0 - I - 0x010A8F 04:8A7F: 00        .byte $00, $00   ; 

; _________________________________________________________________________________________________________________

_off023_8A81_03:
- D 0 - I - 0x010A91 04:8A81: 22        .byte $22   ; ppu address offset
- D 0 - I - 0x010A92 04:8A82: 04        .byte $04   ; counter
- D 0 - I - 0x010A93 04:8A83: 0B        .byte $0B, $0C, $0A, $09   ; tiles

- D 0 - I - 0x010A97 04:8A87: 41        .byte $41   ; ppu address offset
- D 0 - I - 0x010A98 04:8A88: 06        .byte $06   ; counter
- D 0 - I - 0x010A99 04:8A89: 47        .byte $47, $98, $99, $9A, $9B, $0B   ; tiles

- D 0 - I - 0x010A9F 04:8A8F: 61        .byte $61   ; ppu address offset
- D 0 - I - 0x010AA0 04:8A90: 06        .byte $06   ; counter
- D 0 - I - 0x010AA1 04:8A91: 9C        .byte $9C, $9D, $9E, $9F, $A0, $A1   ; tiles

- D 0 - I - 0x010AA7 04:8A97: 81        .byte $81   ; ppu address offset
- D 0 - I - 0x010AA8 04:8A98: 06        .byte $06   ; counter
- D 0 - I - 0x010AA9 04:8A99: A2        .byte $A2, $A3, $A4, $A5, $A6, $A7   ; tiles

- D 0 - I - 0x010AAF 04:8A9F: A1        .byte $A1   ; ppu address offset
- D 0 - I - 0x010AB0 04:8AA0: 06        .byte $06   ; counter
- D 0 - I - 0x010AB1 04:8AA1: 09        .byte $09, $A8, $A9, $AA, $AB, $0B   ; tiles

- D 0 - I - 0x010AB7 04:8AA7: C2        .byte $C2   ; ppu address offset
- D 0 - I - 0x010AB8 04:8AA8: 04        .byte $04   ; counter
- D 0 - I - 0x010AB9 04:8AA9: 0B        .byte $0B, $0C, $0A, $47   ; tiles

- D 0 - I - 0x010ABD 04:8AAD: FF        .byte $FF   ; end token + last 4 tiles
- D 0 - I - 0x010ABE 04:8AAE: 80        .byte $80, $20   ; 
- D 0 - I - 0x010AC0 04:8AB0: 08        .byte $08, $02   ; 

; _________________________________________________________________________________________________________________

_off023_8AB2_04:
- D 0 - I - 0x010AC2 04:8AB2: 22        .byte $22   ; ppu address offset
- D 0 - I - 0x010AC3 04:8AB3: 04        .byte $04   ; counter
- D 0 - I - 0x010AC4 04:8AB4: AC        .byte $AC, $AD, $AE, $AF   ; tiles

- D 0 - I - 0x010AC8 04:8AB8: 41        .byte $41   ; ppu address offset
- D 0 - I - 0x010AC9 04:8AB9: 06        .byte $06   ; counter
- D 0 - I - 0x010ACA 04:8ABA: B0        .byte $B0, $B1, $B2, $B3, $B4, $B5   ; tiles

- D 0 - I - 0x010AD0 04:8AC0: 61        .byte $61   ; ppu address offset
- D 0 - I - 0x010AD1 04:8AC1: 06        .byte $06   ; counter
- D 0 - I - 0x010AD2 04:8AC2: B6        .byte $B6, $B7, $B8, $B9, $BA, $BB   ; tiles

- D 0 - I - 0x010AD8 04:8AC8: 81        .byte $81   ; ppu address offset
- D 0 - I - 0x010AD9 04:8AC9: 06        .byte $06   ; counter
- D 0 - I - 0x010ADA 04:8ACA: BC        .byte $BC, $BD, $BE, $BF, $C0, $C1   ; tiles

- D 0 - I - 0x010AE0 04:8AD0: A1        .byte $A1   ; ppu address offset
- D 0 - I - 0x010AE1 04:8AD1: 06        .byte $06   ; counter
- D 0 - I - 0x010AE2 04:8AD2: C2        .byte $C2, $C3, $C4, $C5, $C6, $C7   ; tiles

- D 0 - I - 0x010AE8 04:8AD8: C2        .byte $C2   ; ppu address offset
- D 0 - I - 0x010AE9 04:8AD9: 04        .byte $04   ; counter
- D 0 - I - 0x010AEA 04:8ADA: C8        .byte $C8, $C9, $CA, $CB   ; tiles

- D 0 - I - 0x010AEE 04:8ADE: FF        .byte $FF   ; end token + last 4 tiles
- D 0 - I - 0x010AEF 04:8ADF: 80        .byte $80, $20   ; 
- D 0 - I - 0x010AF1 04:8AE1: 08        .byte $08, $02   ; 

; _________________________________________________________________________________________________________________

_off023_8AE3_05:
- D 0 - I - 0x010AF3 04:8AE3: 22        .byte $22   ; ppu address offset
- D 0 - I - 0x010AF4 04:8AE4: 04        .byte $04   ; counter
- D 0 - I - 0x010AF5 04:8AE5: 0B        .byte $0B, $0C, $0A, $09   ; tiles

- D 0 - I - 0x010AF9 04:8AE9: 41        .byte $41   ; ppu address offset
- D 0 - I - 0x010AFA 04:8AEA: 06        .byte $06   ; counter
- D 0 - I - 0x010AFB 04:8AEB: 47        .byte $47, $0B, $0C, $0A, $47, $0B   ; tiles

- D 0 - I - 0x010B01 04:8AF1: 61        .byte $61   ; ppu address offset
- D 0 - I - 0x010B02 04:8AF2: 06        .byte $06   ; counter
- D 0 - I - 0x010B03 04:8AF3: 0C        .byte $0C, $0A, $09, $0B, $0C, $0A   ; tiles

- D 0 - I - 0x010B09 04:8AF9: 81        .byte $81   ; ppu address offset
- D 0 - I - 0x010B0A 04:8AFA: 06        .byte $06   ; counter
- D 0 - I - 0x010B0B 04:8AFB: 0C        .byte $0C, $0A, $47, $0B, $0C, $0A   ; tiles

- D 0 - I - 0x010B11 04:8B01: A1        .byte $A1   ; ppu address offset
- D 0 - I - 0x010B12 04:8B02: 06        .byte $06   ; counter
- D 0 - I - 0x010B13 04:8B03: 09        .byte $09, $0B, $0C, $0A, $09, $0B   ; tiles

- D 0 - I - 0x010B19 04:8B09: C2        .byte $C2   ; ppu address offset
- D 0 - I - 0x010B1A 04:8B0A: 04        .byte $04   ; counter
- D 0 - I - 0x010B1B 04:8B0B: 0B        .byte $0B, $0C, $0B, $0C   ; tiles

- D 0 - I - 0x010B1F 04:8B0F: FF        .byte $FF   ; end token + last 4 tiles
- D 0 - I - 0x010B20 04:8B10: 00        .byte $00, $00   ; 
- D 0 - I - 0x010B22 04:8B12: 00        .byte $00, $00   ; 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x010B24_49_спавнер_большой_пасти:
- D 0 - I - 0x010B24 04:8B14: 18 8B     .word ofs_038_49_8B18_01_активация_объекта ; 
- D 0 - I - 0x010B26 04:8B16: 22 8B     .word ofs_038_49_8B22_02 ; 

; ******************************************************************************************************************

ofs_038_49_8B18_01_активация_объекта:
C - - J - - 0x010B28 04:8B18: A9 F0     LDA #con_HP_F0
C - - - - - 0x010B2A 04:8B1A: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x010B2D 04:8B1D: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_49_8B22_02:
C - - J - - 0x010B32 04:8B22: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x010B35 04:8B25: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010B38 04:8B28: C9 E0     CMP #$E0
C - - - - - 0x010B3A 04:8B2A: 90 11     BCC bra_8B3D
C - - - - - 0x010B3C 04:8B2C: BC 56 07  LDY ram_скролл_объекта_X,X
C - - - - - 0x010B3F 04:8B2F: 30 31     BMI bra_8B62
C - - - - - 0x010B41 04:8B31: B9 65 8B  LDA tbl_8B65,Y
C - - - - - 0x010B44 04:8B34: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x010B47 04:8B37: B9 68 8B  LDA tbl_8B68_позиция_Y,Y
C - - - - - 0x010B4A 04:8B3A: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
bra_8B3D:
C - - - - - 0x010B4D 04:8B3D: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x010B50 04:8B40: D0 1F     BNE bra_8B61_RTS
C - - - - - 0x010B52 04:8B42: 20 6B 8B  JSR sub_8B6B
C - - - - - 0x010B55 04:8B45: A9 01     LDA #$01
C - - - - - 0x010B57 04:8B47: B0 15     BCS bra_8B5E
C - - - - - 0x010B59 04:8B49: A0 5D     LDY #con_obj_id_48  ; большая пасть из пола
C - - - - - 0x010B5B 04:8B4B: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x010B5E 04:8B4E: 90 0E     BCC bra_8B5E
C - - - - - 0x010B60 04:8B50: A4 11     LDY ram_0011
C - - - - - 0x010B62 04:8B52: A5 08     LDA ram_0008
C - - - - - 0x010B64 04:8B54: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x010B67 04:8B57: A5 09     LDA ram_0009
C - - - - - 0x010B69 04:8B59: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x010B6C 04:8B5C: A9 47     LDA #$47
bra_8B5E:
C - - - - - 0x010B6E 04:8B5E: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_8B61_RTS:
C - - - - - 0x010B71 04:8B61: 60        RTS
bra_8B62:
C - - - - - 0x010B72 04:8B62: 4C 75 A2  JMP loc_0x00628A_удалить_объект

tbl_8B65:
- D 0 - - - 0x010B75 04:8B65: 01        .byte $01   ; 00 
- D 0 - - - 0x010B76 04:8B66: 02        .byte $02   ; 01 
- D 0 - - - 0x010B77 04:8B67: 80        .byte $80   ; 02 

tbl_8B68_позиция_Y:
- D 0 - - - 0x010B78 04:8B68: 00        .byte $00   ; 00 
- D 0 - - - 0x010B79 04:8B69: C0        .byte $C0   ; 01 
- D 0 - - - 0x010B7A 04:8B6A: 00        .byte $00   ; 02 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8B6B:
C - - - - - 0x010B7B 04:8B6B: A5 23     LDA ram_рандом_байт
C - - - - - 0x010B7D 04:8B6D: 4A        LSR
C - - - - - 0x010B7E 04:8B6E: 29 07     AND #$07
C - - - - - 0x010B80 04:8B70: A8        TAY
C - - - - - 0x010B81 04:8B71: B9 31 8C  LDA tbl_8C31_добавочная_позиция_X_спрайта_игрока,Y
C - - - - - 0x010B84 04:8B74: 85 09     STA ram_0009
C - - - - - 0x010B86 04:8B76: A5 23     LDA ram_рандом_байт
C - - - - - 0x010B88 04:8B78: 65 5B     ADC ram_счетчик_кадров
C - - - - - 0x010B8A 04:8B7A: 4A        LSR
C - - - - - 0x010B8B 04:8B7B: 4A        LSR
C - - - - - 0x010B8C 04:8B7C: 4A        LSR
C - - - - - 0x010B8D 04:8B7D: 29 07     AND #$07
C - - - - - 0x010B8F 04:8B7F: A8        TAY
C - - - - - 0x010B90 04:8B80: B9 29 8C  LDA tbl_8C29_добавочная_позиция_Y_спрайта_игрока,Y
C - - - - - 0x010B93 04:8B83: 85 08     STA ram_0008
C - - - - - 0x010B95 04:8B85: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x010B98 04:8B88: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x010B9B 04:8B8B: 29 01     AND #$01
C - - - - - 0x010B9D 04:8B8D: A8        TAY
C - - - - - 0x010B9E 04:8B8E: B9 CA 00  LDA ram_plr_game_over,Y
C - - - - - 0x010BA1 04:8B91: F0 03     BEQ bra_8B96_далее
C - - - - - 0x010BA3 04:8B93: 49 01     EOR #$01
C - - - - - 0x010BA5 04:8B95: A8        TAY
bra_8B96_далее:
C - - - - - 0x010BA6 04:8B96: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x010BA9 04:8B99: 18        CLC
C - - - - - 0x010BAA 04:8B9A: 65 09     ADC ram_0009
C - - - - - 0x010BAC 04:8B9C: C9 20     CMP #$20
C - - - - - 0x010BAE 04:8B9E: 90 04     BCC bra_8BA4
C - - - - - 0x010BB0 04:8BA0: C9 E0     CMP #$E0
C - - - - - 0x010BB2 04:8BA2: 90 09     BCC bra_8BAD
bra_8BA4:
C - - - - - 0x010BB4 04:8BA4: A9 00     LDA #$00
C - - - - - 0x010BB6 04:8BA6: 38        SEC
C - - - - - 0x010BB7 04:8BA7: E5 09     SBC ram_0009
C - - - - - 0x010BB9 04:8BA9: 18        CLC
C - - - - - 0x010BBA 04:8BAA: 79 4C 05  ADC ram_позиция_x_спрайта_игрока,Y
bra_8BAD:
C - - - - - 0x010BBD 04:8BAD: 29 E0     AND #$E0
C - - - - - 0x010BBF 04:8BAF: 85 09     STA ram_0009
C - - - - - 0x010BC1 04:8BB1: B9 32 05  LDA ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x010BC4 04:8BB4: 18        CLC
C - - - - - 0x010BC5 04:8BB5: 65 08     ADC ram_0008
C - - - - - 0x010BC7 04:8BB7: C9 E0     CMP #$E0
C - - - - - 0x010BC9 04:8BB9: B0 04     BCS bra_8BBF
C - - - - - 0x010BCB 04:8BBB: C9 38     CMP #$38
C - - - - - 0x010BCD 04:8BBD: B0 06     BCS bra_8BC5
bra_8BBF:
C - - - - - 0x010BCF 04:8BBF: B9 32 05  LDA ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x010BD2 04:8BC2: 38        SEC
C - - - - - 0x010BD3 04:8BC3: E5 08     SBC ram_0008
bra_8BC5:
C - - - - - 0x010BD5 04:8BC5: 20 39 8C  JSR sub_8C3A
C - - - - - 0x010BD8 04:8BC8: 29 E0     AND #$E0
C - - - - - 0x010BDA 04:8BCA: 85 08     STA ram_0008
C - - - - - 0x010BDC 04:8BCC: C9 10     CMP #$10
C - - - - - 0x010BDE 04:8BCE: 90 04     BCC bra_8BD4
C - - - - - 0x010BE0 04:8BD0: C9 E0     CMP #$E0
C - - - - - 0x010BE2 04:8BD2: 90 09     BCC bra_8BDD
bra_8BD4:
C - - - - - 0x010BE4 04:8BD4: A5 0A     LDA ram_000A
C - - - - - 0x010BE6 04:8BD6: 0A        ASL
C - - - - - 0x010BE7 04:8BD7: A9 20     LDA #$20
C - - - - - 0x010BE9 04:8BD9: 90 02     BCC bra_8BDD
C - - - - - 0x010BEB 04:8BDB: A9 C0     LDA #$C0
bra_8BDD:
C - - - - - 0x010BED 04:8BDD: 85 0B     STA ram_000B
C - - - - - 0x010BEF 04:8BDF: 38        SEC
C - - - - - 0x010BF0 04:8BE0: E5 FC     SBC ram_scroll_Y
C - - - - - 0x010BF2 04:8BE2: 90 04     BCC bra_8BE8
C - - - - - 0x010BF4 04:8BE4: C9 F0     CMP #$F0
C - - - - - 0x010BF6 04:8BE6: 90 03     BCC bra_8BEB
bra_8BE8:
C - - - - - 0x010BF8 04:8BE8: 38        SEC
C - - - - - 0x010BF9 04:8BE9: E9 10     SBC #$10
bra_8BEB:
C - - - - - 0x010BFB 04:8BEB: 85 08     STA ram_0008
C - - - - - 0x010BFD 04:8BED: C9 18     CMP #$18
C - - - - - 0x010BFF 04:8BEF: 90 13     BCC bra_8C04
C - - - - - 0x010C01 04:8BF1: BC 56 07  LDY ram_скролл_объекта_X,X
C - - - - - 0x010C04 04:8BF4: 30 02     BMI bra_8BF8
C - - - - - 0x010C06 04:8BF6: D0 09     BNE bra_8C01
bra_8BF8:
C - - - - - 0x010C08 04:8BF8: DD 22 05  CMP ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010C0B 04:8BFB: 6A        ROR
C - - - - - 0x010C0C 04:8BFC: 5D 56 07  EOR ram_скролл_объекта_X,X
C - - - - - 0x010C0F 04:8BFF: 30 03     BMI bra_8C04
bra_8C01:
C - - - - - 0x010C11 04:8C01: 4C 06 8C  JMP loc_8C06
bra_8C04:
C - - - - - 0x010C14 04:8C04: 38        SEC
C - - - - - 0x010C15 04:8C05: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

loc_8C06:
C D 0 - - - 0x010C16 04:8C06: A0 0D     LDY #$0D
bra_8C08_loop:
C - - - - - 0x010C18 04:8C08: B9 D8 06  LDA ram_тип_объектов,Y
C - - - - - 0x010C1B 04:8C0B: C9 5D     CMP #con_obj_id_48  ; большая пасть из пола
C - - - - - 0x010C1D 04:8C0D: D0 15     BNE bra_8C24
C - - - - - 0x010C1F 04:8C0F: B9 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,Y
C - - - - - 0x010C22 04:8C12: 20 39 8C  JSR sub_8C3A
C - - - - - 0x010C25 04:8C15: 29 E0     AND #$E0
C - - - - - 0x010C27 04:8C17: C5 0B     CMP ram_000B
C - - - - - 0x010C29 04:8C19: D0 09     BNE bra_8C24
C - - - - - 0x010C2B 04:8C1B: B9 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x010C2E 04:8C1E: 29 E0     AND #$E0
C - - - - - 0x010C30 04:8C20: C5 09     CMP ram_0009
C - - - - - 0x010C32 04:8C22: F0 E0     BEQ bra_8C04
bra_8C24:
C - - - - - 0x010C34 04:8C24: 88        DEY
C - - - - - 0x010C35 04:8C25: 10 E1     BPL bra_8C08_loop
C - - - - - 0x010C37 04:8C27: 18        CLC
C - - - - - 0x010C38 04:8C28: 60        RTS

tbl_8C29_добавочная_позиция_Y_спрайта_игрока:
- D 0 - - - 0x010C39 04:8C29: E0        .byte $E0   ; 00 
- D 0 - - - 0x010C3A 04:8C2A: C0        .byte $C0   ; 08 
- D 0 - - - 0x010C3B 04:8C2B: 00        .byte $00   ; 10 
- D 0 - - - 0x010C3C 04:8C2C: A0        .byte $A0   ; 18 
- D 0 - - - 0x010C3D 04:8C2D: E0        .byte $E0   ; 20 
- D 0 - - - 0x010C3E 04:8C2E: 00        .byte $00   ; 28 
- D 0 - - - 0x010C3F 04:8C2F: 20        .byte $20   ; 30 
- D 0 - - - 0x010C40 04:8C30: C0        .byte $C0   ; 38 

tbl_8C31_добавочная_позиция_X_спрайта_игрока:
- D 0 - - - 0x010C41 04:8C31: 00        .byte $00   ; 00 
- D 0 - - - 0x010C42 04:8C32: 20        .byte $20   ; 02 
- D 0 - - - 0x010C43 04:8C33: 40        .byte $40   ; 04 
- D 0 - - - 0x010C44 04:8C34: 60        .byte $60   ; 06 
- D 0 - - - 0x010C45 04:8C35: 00        .byte $00   ; 08 
- D 0 - - - 0x010C46 04:8C36: E0        .byte $E0   ; 0A 
- D 0 - - - 0x010C47 04:8C37: C0        .byte $C0   ; 0C 
- D 0 - - - 0x010C48 04:8C38: A0        .byte $A0   ; 0E 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8C3A:
C - - - - - 0x010C49 04:8C39: 18        CLC
C - - - - - 0x010C4A 04:8C3A: 65 FC     ADC ram_scroll_Y
C - - - - - 0x010C4C 04:8C3C: B0 04     BCS bra_8C42
C - - - - - 0x010C4E 04:8C3E: C9 F0     CMP #$F0
C - - - - - 0x010C50 04:8C40: 90 02     BCC bra_8C44_RTS
bra_8C42:
C - - - - - 0x010C52 04:8C42: 69 0F     ADC #$0F
bra_8C44_RTS:
C - - - - - 0x010C54 04:8C44: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x010C55_4A_вращающийся_большой_череп:
- D 0 - I - 0x010C55 04:8C45: 53 8C     .word ofs_038_4A_8C53_01_активация_объекта ; 
- D 0 - I - 0x010C57 04:8C47: 8F 8C     .word ofs_038_4A_8C8F_02 ; 
- D 0 - I - 0x010C59 04:8C49: F0 8C     .word ofs_038_4A_8CF0_03 ; 
- D 0 - I - 0x010C5B 04:8C4B: 27 8E     .word ofs_038_4A_8E27_04 ; 
- D 0 - I - 0x010C5D 04:8C4D: 9A A2     .word ofs_038_4A_0x0062AA_05_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x010C5F 04:8C4F: FD A2     .word ofs_038_4A_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x010C61 04:8C51: 3D A3     .word ofs_038_4A_0x00628A_07_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_4A_8C53_01_активация_объекта:
C - - J - - 0x010C63 04:8C53: A9 08     LDA #$08
C - - - - - 0x010C65 04:8C55: 9D 76 06  STA ram_жизни_объектов_8bit,X
C - - - - - 0x010C68 04:8C58: A9 02     LDA #$02
C - - - - - 0x010C6A 04:8C5A: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x010C6D 04:8C5D: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010C70 04:8C60: 4A        LSR
C - - - - - 0x010C71 04:8C61: 90 05     BCC bra_8C68_далее
C - - - - - 0x010C73 04:8C63: A9 D0     LDA #$D0
C - - - - - 0x010C75 04:8C65: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
bra_8C68_далее:
C - - - - - 0x010C78 04:8C68: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x010C7B 04:8C6B: 98        TYA
C - - - - - 0x010C7C 04:8C6C: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x010C7F 04:8C6F: B9 32 05  LDA ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x010C82 04:8C72: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x010C85 04:8C75: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x010C88 04:8C78: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x010C8B 04:8C7B: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010C8E 04:8C7E: 0A        ASL
C - - - - - 0x010C8F 04:8C7F: A8        TAY
C - - - - - 0x010C90 04:8C80: B9 E6 8C  LDA tbl_8CE6_скорость_Y,Y
C - - - - - 0x010C93 04:8C83: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x010C96 04:8C86: B9 E7 8C  LDA tbl_8CE6_скорость_Y + $01,Y
C - - - - - 0x010C99 04:8C89: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x010C9C 04:8C8C: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_8CE6_скорость_Y:
- D 0 - - - 0x010CF6 04:8CE6: 00 02     .word $0200 ; 00 
- D 0 - - - 0x010CF8 04:8CE8: 00 FE     .word $FE00 ; 01 

; ******************************************************************************************************************

ofs_038_4A_8C8F_02:
C - - J - - 0x010C9F 04:8C8F: A9 84     LDA #$84
C - - - - - 0x010CA1 04:8C91: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x010CA4 04:8C94: 10 02     BPL bra_8C98
C - - - - - 0x010CA6 04:8C96: A9 88     LDA #$88
bra_8C98:
C - - - - - 0x010CA8 04:8C98: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x010CAB 04:8C9B: A9 03     LDA #$03
C - - - - - 0x010CAD 04:8C9D: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x010CB0 04:8CA0: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x010CB3 04:8CA3: 20 57 8E  JSR sub_8E57
C - - - - - 0x010CB6 04:8CA6: A0 00     LDY #$00
C - - - - - 0x010CB8 04:8CA8: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010CBB 04:8CAB: C5 09     CMP ram_0009
C - - - - - 0x010CBD 04:8CAD: F0 06     BEQ bra_8CB5
C - - - - - 0x010CBF 04:8CAF: A0 02     LDY #$02
C - - - - - 0x010CC1 04:8CB1: 90 02     BCC bra_8CB5
C - - - - - 0x010CC3 04:8CB3: A0 04     LDY #$04
bra_8CB5:
C - - - - - 0x010CC5 04:8CB5: B9 EA 8C  LDA tbl_8CEA_скорость_X,Y
C - - - - - 0x010CC8 04:8CB8: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x010CCB 04:8CBB: B9 EB 8C  LDA tbl_8CEA_скорость_X + $01,Y
C - - - - - 0x010CCE 04:8CBE: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x010CD1 04:8CC1: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010CD4 04:8CC4: 38        SEC
C - - - - - 0x010CD5 04:8CC5: E5 08     SBC ram_0008
C - - - - - 0x010CD7 04:8CC7: B0 04     BCS bra_8CCD
C - - - - - 0x010CD9 04:8CC9: 49 FF     EOR #$FF
C - - - - - 0x010CDB 04:8CCB: 69 01     ADC #$01
bra_8CCD:
C - - - - - 0x010CDD 04:8CCD: C9 38     CMP #$38
C - - - - - 0x010CDF 04:8CCF: B0 14     BCS bra_8CE5_RTS
C - - - - - 0x010CE1 04:8CD1: A9 60     LDA #$60
C - - - - - 0x010CE3 04:8CD3: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x010CE6 04:8CD6: 10 02     BPL bra_8CDA
C - - - - - 0x010CE8 04:8CD8: A9 20     LDA #$20
bra_8CDA:
C - - - - - 0x010CEA 04:8CDA: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x010CED 04:8CDD: A9 16     LDA #con_sound_16
C - - - - - 0x010CEF 04:8CDF: 20 DE FD  JSR sub_0x01FDEE_play_sound
C - - - - - 0x010CF2 04:8CE2: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8CE5_RTS:
C - - - - - 0x010CF5 04:8CE5: 60        RTS

tbl_8CEA_скорость_X:
- D 0 - - - 0x010CFA 04:8CEA: 00 00     .word $0000 ; 00 
- D 0 - - - 0x010CFC 04:8CEC: 00 03     .word $0300 ; 02 
- D 0 - - - 0x010CFE 04:8CEE: 00 FD     .word $FD00 ; 04 

; ******************************************************************************************************************

ofs_038_4A_8CF0_03:
C - - J - - 0x010D00 04:8CF0: 20 71 8E  JSR sub_8E71
C - - - - - 0x010D03 04:8CF3: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x010D06 04:8CF6: 18        CLC
C - - - - - 0x010D07 04:8CF7: 69 01     ADC #$01
C - - - - - 0x010D09 04:8CF9: 29 7F     AND #$7F
C - - - - - 0x010D0B 04:8CFB: 9D 56 07  STA ram_скролл_объекта_X,X
                                        TAY
C - - - - - 0x010D11 04:8D01: B9 87 8D  LDA tbl_8D87,Y
C - - - - - 0x010D14 04:8D04: 18        CLC
C - - - - - 0x010D15 04:8D05: 7D 64 07  ADC ram_0764_obj,X  ; Y позиция игрока
C - - - - - 0x010D18 04:8D08: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010D1B 04:8D0B: 6A        ROR
C - - - - - 0x010D1C 04:8D0C: 59 87 8D  EOR tbl_8D87,Y
C - - - - - 0x010D1F 04:8D0F: 30 10     BMI bra_8D21
C - - - - - 0x010D21 04:8D11: B9 A7 8D  LDA tbl_8DA7,Y
C - - - - - 0x010D24 04:8D14: 18        CLC
C - - - - - 0x010D25 04:8D15: 7D 72 07  ADC ram_0772_obj,X  ; X позиция игрока
C - - - - - 0x010D28 04:8D18: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010D2B 04:8D1B: 6A        ROR
C - - - - - 0x010D2C 04:8D1C: 59 A7 8D  EOR tbl_8DA7,Y
C - - - - - 0x010D2F 04:8D1F: 10 07     BPL bra_8D28
bra_8D21:
C - - - - - 0x010D31 04:8D21: A9 00     LDA #$00
C - - - - - 0x010D33 04:8D23: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x010D36 04:8D26: F0 03     BEQ bra_8D2B    ; jmp
bra_8D28:
C - - - - - 0x010D38 04:8D28: 20 2D 8E  JSR sub_8E2D
bra_8D2B:
C - - - - - 0x010D3B 04:8D2B: A5 82     LDA ram_0082_конфиг_уровня
C - - - - - 0x010D3D 04:8D2D: C9 05     CMP #$05
C - - - - - 0x010D3F 04:8D2F: D0 B4     BNE bra_8CE5_RTS
C - - - - - 0x010D41 04:8D31: A5 FC     LDA ram_scroll_Y
C - - - - - 0x010D43 04:8D33: C9 60     CMP #$60
C - - - - - 0x010D45 04:8D35: B0 AE     BCS bra_8CE5_RTS
C - - - - - 0x010D47 04:8D37: BD 08 05  LDA ram_кадр_объекта_или_пули,X
C - - - - - 0x010D4A 04:8D3A: D0 03     BNE bra_8D3F
- - - - - - 0x010D4C 04:8D3C: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_8D3F:
C - - - - - 0x010D4F 04:8D3F: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x010D52 04:8D42: 18        CLC
C - - - - - 0x010D53 04:8D43: 69 08     ADC #$08
C - - - - - 0x010D55 04:8D45: 29 7F     AND #$7F
C - - - - - 0x010D57 04:8D47: 4A        LSR
C - - - - - 0x010D58 04:8D48: 4A        LSR
C - - - - - 0x010D59 04:8D49: 29 1C     AND #$1C
C - - - - - 0x010D5B 04:8D4B: A8        TAY
C - - - - - 0x010D5C 04:8D4C: B9 67 8D  LDA tbl_8D67_скорость,Y
C - - - - - 0x010D5F 04:8D4F: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x010D62 04:8D52: B9 68 8D  LDA tbl_8D67_скорость + $01,Y
C - - - - - 0x010D65 04:8D55: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x010D68 04:8D58: B9 69 8D  LDA tbl_8D67_скорость + $02,Y
C - - - - - 0x010D6B 04:8D5B: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x010D6E 04:8D5E: B9 6A 8D  LDA tbl_8D67_скорость + $03,Y
C - - - - - 0x010D71 04:8D61: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x010D74 04:8D64: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_8D67_скорость:
; 
- - - - - - 0x010D77 04:8D67: 00 00     .word $0000 ; Y
- - - - - - 0x010D79 04:8D69: 00 02     .word $0200 ; X
; 
- - - - - - 0x010D7B 04:8D6B: 6A 01     .word $016A ; Y
- - - - - - 0x010D7D 04:8D6D: 6A 01     .word $016A ; X
; 
- - - - - - 0x010D7F 04:8D6F: 00 02     .word $0200 ; Y
- - - - - - 0x010D81 04:8D71: 00 00     .word $0000 ; X
; 
- D 0 - - - 0x010D83 04:8D73: 6A 01     .word $016A ; Y
- D 0 - - - 0x010D85 04:8D75: 96 FE     .word $FE96 ; X
; 
- - - - - - 0x010D87 04:8D77: 00 00     .word $0000 ; Y
- - - - - - 0x010D89 04:8D79: 00 FE     .word $FE00 ; X
; 
- - - - - - 0x010D8B 04:8D7B: 96 FE     .word $FE96 ; Y
- - - - - - 0x010D8D 04:8D7D: 96 FE     .word $FE96 ; X
; 
- D 0 - - - 0x010D8F 04:8D7F: 00 FE     .word $FE00 ; Y
- D 0 - - - 0x010D91 04:8D81: 00 00     .word $0000 ; X
; 
- D 0 - - - 0x010D93 04:8D83: 96 FE     .word $FE96 ; Y
- D 0 - - - 0x010D95 04:8D85: 6A 01     .word $016A ; X

tbl_8D87:
- D 0 - - - 0x010D97 04:8D87: 00        .byte $00   ; 00 
- D 0 - - - 0x010D98 04:8D88: 02        .byte $02   ; 01 
- D 0 - - - 0x010D99 04:8D89: 05        .byte $05   ; 02 
- D 0 - - - 0x010D9A 04:8D8A: 08        .byte $08   ; 03 
- D 0 - - - 0x010D9B 04:8D8B: 0A        .byte $0A   ; 04 
- D 0 - - - 0x010D9C 04:8D8C: 0D        .byte $0D   ; 05 
- D 0 - - - 0x010D9D 04:8D8D: 10        .byte $10   ; 06 
- D 0 - - - 0x010D9E 04:8D8E: 12        .byte $12   ; 07 
- D 0 - - - 0x010D9F 04:8D8F: 15        .byte $15   ; 08 
- D 0 - - - 0x010DA0 04:8D90: 17        .byte $17   ; 09 
- D 0 - - - 0x010DA1 04:8D91: 1A        .byte $1A   ; 0A 
- D 0 - - - 0x010DA2 04:8D92: 1C        .byte $1C   ; 0B 
- D 0 - - - 0x010DA3 04:8D93: 1F        .byte $1F   ; 0C 
- D 0 - - - 0x010DA4 04:8D94: 21        .byte $21   ; 0D 
- D 0 - - - 0x010DA5 04:8D95: 23        .byte $23   ; 0E 
- D 0 - - - 0x010DA6 04:8D96: 25        .byte $25   ; 0F 
- D 0 - - - 0x010DA7 04:8D97: 27        .byte $27   ; 10 
- D 0 - - - 0x010DA8 04:8D98: 29        .byte $29   ; 11 
- D 0 - - - 0x010DA9 04:8D99: 2B        .byte $2B   ; 12 
- D 0 - - - 0x010DAA 04:8D9A: 2C        .byte $2C   ; 13 
- D 0 - - - 0x010DAB 04:8D9B: 2E        .byte $2E   ; 14 
- D 0 - - - 0x010DAC 04:8D9C: 2F        .byte $2F   ; 15 
- D 0 - - - 0x010DAD 04:8D9D: 31        .byte $31   ; 16 
- D 0 - - - 0x010DAE 04:8D9E: 32        .byte $32   ; 17 
- D 0 - - - 0x010DAF 04:8D9F: 33        .byte $33   ; 18 
- D 0 - - - 0x010DB0 04:8DA0: 34        .byte $34   ; 19 
- D 0 - - - 0x010DB1 04:8DA1: 35        .byte $35   ; 1A 
- D 0 - - - 0x010DB2 04:8DA2: 36        .byte $36   ; 1B 
- D 0 - - - 0x010DB3 04:8DA3: 36        .byte $36   ; 1C 
- D 0 - - - 0x010DB4 04:8DA4: 37        .byte $37   ; 1D 
- D 0 - - - 0x010DB5 04:8DA5: 37        .byte $37   ; 1E 
- D 0 - - - 0x010DB6 04:8DA6: 37        .byte $37   ; 1F 
tbl_8DA7:
- D 0 - - - 0x010DB7 04:8DA7: 37        .byte $37   ; 00 (20) 
- D 0 - - - 0x010DB8 04:8DA8: 37        .byte $37   ; 01 (21) 
- D 0 - - - 0x010DB9 04:8DA9: 37        .byte $37   ; 02 (22) 
- D 0 - - - 0x010DBA 04:8DAA: 37        .byte $37   ; 03 (23) 
- D 0 - - - 0x010DBB 04:8DAB: 36        .byte $36   ; 04 (24) 
- D 0 - - - 0x010DBC 04:8DAC: 36        .byte $36   ; 05 (25) 
- D 0 - - - 0x010DBD 04:8DAD: 35        .byte $35   ; 06 (26) 
- D 0 - - - 0x010DBE 04:8DAE: 34        .byte $34   ; 07 (27) 
- D 0 - - - 0x010DBF 04:8DAF: 33        .byte $33   ; 08 (28) 
- D 0 - - - 0x010DC0 04:8DB0: 32        .byte $32   ; 09 (29) 
- D 0 - - - 0x010DC1 04:8DB1: 31        .byte $31   ; 0A (2A) 
- D 0 - - - 0x010DC2 04:8DB2: 2F        .byte $2F   ; 0B (2B) 
- D 0 - - - 0x010DC3 04:8DB3: 2E        .byte $2E   ; 0C (2C) 
- D 0 - - - 0x010DC4 04:8DB4: 2C        .byte $2C   ; 0D (2D) 
- D 0 - - - 0x010DC5 04:8DB5: 2B        .byte $2B   ; 0E (2E) 
- D 0 - - - 0x010DC6 04:8DB6: 29        .byte $29   ; 0F (2F) 
- D 0 - - - 0x010DC7 04:8DB7: 27        .byte $27   ; 10 (30) 
- D 0 - - - 0x010DC8 04:8DB8: 25        .byte $25   ; 11 (31) 
- D 0 - - - 0x010DC9 04:8DB9: 23        .byte $23   ; 12 (32) 
- D 0 - - - 0x010DCA 04:8DBA: 21        .byte $21   ; 13 (33) 
- D 0 - - - 0x010DCB 04:8DBB: 1F        .byte $1F   ; 14 (34) 
- D 0 - - - 0x010DCC 04:8DBC: 1C        .byte $1C   ; 15 (35) 
- D 0 - - - 0x010DCD 04:8DBD: 1A        .byte $1A   ; 16 (36) 
- D 0 - - - 0x010DCE 04:8DBE: 17        .byte $17   ; 17 (37) 
- D 0 - - - 0x010DCF 04:8DBF: 15        .byte $15   ; 18 (38) 
- D 0 - - - 0x010DD0 04:8DC0: 12        .byte $12   ; 19 (39) 
- D 0 - - - 0x010DD1 04:8DC1: 10        .byte $10   ; 1A (3A) 
- D 0 - - - 0x010DD2 04:8DC2: 0D        .byte $0D   ; 1B (3B) 
- D 0 - - - 0x010DD3 04:8DC3: 0A        .byte $0A   ; 1C (3C) 
- D 0 - - - 0x010DD4 04:8DC4: 08        .byte $08   ; 1D (3D) 
- D 0 - - - 0x010DD5 04:8DC5: 05        .byte $05   ; 1E (3E) 
- D 0 - - - 0x010DD6 04:8DC6: 02        .byte $02   ; 1F (3F) 
- D 0 - - - 0x010DD7 04:8DC7: 00        .byte $00   ; 20 (40) 
- D 0 - - - 0x010DD8 04:8DC8: FE        .byte $FE   ; 21 (41) 
- D 0 - - - 0x010DD9 04:8DC9: FB        .byte $FB   ; 22 (42) 
- D 0 - - - 0x010DDA 04:8DCA: F8        .byte $F8   ; 23 (43) 
- D 0 - - - 0x010DDB 04:8DCB: F6        .byte $F6   ; 24 (44) 
- D 0 - - - 0x010DDC 04:8DCC: F3        .byte $F3   ; 25 (45) 
- D 0 - - - 0x010DDD 04:8DCD: F0        .byte $F0   ; 26 (46) 
- D 0 - - - 0x010DDE 04:8DCE: EE        .byte $EE   ; 27 (47) 
- D 0 - - - 0x010DDF 04:8DCF: EB        .byte $EB   ; 28 (48) 
- D 0 - - - 0x010DE0 04:8DD0: E9        .byte $E9   ; 29 (49) 
- D 0 - - - 0x010DE1 04:8DD1: E6        .byte $E6   ; 2A (4A) 
- D 0 - - - 0x010DE2 04:8DD2: E4        .byte $E4   ; 2B (4B) 
- D 0 - - - 0x010DE3 04:8DD3: E1        .byte $E1   ; 2C (4C) 
- D 0 - - - 0x010DE4 04:8DD4: DF        .byte $DF   ; 2D (4D) 
- D 0 - - - 0x010DE5 04:8DD5: DD        .byte $DD   ; 2E (4E) 
- D 0 - - - 0x010DE6 04:8DD6: DB        .byte $DB   ; 2F (4F) 
- D 0 - - - 0x010DE7 04:8DD7: D9        .byte $D9   ; 30 (50) 
- D 0 - - - 0x010DE8 04:8DD8: D7        .byte $D7   ; 31 (51) 
- D 0 - - - 0x010DE9 04:8DD9: D5        .byte $D5   ; 32 (52) 
- D 0 - - - 0x010DEA 04:8DDA: D4        .byte $D4   ; 33 (53) 
- D 0 - - - 0x010DEB 04:8DDB: D2        .byte $D2   ; 34 (54) 
- D 0 - - - 0x010DEC 04:8DDC: D1        .byte $D1   ; 35 (55) 
- D 0 - - - 0x010DED 04:8DDD: CF        .byte $CF   ; 36 (56) 
- D 0 - - - 0x010DEE 04:8DDE: CE        .byte $CE   ; 37 (57) 
- D 0 - - - 0x010DEF 04:8DDF: CD        .byte $CD   ; 38 (58) 
- D 0 - - - 0x010DF0 04:8DE0: CC        .byte $CC   ; 39 (59) 
- D 0 - - - 0x010DF1 04:8DE1: CB        .byte $CB   ; 3A (5A) 
- D 0 - - - 0x010DF2 04:8DE2: CA        .byte $CA   ; 3B (5B) 
- D 0 - - - 0x010DF3 04:8DE3: CA        .byte $CA   ; 3C (5C) 
- D 0 - - - 0x010DF4 04:8DE4: C9        .byte $C9   ; 3D (5D) 
- D 0 - - - 0x010DF5 04:8DE5: C9        .byte $C9   ; 3E (5E) 
- D 0 - - - 0x010DF6 04:8DE6: C9        .byte $C9   ; 3F (5F) 
- D 0 - - - 0x010DF7 04:8DE7: C9        .byte $C9   ; 40 (60) 
- D 0 - - - 0x010DF8 04:8DE8: C9        .byte $C9   ; 41 (61) 
- D 0 - - - 0x010DF9 04:8DE9: C9        .byte $C9   ; 42 (62) 
- D 0 - - - 0x010DFA 04:8DEA: C9        .byte $C9   ; 43 (63) 
- D 0 - - - 0x010DFB 04:8DEB: CA        .byte $CA   ; 44 (64) 
- D 0 - - - 0x010DFC 04:8DEC: CA        .byte $CA   ; 45 (65) 
- D 0 - - - 0x010DFD 04:8DED: CB        .byte $CB   ; 46 (66) 
- D 0 - - - 0x010DFE 04:8DEE: CC        .byte $CC   ; 47 (67) 
- D 0 - - - 0x010DFF 04:8DEF: CD        .byte $CD   ; 48 (68) 
- D 0 - - - 0x010E00 04:8DF0: CE        .byte $CE   ; 49 (69) 
- D 0 - - - 0x010E01 04:8DF1: CF        .byte $CF   ; 4A (6A) 
- D 0 - - - 0x010E02 04:8DF2: D1        .byte $D1   ; 4B (6B) 
- D 0 - - - 0x010E03 04:8DF3: D2        .byte $D2   ; 4C (6C) 
- D 0 - - - 0x010E04 04:8DF4: D4        .byte $D4   ; 4D (6D) 
- D 0 - - - 0x010E05 04:8DF5: D5        .byte $D5   ; 4E (6E) 
- D 0 - - - 0x010E06 04:8DF6: D7        .byte $D7   ; 4F (6F) 
- D 0 - - - 0x010E07 04:8DF7: D9        .byte $D9   ; 50 (70) 
- D 0 - - - 0x010E08 04:8DF8: DB        .byte $DB   ; 51 (71) 
- D 0 - - - 0x010E09 04:8DF9: DD        .byte $DD   ; 52 (72) 
- D 0 - - - 0x010E0A 04:8DFA: DF        .byte $DF   ; 53 (73) 
- D 0 - - - 0x010E0B 04:8DFB: E1        .byte $E1   ; 54 (74) 
- D 0 - - - 0x010E0C 04:8DFC: E4        .byte $E4   ; 55 (75) 
- D 0 - - - 0x010E0D 04:8DFD: E6        .byte $E6   ; 56 (76) 
- D 0 - - - 0x010E0E 04:8DFE: E9        .byte $E9   ; 57 (77) 
- D 0 - - - 0x010E0F 04:8DFF: EB        .byte $EB   ; 58 (78) 
- D 0 - - - 0x010E10 04:8E00: EE        .byte $EE   ; 59 (79) 
- D 0 - - - 0x010E11 04:8E01: F0        .byte $F0   ; 5A (7A) 
- D 0 - - - 0x010E12 04:8E02: F3        .byte $F3   ; 5B (7B) 
- D 0 - - - 0x010E13 04:8E03: F6        .byte $F6   ; 5C (7C) 
- D 0 - - - 0x010E14 04:8E04: F8        .byte $F8   ; 5D (7D) 
- D 0 - - - 0x010E15 04:8E05: FB        .byte $FB   ; 5E (7E) 
- D 0 - - - 0x010E16 04:8E06: FE        .byte $FE   ; 5F (7F) 
- D 0 - - - 0x010E17 04:8E07: 00        .byte $00   ; 60 
- D 0 - - - 0x010E18 04:8E08: 02        .byte $02   ; 61 
- D 0 - - - 0x010E19 04:8E09: 05        .byte $05   ; 62 
- D 0 - - - 0x010E1A 04:8E0A: 08        .byte $08   ; 63 
- D 0 - - - 0x010E1B 04:8E0B: 0A        .byte $0A   ; 64 
- D 0 - - - 0x010E1C 04:8E0C: 0D        .byte $0D   ; 65 
- D 0 - - - 0x010E1D 04:8E0D: 10        .byte $10   ; 66 
- D 0 - - - 0x010E1E 04:8E0E: 12        .byte $12   ; 67 
- D 0 - - - 0x010E1F 04:8E0F: 15        .byte $15   ; 68 
- D 0 - - - 0x010E20 04:8E10: 17        .byte $17   ; 69 
- D 0 - - - 0x010E21 04:8E11: 1A        .byte $1A   ; 6A 
- D 0 - - - 0x010E22 04:8E12: 1C        .byte $1C   ; 6B 
- D 0 - - - 0x010E23 04:8E13: 1F        .byte $1F   ; 6C 
- D 0 - - - 0x010E24 04:8E14: 21        .byte $21   ; 6D 
- D 0 - - - 0x010E25 04:8E15: 23        .byte $23   ; 6E 
- D 0 - - - 0x010E26 04:8E16: 25        .byte $25   ; 6F 
- D 0 - - - 0x010E27 04:8E17: 27        .byte $27   ; 70 
- D 0 - - - 0x010E28 04:8E18: 29        .byte $29   ; 71 
- D 0 - - - 0x010E29 04:8E19: 2B        .byte $2B   ; 72 
- D 0 - - - 0x010E2A 04:8E1A: 2C        .byte $2C   ; 73 
- D 0 - - - 0x010E2B 04:8E1B: 2E        .byte $2E   ; 74 
- D 0 - - - 0x010E2C 04:8E1C: 2F        .byte $2F   ; 75 
- D 0 - - - 0x010E2D 04:8E1D: 31        .byte $31   ; 76 
- D 0 - - - 0x010E2E 04:8E1E: 32        .byte $32   ; 77 
- D 0 - - - 0x010E2F 04:8E1F: 33        .byte $33   ; 78 
- D 0 - - - 0x010E30 04:8E20: 34        .byte $34   ; 79 
- D 0 - - - 0x010E31 04:8E21: 35        .byte $35   ; 7A 
- D 0 - - - 0x010E32 04:8E22: 36        .byte $36   ; 7B 
- D 0 - - - 0x010E33 04:8E23: 36        .byte $36   ; 7C 
- D 0 - - - 0x010E34 04:8E24: 37        .byte $37   ; 7D 
- D 0 - - - 0x010E35 04:8E25: 37        .byte $37   ; 7E 
- D 0 - - - 0x010E36 04:8E26: 37        .byte $37   ; 7F 

; ******************************************************************************************************************

ofs_038_4A_8E27_04:
C - - J - - 0x010E37 04:8E27: 20 2D 8E  JSR sub_8E2D
C - - - - - 0x010E3A 04:8E2A: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8E2D:
C - - - - - 0x010E3D 04:8E2D: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x010E40 04:8E30: 18        CLC
C - - - - - 0x010E41 04:8E31: 69 08     ADC #$08
C - - - - - 0x010E43 04:8E33: 29 7F     AND #$7F
C - - - - - 0x010E45 04:8E35: 4A        LSR
C - - - - - 0x010E46 04:8E36: 4A        LSR
C - - - - - 0x010E47 04:8E37: 4A        LSR
C - - - - - 0x010E48 04:8E38: 4A        LSR
C - - - - - 0x010E49 04:8E39: A8        TAY
C - - - - - 0x010E4A 04:8E3A: B9 47 8E  LDA tbl_8E47_кадры_анимации,Y
C - - - - - 0x010E4D 04:8E3D: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x010E50 04:8E40: B9 4F 8E  LDA tbl_8E4F_аттрибуты_спрайта,Y
C - - - - - 0x010E53 04:8E43: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x010E56 04:8E46: 60        RTS

tbl_8E47_кадры_анимации:
- D 0 - - - 0x010E57 04:8E47: 86        .byte $86   ; 00 
- D 0 - - - 0x010E58 04:8E48: 87        .byte $87   ; 10 
- D 0 - - - 0x010E59 04:8E49: 88        .byte $88   ; 20 
- D 0 - - - 0x010E5A 04:8E4A: 87        .byte $87   ; 30 
- D 0 - - - 0x010E5B 04:8E4B: 86        .byte $86   ; 40 
- D 0 - - - 0x010E5C 04:8E4C: 85        .byte $85   ; 50 
- D 0 - - - 0x010E5D 04:8E4D: 84        .byte $84   ; 60 
- D 0 - - - 0x010E5E 04:8E4E: 85        .byte $85   ; 70 

tbl_8E4F_аттрибуты_спрайта:
- D 0 - - - 0x010E5F 04:8E4F: 03        .byte $03   ; 00 
- D 0 - - - 0x010E60 04:8E50: 03        .byte $03   ; 10 
- D 0 - - - 0x010E61 04:8E51: 03        .byte $03   ; 20 
- D 0 - - - 0x010E62 04:8E52: 43        .byte $43   ; 30 
- D 0 - - - 0x010E63 04:8E53: 43        .byte $43   ; 40 
- D 0 - - - 0x010E64 04:8E54: 43        .byte $43   ; 50 
- D 0 - - - 0x010E65 04:8E55: 03        .byte $03   ; 60 
- D 0 - - - 0x010E66 04:8E56: 03        .byte $03   ; 70 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8E57:
C - - - - - 0x010E67 04:8E57: BC 48 07  LDY ram_скролл_объекта_Y,X
C - - - - - 0x010E6A 04:8E5A: B9 CA 00  LDA ram_plr_game_over,Y
C - - - - - 0x010E6D 04:8E5D: F0 07     BEQ bra_8E66
- - - - - - 0x010E6F 04:8E5F: 98        TYA
- - - - - - 0x010E70 04:8E60: 49 01     EOR #$01
- - - - - - 0x010E72 04:8E62: A8        TAY
- - - - - - 0x010E73 04:8E63: 9D 48 07  STA ram_скролл_объекта_Y,X
bra_8E66:
C - - - - - 0x010E76 04:8E66: B9 32 05  LDA ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x010E79 04:8E69: 85 08     STA ram_0008
C - - - - - 0x010E7B 04:8E6B: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x010E7E 04:8E6E: 85 09     STA ram_0009
C - - - - - 0x010E80 04:8E70: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8E71:
C - - - - - 0x010E81 04:8E71: 20 57 8E  JSR sub_8E57
C - - - - - 0x010E84 04:8E74: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x010E87 04:8E77: C5 08     CMP ram_0008
C - - - - - 0x010E89 04:8E79: F0 19     BEQ bra_8E94
C - - - - - 0x010E8B 04:8E7B: A0 00     LDY #$00
C - - - - - 0x010E8D 04:8E7D: 90 02     BCC bra_8E81
C - - - - - 0x010E8F 04:8E7F: A0 02     LDY #$02
bra_8E81:
C - - - - - 0x010E91 04:8E81: B9 BE 8E  LDA tbl_8EBE,Y
C - - - - - 0x010E94 04:8E84: 18        CLC
C - - - - - 0x010E95 04:8E85: 7D A0 06  ADC ram_скорость_объектов_y_младш,X
C - - - - - 0x010E98 04:8E88: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x010E9B 04:8E8B: B9 BF 8E  LDA tbl_8EBE + $01,Y
C - - - - - 0x010E9E 04:8E8E: 7D 64 07  ADC ram_0764_obj,X
C - - - - - 0x010EA1 04:8E91: 9D 64 07  STA ram_0764_obj,X
bra_8E94:
C - - - - - 0x010EA4 04:8E94: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x010EA7 04:8E97: 38        SEC
C - - - - - 0x010EA8 04:8E98: E5 72     SBC ram_скорость_камеры_Y
C - - - - - 0x010EAA 04:8E9A: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x010EAD 04:8E9D: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x010EB0 04:8EA0: C5 09     CMP ram_0009
C - - - - - 0x010EB2 04:8EA2: F0 19     BEQ bra_8EBD_RTS
C - - - - - 0x010EB4 04:8EA4: A0 00     LDY #$00
C - - - - - 0x010EB6 04:8EA6: 90 02     BCC bra_8EAA
C - - - - - 0x010EB8 04:8EA8: A0 02     LDY #$02
bra_8EAA:
C - - - - - 0x010EBA 04:8EAA: B9 BE 8E  LDA tbl_8EBE,Y
C - - - - - 0x010EBD 04:8EAD: 18        CLC
C - - - - - 0x010EBE 04:8EAE: 7D BC 06  ADC ram_скорость_объектов_x_младш,X
C - - - - - 0x010EC1 04:8EB1: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x010EC4 04:8EB4: B9 BF 8E  LDA tbl_8EBE + $01,Y
C - - - - - 0x010EC7 04:8EB7: 7D 72 07  ADC ram_0772_obj,X
C - - - - - 0x010ECA 04:8EBA: 9D 72 07  STA ram_0772_obj,X
bra_8EBD_RTS:
C - - - - - 0x010ECD 04:8EBD: 60        RTS

tbl_8EBE:
;                                              +---------- speed
;                                              |    +----- 
;                                              |    |
- D 0 - - - 0x010ECE 04:8EBE: 00        .byte $00, $01   ; 00 
- D 0 - - - 0x010ED0 04:8EC0: 00        .byte $00, $FF   ; 02

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

 _off001_0x010ED2_15_ползающие_синии_пауки:
- D 0 - I - 0x010ED2 04:8EC2: CE 8E     .word ofs_038_15_8ECE_01_активация_объекта ; 
- D 0 - I - 0x010ED4 04:8EC4: 52 8F     .word ofs_038_15_8F52_02 ; 
- D 0 - I - 0x010ED6 04:8EC6: 1E 91     .word ofs_038_15_911E_03 ; 
- D 0 - I - 0x010ED8 04:8EC8: 9A A2     .word ofs_038_15_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x010EDA 04:8ECA: FD A2     .word ofs_038_15_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x010EDC 04:8ECC: 3D A3     .word ofs_038_15_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_15_8ECE_01_активация_объекта:
C - - J - - 0x010EDE 04:8ECE: A9 14     LDA #$14
C - - - - - 0x010EE0 04:8ED0: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x010EE3 04:8ED3: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x010EE6 04:8ED6: 4A        LSR
C - - - - - 0x010EE7 04:8ED7: 90 0A     BCC bra_8EE3
C - - - - - 0x010EE9 04:8ED9: A9 40     LDA #$40
C - - - - - 0x010EEB 04:8EDB: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x010EEE 04:8EDE: A9 E0     LDA #$E0
C - - - - - 0x010EF0 04:8EE0: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
bra_8EE3:
C - - - - - 0x010EF3 04:8EE3: A9 00     LDA #$00
C - - - - - 0x010EF5 04:8EE5: 9D 3A 07  STA ram_хитбоксы_объектов,X
C - - - - - 0x010EF8 04:8EE8: 20 F8 8E  JSR sub_8EF8
C - - - - - 0x010EFB 04:8EEB: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x010EFE 04:8EEE: A9 20     LDA #$20
C - - - - - 0x010F00 04:8EF0: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x010F03 04:8EF3: A9 30     LDA #$30    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8EF8:
C - - - - - 0x010F08 04:8EF8: 20 DB 90  JSR sub_90DB
C - - - - - 0x010F0B 04:8EFB: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x010F0E 04:8EFE: 20 F0 F4  JSR sub_0x01F500
C - - - - - 0x010F11 04:8F01: A5 0C     LDA ram_000C
C - - - - - 0x010F13 04:8F03: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x010F16 04:8F06: A8        TAY
C - - - - - 0x010F17 04:8F07: 20 9B F4  JSR sub_0x01F4AB
C - - - - - 0x010F1A 04:8F0A: 4C 13 8F  JMP loc_8F13

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8F0D:
C - - - - - 0x010F1D 04:8F0D: 20 DB 90  JSR sub_90DB
C - - - - - 0x010F20 04:8F10: 20 95 F4  JSR sub_0x01F4A5
loc_8F13:
sub_8F13:
C D 0 - - - 0x010F23 04:8F13: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x010F26 04:8F16: 0A        ASL
C - - - - - 0x010F27 04:8F17: 0A        ASL
C - - - - - 0x010F28 04:8F18: A8        TAY
C - - - - - 0x010F29 04:8F19: B9 32 8F  LDA tbl_8F32_скорость,Y
C - - - - - 0x010F2C 04:8F1C: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x010F2F 04:8F1F: B9 33 8F  LDA tbl_8F32_скорость + $01,Y
C - - - - - 0x010F32 04:8F22: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x010F35 04:8F25: B9 34 8F  LDA tbl_8F32_скорость + $02,Y
C - - - - - 0x010F38 04:8F28: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x010F3B 04:8F2B: B9 35 8F  LDA tbl_8F32_скорость + $03,Y
C - - - - - 0x010F3E 04:8F2E: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x010F41 04:8F31: 60        RTS

tbl_8F32_скорость:
; 00 
- D 0 - - - 0x010F42 04:8F32: 00 00     .word $0000 ; Y
- D 0 - - - 0x010F44 04:8F34: C0 00     .word $00C0 ; X
; 01 
- D 0 - - - 0x010F46 04:8F36: 87 00     .word $0087 ; Y
- D 0 - - - 0x010F48 04:8F38: 87 00     .word $0087 ; X
; 02 
- D 0 - - - 0x010F4A 04:8F3A: C0 00     .word $00C0 ; Y
- D 0 - - - 0x010F4C 04:8F3C: 00 00     .word $0000 ; X
; 03 
- D 0 - - - 0x010F4E 04:8F3E: 87 00     .word $0087 ; Y
- D 0 - - - 0x010F50 04:8F40: 79 FF     .word $FF79 ; X
; 04 
- D 0 - - - 0x010F52 04:8F42: 00 00     .word $0000 ; Y
- D 0 - - - 0x010F54 04:8F44: 40 FF     .word $FF40 ; X
; 05 
- D 0 - - - 0x010F56 04:8F46: 79 FF     .word $FF79 ; Y
- D 0 - - - 0x010F58 04:8F48: 79 FF     .word $FF79 ; X
; 06 
- D 0 - - - 0x010F5A 04:8F4A: 40 FF     .word $FF40 ; Y
- D 0 - - - 0x010F5C 04:8F4C: 00 00     .word $0000 ; X
; 07 
- D 0 - - - 0x010F5E 04:8F4E: 79 FF     .word $FF79 ; Y
- D 0 - - - 0x010F60 04:8F50: 87 00     .word $0087 ; X

; ******************************************************************************************************************

ofs_038_15_8F52_02:
C - - J - - 0x010F62 04:8F52: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x010F65 04:8F55: F0 2D     BEQ bra_8F84
C - - - - - 0x010F67 04:8F57: B9 9F 90  LDA tbl_90A0_добавочная_позиция_Y_спрайта - $01,Y
C - - - - - 0x010F6A 04:8F5A: 18        CLC
C - - - - - 0x010F6B 04:8F5B: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010F6E 04:8F5E: 85 08     STA ram_0008
C - - - - - 0x010F70 04:8F60: B9 A3 90  LDA tbl_90A4_добавочная_позиция_X_спрайта - $01,Y
C - - - - - 0x010F73 04:8F63: 18        CLC
C - - - - - 0x010F74 04:8F64: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010F77 04:8F67: A4 08     LDY ram_0008
C - - - - - 0x010F79 04:8F69: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x010F7C 04:8F6C: D0 16     BNE bra_8F84
C - - - - - 0x010F7E 04:8F6E: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x010F81 04:8F71: B9 A7 90  LDA tbl_90A8 - $01,Y
C - - - - - 0x010F84 04:8F74: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x010F87 04:8F77: A9 08     LDA #$08
C - - - - - 0x010F89 04:8F79: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x010F8C 04:8F7C: A9 00     LDA #$00
C - - - - - 0x010F8E 04:8F7E: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x010F91 04:8F81: 4C 02 90  JMP loc_9002
bra_8F84:
C - - - - - 0x010F94 04:8F84: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x010F97 04:8F87: 1D BC 06  ORA ram_скорость_объектов_x_младш,X
C - - - - - 0x010F9A 04:8F8A: F0 3D     BEQ bra_8FC9
C - - - - - 0x010F9C 04:8F8C: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x010F9F 04:8F8F: 2A        ROL
C - - - - - 0x010FA0 04:8F90: 2A        ROL
C - - - - - 0x010FA1 04:8F91: 29 01     AND #$01
C - - - - - 0x010FA3 04:8F93: A8        TAY
C - - - - - 0x010FA4 04:8F94: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010FA7 04:8F97: D9 B0 90  CMP tbl_90B0_позиция_X_спрайта,Y
C - - - - - 0x010FAA 04:8F9A: C8        INY
C - - - - - 0x010FAB 04:8F9B: 84 13     STY ram_0013
C - - - - - 0x010FAD 04:8F9D: 6A        ROR
C - - - - - 0x010FAE 04:8F9E: 5D CA 06  EOR ram_скорость_объектов_X_старш,X
C - - - - - 0x010FB1 04:8FA1: 30 1B     BMI bra_8FBE
C - - - - - 0x010FB3 04:8FA3: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x010FB6 04:8FA6: 0A        ASL
C - - - - - 0x010FB7 04:8FA7: A9 08     LDA #$08
C - - - - - 0x010FB9 04:8FA9: A0 01     LDY #$01
C - - - - - 0x010FBB 04:8FAB: 90 03     BCC bra_8FB0
C - - - - - 0x010FBD 04:8FAD: A9 F8     LDA #$F8
C - - - - - 0x010FBF 04:8FAF: C8        INY
bra_8FB0:
C - - - - - 0x010FC0 04:8FB0: 84 13     STY ram_0013
C - - - - - 0x010FC2 04:8FB2: 18        CLC
C - - - - - 0x010FC3 04:8FB3: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010FC6 04:8FB6: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010FC9 04:8FB9: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x010FCC 04:8FBC: F0 0B     BEQ bra_8FC9
bra_8FBE:
C - - - - - 0x010FCE 04:8FBE: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x010FD1 04:8FC1: F0 76     BEQ bra_9039
C - - - - - 0x010FD3 04:8FC3: 20 BA 90  JSR sub_90BA
C - - - - - 0x010FD6 04:8FC6: 4C 02 90  JMP loc_9002
bra_8FC9:
C - - - - - 0x010FD9 04:8FC9: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x010FDC 04:8FCC: 1D A0 06  ORA ram_скорость_объектов_y_младш,X
C - - - - - 0x010FDF 04:8FCF: F0 27     BEQ bra_8FF8
C - - - - - 0x010FE1 04:8FD1: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x010FE4 04:8FD4: 0A        ASL
C - - - - - 0x010FE5 04:8FD5: A9 08     LDA #$08
C - - - - - 0x010FE7 04:8FD7: A0 03     LDY #$03
C - - - - - 0x010FE9 04:8FD9: 90 03     BCC bra_8FDE
C - - - - - 0x010FEB 04:8FDB: A9 F8     LDA #$F8
C - - - - - 0x010FED 04:8FDD: C8        INY
bra_8FDE:
C - - - - - 0x010FEE 04:8FDE: 84 13     STY ram_0013
C - - - - - 0x010FF0 04:8FE0: 18        CLC
C - - - - - 0x010FF1 04:8FE1: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010FF4 04:8FE4: A8        TAY
C - - - - - 0x010FF5 04:8FE5: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010FF8 04:8FE8: 20 C0 BA  JSR sub_0x007AD0
C - - - - - 0x010FFB 04:8FEB: F0 0B     BEQ bra_8FF8
C - - - - - 0x010FFD 04:8FED: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x011000 04:8FF0: F0 2B     BEQ bra_901D
C - - - - - 0x011002 04:8FF2: 20 BA 90  JSR sub_90BA
C - - - - - 0x011005 04:8FF5: 4C 02 90  JMP loc_9002
bra_8FF8:
C - - - - - 0x011008 04:8FF8: BC 64 07  LDY ram_0764_obj,X
C - - - - - 0x01100B 04:8FFB: D0 05     BNE bra_9002
C - - - - - 0x01100D 04:8FFD: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x011010 04:9000: F0 53     BEQ bra_9055
bra_9002:
loc_9002:
C D 0 - - - 0x011012 04:9002: 20 5E 91  JSR sub_915E
C - - - - - 0x011015 04:9005: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x011018 04:9008: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x01101B 04:900B: 29 02     AND #$02
C - - - - - 0x01101D 04:900D: F0 0D     BEQ bra_901C_RTS
C - - - - - 0x01101F 04:900F: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x011022 04:9012: D0 08     BNE bra_901C_RTS
C - - - - - 0x011024 04:9014: A9 10     LDA #$10
C - - - - - 0x011026 04:9016: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x011029 04:9019: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_901C_RTS:
C - - - - - 0x01102C 04:901C: 60        RTS
bra_901D:
C - - - - - 0x01102D 04:901D: 20 F5 90  JSR sub_90F5
C - - - - - 0x011030 04:9020: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x011033 04:9023: C5 0C     CMP ram_000C
C - - - - - 0x011035 04:9025: 6A        ROR
C - - - - - 0x011036 04:9026: 5D AE 06  EOR ram_скорость_объектов_Y_старш,X
C - - - - - 0x011039 04:9029: 30 2A     BMI bra_9055
C - - - - - 0x01103B 04:902B: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01103E 04:902E: C5 0B     CMP ram_000B
C - - - - - 0x011040 04:9030: A9 00     LDA #$00
C - - - - - 0x011042 04:9032: 90 02     BCC bra_9036
C - - - - - 0x011044 04:9034: A9 01     LDA #$01
bra_9036:
C - - - - - 0x011046 04:9036: 4C 88 90  JMP loc_9088
bra_9039:
C - - - - - 0x011049 04:9039: 20 F5 90  JSR sub_90F5
C - - - - - 0x01104C 04:903C: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x01104F 04:903F: C5 0B     CMP ram_000B
C - - - - - 0x011051 04:9041: 6A        ROR
C - - - - - 0x011052 04:9042: 5D CA 06  EOR ram_скорость_объектов_X_старш,X
C - - - - - 0x011055 04:9045: 30 0E     BMI bra_9055
C - - - - - 0x011057 04:9047: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01105A 04:904A: C5 0C     CMP ram_000C
C - - - - - 0x01105C 04:904C: A9 02     LDA #$02
C - - - - - 0x01105E 04:904E: 90 02     BCC bra_9052
- - - - - - 0x011060 04:9050: A9 03     LDA #$03
bra_9052:
C - - - - - 0x011062 04:9052: 4C 88 90  JMP loc_9088
bra_9055:
C - - - - - 0x011065 04:9055: 20 F5 90  JSR sub_90F5
C - - - - - 0x011068 04:9058: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x01106B 04:905B: C5 0C     CMP ram_000C
C - - - - - 0x01106D 04:905D: 90 0A     BCC bra_9069
C - - - - - 0x01106F 04:905F: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x011072 04:9062: 0A        ASL
C - - - - - 0x011073 04:9063: 30 0C     BMI bra_9071
C - - - - - 0x011075 04:9065: A9 80     LDA #$80
C - - - - - 0x011077 04:9067: D0 05     BNE bra_906E    ; jmp
bra_9069:
C - - - - - 0x011079 04:9069: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x01107C 04:906C: 29 BF     AND #$BF
bra_906E:
C - - - - - 0x01107E 04:906E: 9D 72 07  STA ram_0772_obj,X
bra_9071:
C - - - - - 0x011081 04:9071: A5 1B     LDA ram_счетчик_кадров
C - - - - - 0x011083 04:9073: E5 23     SBC ram_рандом_байт
C - - - - - 0x011085 04:9075: 85 23     STA ram_рандом_байт
C - - - - - 0x011087 04:9077: A5 23     LDA ram_рандом_байт
C - - - - - 0x011089 04:9079: 29 07     AND #$07
C - - - - - 0x01108B 04:907B: A8        TAY
C - - - - - 0x01108C 04:907C: B9 B2 90  LDA tbl_90B2_счетчики,Y
C - - - - - 0x01108F 04:907F: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x011092 04:9082: 20 0D 8F  JSR sub_8F0D
C - - - - - 0x011095 04:9085: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

loc_9088:
C D 0 - - - 0x011098 04:9088: A8        TAY
C - - - - - 0x011099 04:9089: B9 A8 90  LDA tbl_90A8,Y
C - - - - - 0x01109C 04:908C: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x01109F 04:908F: B9 AC 90  LDA tbl_90AC,Y
C - - - - - 0x0110A2 04:9092: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0110A5 04:9095: A5 13     LDA ram_0013
C - - - - - 0x0110A7 04:9097: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0110AA 04:909A: 20 13 8F  JSR sub_8F13
C - - - - - 0x0110AD 04:909D: 4C B7 A6  JMP loc_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y

tbl_90A0_добавочная_позиция_Y_спрайта:
- D 0 - - - 0x0110B0 04:90A0: 00        .byte $00   ; 01
- D 0 - - - 0x0110B1 04:90A1: 00        .byte $00   ; 02
- D 0 - - - 0x0110B2 04:90A2: 08        .byte $08   ; 03
- - - - - - 0x0110B3 04:90A3: F8        .byte $F8   ; 04

tbl_90A4_добавочная_позиция_X_спрайта:
- D 0 - - - 0x0110B4 04:90A4: 08        .byte $08   ; 01
- D 0 - - - 0x0110B5 04:90A5: F8        .byte $F8   ; 02
- D 0 - - - 0x0110B6 04:90A6: 00        .byte $00   ; 03
- - - - - - 0x0110B7 04:90A7: 00        .byte $00   ; 0

tbl_90A8:
- D 0 - - - 0x0110B8 04:90A8: 00        .byte $00   ; 00 (01)
- D 0 - - - 0x0110B9 04:90A9: 0C        .byte $0C   ; 01 (02)
- D 0 - - - 0x0110BA 04:90AA: 06        .byte $06   ; 02 (03)
- - - - - - 0x0110BB 04:90AB: 12        .byte $12   ; 03 (04)

tbl_90AC:
- D 0 - - - 0x0110BC 04:90AC: 00        .byte $00   ; 00
- D 0 - - - 0x0110BD 04:90AD: 04        .byte $04   ; 01
- D 0 - - - 0x0110BE 04:90AE: 02        .byte $02   ; 02
- - - - - - 0x0110BF 04:90AF: 06        .byte $06   ; 03

tbl_90B0_позиция_X_спрайта:
- D 0 - - - 0x0110C0 04:90B0: F0        .byte $F0   ; 00    ; право
- D 0 - - - 0x0110C1 04:90B1: 10        .byte $10   ; 01    ; лево

tbl_90B2_счетчики:
- D 0 - - - 0x0110C2 04:90B2: 1A        .byte $1A   ; 00
- D 0 - - - 0x0110C3 04:90B3: 08        .byte $08   ; 01
- D 0 - - - 0x0110C4 04:90B4: 18        .byte $18   ; 02
- D 0 - - - 0x0110C5 04:90B5: 20        .byte $20   ; 03
- D 0 - - - 0x0110C6 04:90B6: 02        .byte $02   ; 04
- D 0 - - - 0x0110C7 04:90B7: 1C        .byte $1C   ; 05
- D 0 - - - 0x0110C8 04:90B8: 05        .byte $05   ; 06
- D 0 - - - 0x0110C9 04:90B9: 0E        .byte $0E   ; 07

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_90BA:
C - - - - - 0x0110CA 04:90BA: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0110CD 04:90BD: 18        CLC
C - - - - - 0x0110CE 04:90BE: 69 0C     ADC #$0C
C - - - - - 0x0110D0 04:90C0: C9 18     CMP #$18
C - - - - - 0x0110D2 04:90C2: 90 02     BCC bra_90C6
C - - - - - 0x0110D4 04:90C4: E9 18     SBC #$18
bra_90C6:
C - - - - - 0x0110D6 04:90C6: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0110D9 04:90C9: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0110DC 04:90CC: 18        CLC
C - - - - - 0x0110DD 04:90CD: 69 04     ADC #$04
C - - - - - 0x0110DF 04:90CF: C9 08     CMP #$08
C - - - - - 0x0110E1 04:90D1: 90 02     BCC bra_90D5
C - - - - - 0x0110E3 04:90D3: E9 08     SBC #$08
bra_90D5:
C - - - - - 0x0110E5 04:90D5: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0110E8 04:90D8: 4C 13 8F  JMP loc_8F13

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_90DB:
C - - - - - 0x0110EB 04:90DB: 20 0B 91  JSR sub_910B
C - - - - - 0x0110EE 04:90DE: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x0110F1 04:90E1: 30 0F     BMI bra_90F2
C - - - - - 0x0110F3 04:90E3: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x0110F6 04:90E6: 84 0A     STY ram_000A
C - - - - - 0x0110F8 04:90E8: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x0110FB 04:90EB: 29 FE     AND #$FE
C - - - - - 0x0110FD 04:90ED: 05 0A     ORA ram_000A
C - - - - - 0x0110FF 04:90EF: 9D 72 07  STA ram_0772_obj,X
bra_90F2:
C - - - - - 0x011102 04:90F2: 85 0A     STA ram_000A
C - - - - - 0x011104 04:90F4: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_90F5:
C - - - - - 0x011105 04:90F5: 20 0B 91  JSR sub_910B
C - - - - - 0x011108 04:90F8: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x01110B 04:90FB: 30 0D     BMI bra_910A_RTS
C - - - - - 0x01110D 04:90FD: 29 01     AND #$01
C - - - - - 0x01110F 04:90FF: A8        TAY
C - - - - - 0x011110 04:9100: B9 32 05  LDA ram_позиция_y_спрайта_игрока,Y
C - - - - - 0x011113 04:9103: 85 0C     STA ram_000C
C - - - - - 0x011115 04:9105: B9 4C 05  LDA ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x011118 04:9108: 85 0B     STA ram_000B
bra_910A_RTS:
C - - - - - 0x01111A 04:910A: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_910B:
C - - - - - 0x01111B 04:910B: A5 23     LDA ram_рандом_байт
C - - - - - 0x01111D 04:910D: 29 03     AND #$03
C - - - - - 0x01111F 04:910F: A8        TAY
C - - - - - 0x011120 04:9110: B9 1A 91  LDA tbl_911A,Y
C - - - - - 0x011123 04:9113: 85 0B     STA ram_000B
C - - - - - 0x011125 04:9115: A9 FF     LDA #$FF
C - - - - - 0x011127 04:9117: 85 0C     STA ram_000C
C - - - - - 0x011129 04:9119: 60        RTS

tbl_911A:
- D 0 - - - 0x01112A 04:911A: 20        .byte $20   ; 00 
- D 0 - - - 0x01112B 04:911B: 60        .byte $60   ; 01 
- D 0 - - - 0x01112C 04:911C: A0        .byte $A0   ; 02 
- D 0 - - - 0x01112D 04:911D: E0        .byte $E0   ; 03 

; ******************************************************************************************************************

ofs_038_15_911E_03:
C - - J - - 0x01112E 04:911E: 20 57 91  JSR sub_9157
C - - - - - 0x011131 04:9121: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x011134 04:9124: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x011137 04:9127: F0 24     BEQ bra_914D
C - - - - - 0x011139 04:9129: BD F4 06  LDA ram_счетчкик_жизни_объектов,X
C - - - - - 0x01113C 04:912C: C9 0C     CMP #$0C
C - - - - - 0x01113E 04:912E: D0 1C     BNE bra_914C_RTS
C - - - - - 0x011140 04:9130: A9 06     LDA #$06
C - - - - - 0x011142 04:9132: 9D 80 07  STA ram_0780_obj,X
C - - - - - 0x011145 04:9135: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x011148 04:9138: 10 03     BPL bra_913D
C - - - - - 0x01114A 04:913A: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
bra_913D:
C - - - - - 0x01114D 04:913D: 85 0A     STA ram_000A
C - - - - - 0x01114F 04:913F: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта
C - - - - - 0x011152 04:9142: A0 03     LDY #$03
C - - - - - 0x011154 04:9144: 20 27 F3  JSR sub_0x01F337
C - - - - - 0x011157 04:9147: A9 08     LDA #$08
C - - - - - 0x011159 04:9149: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_914C_RTS:
C - - - - - 0x01115C 04:914C: 60        RTS
bra_914D:
C - - - - - 0x01115D 04:914D: A9 40     LDA #$40
C - - - - - 0x01115F 04:914F: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x011162 04:9152: A9 02     LDA #$02
C - - - - - 0x011164 04:9154: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9157:
C - - - - - 0x011167 04:9157: A9 00     LDA #$00
C - - - - - 0x011169 04:9159: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
sub_915E:
C - - - - - 0x01116E 04:915E: FE 02 07  INC ram_счетчик_анимации_объектов,X
C - - - - - 0x011171 04:9161: BD 02 07  LDA ram_счетчик_анимации_объектов,X
C - - - - - 0x011174 04:9164: C9 08     CMP #$08
C - - - - - 0x011176 04:9166: 90 10     BCC bra_9178_not_overflow
C - - - - - 0x011178 04:9168: A9 00     LDA #$00
C - - - - - 0x01117A 04:916A: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x01117D 04:916D: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x011180 04:9170: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x011183 04:9173: 29 01     AND #$01
C - - - - - 0x011185 04:9175: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
bra_9178_not_overflow:
C - - - - - 0x011188 04:9178: BC 56 07  LDY ram_скролл_объекта_X,X
C - - - - - 0x01118B 04:917B: B9 8F 91  LDA tbl_918F_аттрибуты_спрайта,Y
C - - - - - 0x01118E 04:917E: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x011191 04:9181: 98        TYA
C - - - - - 0x011192 04:9182: 0A        ASL
C - - - - - 0x011193 04:9183: 18        CLC
C - - - - - 0x011194 04:9184: 7D 10 07  ADC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x011197 04:9187: A8        TAY
C - - - - - 0x011198 04:9188: B9 97 91  LDA tbl_9197_кадры_анимации,Y
C - - - - - 0x01119B 04:918B: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x01119E 04:918E: 60        RTS

tbl_918F_аттрибуты_спрайта:
- D 0 - - - 0x01119F 04:918F: 40        .byte $40   ; 00 
- D 0 - - - 0x0111A0 04:9190: 40        .byte $40   ; 01 
- D 0 - - - 0x0111A1 04:9191: 00        .byte $00   ; 02 
- D 0 - - - 0x0111A2 04:9192: 00        .byte $00   ; 03 
- D 0 - - - 0x0111A3 04:9193: 00        .byte $00   ; 04 
- D 0 - - - 0x0111A4 04:9194: 00        .byte $00   ; 05 
- D 0 - - - 0x0111A5 04:9195: 00        .byte $00   ; 06 
- D 0 - - - 0x0111A6 04:9196: 40        .byte $40   ; 07 

tbl_9197_кадры_анимации:
;                                              +---------- 
;                                              |    +----- 
;                                              |    |
- D 0 - - - 0x0111A7 04:9197: 7C        .byte $7C, $7D   ; 00 
- D 0 - - - 0x0111A9 04:9199: 7A        .byte $7A, $7B   ; 01 
- D 0 - - - 0x0111AB 04:919B: 78        .byte $78, $79   ; 02 
- D 0 - - - 0x0111AD 04:919D: 7A        .byte $7A, $7B   ; 03 
- D 0 - - - 0x0111AF 04:919F: 7C        .byte $7C, $7D   ; 04 
- D 0 - - - 0x0111B1 04:91A1: 7E        .byte $7E, $7F   ; 05 
- D 0 - - - 0x0111B3 04:91A3: 80        .byte $80, $81   ; 06 
- D 0 - - - 0x0111B5 04:91A5: 7E        .byte $7E, $7F   ; 07 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x014DF0_22_двойные_летающие_шарики:
- D 0 - I - 0x014DF0 05:8DE0: EC 8D     .word ofs_038_22_8DEC_01_активация_объекта ; 
- D 0 - I - 0x014DF2 05:8DE2: F9 8D     .word ofs_038_22_8DF9_02 ; 
- D 0 - I - 0x014DF4 05:8DE4: 19 8E     .word ofs_038_22_8E19_03 ; 
- D 0 - I - 0x014DF6 05:8DE6: 9A A2     .word ofs_038_22_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x014DF8 05:8DE8: FD A2     .word ofs_038_22_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x014DFA 05:8DEA: 3D A3     .word ofs_038_22_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_22_8DEC_01_активация_объекта:
C - - J - - 0x014DFC 05:8DEC: A9 06     LDA #$06
C - - - - - 0x014DFE 05:8DEE: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x014E01 05:8DF1: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014E04 05:8DF4: A9 40     LDA #$40    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP  loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_22_8DF9_02:
C - - J - - 0x014E09 05:8DF9: A0 05     LDY #$05
C - - - - - 0x014E0B 05:8DFB: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x014E0E 05:8DFE: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x014E11 05:8E01: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x014E14 05:8E04: D0 12     BNE bra_8E18_RTS
C - - - - - 0x014E16 05:8E06: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x014E19 05:8E09: A0 06     LDY #$06
C - - - - - 0x014E1B 05:8E0B: 20 57 A9  JSR sub_0x006967
C - - - - - 0x014E1E 05:8E0E: A9 20     LDA #$20
C - - - - - 0x014E20 05:8E10: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x014E23 05:8E13: A9 30     LDA #$30    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP  loc_0x0062E7_увеличить_состояние_объекта
bra_8E18_RTS:
C - - - - - 0x014E28 05:8E18: 60        RTS

; ******************************************************************************************************************

ofs_038_22_8E19_03:
C - - J - - 0x014E29 05:8E19: A0 06     LDY #$06
C - - - - - 0x014E2B 05:8E1B: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x014E2E 05:8E1E: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x014E31 05:8E21: F0 15     BEQ bra_8E38
C - - - - - 0x014E33 05:8E23: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x014E36 05:8E26: D0 10     BNE bra_8E38
C - - - - - 0x014E38 05:8E28: A9 06     LDA #$06
C - - - - - 0x014E3A 05:8E2A: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x014E3D 05:8E2D: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x014E40 05:8E30: A0 06     LDY #$06
C - - - - - 0x014E42 05:8E32: 20 23 A9  JSR sub_0x006933
C - - - - - 0x014E45 05:8E35: DE 56 07  DEC ram_скролл_объекта_X,X
bra_8E38:
C - - - - - 0x014E48 05:8E38: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0154F3_55_голубой_летающий_шарик:
- D 0 - I - 0x0154F3 05:94E3: EF 94     .word ofs_038_55_94EF_01_активация_объекта ; 
- D 0 - I - 0x0154F5 05:94E5: 40 95     .word ofs_038_55_9540_02 ; 
- D 0 - I - 0x0154F7 05:94E7: 71 95     .word ofs_038_55_9571_03 ; 
- D 0 - I - 0x0154F9 05:94E9: 9A A2     .word ofs_038_55_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x0154FB 05:94EB: FD A2     .word ofs_038_55_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x0154FD 05:94ED: 3D A3     .word ofs_038_55_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_55_94EF_01_активация_объекта:
C - - J - - 0x0154FF 05:94EF: A9 5E     LDA #$5E
C - - - - - 0x015501 05:94F1: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x015504 05:94F4: A5 23     LDA ram_рандом_байт
C - - - - - 0x015506 05:94F6: 29 07     AND #$07
C - - - - - 0x015508 05:94F8: 0A        ASL
C - - - - - 0x015509 05:94F9: A8        TAY
C - - - - - 0x01550A 05:94FA: B9 28 95  LDA tbl_9528_скорость_Y,Y
C - - - - - 0x01550D 05:94FD: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x015510 05:9500: B9 29 95  LDA tbl_9528_скорость_Y + $01,Y
C - - - - - 0x015513 05:9503: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x015516 05:9506: A5 23     LDA ram_рандом_байт
C - - - - - 0x015518 05:9508: 4A        LSR
C - - - - - 0x015519 05:9509: 4A        LSR
C - - - - - 0x01551A 05:950A: 4A        LSR
C - - - - - 0x01551B 05:950B: 4A        LSR
C - - - - - 0x01551C 05:950C: 48        PHA
C - - - - - 0x01551D 05:950D: 29 03     AND #$03
C - - - - - 0x01551F 05:950F: 0A        ASL
C - - - - - 0x015520 05:9510: A8        TAY
C - - - - - 0x015521 05:9511: B9 38 95  LDA tbl_9538_скорость_X,Y
C - - - - - 0x015524 05:9514: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x015527 05:9517: B9 39 95  LDA tbl_9538_скорость_X + $01,Y
C - - - - - 0x01552A 05:951A: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x01552D 05:951D: 68        PLA
C - - - - - 0x01552E 05:951E: 4A        LSR
C - - - - - 0x01552F 05:951F: 4A        LSR
C - - - - - 0x015530 05:9520: 90 03     BCC bra_9525
C - - - - - 0x015532 05:9522: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
bra_9525:
C - - - - - 0x015535 05:9525: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_9528_скорость_Y:
- D 0 - - - 0x015538 05:9528: 00 08     .word $0800 ; 00 
- D 0 - - - 0x01553A 05:952A: 00 07     .word $0700 ; 01 
- D 0 - - - 0x01553C 05:952C: 00 06     .word $0600 ; 02 
- D 0 - - - 0x01553E 05:952E: 00 05     .word $0500 ; 03 
- D 0 - - - 0x015540 05:9530: 80 04     .word $0480 ; 04 
- D 0 - - - 0x015542 05:9532: 40 07     .word $0740 ; 05 
- D 0 - - - 0x015544 05:9534: 80 06     .word $0680 ; 06 
- D 0 - - - 0x015546 05:9536: 80 05     .word $0580 ; 07 

tbl_9538_скорость_X:
- D 0 - - - 0x015548 05:9538: 40 00     .word $0040 ; 00 
- D 0 - - - 0x01554A 05:953A: 60 00     .word $0060 ; 01 
- D 0 - - - 0x01554C 05:953C: 80 00     .word $0080 ; 02 
- D 0 - - - 0x01554E 05:953E: C0 00     .word $00C0 ; 03 

; ******************************************************************************************************************

ofs_038_55_9540_02:
C - - J - - 0x015550 05:9540: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x015553 05:9543: 10 04     BPL bra_9549_00_08
C - - - - - 0x015555 05:9545: C9 FF     CMP #$FF
C - - - - - 0x015557 05:9547: F0 11     BEQ bra_955A_FF
bra_9549_00_08:
C - - - - - 0x015559 05:9549: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x01555C 05:954C: 38        SEC
C - - - - - 0x01555D 05:954D: E9 80     SBC #< $0080
C - - - - - 0x01555F 05:954F: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x015562 05:9552: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x015565 05:9555: E9 00     SBC #> $0080
C - - - - - 0x015567 05:9557: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
bra_955A_FF:
C - - - - - 0x01556A 05:955A: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x01556D 05:955D: 20 84 95  JSR sub_9584
C - - - - - 0x015570 05:9560: F0 06     BEQ bra_9568
C - - - - - 0x015572 05:9562: 20 EE A7  JSR sub_0x0067FE_отразить_скорость_по_Y
C - - - - - 0x015575 05:9565: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_9568:
C - - - - - 0x015578 05:9568: 20 98 95  JSR sub_9598
C - - - - - 0x01557B 05:956B: F0 03     BEQ bra_9570_RTS
C - - - - - 0x01557D 05:956D: 4C DC A7  JMP loc_0x0067EC_отразить_скорость_по_X
bra_9570_RTS:
C - - - - - 0x015580 05:9570: 60        RTS

; ******************************************************************************************************************

ofs_038_55_9571_03:
C - - J - - 0x015581 05:9571: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x015584 05:9574: 20 84 95  JSR sub_9584
C - - - - - 0x015587 05:9577: F0 03     BEQ bra_957C
C - - - - - 0x015589 05:9579: 20 EE A7  JSR sub_0x0067FE_отразить_скорость_по_Y
bra_957C:
C - - - - - 0x01558C 05:957C: 20 98 95  JSR sub_9598
C - - - - - 0x01558F 05:957F: F0 EF     BEQ bra_9570_RTS
C - - - - - 0x015591 05:9581: 4C DC A7  JMP loc_0x0067EC_отразить_скорость_по_X

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9584:
C - - - - - 0x015594 05:9584: A9 04     LDA #$04
C - - - - - 0x015596 05:9586: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x015599 05:9589: 10 02     BPL bra_958D
C - - - - - 0x01559B 05:958B: A9 FC     LDA #$FC
bra_958D:
C - - - - - 0x01559D 05:958D: 18        CLC
C - - - - - 0x01559E 05:958E: 7D 22 05  ADC ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0155A1 05:9591: A8        TAY
C - - - - - 0x0155A2 05:9592: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0155A5 05:9595: 4C C0 BA  JMP loc_0x007AD0

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9598:
C - - - - - 0x0155A8 05:9598: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x0155AB 05:959B: 2A        ROL
C - - - - - 0x0155AC 05:959C: 2A        ROL
C - - - - - 0x0155AD 05:959D: 29 01     AND #$01
C - - - - - 0x0155AF 05:959F: A8        TAY
C - - - - - 0x0155B0 05:95A0: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0155B3 05:95A3: D9 AF 95  CMP tbl_95AF_позиция_Y,Y
C - - - - - 0x0155B6 05:95A6: 6A        ROR
C - - - - - 0x0155B7 05:95A7: 5D CA 06  EOR ram_скорость_объектов_X_старш,X
C - - - - - 0x0155BA 05:95AA: 30 02     BMI bra_95AE_RTS
C - - - - - 0x0155BC 05:95AC: A9 00     LDA #$00
bra_95AE_RTS:
C - - - - - 0x0155BE 05:95AE: 60        RTS

tbl_95AF_позиция_Y:
- D 0 - - - 0x0155BF 05:95AF: F0        .byte $F0   ; 00 право
- D 0 - - - 0x0155C0 05:95B0: 10        .byte $10   ; 01 лево

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0155C1_56_спавнер_голубых_летающих_шариков:
- D 0 - I - 0x0155C1 05:95B1: BB 95     .word ofs_038_56_95BB_01_активация_объекта ; 
- D 0 - I - 0x0155C3 05:95B3: D5 95     .word ofs_038_56_95D5_02 ; 
- - - - - - 0x0155C5 05:95B5: 9A A2     .word ofs_038_56_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- - - - - - 0x0155C7 05:95B7: FD A2     .word ofs_038_56_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- - - - - - 0x0155C9 05:95B9: 3D A3     .word ofs_038_56_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_56_95BB_01_активация_объекта:
C - - J - - 0x0155CB 05:95BB: A9 01     LDA #$01
C - - - - - 0x0155CD 05:95BD: A9 20     LDA #$20
C - - - - - 0x0155CF 05:95BF: 9D 76 06  STA ram_жизни_объектов_8bit,X
C - - - - - 0x0155D2 05:95C2: A9 14     LDA #$14
C - - - - - 0x0155D4 05:95C4: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0155D7 05:95C7: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0155DA 05:95CA: 38        SEC
C - - - - - 0x0155DB 05:95CB: E9 08     SBC #$08
C - - - - - 0x0155DD 05:95CD: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0155E0 05:95D0: A9 10     LDA #$10    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP  loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_56_95D5_02:
C - - J - - 0x0155E5 05:95D5: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0155E8 05:95D8: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0155EB 05:95DB: D0 14     BNE bra_95F1_RTS
C - - - - - 0x0155ED 05:95DD: A9 14     LDA #$14
C - - - - - 0x0155EF 05:95DF: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0155F2 05:95E2: A0 6B     LDY #con_obj_id_55  ; голубой_летающий_шарик
C - - - - - 0x0155F4 05:95E4: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0155F7 05:95E7: 90 08     BCC bra_95F1_RTS
C - - - - - 0x0155F9 05:95E9: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x0155FC 05:95EC: D0 03     BNE bra_95F1_RTS
C - - - - - 0x0155FE 05:95EE: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_95F1_RTS:
C - - - - - 0x015601 05:95F1: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x01510E_20_движущийся_камень:
- D 0 - I - 0x010011 04:8001: 0B 80     .word ofs_038_20_800B_01_активация_объекта ; 
- D 0 - I - 0x010013 04:8003: 22 80     .word ofs_038_20_8022_02 ; 
- D 0 - I - 0x010015 04:8005: 9A A2     .word ofs_038_20_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x010017 04:8007: FD A2     .word ofs_038_20_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x010019 04:8009: 3D A3     .word ofs_038_20_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_20_800B_01_активация_объекта:
; area 8 mouth which shooting red stars - а инфа ?
C - - J - - 0x01001B 04:800B: A9 05     LDA #$05
C - - - - - 0x01001D 04:800D: A0 06     LDY #$06
C - - - - - 0x01001F 04:800F: 20 9B AB  JSR sub_0x006BAB_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x010022 04:8012: A9 03     LDA #$03
C - - - - - 0x010024 04:8014: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x010027 04:8017: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x01002A 04:801A: A0 08     LDY #$08
C - - - - - 0x01002C 04:801C: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x01002F 04:801F: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_20_8022_02:
C - - J - - 0x010032 04:8022: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x010035 04:8025: 1D BC 06  ORA ram_скорость_объектов_x_младш,X
C - - - - - 0x010038 04:8028: F0 0B     BEQ bra_8035
C - - - - - 0x01003A 04:802A: A0 08     LDY #$08
C - - - - - 0x01003C 04:802C: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x01003F 04:802F: 30 01     BMI bra_8032
C - - - - - 0x010041 04:8031: C8        INY
bra_8032:
C - - - - - 0x010042 04:8032: 20 FD AB  JSR sub_0x006C0D
bra_8035:
C - - - - - 0x010045 04:8035: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x010048 04:8038: 85 17     STA ram_0017
C - - - - - 0x01004A 04:803A: A9 10     LDA #$10
C - - - - - 0x01004C 04:803C: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x01004F 04:803F: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x010052 04:8042: F0 0F     BEQ bra_8053
C - - - - - 0x010054 04:8044: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
C - - - - - 0x010057 04:8047: A5 17     LDA ram_0017
C - - - - - 0x010059 04:8049: D0 08     BNE bra_8053
C - - - - - 0x01005B 04:804B: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x01005E 04:804E: F0 03     BEQ bra_8053
C - - - - - 0x010060 04:8050: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
bra_8053:
C - - - - - 0x010063 04:8053: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x010066 04:8056: 18        CLC
C - - - - - 0x010067 04:8057: 69 20     ADC #< $0020
C - - - - - 0x010069 04:8059: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x01006C 04:805C: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x01006F 04:805F: 69 00     ADC #> $0020
C - - - - - 0x010071 04:8061: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x010074 04:8064: BC 22 05  LDY ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x010077 04:8067: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x01007A 04:806A: 0A        ASL
C - - - - - 0x01007B 04:806B: A9 10     LDA #$10
C - - - - - 0x01007D 04:806D: 90 02     BCC bra_8071
C - - - - - 0x01007F 04:806F: A9 F0     LDA #$F0
bra_8071:
C - - - - - 0x010081 04:8071: 18        CLC
C - - - - - 0x010082 04:8072: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x010085 04:8075: 20 AA BA  JSR sub_0x007ABA_вычислить_тип_поверхности
C - - - - - 0x010088 04:8078: C9 02     CMP #$02
C - - - - - 0x01008A 04:807A: D0 03     BNE bra_807F
- - - - - - 0x01008C 04:807C: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
bra_807F:
C - - - - - 0x01008F 04:807F: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x010092 04:8082: F0 22     BEQ bra_80A6
C - - - - - 0x010094 04:8084: C9 06     CMP #$06
C - - - - - 0x010096 04:8086: 90 1B     BCC bra_80A3
C - - - - - 0x010098 04:8088: A0 00     LDY #$00
C - - - - - 0x01009A 04:808A: C9 09     CMP #$09
C - - - - - 0x01009C 04:808C: 90 02     BCC bra_8090
C - - - - - 0x01009E 04:808E: A0 02     LDY #$02
bra_8090:
C - - - - - 0x0100A0 04:8090: BD BC 06  LDA ram_скорость_объектов_x_младш,X
C - - - - - 0x0100A3 04:8093: 18        CLC
C - - - - - 0x0100A4 04:8094: 79 A9 80  ADC tbl_80A9_скорость_X,Y
C - - - - - 0x0100A7 04:8097: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0100AA 04:809A: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x0100AD 04:809D: 79 AA 80  ADC tbl_80A9_скорость_X + $01,Y
C - - - - - 0x0100B0 04:80A0: 9D CA 06  STA ram_скорость_объектов_X_старш,X
bra_80A3:
C - - - - - 0x0100B3 04:80A3: 20 CA A7  JSR sub_0x0067DA_очистить_скорость_Y
bra_80A6:
C - - - - - 0x0100B6 04:80A6: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости

tbl_80A9_скорость_X:
- D 0 - - - 0x0100B9 04:80A9: FD FF     .word $FFFD ; 00 
- D 0 - - - 0x0100BB 04:80AB: 03 00     .word $0003 ; 01 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008011_35_пасть_автоспавнер_летающих_шипов:
- D 0 - I - 0x008011 02:8001: 0D 80     .word ofs_038_35_800D_01_активация_объекта ; 
- D 0 - I - 0x008013 02:8003: 35 80     .word ofs_038_35_8035_02 ; 
- D 0 - I - 0x008015 02:8005: 53 80     .word ofs_038_35_8053_03 ; 
- D 0 - I - 0x008017 02:8007: BD 80     .word ofs_038_35_80BD_04 ; 
- D 0 - I - 0x008019 02:8009: FD A2     .word ofs_038_35_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x00801B 02:800B: 3D A3     .word ofs_038_35_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_35_800D_01_активация_объекта:
C - - J - - 0x00801D 02:800D: A9 0C     LDA #$0C
C - - - - - 0x00801F 02:800F: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x008022 02:8012: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008025 02:8015: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008028 02:8018: 29 03     AND #$03
C - - - - - 0x00802A 02:801A: A8        TAY
C - - - - - 0x00802B 02:801B: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00802E 02:801E: 18        CLC
C - - - - - 0x00802F 02:801F: 79 31 80  ADC tbl_8031_добавочная_позиция_Y_спрайта,Y
C - - - - - 0x008032 02:8022: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008035 02:8025: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008038 02:8028: 38        SEC
C - - - - - 0x008039 02:8029: E9 08     SBC #$08
C - - - - - 0x00803B 02:802B: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00803E 02:802E: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_8031_добавочная_позиция_Y_спрайта:
- D 0 - - - 0x008041 02:8031: 04        .byte $04   ; 00 
- D 0 - - - 0x008042 02:8032: F8        .byte $F8   ; 01 
- D 0 - - - 0x008043 02:8033: FF        .byte $FF   ; 02 
- D 0 - - - 0x008044 02:8034: FC        .byte $FC   ; 03 

; ******************************************************************************************************************

ofs_038_35_8035_02:
C - - J - - 0x008045 02:8035: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008048 02:8038: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00804B 02:803B: C9 F0     CMP #$F0
C - - - - - 0x00804D 02:803D: B0 13     BCS bra_8052_RTS
C - - - - - 0x00804F 02:803F: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008052 02:8042: C9 20     CMP #$20
C - - - - - 0x008054 02:8044: 90 0C     BCC bra_8052_RTS
C - - - - - 0x008056 02:8046: C9 D0     CMP #$D0
C - - - - - 0x008058 02:8048: B0 08     BCS bra_8052_RTS
C - - - - - 0x00805A 02:804A: A9 01     LDA #$01
C - - - - - 0x00805C 02:804C: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x00805F 02:804F: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8052_RTS:
C - - - - - 0x008062 02:8052: 60        RTS

; ******************************************************************************************************************

ofs_038_35_8053_03:
C - - J - - 0x008063 02:8053: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008066 02:8056: C9 D0     CMP #$D0
C - - - - - 0x008068 02:8058: 90 03     BCC bra_805D
C - - - - - 0x00806A 02:805A: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_805D:
C - - - - - 0x00806D 02:805D: A9 01     LDA #$01
C - - - - - 0x00806F 02:805F: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x008072 02:8062: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008075 02:8065: DE 02 07  DEC ram_счетчик_анимации_объектов,X
C - - - - - 0x008078 02:8068: D0 E8     BNE bra_8052_RTS
C - - - - - 0x00807A 02:806A: 20 C7 80  JSR sub_80C7
C - - - - - 0x00807D 02:806D: B0 4A     BCS bra_80B9
C - - - - - 0x00807F 02:806F: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x008082 02:8072: F0 0E     BEQ bra_8082
C - - - - - 0x008084 02:8074: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008087 02:8077: 10 3E     BPL bra_80B7
C - - - - - 0x008089 02:8079: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00808C 02:807C: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00808F 02:807F: 4C AF 80  JMP loc_80AF
bra_8082:
C - - - - - 0x008092 02:8082: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008095 02:8085: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x008098 02:8088: C9 05     CMP #$05
C - - - - - 0x00809A 02:808A: A9 02     LDA #$02
C - - - - - 0x00809C 02:808C: 90 02     BCC bra_8090_далее
C - - - - - 0x00809E 02:808E: A9 04     LDA #$04
bra_8090_далее:
C - - - - - 0x0080A0 02:8090: DD 10 07  CMP ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0080A3 02:8093: D0 22     BNE bra_80B7
C - - - - - 0x0080A5 02:8095: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0080A8 02:8098: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0080AB 02:809B: FE 48 07  INC ram_скролл_объекта_Y,X
C - - - - - 0x0080AE 02:809E: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0080B1 02:80A1: C9 06     CMP #$06
C - - - - - 0x0080B3 02:80A3: 90 0A     BCC bra_80AF_далее
C - - - - - 0x0080B5 02:80A5: A9 00     LDA #$00
C - - - - - 0x0080B7 02:80A7: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0080BA 02:80AA: A0 46     LDY #con_obj_id_36  ; летающий_шип
C - - - - - 0x0080BC 02:80AC: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
bra_80AF_далее:
loc_80AF:
C D 0 - - - 0x0080BF 02:80AF: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0080C2 02:80B2: 49 01     EOR #$01
C - - - - - 0x0080C4 02:80B4: 9D 56 07  STA ram_скролл_объекта_X,X
bra_80B7:
C - - - - - 0x0080C7 02:80B7: A9 0A     LDA #$0A
bra_80B9:
C - - - - - 0x0080C9 02:80B9: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x0080CC 02:80BC: 60        RTS

; ******************************************************************************************************************

ofs_038_35_80BD_04:
C - - J - - 0x0080CD 02:80BD: A9 04     LDA #$04
C - - - - - 0x0080CF 02:80BF: 20 CA 80  JSR sub_80CA
C - - - - - 0x0080D2 02:80C2: B0 8E     BCS bra_8052_RTS
C - - - - - 0x0080D4 02:80C4: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_80C7:
C - - - - - 0x0080D7 02:80C7: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
sub_80CA:
C - - - - - 0x0080DA 02:80CA: 85 0A     STA ram_000A
C - - - - - 0x0080DC 02:80CC: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0080DF 02:80CF: 29 03     AND #$03
C - - - - - 0x0080E1 02:80D1: 0A        ASL
C - - - - - 0x0080E2 02:80D2: A8        TAY
C - - - - - 0x0080E3 02:80D3: B9 FD 80  LDA tbl_80FD_поинтеры,Y
C - - - - - 0x0080E6 02:80D6: 85 08     STA ram_0008
C - - - - - 0x0080E8 02:80D8: B9 FE 80  LDA tbl_80FD_поинтеры + $01,Y
C - - - - - 0x0080EB 02:80DB: 85 09     STA ram_0009
C - - - - - 0x0080ED 02:80DD: 98        TYA
C - - - - - 0x0080EE 02:80DE: F0 13     BEQ bra_80F3
C - - - - - 0x0080F0 02:80E0: A5 0A     LDA ram_000A
C - - - - - 0x0080F2 02:80E2: 0A        ASL
C - - - - - 0x0080F3 02:80E3: A8        TAY
C - - - - - 0x0080F4 02:80E4: B1 08     LDA (ram_0008),Y
C - - - - - 0x0080F6 02:80E6: 85 0C     STA ram_000C
C - - - - - 0x0080F8 02:80E8: C8        INY
C - - - - - 0x0080F9 02:80E9: B1 08     LDA (ram_0008),Y
C - - - - - 0x0080FB 02:80EB: A0 E0     LDY #$E0
C - - - - - 0x0080FD 02:80ED: 20 A8 A8  JSR sub_0x0068B8
C - - - - - 0x008100 02:80F0: A9 01     LDA #$01
C - - - - - 0x008102 02:80F2: 60        RTS
bra_80F3:
C - - - - - 0x008103 02:80F3: A4 0A     LDY ram_000A
C - - - - - 0x008105 02:80F5: B1 08     LDA (ram_0008),Y
C - - - - - 0x008107 02:80F7: 20 9A A8  JSR sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер
C - - - - - 0x00810A 02:80FA: A9 01     LDA #$01
C - - - - - 0x00810C 02:80FC: 60        RTS

tbl_80FD_поинтеры:
- D 0 - - - 0x00810D 02:80FD: 05 81     .word off_8105_00
- D 0 - - - 0x00810F 02:80FF: 0A 81     .word off_810A_01
- D 0 - - - 0x008111 02:8101: 14 81     .word off_8114_02
- D 0 - - - 0x008113 02:8103: 1E 81     .word off_811E_03

; _________________________________________________________________________________________________________________

off_8105_00:
- D 0 - I - 0x008115 02:8105: 4F        .byte $4F   ; 
- D 0 - I - 0x008116 02:8106: 60        .byte $60   ; 
- D 0 - I - 0x008117 02:8107: 61        .byte $61   ; 
- D 0 - I - 0x008118 02:8108: 62        .byte $62   ; 
- D 0 - I - 0x008119 02:8109: 0B        .byte $0B   ; 

; _________________________________________________________________________________________________________________

off_810A_01:
- D 0 - I - 0x00811A 02:810A: 47        .byte $47   ; 
- D 0 - I - 0x00811B 02:810B: 4B        .byte $4B   ; 
- D 0 - I - 0x00811C 02:810C: 48        .byte $48   ; 
- D 0 - I - 0x00811D 02:810D: 4C        .byte $4C   ; 
- D 0 - I - 0x00811E 02:810E: 49        .byte $49   ; 
- D 0 - I - 0x00811F 02:810F: 4D        .byte $4D   ; 
- D 0 - I - 0x008120 02:8110: 4A        .byte $4A   ; 
- D 0 - I - 0x008121 02:8111: 4E        .byte $4E   ; 
- D 0 - I - 0x008122 02:8112: 04        .byte $04   ; 
- D 0 - I - 0x008123 02:8113: 08        .byte $08   ; 

; _________________________________________________________________________________________________________________

off_8114_02:
- D 0 - I - 0x008124 02:8114: 50        .byte $50   ; 
- D 0 - I - 0x008125 02:8115: 54        .byte $54   ; 
- D 0 - I - 0x008126 02:8116: 51        .byte $51   ; 
- D 0 - I - 0x008127 02:8117: 55        .byte $55   ; 
- D 0 - I - 0x008128 02:8118: 52        .byte $52   ; 
- D 0 - I - 0x008129 02:8119: 56        .byte $56   ; 
- D 0 - I - 0x00812A 02:811A: 53        .byte $53   ; 
- D 0 - I - 0x00812B 02:811B: 57        .byte $57   ; 
- D 0 - I - 0x00812C 02:811C: 19        .byte $19   ; 
- D 0 - I - 0x00812D 02:811D: 1D        .byte $1D   ; 

; _________________________________________________________________________________________________________________

off_811E_03:
- D 0 - I - 0x00812E 02:811E: 58        .byte $58   ; 
- D 0 - I - 0x00812F 02:811F: 5C        .byte $5C   ; 
- D 0 - I - 0x008130 02:8120: 59        .byte $59   ; 
- D 0 - I - 0x008131 02:8121: 5D        .byte $5D   ; 
- D 0 - I - 0x008132 02:8122: 5A        .byte $5A   ; 
- D 0 - I - 0x008133 02:8123: 5E        .byte $5E   ; 
- D 0 - I - 0x008134 02:8124: 5B        .byte $5B   ; 
- D 0 - I - 0x008135 02:8125: 5F        .byte $5F   ; 
- D 0 - I - 0x008136 02:8126: 23        .byte $23   ; 
- D 0 - I - 0x008137 02:8127: 27        .byte $27   ; 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008138_36_летающий_шип:
- D 0 - I - 0x008138 02:8128: 36 81     .word ofs_038_36_8136_01_активация_объекта ; 
- D 0 - I - 0x00813A 02:812A: 4D 81     .word ofs_038_36_814D_02 ; 
- D 0 - I - 0x00813C 02:812C: 64 81     .word ofs_038_36_8164_03 ; 
- D 0 - I - 0x00813E 02:812E: 7E 81     .word ofs_038_36_817E_04 ; 
- D 0 - I - 0x008140 02:8130: 9A A2     .word ofs_038_36_0x0062AA_05_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x008142 02:8132: FD A2     .word ofs_038_36_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008144 02:8134: 3D A3     .word ofs_038_36_0x00628A_07_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_36_8136_01_активация_объекта:
C - - J - - 0x008146 02:8136: A9 16     LDA #$16
C - - - - - 0x008148 02:8138: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00814B 02:813B: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x00814E 02:813E: A0 00     LDY #$00
C - - - - - 0x008150 02:8140: 20 57 A9  JSR sub_0x006967
C - - - - - 0x008153 02:8143: A9 02     LDA #$02
C - - - - - 0x008155 02:8145: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x008158 02:8148: A9 40     LDA #$40    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_36_814D_02:
C - - J - - 0x00815D 02:814D: A0 16     LDY #$16
C - - - - - 0x00815F 02:814F: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x008162 02:8152: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x008165 02:8155: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008168 02:8158: D0 46     BNE bra_81A0_RTS
C - - - - - 0x00816A 02:815A: A9 20     LDA #$20
C - - - - - 0x00816C 02:815C: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x00816F 02:815F: A9 20     LDA #$20    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_36_8164_03:
C - - J - - 0x008174 02:8164: A0 16     LDY #$16
C - - - - - 0x008176 02:8166: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x008179 02:8169: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00817C 02:816C: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00817F 02:816F: D0 2F     BNE bra_81A0_RTS
C - - - - - 0x008181 02:8171: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x008184 02:8174: A0 05     LDY #$05
C - - - - - 0x008186 02:8176: 20 57 A9  JSR sub_0x006967
C - - - - - 0x008189 02:8179: A9 10     LDA #$10    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_36_817E_04:
C - - J - - 0x00818E 02:817E: A0 16     LDY #$16
C - - - - - 0x008190 02:8180: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x008193 02:8183: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x008196 02:8186: F0 15     BEQ bra_819D
C - - - - - 0x008198 02:8188: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00819B 02:818B: D0 10     BNE bra_819D
C - - - - - 0x00819D 02:818D: A9 07     LDA #$07
C - - - - - 0x00819F 02:818F: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x0081A2 02:8192: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x0081A5 02:8195: A0 05     LDY #$05
C - - - - - 0x0081A7 02:8197: 20 23 A9  JSR sub_0x006933
C - - - - - 0x0081AA 02:819A: DE 56 07  DEC ram_скролл_объекта_X,X
bra_819D:
C - - - - - 0x0081AD 02:819D: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
bra_81A0_RTS:
C - - - - - 0x0081B0 02:81A0: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0081B1_1B_летающий_круглый_эмбрион:
- D 0 - I - 0x0081B1 02:81A1: AD 81     .word ofs_038_1B_81AD_01_активация_объекта ; 
- D 0 - I - 0x0081B3 02:81A3: CC 81     .word ofs_038_1B_81CC_02 ; 
- D 0 - I - 0x0081B5 02:81A5: E7 81     .word ofs_038_1B_81E7_03 ; 
- D 0 - I - 0x0081B7 02:81A7: 9A A2     .word ofs_038_1B_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x0081B9 02:81A9: FD A2     .word ofs_038_1B_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x0081BB 02:81AB: 3D A3     .word ofs_038_1B_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_1B_81AD_01_активация_объекта:
C - - J - - 0x0081BD 02:81AD: A9 06     LDA #$06
C - - - - - 0x0081BF 02:81AF: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0081C2 02:81B2: A9 02     LDA #$02
C - - - - - 0x0081C4 02:81B4: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0081C7 02:81B7: A9 81     LDA #$81
C - - - - - 0x0081C9 02:81B9: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0081CC 02:81BC: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0081CF 02:81BF: 4A        LSR
C - - - - - 0x0081D0 02:81C0: A9 20     LDA #$20    ; счетчик
C - - - - - 0x0081D2 02:81C2: B0 05     BCS bra_81C9
C - - - - - 0x0081D4 02:81C4: 20 D7 A2  JSR sub_0x0062E7_увеличить_состояние_объекта
C - - - - - 0x0081D7 02:81C7: A9 01     LDA #$01    ; счетчик
bra_81C9:
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_1B_81CC_02:
C - - J - - 0x0081DC 02:81CC: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x0081DF 02:81CF: 4A        LSR
C - - - - - 0x0081E0 02:81D0: 4A        LSR
C - - - - - 0x0081E1 02:81D1: A9 A8     LDA #$A8
C - - - - - 0x0081E3 02:81D3: 90 02     BCC bra_81D7
C - - - - - 0x0081E5 02:81D5: A9 00     LDA #$00
bra_81D7:
C - - - - - 0x0081E7 02:81D7: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x0081EA 02:81DA: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x0081ED 02:81DD: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0081F0 02:81E0: D0 BE     BNE bra_81A0_RTS
C - - - - - 0x0081F2 02:81E2: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_1B_81E7_03:
C - - J - - 0x0081F7 02:81E7: A9 00     LDA #$00
C - - - - - 0x0081F9 02:81E9: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0081FC 02:81EC: A0 15     LDY #$15
C - - - - - 0x0081FE 02:81EE: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x008201 02:81F1: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008204 02:81F4: D0 0D     BNE bra_8203
C - - - - - 0x008206 02:81F6: A9 07     LDA #$07
C - - - - - 0x008208 02:81F8: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x00820B 02:81FB: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x00820E 02:81FE: A0 01     LDY #$01
C - - - - - 0x008210 02:8200: 20 23 A9  JSR sub_0x006933
bra_8203:
C - - - - - 0x008213 02:8203: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008216_37_пушечный_череп:
- D 0 - I - 0x008216 02:8206: 10 82     .word ofs_038_37_8210_01_активация_объекта ; 
- D 0 - I - 0x008218 02:8208: 34 82     .word ofs_038_37_8234_02 ; 
- D 0 - I - 0x00821A 02:820A: 7F 82     .word ofs_038_37_827F_03 ; 
- D 0 - I - 0x00821C 02:820C: FD A2     .word ofs_038_37_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x00821E 02:820E: 3D A3     .word ofs_038_37_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_37_8210_01_активация_объекта:
C - - J - - 0x008220 02:8210: A9 10     LDA #$10
C - - - - - 0x008222 02:8212: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x008225 02:8215: A9 01     LDA #$01
C - - - - - 0x008227 02:8217: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x00822A 02:821A: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00822D 02:821D: 38        SEC
C - - - - - 0x00822E 02:821E: E9 08     SBC #$08
C - - - - - 0x008230 02:8220: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008233 02:8223: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008236 02:8226: 18        CLC
C - - - - - 0x008237 02:8227: 69 08     ADC #$08
C - - - - - 0x008239 02:8229: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x00823C 02:822C: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x00823F 02:822F: A9 10     LDA #$10    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_37_8234_02:
C - - J - - 0x008244 02:8234: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008247 02:8237: C9 D0     CMP #$D0
C - - - - - 0x008249 02:8239: 90 03     BCC bra_823E
C - - - - - 0x00824B 02:823B: 4C 75 A2  JMP loc_0x00628A_удалить_объект
bra_823E:
C - - - - - 0x00824E 02:823E: A9 01     LDA #$01
C - - - - - 0x008250 02:8240: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x008253 02:8243: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008256 02:8246: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008259 02:8249: D0 31     BNE bra_827C_RTS
C - - - - - 0x00825B 02:824B: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00825E 02:824E: B9 7D 82  LDA tbl_827D,Y
C - - - - - 0x008261 02:8251: 20 9A A8  JSR sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер
C - - - - - 0x008264 02:8254: A9 01     LDA #$01
C - - - - - 0x008266 02:8256: B0 21     BCS bra_8279
C - - - - - 0x008268 02:8258: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00826B 02:825B: 49 01     EOR #$01
C - - - - - 0x00826D 02:825D: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008270 02:8260: F0 09     BEQ bra_826B
C - - - - - 0x008272 02:8262: A0 48     LDY #con_obj_id_38  ; пуля пушечного черепа
C - - - - - 0x008274 02:8264: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x008277 02:8267: A9 08     LDA #$08
C - - - - - 0x008279 02:8269: D0 0E     BNE bra_8279    ; jmp
bra_826B:
C - - - - - 0x00827B 02:826B: A9 10     LDA #$10
C - - - - - 0x00827D 02:826D: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x008280 02:8270: 10 07     BPL bra_8279
C - - - - - 0x008282 02:8272: A9 01     LDA #$01
C - - - - - 0x008284 02:8274: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x008287 02:8277: A9 50     LDA #$50
bra_8279:
C - - - - - 0x008289 02:8279: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_827C_RTS:
C - - - - - 0x00828C 02:827C: 60        RTS

tbl_827D:
- D 0 - - - 0x00828D 02:827D: 6E        .byte $6E   ; 00 
- D 0 - - - 0x00828E 02:827E: 6D        .byte $6D   ; 01 

; ******************************************************************************************************************

ofs_038_37_827F_03:
C - - J - - 0x00828F 02:827F: A9 6C     LDA #$6C
C - - - - - 0x008291 02:8281: 20 9A A8  JSR sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер
C - - - - - 0x008294 02:8284: B0 F6     BCS bra_827C_RTS
C - - - - - 0x008296 02:8286: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008959_2B_мутант_с_двумя_пастями:
- D 0 - I - 0x008959 02:8949: 55 89     .word ofs_038_2B_8955_01_активация_объекта ; 
- D 0 - I - 0x00895B 02:894B: 6A 89     .word ofs_038_2B_896A_02 ; 
- D 0 - I - 0x00895D 02:894D: 83 89     .word ofs_038_2B_8983_03 ; 
- D 0 - I - 0x00895F 02:894F: 9A A2     .word ofs_038_2B_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x008961 02:8951: FD A2     .word ofs_038_2B_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008963 02:8953: 3D A3     .word ofs_038_2B_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_2B_8955_01_активация_объекта:
C - - J - - 0x008965 02:8955: A9 F1     LDA #con_HP_F0
C - - - - - 0x008967 02:8957: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x00896A 02:895A: A9 00     LDA #$00
C - - - - - 0x00896C 02:895C: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00896F 02:895F: A9 10     LDA #$10
C - - - - - 0x008971 02:8961: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x008974 02:8964: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008977 02:8967: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_2B_896A_02:
C - - J - - 0x00897A 02:896A: 20 2A 8A  JSR sub_8A2A
C - - - - - 0x00897D 02:896D: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008980 02:8970: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008983 02:8973: C9 B8     CMP #$B8
C - - - - - 0x008985 02:8975: B0 0B     BCS bra_8982_RTS
C - - - - - 0x008987 02:8977: A9 18     LDA #$18
C - - - - - 0x008989 02:8979: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x00898C 02:897C: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x00898F 02:897F: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8982_RTS:
C - - - - - 0x008992 02:8982: 60        RTS

; ******************************************************************************************************************

ofs_038_2B_8983_03:
C - - J - - 0x008993 02:8983: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x008996 02:8986: 84 12     STY ram_0012
C - - - - - 0x008998 02:8988: A9 28     LDA #$28
C - - - - - 0x00899A 02:898A: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x00899D 02:898D: D0 0B     BNE bra_899A
C - - - - - 0x00899F 02:898F: A9 14     LDA #$14
C - - - - - 0x0089A1 02:8991: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_y
C - - - - - 0x0089A4 02:8994: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
C - - - - - 0x0089A7 02:8997: 4C EF 89  JMP loc_89EF
bra_899A:
C - - - - - 0x0089AA 02:899A: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
C - - - - - 0x0089AD 02:899D: A0 00     LDY #$00
C - - - - - 0x0089AF 02:899F: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x0089B2 02:89A2: 38        SEC
C - - - - - 0x0089B3 02:89A3: FD 76 06  SBC ram_жизни_объектов_8bit,X
C - - - - - 0x0089B6 02:89A6: 0A        ASL
C - - - - - 0x0089B7 02:89A7: 0A        ASL
C - - - - - 0x0089B8 02:89A8: 0A        ASL
C - - - - - 0x0089B9 02:89A9: 0A        ASL
C - - - - - 0x0089BA 02:89AA: 0A        ASL
C - - - - - 0x0089BB 02:89AB: 18        CLC
C - - - - - 0x0089BC 02:89AC: 7D 56 07  ADC ram_скролл_объекта_X,X
C - - - - - 0x0089BF 02:89AF: 90 02     BCC bra_89B3
C - - - - - 0x0089C1 02:89B1: A9 FF     LDA #$FF
bra_89B3:
C - - - - - 0x0089C3 02:89B3: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x0089C6 02:89B6: BD 76 06  LDA ram_жизни_объектов_8bit,X
C - - - - - 0x0089C9 02:89B9: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0089CC 02:89BC: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0089CF 02:89BF: F0 18     BEQ bra_89D9
C - - - - - 0x0089D1 02:89C1: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x0089D4 02:89C4: A4 12     LDY ram_0012
C - - - - - 0x0089D6 02:89C6: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0089D9 02:89C9: D9 4C 05  CMP ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x0089DC 02:89CC: A0 02     LDY #$02
C - - - - - 0x0089DE 02:89CE: A9 00     LDA #$00
C - - - - - 0x0089E0 02:89D0: B0 04     BCS bra_89D6
C - - - - - 0x0089E2 02:89D2: A0 04     LDY #$04
C - - - - - 0x0089E4 02:89D4: A9 01     LDA #$01
bra_89D6:
C - - - - - 0x0089E6 02:89D6: 9D 1E 07  STA ram_флаги_объектов,X
bra_89D9:
C - - - - - 0x0089E9 02:89D9: A9 00     LDA #< $0100
C - - - - - 0x0089EB 02:89DB: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0089EE 02:89DE: A9 01     LDA #> $0100
C - - - - - 0x0089F0 02:89E0: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0089F3 02:89E3: B9 22 8A  LDA tbl_8A22_скорость_X,Y
C - - - - - 0x0089F6 02:89E6: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0089F9 02:89E9: B9 23 8A  LDA tbl_8A22_скорость_X + $01,Y
C - - - - - 0x0089FC 02:89EC: 9D CA 06  STA ram_скорость_объектов_X_старш,X
loc_89EF:
C D 0 - - - 0x0089FF 02:89EF: 20 2A 8A  JSR sub_8A2A
C - - - - - 0x008A02 02:89F2: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости
C - - - - - 0x008A05 02:89F5: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x008A08 02:89F8: D0 27     BNE bra_8A21_RTS
C - - - - - 0x008A0A 02:89FA: A0 3C     LDY #con_obj_id_2C  ; пуля мутанта с двумя пастями
C - - - - - 0x008A0C 02:89FC: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x008A0F 02:89FF: 90 1B     BCC bra_8A1C
C - - - - - 0x008A11 02:8A01: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008A14 02:8A04: 29 01     AND #$01
C - - - - - 0x008A16 02:8A06: A8        TAY
C - - - - - 0x008A17 02:8A07: B9 28 8A  LDA tbl_8A28_позиция_X_спрайта,Y
C - - - - - 0x008A1A 02:8A0A: A4 11     LDY ram_0011
C - - - - - 0x008A1C 02:8A0C: 18        CLC
C - - - - - 0x008A1D 02:8A0D: 7D 3C 05  ADC ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008A20 02:8A10: 99 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,Y
C - - - - - 0x008A23 02:8A13: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008A26 02:8A16: 38        SEC
C - - - - - 0x008A27 02:8A17: E9 10     SBC #$10
C - - - - - 0x008A29 02:8A19: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
bra_8A1C:
C - - - - - 0x008A2C 02:8A1C: A9 17     LDA #$17
C - - - - - 0x008A2E 02:8A1E: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
bra_8A21_RTS:
C - - - - - 0x008A31 02:8A21: 60        RTS

tbl_8A22_скорость_X:
- D 0 - - - 0x008A32 02:8A22: 00 00     .word $0000 ; 00 
- D 0 - - - 0x008A34 02:8A24: E0 FF     .word $FFE0 ; 02 
- D 0 - - - 0x008A36 02:8A26: 20 00     .word $0020 ; 04 

tbl_8A28_позиция_X_спрайта:
- D 0 - - - 0x008A38 02:8A28: F9        .byte $F9   ; 00 
- D 0 - - - 0x008A39 02:8A29: 07        .byte $07   ; 01 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8A2A:
C - - - - - 0x008A3A 02:8A2A: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008A3D 02:8A2D: 4A        LSR
C - - - - - 0x008A3E 02:8A2E: A9 03     LDA #$03
C - - - - - 0x008A40 02:8A30: 90 02     BCC bra_8A34
C - - - - - 0x008A42 02:8A32: A9 43     LDA #$43
bra_8A34:
C - - - - - 0x008A44 02:8A34: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x008A47 02:8A37: A0 0E     LDY #$0E
C - - - - - 0x008A49 02:8A39: 4C FD AB  JMP loc_0x006C0D

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008AD4_2D_кокан_с_лицехватами:
- D 0 - I - 0x008AD4 02:8AC4: D0 8A     .word ofs_038_2D_8AD0_01_активация_объекта ; 
- D 0 - I - 0x008AD6 02:8AC6: F0 8A     .word ofs_038_2D_8AF0_02 ; 
- D 0 - I - 0x008AD8 02:8AC8: 45 8B     .word ofs_038_2D_8B45_03 ; 
- D 0 - I - 0x008ADA 02:8ACA: 78 8B     .word ofs_038_2D_8B78_04 ; 
- D 0 - I - 0x008ADC 02:8ACC: FD A2     .word ofs_038_2D_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008ADE 02:8ACE: 3D A3     .word ofs_038_2D_0x00628A_06_удалить_объект ;

; ******************************************************************************************************************

ofs_038_2D_8AD0_01_активация_объекта:
C - - J - - 0x008AE0 02:8AD0: A9 10     LDA #$10
C - - - - - 0x008AE2 02:8AD2: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x008AE5 02:8AD5: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008AE8 02:8AD8: 38        SEC
C - - - - - 0x008AE9 02:8AD9: E9 08     SBC #$08
C - - - - - 0x008AEB 02:8ADB: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008AEE 02:8ADE: A9 01     LDA #$01
C - - - - - 0x008AF0 02:8AE0: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008AF3 02:8AE3: A9 03     LDA #$03
C - - - - - 0x008AF5 02:8AE5: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x008AF8 02:8AE8: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008AFB 02:8AEB: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_2D_8AF0_02:
C - - J - - 0x008B00 02:8AF0: A9 01     LDA #$01
C - - - - - 0x008B02 02:8AF2: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x008B05 02:8AF5: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008B08 02:8AF8: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008B0B 02:8AFB: D0 2E     BNE bra_8B2B_RTS
C - - - - - 0x008B0D 02:8AFD: 20 82 8B  JSR sub_8B82
C - - - - - 0x008B10 02:8B00: B0 26     BCS bra_8B28
C - - - - - 0x008B12 02:8B02: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x008B15 02:8B05: D0 16     BNE bra_8B1D
C - - - - - 0x008B17 02:8B07: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008B1A 02:8B0A: C9 01     CMP #$01
C - - - - - 0x008B1C 02:8B0C: 90 0A     BCC bra_8B18
bra_8B0E:
C - - - - - 0x008B1E 02:8B0E: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x008B21 02:8B11: 49 01     EOR #$01
C - - - - - 0x008B23 02:8B13: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x008B26 02:8B16: B0 14     BCS bra_8B2C
bra_8B18:
C - - - - - 0x008B28 02:8B18: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008B2B 02:8B1B: D0 09     BNE bra_8B26    ; jmp?
bra_8B1D:
C - - - - - 0x008B2D 02:8B1D: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008B30 02:8B20: 18        CLC
C - - - - - 0x008B31 02:8B21: F0 EB     BEQ bra_8B0E
bra_8B23:
C - - - - - 0x008B33 02:8B23: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
bra_8B26:
C - - - - - 0x008B36 02:8B26: A9 08     LDA #$08
bra_8B28:
C - - - - - 0x008B38 02:8B28: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_8B2B_RTS:
C - - - - - 0x008B3B 02:8B2B: 60        RTS
bra_8B2C:
C - - - - - 0x008B3C 02:8B2C: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x008B3F 02:8B2F: D0 F2     BNE bra_8B23
C - - - - - 0x008B41 02:8B31: A9 06     LDA #$06
C - - - - - 0x008B43 02:8B33: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x008B46 02:8B36: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008B49 02:8B39: C9 C0     CMP #$C0
C - - - - - 0x008B4B 02:8B3B: B0 E6     BCS bra_8B23
C - - - - - 0x008B4D 02:8B3D: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008B50 02:8B40: A9 10     LDA #$10    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_2D_8B45_03:
C - - J - - 0x008B55 02:8B45: 20 B7 A6  JSR sub_0x0066C7_прибавить_позицию_спрайта_к_скорости_камеры_X_Y
C - - - - - 0x008B58 02:8B48: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008B5B 02:8B4B: D0 DE     BNE bra_8B2B_RTS
C - - - - - 0x008B5D 02:8B4D: 20 82 8B  JSR sub_8B82
C - - - - - 0x008B60 02:8B50: B0 D6     BCS bra_8B28
C - - - - - 0x008B62 02:8B52: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008B65 02:8B55: C9 02     CMP #$02
C - - - - - 0x008B67 02:8B57: 90 BF     BCC bra_8B18
C - - - - - 0x008B69 02:8B59: A0 3E     LDY #con_obj_id_2E  ; лицехват
C - - - - - 0x008B6B 02:8B5B: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x008B6E 02:8B5E: 90 0B     BCC bra_8B6B
C - - - - - 0x008B70 02:8B60: A4 11     LDY ram_0011
C - - - - - 0x008B72 02:8B62: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008B75 02:8B65: 38        SEC
C - - - - - 0x008B76 02:8B66: E9 08     SBC #$08
C - - - - - 0x008B78 02:8B68: 99 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,Y
bra_8B6B:
C - - - - - 0x008B7B 02:8B6B: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008B7E 02:8B6E: A9 20     LDA #$20
C - - - - - 0x008B80 02:8B70: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x008B83 02:8B73: A9 02     LDA #$02
C - - - - - 0x008B85 02:8B75: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта

; ******************************************************************************************************************

ofs_038_2D_8B78_04:
C - - J - - 0x008B88 02:8B78: A0 03     LDY #$03
C - - - - - 0x008B8A 02:8B7A: 20 85 8B  JSR sub_8B85
C - - - - - 0x008B8D 02:8B7D: B0 AC     BCS bra_8B2B_RTS
C - - - - - 0x008B8F 02:8B7F: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8B82:
C - - - - - 0x008B92 02:8B82: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
sub_8B85:
C - - - - - 0x008B95 02:8B85: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008B98 02:8B88: C9 20     CMP #$20
C - - - - - 0x008B9A 02:8B8A: 90 0D     BCC bra_8B99
C - - - - - 0x008B9C 02:8B8C: C9 D0     CMP #$D0
C - - - - - 0x008B9E 02:8B8E: B0 09     BCS bra_8B99
C - - - - - 0x008BA0 02:8B90: B9 9C 8B  LDA tbl_8B9C,Y
C - - - - - 0x008BA3 02:8B93: 20 9A A8  JSR sub_0x0068AA_попытка_перерисовать_фон_объекта_через_буфер
bra_8B96:
C - - - - - 0x008BA6 02:8B96: A9 01     LDA #$01
C - - - - - 0x008BA8 02:8B98: 60        RTS
bra_8B99:
C - - - - - 0x008BA9 02:8B99: 38        SEC
C - - - - - 0x008BAA 02:8B9A: B0 FA     BCS bra_8B96    ; jmp

tbl_8B9C:
- D 0 - - - 0x008BAC 02:8B9C: 6E        .byte $6E   ; 00 
- D 0 - - - 0x008BAD 02:8B9D: 6F        .byte $6F   ; 01 
- D 0 - - - 0x008BAE 02:8B9E: 70        .byte $70   ; 02 
- D 0 - - - 0x008BAF 02:8B9F: 37        .byte $37   ; 03 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008BB0_2E_лицехват:
- D 0 - I - 0x008BB0 02:8BA0: AA 8B     .word ofs_038_2E_8BAA_01_активация_объекта ; 
- D 0 - I - 0x008BB2 02:8BA2: EA 8B     .word ofs_038_2E_8BEA_02 ; 
- D 0 - I - 0x008BB4 02:8BA4: 9A A2     .word ofs_038_2E_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x008BB6 02:8BA6: FD A2     .word ofs_038_2E_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008BB8 02:8BA8: 3D A3     .word ofs_038_2E_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_2E_8BAA_01_активация_объекта:
C - - J - - 0x008BBA 02:8BAA: A9 01     LDA #$01
C - - - - - 0x008BBC 02:8BAC: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x008BBF 02:8BAF: A5 23     LDA ram_рандом_байт
C - - - - - 0x008BC1 02:8BB1: 29 03     AND #$03
C - - - - - 0x008BC3 02:8BB3: 0A        ASL
C - - - - - 0x008BC4 02:8BB4: 0A        ASL
C - - - - - 0x008BC5 02:8BB5: A8        TAY
C - - - - - 0x008BC6 02:8BB6: 20 BC 8B  JSR sub_8BBC
C - - - - - 0x008BC9 02:8BB9: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8BBC:
C - - - - - 0x008BCC 02:8BBC: B9 75 8C  LDA tbl_8C75_скорость,Y
C - - - - - 0x008BCF 02:8BBF: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x008BD2 02:8BC2: B9 76 8C  LDA tbl_8C75_скорость + $01,Y
C - - - - - 0x008BD5 02:8BC5: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x008BD8 02:8BC8: B9 77 8C  LDA tbl_8C75_скорость + $02,Y
C - - - - - 0x008BDB 02:8BCB: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x008BDE 02:8BCE: B9 78 8C  LDA tbl_8C75_скорость + $03,Y
C - - - - - 0x008BE1 02:8BD1: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x008BE4 02:8BD4: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x008BE7 02:8BD7: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008BEA 02:8BDA: D9 4C 05  CMP ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x008BED 02:8BDD: A9 43     LDA #$43
C - - - - - 0x008BEF 02:8BDF: 90 05     BCC bra_8BE6
C - - - - - 0x008BF1 02:8BE1: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
C - - - - - 0x008BF4 02:8BE4: A9 03     LDA #$03
bra_8BE6:
C - - - - - 0x008BF6 02:8BE6: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x008BF9 02:8BE9: 60        RTS

tbl_8C75_скорость:
; 00 
- D 0 - - - 0x008C85 02:8C75: 00 FE     .word $FE00 ; Y
- D 0 - - - 0x008C87 02:8C77: 80 00     .word $0080 ; X
; 01 
- D 0 - - - 0x008C89 02:8C79: 00 FE     .word $FE00 ; Y
- D 0 - - - 0x008C8B 02:8C7B: 00 01     .word $0100 ; X
; 02 
- D 0 - - - 0x008C8D 02:8C7D: 00 FE     .word $FE00 ; Y
- D 0 - - - 0x008C8F 02:8C7F: 80 01     .word $0180 ; X
; 03 
- D 0 - - - 0x008C91 02:8C81: 00 FE     .word $FE00 ; Y
- D 0 - - - 0x008C93 02:8C83: 00 02     .word $0200 ; X
; 04 
- D 0 - - - 0x008C95 02:8C85: 00 00     .word $0000 ; Y
- D 0 - - - 0x008C97 02:8C87: 00 02     .word $0200 ; X

; ******************************************************************************************************************

ofs_038_2E_8BEA_02:
C - - J - - 0x008BFA 02:8BEA: 20 F0 8B  JSR sub_8BF0
C - - - - - 0x008BFD 02:8BED: 4C 07 A7  JMP loc_0x006717_обработка_позиции_объекта_по_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8BF0:
C - - - - - 0x008C00 02:8BF0: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x008C03 02:8BF3: F0 41     BEQ bra_8C36
C - - - - - 0x008C05 02:8BF5: A9 9E     LDA #$9E
C - - - - - 0x008C07 02:8BF7: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x008C0A 02:8BFA: A9 18     LDA #$18
C - - - - - 0x008C0C 02:8BFC: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_y
C - - - - - 0x008C0F 02:8BFF: A9 10     LDA #$10
C - - - - - 0x008C11 02:8C01: BC CA 06  LDY ram_скорость_объектов_X_старш,X
C - - - - - 0x008C14 02:8C04: 10 02     BPL bra_8C08
C - - - - - 0x008C16 02:8C06: A9 F0     LDA #$F0
bra_8C08:
C - - - - - 0x008C18 02:8C08: 20 22 A8  JSR sub_0x006832
C - - - - - 0x008C1B 02:8C0B: F0 03     BEQ bra_8C10
C - - - - - 0x008C1D 02:8C0D: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
bra_8C10:
C - - - - - 0x008C20 02:8C10: BD 8E 07  LDA ram_позиция_объектов_Y_старш,X
C - - - - - 0x008C23 02:8C13: D0 20     BNE bra_8C35_RTS
C - - - - - 0x008C25 02:8C15: A9 0E     LDA #$0E
C - - - - - 0x008C27 02:8C17: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x008C2A 02:8C1A: 10 02     BPL bra_8C1E
C - - - - - 0x008C2C 02:8C1C: A9 F2     LDA #$F2
bra_8C1E:
C - - - - - 0x008C2E 02:8C1E: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x008C31 02:8C21: F0 12     BEQ bra_8C35_RTS
C - - - - - 0x008C33 02:8C23: BC AE 06  LDY ram_скорость_объектов_Y_старш,X
C - - - - - 0x008C36 02:8C26: 10 03     BPL bra_8C2B
C - - - - - 0x008C38 02:8C28: 4C CA A7  JMP loc_0x0067DA_очистить_скорость_Y
bra_8C2B:
C - - - - - 0x008C3B 02:8C2B: A0 10     LDY #$04 * $04
C - - - - - 0x008C3D 02:8C2D: 20 BC 8B  JSR sub_8BBC
C - - - - - 0x008C40 02:8C30: A9 00     LDA #$00
C - - - - - 0x008C42 02:8C32: 9D 48 07  STA ram_скролл_объекта_Y,X
bra_8C35_RTS:
C - - - - - 0x008C45 02:8C35: 60        RTS
bra_8C36:
C - - - - - 0x008C46 02:8C36: A0 10     LDY #$10
C - - - - - 0x008C48 02:8C38: 20 FD AB  JSR sub_0x006C0D
C - - - - - 0x008C4B 02:8C3B: A9 10     LDA #$10
C - - - - - 0x008C4D 02:8C3D: BC CA 06  LDY ram_скорость_объектов_X_старш,X
C - - - - - 0x008C50 02:8C40: 10 02     BPL bra_8C44
C - - - - - 0x008C52 02:8C42: A9 F0     LDA #$F0
bra_8C44:
C - - - - - 0x008C54 02:8C44: 20 22 A8  JSR sub_0x006832
C - - - - - 0x008C57 02:8C47: F0 03     BEQ bra_8C4C
- - - - - - 0x008C59 02:8C49: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
bra_8C4C:
C - - - - - 0x008C5C 02:8C4C: A9 0E     LDA #$0E
C - - - - - 0x008C5E 02:8C4E: 20 00 A8  JSR sub_0x006810_проверить_есть_или_нет_преграда_на_пути_если_спрайт_на_экране_и_падает
C - - - - - 0x008C61 02:8C51: F0 03     BEQ bra_8C56
C - - - - - 0x008C63 02:8C53: 4C 3D A8  JMP loc_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
bra_8C56:
C - - - - - 0x008C66 02:8C56: A9 01     LDA #$01
C - - - - - 0x008C68 02:8C58: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x008C6B 02:8C5B: 20 CA A7  JSR sub_0x0067DA_очистить_скорость_Y
C - - - - - 0x008C6E 02:8C5E: A0 00     LDY #$00
C - - - - - 0x008C70 02:8C60: BD 56 05  LDA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x008C73 02:8C63: 0A        ASL
C - - - - - 0x008C74 02:8C64: 10 02     BPL bra_8C68
C - - - - - 0x008C76 02:8C66: A0 02     LDY #$02
bra_8C68:
C - - - - - 0x008C78 02:8C68: B9 89 8C  LDA tbl_8C89_скорость_X,Y
C - - - - - 0x008C7B 02:8C6B: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x008C7E 02:8C6E: B9 8A 8C  LDA tbl_8C89_скорость_X + $01,Y
C - - - - - 0x008C81 02:8C71: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x008C84 02:8C74: 60        RTS


tbl_8C89_скорость_X:
- D 0 - - - 0x008C99 02:8C89: 80 FF     .word $FF80 ; 00 
- D 0 - - - 0x008C9B 02:8C8B: 80 00     .word $0080 ; 02 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************



; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************


.out .sprintf("Free bytes in bank 2B: %Xh [%d]", ($A000 - *), ($A000 - *))

