.segment "BANK_2F"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
.org $8000 ; for listing file
; 0x01E010-0x02000F

; БОССЫ 7-8 уровни

.export _off001_0x009002_3D_босс_7_пасть_черепа
.export _off001_0x008C9D_3E_босс_7_грудная_клетка
.export _off001_0x008DD4_3F_босс_7_костяное_ухо
.export _off001_0x008E18_40_босс_7_большой_красный_шар
.export _off001_0x008E51_41_босс_7_летающие_шипы
.export _off001_0x008EB4_42_босс_7_ползающая_слизь

.export _off001_0x00847F_1C_босс_8_летящий_красный_шип
.export _off001_0x0084B9_28_босс_8_летящий_синий_шип
.export _off001_0x0085A4_57_босс_8_глаз
.export _off001_0x0088CD_58_босс_8_падающие_камни

; bzk this byte must be placed at 8000
    .byte con_prg_bank + $2F   ; 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x009002_3D_босс_7_пасть_черепа:
- D 0 - I - 0x009002 02:8FF2: 08 90     .word ofs_038_3D_9008_01_активация_объекта ; 
- D 0 - I - 0x009004 02:8FF4: 1D 90     .word ofs_038_3D_901D_02 ; 
- D 0 - I - 0x009006 02:8FF6: 71 90     .word ofs_038_3D_9071_03 ; 
- D 0 - I - 0x009008 02:8FF8: 80 90     .word ofs_038_3D_9080_04 ; 
- D 0 - I - 0x00900A 02:8FFA: B5 90     .word ofs_038_3D_90B5_05 ; 
- D 0 - I - 0x00900C 02:8FFC: E6 90     .word ofs_038_3D_90E6_06 ; 
- D 0 - I - 0x00900E 02:8FFE: B8 A3     .word ofs_038_3D_0x0063C8_07_установить_статус_уничтожения_босса_и_убить_все_объекты ; 
- D 0 - I - 0x009010 02:9000: D8 A3     .word ofs_038_3D_0x0063E8_08_большие_взрывы_для_боссов ; 
- D 0 - I - 0x009012 02:9002: 06 91     .word ofs_038_3D_9106_09 ; 
- D 0 - I - 0x009014 02:9004: F6 A2     .word ofs_038_3D_0x006306_0A ; 
- D 0 - I - 0x009016 02:9006: 10 91     .word ofs_038_3D_0x006347_0B_удалить_объект_босс ; 

; ******************************************************************************************************************

ofs_038_3D_9008_01_активация_объекта:
C - - J - - 0x009018 02:9008: A9 11     LDA #$11
C - - - - - 0x00901A 02:900A: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00901D 02:900D: A9 20     LDA #$20
C - - - - - 0x00901F 02:900F: 20 99 AB  JSR sub_0x006BA9_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x009022 02:9012: 9D 56 07  STA ram_скролл_объекта_X,X  ; отложить 32bit HP
C - - - - - 0x009025 02:9015: A9 F0     LDA #con_HP_F0  ; запретить урон
C - - - - - 0x009027 02:9017: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x00902A 02:901A: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_3D_901D_02:
C - - J - - 0x00902D 02:901D: A9 01     LDA #$01
C - - - - - 0x00902F 02:901F: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x009032 02:9022: A5 7D     LDA ram_007D_тип_скролла
C - - - - - 0x009034 02:9024: C9 C0     CMP #$C0
C - - - - - 0x009036 02:9026: D0 45     BNE bra_906D_RTS
C - - - - - 0x009038 02:9028: A9 31     LDA #con_sound_31 ; музыка 7й босс
C - - - - - 0x00903A 02:902A: 20 DE FD  JSR sub_0x01FDEE_play_music
C - - - - - 0x00903D 02:902D: A9 48     LDA #$48
C - - - - - 0x00903F 02:902F: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x009042 02:9032: A9 80     LDA #$80
C - - - - - 0x009044 02:9034: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x009047 02:9037: A9 0A     LDA #con_irq_area_7_boss
C - - - - - 0x009049 02:9039: 85 27     STA ram_irq_handler_hi
C - - - - - 0x00904B 02:903B: A9 52     LDA #$52
C - - - - - 0x00904D 02:903D: 85 45     STA ram_номер_сканлинии
C - - - - - 0x00904F 02:903F: A9 E0     LDA #$E0
C - - - - - 0x009051 02:9041: 85 FC     STA ram_scroll_Y
C - - - - - 0x009053 02:9043: 85 F9     STA ram_00F9
C - - - - - 0x009055 02:9045: A5 FD     LDA ram_scroll_X
C - - - - - 0x009057 02:9047: 85 FA     STA ram_00FA
C - - - - - 0x009059 02:9049: A5 FF     LDA ram_for_2000
C - - - - - 0x00905B 02:904B: 85 FB     STA ram_00FB
C - - - - - 0x00905D 02:904D: A0 02     LDY #$02
bra_904F_loop:
C - - - - - 0x00905F 02:904F: 84 08     STY ram_0008
C - - - - - 0x009061 02:9051: B9 6E 90  LDA tbl_906E_объекты,Y
C - - - - - 0x009064 02:9054: A8        TAY
C - - - - - 0x009065 02:9055: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x009068 02:9058: 90 10     BCC bra_906A
C - - - - - 0x00906A 02:905A: A4 11     LDY ram_0011
C - - - - - 0x00906C 02:905C: A5 08     LDA ram_0008
C - - - - - 0x00906E 02:905E: 99 1E 07  STA ram_флаги_объектов,Y
C - - - - - 0x009071 02:9061: 8A        TXA
C - - - - - 0x009072 02:9062: 99 80 07  STA ram_0780_obj,Y
C - - - - - 0x009075 02:9065: A4 08     LDY ram_0008
C - - - - - 0x009077 02:9067: 88        DEY
C - - - - - 0x009078 02:9068: 10 E5     BPL bra_904F_loop
bra_906A:
C - - - - - 0x00907A 02:906A: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_906D_RTS:
C - - - - - 0x00907D 02:906D: 60        RTS

tbl_906E_объекты:
- D 0 - - - 0x00907E 02:906E: 52        .byte con_obj_id_3E   ; 00 грудь
- D 0 - - - 0x00907F 02:906F: 53        .byte con_obj_id_3F   ; 01 ухо
- D 0 - - - 0x009080 02:9070: 53        .byte con_obj_id_3F   ; 02 ухо

; ******************************************************************************************************************

ofs_038_3D_9071_03:
C - - J - - 0x009081 02:9071: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x009084 02:9074: F0 F7     BEQ bra_906D_RTS
C - - - - - 0x009086 02:9076: A9 01     LDA #$01
C - - - - - 0x009088 02:9078: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00908B 02:907B: A9 40     LDA #$40    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_3D_9080_04:
C - - J - - 0x009090 02:9080: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x009093 02:9083: D0 29     BNE bra_90AE_RTS
C - - - - - 0x009095 02:9085: 20 13 91  JSR sub_9113
C - - - - - 0x009098 02:9088: A9 01     LDA #$01
C - - - - - 0x00909A 02:908A: B0 1F     BCS bra_90AB
C - - - - - 0x00909C 02:908C: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00909F 02:908F: C9 02     CMP #$02
C - - - - - 0x0090A1 02:9091: A9 08     LDA #$08
C - - - - - 0x0090A3 02:9093: 90 13     BCC bra_90A8
C - - - - - 0x0090A5 02:9095: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0090A8 02:9098: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0090AB 02:909B: 9D 76 06  STA ram_жизни_объектов_32bit,X  ; вернуть 32bit HP и разрешить урон
C - - - - - 0x0090AE 02:909E: A9 08     LDA #$08
C - - - - - 0x0090B0 02:90A0: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x0090B3 02:90A3: A9 50     LDA #$50    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_90A8:
C - - - - - 0x0090B8 02:90A8: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
bra_90AB:
C D 0 - - - 0x0090BB 02:90AB: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_90AE_RTS:
C - - - - - 0x0090BE 02:90AE: 60        RTS

; ******************************************************************************************************************

ofs_038_3D_90B5_05:
C - - J - - 0x0090C5 02:90B5: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x0090C8 02:90B8: D0 17     BNE bra_90D1
C - - - - - 0x0090CA 02:90BA: A0 02     LDY #$02
bra_90BC_loop:
C - - - - - 0x0090CC 02:90BC: 84 08     STY ram_0008
C - - - - - 0x0090CE 02:90BE: A0 55     LDY #con_obj_id_41  ; красный шип
C - - - - - 0x0090D0 02:90C0: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0090D3 02:90C3: 90 0C     BCC bra_90D1
C - - - - - 0x0090D5 02:90C5: A4 11     LDY ram_0011
C - - - - - 0x0090D7 02:90C7: A5 08     LDA ram_0008
C - - - - - 0x0090D9 02:90C9: 99 1E 07  STA ram_флаги_объектов,Y
C - - - - - 0x0090DC 02:90CC: A4 08     LDY ram_0008
C - - - - - 0x0090DE 02:90CE: 88        DEY
C - - - - - 0x0090DF 02:90CF: 10 EB     BPL bra_90BC_loop
bra_90D1:
C - - - - - 0x0090E1 02:90D1: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0090E4 02:90D4: D0 D8     BNE bra_90AE_RTS
C - - - - - 0x0090E6 02:90D6: BD 76 06  LDA ram_жизни_объектов_32bit,X
C - - - - - 0x0090E9 02:90D9: 9D 56 07  STA ram_скролл_объекта_X,X  ; отложить 32bit HP
C - - - - - 0x0090EC 02:90DC: A9 F0     LDA #con_HP_F0  ; запретить урон
C - - - - - 0x0090EE 02:90DE: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x0090F1 02:90E1: A9 01     LDA #$01     ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_3D_90E6_06:
C - - J - - 0x0090F6 02:90E6: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0090F9 02:90E9: D0 C3     BNE bra_90B2_RTS
C - - - - - 0x0090FB 02:90EB: 20 13 91  JSR sub_9113
C - - - - - 0x0090FE 02:90EE: A9 01     LDA #$01
C - - - - - 0x009100 02:90F0: B0 B9     BCS bra_90AB
C - - - - - 0x009102 02:90F2: A9 08     LDA #$08
C - - - - - 0x009104 02:90F4: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x009107 02:90F7: D0 B6     BNE bra_90AF
C - - - - - 0x009109 02:90F9: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00910C 02:90FC: A9 80     LDA #$80
C - - - - - 0x00910E 02:90FE: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x009111 02:9101: A9 04     LDA #$04
C - - - - - 0x009113 02:9103: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта
bra_90AF:
C - - - - - 0x0090BF 02:90AF: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
                                        STA ram_счетчики_для_объектов,X
bra_90B2_RTS:
                                        RTS
                                        
; ******************************************************************************************************************

ofs_038_3D_9106_09:
C - - J - - 0x009116 02:9106: A9 03     LDA #$03
C - - - - - 0x009118 02:9108: 20 16 91  JSR sub_9116
C - - - - - 0x00911B 02:910B: B0 A1     BCS bra_90B2_RTS
C - - - - - 0x00911D 02:910D: 4C A2 A2  JMP loc_0x0062B2_обработка_состояния_смерти_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_9113:
C - - - - - 0x009123 02:9113: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
sub_9116:
C - - - - - 0x009126 02:9116: 18        CLC
C - - - - - 0x009127 02:9117: 69 04     ADC #$04
C - - - - - 0x009129 02:9119: A0 04     LDY #$04
C - - - - - 0x00912B 02:911B: 4C 54 8D  JMP loc_8D54

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008C9D_3E_босс_7_грудная_клетка:
- D 0 - I - 0x008C9D 02:8C8D: 9B 8C     .word ofs_038_3E_8C9B_01_активация_объекта ; 
- D 0 - I - 0x008C9F 02:8C8F: C6 8C     .word ofs_038_3E_8CC6_02 ; 
- D 0 - I - 0x008CA1 02:8C91: FB 8C     .word ofs_038_3E_8CFB_03 ; 
- D 0 - I - 0x008CA3 02:8C93: 1A 8D     .word ofs_038_3E_8D1A_04 ; 
- D 0 - I - 0x008CA5 02:8C95: 3A 8D     .word ofs_038_3E_8D3A_05 ; 
- D 0 - I - 0x008CA7 02:8C97: FD A2     .word ofs_038_3E_0x00630D_06_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008CA9 02:8C99: 44 8D     .word ofs_038_3E_8D44_07 ;

; ******************************************************************************************************************

ofs_038_3E_8C9B_01_активация_объекта:
C - - J - - 0x008CAB 02:8C9B: A9 01     LDA #$01
C - - - - - 0x008CAD 02:8C9D: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x008CB2 02:8CA2: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x008CB5 02:8CA5: A9 18     LDA #$18
C - - - - - 0x008CB7 02:8CA7: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x008CBA 02:8CAA: 9D 48 07  STA ram_скролл_объекта_Y,X  ; отложить 32bit HP
C - - - - - 0x008CBD 02:8CAD: A9 F0     LDA #con_HP_F0  ; запретить урон
C - - - - - 0x008CBF 02:8CAF: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x008CC2 02:8CB2: A9 70     LDA #$70
C - - - - - 0x008CC4 02:8CB4: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008CC7 02:8CB7: A9 80     LDA #$80
C - - - - - 0x008CC9 02:8CB9: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008CCC 02:8CBC: A9 01     LDA #$01
C - - - - - 0x008CCE 02:8CBE: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008CD1 02:8CC1: A9 40     LDA #$40    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_3E_8CC6_02:
C - - J - - 0x008CD6 02:8CC6: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008CD9 02:8CC9: D0 29     BNE bra_8CF4_RTS
C - - - - - 0x008CDB 02:8CCB: 20 4F 8D  JSR sub_8D4F
C - - - - - 0x008CDE 02:8CCE: A9 01     LDA #$01
C - - - - - 0x008CE0 02:8CD0: B0 1F     BCS bra_8CF1
C - - - - - 0x008CE2 02:8CD2: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008CE5 02:8CD5: C9 02     CMP #$02
C - - - - - 0x008CE7 02:8CD7: A9 08     LDA #$08
C - - - - - 0x008CE9 02:8CD9: 90 13     BCC bra_8CEE
C - - - - - 0x008CEB 02:8CDB: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008CEE 02:8CDE: BD 48 07  LDA ram_скролл_объекта_Y,X
C - - - - - 0x008CF1 02:8CE1: 9D 76 06  STA ram_жизни_объектов_32bit,X  ; вернуть 32bit HP и разрешить урон
C - - - - - 0x008CF4 02:8CE4: A9 10     LDA #$10
C - - - - - 0x008CF6 02:8CE6: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x008CF9 02:8CE9: A9 70     LDA #$70    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8CEE:
C - - - - - 0x008CFE 02:8CEE: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
bra_8CF1:
C D 0 - - - 0x008D01 02:8CF1: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_8CF4_RTS:
C - - - - - 0x008D04 02:8CF4: 60        RTS

; ******************************************************************************************************************

ofs_038_3E_8CFB_03:
C - - J - - 0x008D0B 02:8CFB: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x008D0E 02:8CFE: D0 05     BNE bra_8D05
C - - - - - 0x008D10 02:8D00: A0 54     LDY #con_obj_id_40  ; большой красный шар из груди
C - - - - - 0x008D12 02:8D02: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
bra_8D05:
C - - - - - 0x008D15 02:8D05: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008D18 02:8D08: D0 EA     BNE bra_8CF4_RTS
C - - - - - 0x008D1A 02:8D0A: BD 76 06  LDA ram_жизни_объектов_32bit,X
C - - - - - 0x008D1D 02:8D0D: 9D 48 07  STA ram_скролл_объекта_Y,X  ; отложить 32bit HP
C - - - - - 0x008D20 02:8D10: A9 F0     LDA #con_HP_F0  ; запретить урон
C - - - - - 0x008D22 02:8D12: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x008D25 02:8D15: A9 01     LDA #$01    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_3E_8D1A_04:
C - - J - - 0x008D2A 02:8D1A: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008D2D 02:8D1D: D0 D5     BNE bra_8CF4_RTS
C - - - - - 0x008D2F 02:8D1F: 20 4F 8D  JSR sub_8D4F
C - - - - - 0x008D32 02:8D22: A9 01     LDA #$01
C - - - - - 0x008D34 02:8D24: B0 CB     BCS bra_8CF1
C - - - - - 0x008D36 02:8D26: A9 08     LDA #$08
C - - - - - 0x008D38 02:8D28: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008D3B 02:8D2B: D0 C8     BNE bra_8CF5
C - - - - - 0x008D3D 02:8D2D: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008D40 02:8D30: A9 50     LDA #$50
C - - - - - 0x008D42 02:8D32: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x008D45 02:8D35: A9 02     LDA #$02
C - - - - - 0x008D47 02:8D37: 4C 83 A2  JMP loc_0x006293_установить_состояние_объекта
bra_8CF5:
C - - - - - 0x008D05 02:8CF5: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
                                        STA ram_счетчики_для_объектов,X
                                        RTS

; ******************************************************************************************************************

ofs_038_3E_8D3A_05:
C - - J - - 0x008D4A 02:8D3A: A9 03     LDA #$03
C - - - - - 0x008D4C 02:8D3C: 20 52 8D  JSR sub_8D52
C - - - - - 0x008D4F 02:8D3F: B0 B3     BCS bra_8CF4_RTS
C - - - - - 0x008D51 02:8D41: 4C 9A A2  JMP loc_0x0062AA_обработка_состояния_смерти_объекта


; ******************************************************************************************************************

ofs_038_3E_8D44_07:
C - - J - - 0x008D54 02:8D44: BC 80 07  LDY ram_0780_obj,X
C - - - - - 0x008D57 02:8D47: A9 01     LDA #$01
C - - - - - 0x008D59 02:8D49: 99 48 07  STA ram_скролл_объекта_Y,Y
C - - - - - 0x008D5C 02:8D4C: 4C 3D A3  JMP loc_0x00628A_удалить_объект

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8D4F:
C - - - - - 0x008D5F 02:8D4F: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
sub_8D52:
C - - - - - 0x008D62 02:8D52: A0 00     LDY #$00
loc_8D54:
C D 0 - - - 0x008D64 02:8D54: 84 0E     STY ram_000E
; A = 00-07
C - - - - - 0x008D66 02:8D56: 0A        ASL
C - - - - - 0x008D67 02:8D57: 0A        ASL
C - - - - - 0x008D68 02:8D58: 85 0D     STA ram_000D
; bzk optimize, check ram_index_ppu_buffer first
C - - - - - 0x008D6A 02:8D5A: A5 1E     LDA ram_index_ppu_buffer
C - - - - - 0x008D6C 02:8D5C: D0 33     BNE bra_8D91
C - - - - - 0x008D6E 02:8D5E: A0 03     LDY #$03
bra_8D60_loop:
C - - - - - 0x008D70 02:8D60: 84 0F     STY ram_000F
C - - - - - 0x008D72 02:8D62: 98        TYA
C - - - - - 0x008D73 02:8D63: 18        CLC
C - - - - - 0x008D74 02:8D64: 65 0D     ADC ram_000D
C - - - - - 0x008D76 02:8D66: A8        TAY
C - - - - - 0x008D77 02:8D67: B9 94 8D  LDA tbl_8D94,Y
C - - - - - 0x008D7A 02:8D6A: 85 08     STA ram_0008
C - - - - - 0x008D7C 02:8D6C: A5 0F     LDA ram_000F
C - - - - - 0x008D7E 02:8D6E: 18        CLC
C - - - - - 0x008D7F 02:8D6F: 65 0E     ADC ram_000E    ; 00/04
C - - - - - 0x008D81 02:8D71: A8        TAY
C - - - - - 0x008D82 02:8D72: B9 B4 8D  LDA tbl_8DB4,Y
C - - - - - 0x008D85 02:8D75: 85 0C     STA ram_000C
C - - - - - 0x008D87 02:8D77: B9 BC 8D  LDA tbl_8DBC,Y
C - - - - - 0x008D8A 02:8D7A: A4 0C     LDY ram_000C
C - - - - - 0x008D8C 02:8D7C: 20 A4 FE  JSR sub_0x01FEB4_подготовка_и_выбор_банков_для_перерисовки_части_фона_через_буфер
C - - - - - 0x008D8F 02:8D7F: 8A        TXA
C - - - - - 0x008D90 02:8D80: 38        SEC
C - - - - - 0x008D91 02:8D81: E9 04     SBC #$04
C - - - - - 0x008D93 02:8D83: 85 1E     STA ram_index_ppu_buffer
C - - - - - 0x008D95 02:8D85: AA        TAX
C - - - - - 0x008D96 02:8D86: A9 FF     LDA #$FF
C - - - - - 0x008D98 02:8D88: 9D FF 02  STA ram_nmt_buffer - $01,X
C - - - - - 0x008D9B 02:8D8B: A4 0F     LDY ram_000F
C - - - - - 0x008D9D 02:8D8D: 88        DEY
C - - - - - 0x008D9E 02:8D8E: 10 D0     BPL bra_8D60_loop
C - - - - - 0x008DA0 02:8D90: 18        CLC
bra_8D91:
C - - - - - 0x008DA1 02:8D91: A6 10     LDX ram_0010
C - - - - - 0x008DA3 02:8D93: 60        RTS

tbl_8D94:
- D 0 - - - 0x008DA4 02:8D94: 7F        .byte $7F, $80, $86, $87   ; 00 
- D 0 - - - 0x008DA8 02:8D98: A1        .byte $A1, $A2, $A3, $A4   ; 01 
- D 0 - - - 0x008DAC 02:8D9C: A5        .byte $A5, $A6, $A7, $A8   ; 02 
- D 0 - - - 0x008DB0 02:8DA0: A5        .byte $A5, $A6, $A7, $A8   ; 03 
- D 0 - - - 0x008DB4 02:8DA4: 73        .byte $73, $74, $79, $7A   ; 04 
- D 0 - - - 0x008DB8 02:8DA8: A9        .byte $A9, $AA, $AB, $AC   ; 05 
- D 0 - - - 0x008DBC 02:8DAC: AD        .byte $AD, $AE, $AF, $B0   ; 06 
- D 0 - - - 0x008DC0 02:8DB0: AD        .byte $AD, $AE, $AF, $B0   ; 07 

tbl_8DB4:
- D 0 - - - 0x008DC4 02:8DB4: 60        .byte $60   ; 00 
- D 0 - - - 0x008DC5 02:8DB5: 60        .byte $60   ; 01 
- D 0 - - - 0x008DC6 02:8DB6: 80        .byte $80   ; 02 
- D 0 - - - 0x008DC7 02:8DB7: 80        .byte $80   ; 03 
- D 0 - - - 0x008DC8 02:8DB8: 20        .byte $20   ; 04 
- D 0 - - - 0x008DC9 02:8DB9: 20        .byte $20   ; 05 
- D 0 - - - 0x008DCA 02:8DBA: 40        .byte $40   ; 06 
- D 0 - - - 0x008DCB 02:8DBB: 40        .byte $40   ; 07 

tbl_8DBC:
- D 0 - - - 0x008DCC 02:8DBC: 70        .byte $70   ; 00 
- D 0 - - - 0x008DCD 02:8DBD: 90        .byte $90   ; 01 
- D 0 - - - 0x008DCE 02:8DBE: 70        .byte $70   ; 02 
- D 0 - - - 0x008DCF 02:8DBF: 90        .byte $90   ; 03 
- D 0 - - - 0x008DD0 02:8DC0: 70        .byte $70   ; 04 
- D 0 - - - 0x008DD1 02:8DC1: 90        .byte $90   ; 05 
- D 0 - - - 0x008DD2 02:8DC2: 70        .byte $70   ; 06 
- D 0 - - - 0x008DD3 02:8DC3: 90        .byte $90   ; 07 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008DD4_3F_босс_7_костяное_ухо:
- D 0 - I - 0x008DD4 02:8DC4: CE 8D     .word ofs_038_3F_8DCE_01_активация_объекта ; 
- D 0 - I - 0x008DD6 02:8DC6: ED 8D     .word ofs_038_3F_8DED_02 ; 
- D 0 - I - 0x008DD8 02:8DC8: 02 8E     .word ofs_038_3F_0x008E02_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x008DDA 02:8DCA: FD A2     .word ofs_038_3F_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008DDC 02:8DCC: 05 8E     .word ofs_038_3F_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_3F_8DCE_01_активация_объекта:
C - - J - - 0x008DDE 02:8DCE: A9 01     LDA #$01
C - - - - - 0x008DE0 02:8DD0: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x008DE3 02:8DD3: A9 10     LDA #$10
C - - - - - 0x008DE5 02:8DD5: 20 95 AB  JSR sub_0x006BA5_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x008DE8 02:8DD8: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008DEB 02:8DDB: 4A        LSR
C - - - - - 0x008DEC 02:8DDC: A9 C4     LDA #$C4
C - - - - - 0x008DEE 02:8DDE: B0 02     BCS bra_8DE2
C - - - - - 0x008DF0 02:8DE0: A9 3C     LDA #$3C
bra_8DE2:
C - - - - - 0x008DF2 02:8DE2: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008DF5 02:8DE5: A9 27     LDA #$27
C - - - - - 0x008DF7 02:8DE7: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_3F_8DED_02:
C - - J - - 0x008DFD 02:8DED: A9 01     LDA #$01
C - - - - - 0x008DFF 02:8DEF: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x008E02 02:8DF2: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008E05 02:8DF5: D0 0A     BNE bra_8E01_RTS
C - - - - - 0x008E07 02:8DF7: A0 56     LDY #con_obj_id_42  ; ползающая слизь
C - - - - - 0x008E09 02:8DF9: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x008E0C 02:8DFC: A9 A0     LDA #$A0
C - - - - - 0x008E0E 02:8DFE: 9D E6 06  STA ram_счетчики_для_объектов,X
bra_8E01_RTS:
C - - - - - 0x008E11 02:8E01: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008E18_40_босс_7_большой_красный_шар:
- D 0 - I - 0x008E18 02:8E08: 14 8E     .word ofs_038_40_8E14_01_активация_объекта ; 
- D 0 - I - 0x008E1A 02:8E0A: 23 8E     .word ofs_038_40_8E23_02 ; 
- D 0 - I - 0x008E1C 02:8E0C: 39 8E     .word ofs_038_40_8E39_03 ; 
- D 0 - I - 0x008E1E 02:8E0E: 9A A2     .word ofs_038_40_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x008E20 02:8E10: FD A2     .word ofs_038_40_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008E22 02:8E12: 3D A3     .word ofs_038_40_0x00628A_06_удалить_объект ;

; ******************************************************************************************************************

ofs_038_40_8E14_01_активация_объекта:
C - - J - - 0x008E24 02:8E14: A9 03     LDA #$03
C - - - - - 0x008E26 02:8E16: 9D 76 06  STA ram_жизни_объектов_8bit,X
C - - - - - 0x008E29 02:8E19: A9 02     LDA #$02
C - - - - - 0x008E2B 02:8E1B: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x008E2E 02:8E1E: A9 28     LDA #$28    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_40_8E23_02:
C - - J - - 0x008E33 02:8E23: A0 11     LDY #$11
C - - - - - 0x008E35 02:8E25: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008E38 02:8E28: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008E3B 02:8E2B: D0 0B     BNE bra_8E38_RTS
C - - - - - 0x008E3D 02:8E2D: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x008E40 02:8E30: A0 07     LDY #$07
C - - - - - 0x008E42 02:8E32: 20 57 A9  JSR sub_0x006967
C - - - - - 0x008E45 02:8E35: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8E38_RTS:
C - - - - - 0x008E48 02:8E38: 60        RTS

; ******************************************************************************************************************

ofs_038_40_8E39_03:
C - - J - - 0x008E49 02:8E39: A0 11     LDY #$11
C - - - - - 0x008E4B 02:8E3B: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008E4E 02:8E3E: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008E51_41_босс_7_летающие_шипы:
- D 0 - I - 0x008E51 02:8E41: 4B 8E     .word ofs_038_41_8E4B_01_активация_объекта ; 
- D 0 - I - 0x008E53 02:8E43: 82 8E     .word ofs_038_41_8E82_02 ; 
- D 0 - I - 0x008E55 02:8E45: 9A A2     .word ofs_038_41_0x0062AA_03_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x008E57 02:8E47: FD A2     .word ofs_038_41_0x00630D_04_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008E59 02:8E49: 3D A3     .word ofs_038_41_0x00628A_05_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_41_8E4B_01_активация_объекта:
C - - J - - 0x008E5B 02:8E4B: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x008E5E 02:8E4E: A0 06     LDY #$06
C - - - - - 0x008E60 02:8E50: 84 06     STY ram_0006
C - - - - - 0x008E62 02:8E52: 20 AE AA  JSR sub_0x006ABE_копировать_позиции_спрайта_объекта
C - - - - - 0x008E65 02:8E55: 20 F0 F4  JSR sub_0x01F500_определить_угол_до_игрока_и_возможность_поворота_объекта
C - - - - - 0x008E68 02:8E58: BC 1E 07  LDY ram_флаги_объектов,X
C - - - - - 0x008E6B 02:8E5B: B9 7F 8E  LDA tbl_8E7F,Y
C - - - - - 0x008E6E 02:8E5E: 18        CLC
C - - - - - 0x008E6F 02:8E5F: 65 0C     ADC ram_000C
C - - - - - 0x008E71 02:8E61: C9 18     CMP #$18
C - - - - - 0x008E73 02:8E63: 90 02     BCC bra_8E67
- - - - - - 0x008E75 02:8E65: A9 00     LDA #$00
bra_8E67:
C - - - - - 0x008E77 02:8E67: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x008E7A 02:8E6A: A0 06     LDY #$06
C - - - - - 0x008E7C 02:8E6C: 20 23 A9  JSR sub_0x006933
C - - - - - 0x008E7F 02:8E6F: A9 02     LDA #$02
C - - - - - 0x008E81 02:8E71: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x008E84 02:8E74: A9 20     LDA #$20
C - - - - - 0x008E86 02:8E76: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x008E89 02:8E79: A9 2C     LDA #$2C    ;    счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_8E7F:
- D 0 - - - 0x008E8F 02:8E7F: 00        .byte $00   ; 00 
- D 0 - - - 0x008E90 02:8E80: 04        .byte $04   ; 01 
- D 0 - - - 0x008E91 02:8E81: FC        .byte $FC   ; 02 

; ******************************************************************************************************************

ofs_038_41_8E82_02:
C - - J - - 0x008E92 02:8E82: A0 12     LDY #$12
C - - - - - 0x008E94 02:8E84: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008E97 02:8E87: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x008E9A 02:8E8A: F0 15     BEQ bra_8EA1
C - - - - - 0x008E9C 02:8E8C: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008E9F 02:8E8F: D0 10     BNE bra_8EA1
C - - - - - 0x008EA1 02:8E91: A9 06     LDA #$06
C - - - - - 0x008EA3 02:8E93: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x008EA6 02:8E96: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x008EA9 02:8E99: A0 06     LDY #$06
C - - - - - 0x008EAB 02:8E9B: 20 23 A9  JSR sub_0x006933
C - - - - - 0x008EAE 02:8E9E: DE 56 07  DEC ram_скролл_объекта_X,X
bra_8EA1:
C - - - - - 0x008EB1 02:8EA1: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x008EB4_42_босс_7_ползающая_слизь:
- D 0 - I - 0x008EB4 02:8EA4: B8 8E     .word ofs_038_42_8EB8_01_активация_объекта ; 
- D 0 - I - 0x008EB6 02:8EA6: C0 8E     .word ofs_038_42_8EC0_02 ; 
- D 0 - I - 0x008EB8 02:8EA8: DA 8E     .word ofs_038_42_8EDA_03 ; 
- D 0 - I - 0x008EBA 02:8EAA: 01 8F     .word ofs_038_42_8F01_04 ; 
- D 0 - I - 0x008EBC 02:8EAC: 51 8F     .word ofs_038_42_8F51_05 ; 
- D 0 - I - 0x008EBE 02:8EAE: 70 8F     .word ofs_038_42_8F70_06 ; 
- D 0 - I - 0x008EC0 02:8EB0: 92 8F     .word ofs_038_42_8F92_07 ; 
- D 0 - I - 0x008EC2 02:8EB2: 9A A2     .word ofs_038_42_0x0062AA_08_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x008EC4 02:8EB4: FD A2     .word ofs_038_42_0x00630D_09_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x008EC6 02:8EB6: 3D A3     .word ofs_038_42_0x00628A_0A_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_42_8EB8_01_активация_объекта:
C - - J - - 0x008EC8 02:8EB8: 20 9E 8F  JSR sub_8F9E
C - - - - - 0x008ECB 02:8EBB: A9 0C     LDA #$0C    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_42_8EC0_02:
C - - J - - 0x008ED0 02:8EC0: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008ED3 02:8EC3: D0 3B     BNE bra_8F00_RTS
C - - - - - 0x008ED5 02:8EC5: A9 0C     LDA #$0C
C - - - - - 0x008ED7 02:8EC7: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x008EDA 02:8ECA: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008EDD 02:8ECD: 20 9E 8F  JSR sub_8F9E
C - - - - - 0x008EE0 02:8ED0: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008EE3 02:8ED3: C9 03     CMP #$03
C - - - - - 0x008EE5 02:8ED5: 90 29     BCC bra_8F00_RTS
C - - - - - 0x008EE7 02:8ED7: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_42_8EDA_03:
C - - J - - 0x008EEA 02:8EDA: A9 10     LDA #$10
C - - - - - 0x008EEC 02:8EDC: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_Y
C - - - - - 0x008EEF 02:8EDF: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x008EF2 02:8EE2: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008EF5 02:8EE5: C9 4C     CMP #$4C
C - - - - - 0x008EF7 02:8EE7: 90 17     BCC bra_8F00_RTS
C - - - - - 0x008EF9 02:8EE9: A9 4C     LDA #$4C
C - - - - - 0x008EFB 02:8EEB: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008EFE 02:8EEE: A9 05     LDA #$05
C - - - - - 0x008F00 02:8EF0: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x008F03 02:8EF3: 20 CA A7  JSR sub_0x0067DA_очистить_скорость_Y
C - - - - - 0x008F06 02:8EF6: A9 00     LDA #$00
C - - - - - 0x008F08 02:8EF8: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008F0B 02:8EFB: A9 10     LDA #$10    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8F00_RTS:
C - - - - - 0x008F10 02:8F00: 60        RTS

; ******************************************************************************************************************

ofs_038_42_8F01_04:
C - - J - - 0x008F11 02:8F01: A0 13     LDY #$13
C - - - - - 0x008F13 02:8F03: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008F16 02:8F06: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008F19 02:8F09: 29 01     AND #$01
C - - - - - 0x008F1B 02:8F0B: 0A        ASL
C - - - - - 0x008F1C 02:8F0C: 85 00     STA ram_0000
C - - - - - 0x008F1E 02:8F0E: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x008F21 02:8F11: 2A        ROL
C - - - - - 0x008F22 02:8F12: 2A        ROL
C - - - - - 0x008F23 02:8F13: 29 01     AND #$01
C - - - - - 0x008F25 02:8F15: 18        CLC
C - - - - - 0x008F26 02:8F16: 65 00     ADC ram_0000    ; 00/02
C - - - - - 0x008F28 02:8F18: A8        TAY
C - - - - - 0x008F29 02:8F19: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008F2C 02:8F1C: D9 4D 8F  CMP tbl_8F4D_позиция_X_спрайта_объекта,Y
C - - - - - 0x008F2F 02:8F1F: 6A        ROR
C - - - - - 0x008F30 02:8F20: 5D CA 06  EOR ram_скорость_объектов_X_старш,X
C - - - - - 0x008F33 02:8F23: 10 03     BPL bra_8F28
C - - - - - 0x008F35 02:8F25: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
bra_8F28:
C - - - - - 0x008F38 02:8F28: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x008F3B 02:8F2B: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008F3E 02:8F2E: D0 D0     BNE bra_8F4A_RTS
C - - - - - 0x008F40 02:8F30: A9 30     LDA #$30
C - - - - - 0x008F42 02:8F32: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x008F45 02:8F35: 20 C9 8F  JSR sub_8FC9
C - - - - - 0x008F48 02:8F38: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x008F4B 02:8F3B: D0 C3     BNE bra_8F4A_RTS
C - - - - - 0x008F4D 02:8F3D: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
C - - - - - 0x008F50 02:8F40: A9 04     LDA #$04
C - - - - - 0x008F52 02:8F42: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008F55 02:8F45: 20 9A 8F  JSR sub_8F9A
C - - - - - 0x008F58 02:8F48: A9 0C     LDA #$0C    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_8F4A_RTS:
                                        RTS

tbl_8F4D_позиция_X_спрайта_объекта:
; 00 
- D 0 - - - 0x008F5D 02:8F4D: 60        .byte $60   ; 00 
- D 0 - - - 0x008F5E 02:8F4E: 20        .byte $20   ; 01 
; 01 
- D 0 - - - 0x008F5F 02:8F4F: E0        .byte $E0   ; 00 
- D 0 - - - 0x008F60 02:8F50: A0        .byte $A0   ; 01 

; ******************************************************************************************************************

ofs_038_42_8F51_05:
C - - J - - 0x008F61 02:8F51: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008F64 02:8F54: D0 AA     BNE bra_8F4A_RTS
C - - - - - 0x008F66 02:8F56: A9 0C     LDA #$0C
C - - - - - 0x008F68 02:8F58: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x008F6B 02:8F5B: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008F6E 02:8F5E: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008F71 02:8F61: C9 07     CMP #$07
C - - - - - 0x008F73 02:8F63: B0 03     BCS bra_8F68
C - - - - - 0x008F75 02:8F65: 4C 9A 8F  JMP loc_8F9A
bra_8F68:
C - - - - - 0x008F78 02:8F68: A9 97     LDA #$97
C - - - - - 0x008F7A 02:8F6A: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x008F7D 02:8F6D: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_42_8F70_06:
C - - J - - 0x008F80 02:8F70: A9 10     LDA #$10
C - - - - - 0x008F82 02:8F72: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_Y
C - - - - - 0x008F85 02:8F75: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x008F88 02:8F78: A9 0C     LDA #$0C
C - - - - - 0x008F8A 02:8F7A: 20 0A A8  JSR sub_0x00681A_проверить_есть_или_нет_преграда_на_пути
C - - - - - 0x008F8D 02:8F7D: F0 81     BEQ bra_8F4A_RTS
C - - - - - 0x008F8F 02:8F7F: 20 3D A8  JSR sub_0x00684D_установить_Y_позицию_объекта_исходя_из_поверхности
C - - - - - 0x008F92 02:8F82: 20 CA A7  JSR sub_0x0067DA_очистить_скорость_Y
C - - - - - 0x008F95 02:8F85: A0 02     LDY #$02
C - - - - - 0x008F97 02:8F87: 20 CB 8F  JSR sub_8FCB
C - - - - - 0x008F9A 02:8F8A: A9 00     LDA #$00
C - - - - - 0x008F9C 02:8F8C: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008F9F 02:8F8F: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_42_8F92_07:
C - - J - - 0x008FA2 02:8F92: A0 14     LDY #$14
C - - - - - 0x008FA4 02:8F94: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008FA7 02:8F97: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8F9A:
loc_8F9A:
C D 0 - - - 0x008FAA 02:8F9A: A9 96     LDA #$96
C - - - - - 0x008FAC 02:8F9C: D0 02     BNE bra_8FA0    ; jmp
sub_8F9E:
C - - - - - 0x008FAE 02:8F9E: A9 94     LDA #$94
bra_8FA0:
C - - - - - 0x008FB0 02:8FA0: 18        CLC
C - - - - - 0x008FB1 02:8FA1: 7D 10 07  ADC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008FB4 02:8FA4: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x008FB7 02:8FA7: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008FBA 02:8FAA: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008FBD 02:8FAD: 18        CLC
C - - - - - 0x008FBE 02:8FAE: 79 C2 8F  ADC tbl_8FC2_добавочная_позиция_Y_спрайта,Y
C - - - - - 0x008FC1 02:8FB1: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008FC4 02:8FB4: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008FC7 02:8FB7: 4A        LSR
loc_8FB8:
C D 0 - - - 0x008FC8 02:8FB8: A9 03     LDA #$03
C - - - - - 0x008FCA 02:8FBA: 90 02     BCC bra_8FBE
C - - - - - 0x008FCC 02:8FBC: A9 43     LDA #$43
bra_8FBE:
C - - - - - 0x008FCE 02:8FBE: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x008FD1 02:8FC1: 60        RTS

tbl_8FC2_добавочная_позиция_Y_спрайта:
- D 0 - - - 0x008FD2 02:8FC2: 00        .byte $00   ; 00 
- D 0 - - - 0x008FD3 02:8FC3: 04        .byte $04   ; 01 
- D 0 - - - 0x008FD4 02:8FC4: 08        .byte $08   ; 02 
- D 0 - - - 0x008FD5 02:8FC5: 04        .byte $04   ; 03 
- D 0 - - - 0x008FD6 02:8FC6: 04        .byte $04   ; 04 
- D 0 - - - 0x008FD7 02:8FC7: 08        .byte $08   ; 05 
- D 0 - - - 0x008FD8 02:8FC8: 02        .byte $02   ; 06 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8FC9:
C - - - - - 0x008FD9 02:8FC9: A0 00     LDY #$00
sub_8FCB:
C - - - - - 0x008FDB 02:8FCB: B9 EE 8F  LDA tbl_8FEE_скорость_X,Y
C - - - - - 0x008FDE 02:8FCE: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x008FE1 02:8FD1: B9 EF 8F  LDA tbl_8FEE_скорость_X + $01,Y
C - - - - - 0x008FE4 02:8FD4: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x008FE7 02:8FD7: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x008FEA 02:8FDA: BD 3C 05  LDA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008FED 02:8FDD: D9 4C 05  CMP ram_позиция_x_спрайта_игрока,Y
C - - - - - 0x008FF0 02:8FE0: 90 03     BCC bra_8FE5
C - - - - - 0x008FF2 02:8FE2: 20 DC A7  JSR sub_0x0067EC_отразить_скорость_по_X
bra_8FE5:
C - - - - - 0x008FF5 02:8FE5: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x008FF8 02:8FE8: 49 80     EOR #$80
C - - - - - 0x008FFA 02:8FEA: 0A        ASL
C - - - - - 0x008FFB 02:8FEB: 4C B8 8F  JMP loc_8FB8

tbl_8FEE_скорость_X:
- D 0 - - - 0x008FFE 02:8FEE: 80 00     .word $0080 ; 00 
- D 0 - - - 0x009000 02:8FF0: 80 01     .word $0180 ; 02 

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x00847F_1C_босс_8_летящий_красный_шип:
- D 0 - I - 0x00847F 02:846F: 77 84     .word ofs_038_1C_8477_01_активация_объекта ; 
- D 0 - I - 0x008481 02:8471: 92 84     .word ofs_038_1C_8492_02 ; 
- D 0 - I - 0x008483 02:8473: A0 84     .word ofs_038_1C_84A0_03 ; 
- D 0 - I - 0x008485 02:8475: 75 A2     .word ofs_038_1C_0x00628A_04_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_1C_8477_01_активация_объекта:
C - - J - - 0x008487 02:8477: A9 80     LDA #$80
C - - - - - 0x008489 02:8479: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x00848C 02:847C: A9 F1     LDA #con_HP_F1
C - - - - - 0x00848E 02:847E: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x008491 02:8481: BC 48 07  LDY ram_скролл_объекта_Y,X
C - - - - - 0x008494 02:8484: B9 8A 84  LDA tbl_848A_счетчики,Y
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_848A_счетчики:
- D 0 - - - 0x00849A 02:848A: 1C        .byte $1C   ; 00 
- D 0 - - - 0x00849B 02:848B: 18        .byte $18   ; 01 
- D 0 - - - 0x00849C 02:848C: 14        .byte $14   ; 02 
- D 0 - - - 0x00849D 02:848D: 10        .byte $10   ; 03 
- D 0 - - - 0x00849E 02:848E: 0C        .byte $0C   ; 04 
- D 0 - - - 0x00849F 02:848F: 08        .byte $08   ; 05 
- D 0 - - - 0x0084A0 02:8490: 04        .byte $04   ; 06 
- D 0 - - - 0x0084A1 02:8491: 01        .byte $01   ; 07 

; ******************************************************************************************************************

ofs_038_1C_8492_02:
C - - J - - 0x0084A2 02:8492: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0084A5 02:8495: D0 08     BNE bra_849F_RTS
C - - - - - 0x0084A7 02:8497: A9 02     LDA #$02
C - - - - - 0x0084A9 02:8499: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0084AC 02:849C: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_849F_RTS:
C - - - - - 0x0084AF 02:849F: 60        RTS

; ******************************************************************************************************************

ofs_038_1C_84A0_03:
C - - J - - 0x0084B0 02:84A0: A0 16     LDY #$16
C - - - - - 0x0084B2 02:84A2: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x0084B5 02:84A5: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x0084B8 02:84A8: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0084B9_28_босс_8_летящий_синий_шип:
- D 0 - I - 0x0084B9 02:84A9: B5 84     .word ofs_038_28_84B5_01_активация_объекта ; 
- D 0 - I - 0x0084BB 02:84AB: EE 84     .word ofs_038_28_84EE_02 ; 
- D 0 - I - 0x0084BD 02:84AD: 0B 85     .word ofs_038_28_850B_03 ; 
- D 0 - I - 0x0084BF 02:84AF: 9A A2     .word ofs_038_28_0x0062AA_04_обработка_состояния_смерти_объекта ; 
- D 0 - I - 0x0084C1 02:84B1: FD A2     .word ofs_038_28_0x00630D_05_обработка_анимации_взрыва_объекта ; 
- D 0 - I - 0x0084C3 02:84B3: 3D A3     .word ofs_038_28_0x00628A_06_удалить_объект ; 

; ******************************************************************************************************************

ofs_038_28_84B5_01_активация_объекта:
C - - J - - 0x0084C5 02:84B5: A9 03     LDA #$03
C - - - - - 0x0084C7 02:84B7: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0084CA 02:84BA: A9 B8     LDA #$B8
C - - - - - 0x0084CC 02:84BC: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0084CF 02:84BF: A9 D0     LDA #$D0
C - - - - - 0x0084D1 02:84C1: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0084D4 02:84C4: A5 23     LDA ram_рандом_байт
C - - - - - 0x0084D6 02:84C6: 29 07     AND #$07
C - - - - - 0x0084D8 02:84C8: 0A        ASL
C - - - - - 0x0084D9 02:84C9: A8        TAY
C - - - - - 0x0084DA 02:84CA: B9 13 85  LDA tbl_8513_скорость_Y,Y
C - - - - - 0x0084DD 02:84CD: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x0084E0 02:84D0: B9 14 85  LDA tbl_8513_скорость_Y + $01,Y
C - - - - - 0x0084E3 02:84D3: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x0084E6 02:84D6: A5 23     LDA ram_рандом_байт
C - - - - - 0x0084E8 02:84D8: 18        CLC
C - - - - - 0x0084E9 02:84D9: 65 1B     ADC ram_счетчик_кадров
C - - - - - 0x0084EB 02:84DB: 29 07     AND #$07
C - - - - - 0x0084ED 02:84DD: 0A        ASL
C - - - - - 0x0084EE 02:84DE: A8        TAY
C - - - - - 0x0084EF 02:84DF: B9 23 85  LDA tbl_8523_скорость_X,Y
C - - - - - 0x0084F2 02:84E2: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x0084F5 02:84E5: B9 24 85  LDA tbl_8523_скорость_X + $01,Y
C - - - - - 0x0084F8 02:84E8: 9D CA 06  STA ram_скорость_объектов_X_старш,X
C - - - - - 0x0084FB 02:84EB: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_8513_скорость_Y:
- D 0 - - - 0x008523 02:8513: C0 F9     .word $F9C0 ; 00 
- D 0 - - - 0x008525 02:8515: 00 FA     .word $FA00 ; 01 
- D 0 - - - 0x008527 02:8517: C0 F9     .word $F9C0 ; 02 
- D 0 - - - 0x008529 02:8519: 00 FA     .word $FA00 ; 03 
- D 0 - - - 0x00852B 02:851B: C0 F9     .word $F9C0 ; 04 
- D 0 - - - 0x00852D 02:851D: 00 FA     .word $FA00 ; 05 
- D 0 - - - 0x00852F 02:851F: C0 F9     .word $F9C0 ; 06 
- D 0 - - - 0x008531 02:8521: 00 FA     .word $FA00 ; 07 

tbl_8523_скорость_X:
- D 0 - - - 0x008533 02:8523: 00 FD     .word $FD00 ; 00 
- D 0 - - - 0x008535 02:8525: 30 FD     .word $FD30 ; 01 
- D 0 - - - 0x008537 02:8527: 60 FD     .word $FD60 ; 02 
- D 0 - - - 0x008539 02:8529: 90 FD     .word $FD90 ; 03 
- D 0 - - - 0x00853B 02:852B: C0 FD     .word $FDC0 ; 04 
- D 0 - - - 0x00853D 02:852D: F0 FD     .word $FDF0 ; 05 
- D 0 - - - 0x00853F 02:852F: 20 FE     .word $FE20 ; 06 
- D 0 - - - 0x008541 02:8531: 50 FE     .word $FE50 ; 07 

; ******************************************************************************************************************

ofs_038_28_84EE_02:
C - - J - - 0x0084FE 02:84EE: A0 16     LDY #$16
C - - - - - 0x008500 02:84F0: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008503 02:84F3: A9 20     LDA #$20
C - - - - - 0x008505 02:84F5: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_Y
C - - - - - 0x008508 02:84F8: 20 D3 A6  JSR sub_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры
C - - - - - 0x00850B 02:84FB: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x00850E 02:84FE: 30 0A     BMI bra_850A_RTS
C - - - - - 0x008510 02:8500: C9 01     CMP #$01
C - - - - - 0x008512 02:8502: 90 06     BCC bra_850A_RTS
C - - - - - 0x008514 02:8504: 20 D3 A7  JSR sub_0x0067E3_очистить_скорость_X
C - - - - - 0x008517 02:8507: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта
bra_850A_RTS:
C - - - - - 0x00851A 02:850A: 60        RTS

; ******************************************************************************************************************

ofs_038_28_850B_03:
C - - J - - 0x00851B 02:850B: A0 16     LDY #$16
C - - - - - 0x00851D 02:850D: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008520 02:8510: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0085A4_57_босс_8_глаз:
- D 0 - I - 0x0085A4 02:8594: AC 85     .word ofs_038_57_85AC_01_активация_объекта ; 
- D 0 - I - 0x0085A6 02:8596: B9 85     .word ofs_038_57_85B9_02 ; 
- D 0 - I - 0x0085A8 02:8598: D4 85     .word ofs_038_57_85D4_03 ; 
- D 0 - I - 0x0085AA 02:859A: 02 86     .word ofs_038_57_8602_04 ; 
- D 0 - I - 0x0085AC 02:859C: 76 86     .word ofs_038_57_8676_05 ; 
- D 0 - I - 0x0085AE 02:859E: B3 86     .word ofs_038_57_86B3_06 ; 
- D 0 - I - 0x0085B0 02:85A0: 07 87     .word ofs_038_57_8707_07 ; 
- D 0 - I - 0x0085B2 02:85A2: 0D 87     .word ofs_038_57_870D_08 ; 
- D 0 - I - 0x0085B4 02:85A4: 18 87     .word ofs_038_57_8718_09 ; 
- D 0 - I - 0x0085B6 02:85A6: 1E 87     .word ofs_038_57_871E_0A ; 
- D 0 - I - 0x0085B8 02:85A8: F6 A2     .word ofs_038_57_0x006306_0B ; 
- D 0 - I - 0x0085BA 02:85AA: 37 A3     .word ofs_038_57_0x006347_0C_удалить_объект_босс ; 

; ******************************************************************************************************************

ofs_038_57_85AC_01_активация_объекта:
C - - J - - 0x0085BC 02:85AC: A9 91     LDA #$91
C - - - - - 0x0085BE 02:85AE: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0085C1 02:85B1: A9 F0     LDA #con_HP_F0
C - - - - - 0x0085C3 02:85B3: 9D 76 06  STA ram_жизни_объектов_32bit,X
C - - - - - 0x0085C6 02:85B6: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_57_85B9_02:
C - - J - - 0x0085C9 02:85B9: A5 61     LDA ram_0061_конфиг_уровня
C - - - - - 0x0085CB 02:85BB: F0 26     BEQ bra_85E3_RTS
C - - - - - 0x0085CD 02:85BD: A9 00     LDA #$00
C - - - - - 0x0085CF 02:85BF: 85 64     STA ram_0064
C - - - - - 0x0085D1 02:85C1: A9 02     LDA #$02
C - - - - - 0x0085D3 02:85C3: 85 61     STA ram_0061_конфиг_уровня
C - - - - - 0x0085D5 02:85C5: A0 50     LDY #$50
C - - - - - 0x0085D7 02:85C7: 20 30 FA  JSR sub_0x01FA40
C - - - - - 0x0085DA 02:85CA: A6 10     LDX ram_0010
C - - - - - 0x0085DC 02:85CC: A9 08     LDA #$08
C - - - - - 0x0085DE 02:85CE: 9D 48 07  STA ram_скролл_объекта_Y,X
C - - - - - 0x0085E1 02:85D1: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_57_85D4_03:
C - - J - - 0x0085E4 02:85D4: A5 60     LDA ram_0060_unk
C - - - - - 0x0085E6 02:85D6: 05 70     ORA ram_0070
C - - - - - 0x0085E8 02:85D8: D0 09     BNE bra_85E3_RTS
C - - - - - 0x0085EA 02:85DA: DE 48 07  DEC ram_скролл_объекта_Y,X
C - - - - - 0x0085ED 02:85DD: F0 05     BEQ bra_85E4
C - - - - - 0x0085EF 02:85DF: A9 00     LDA #$00
C - - - - - 0x0085F1 02:85E1: 85 6B     STA ram_006B
bra_85E3_RTS:
C - - - - - 0x0085F3 02:85E3: 60        RTS
bra_85E4:
C - - - - - 0x0085F4 02:85E4: A0 AC     LDY #con_F97C_colors + $2B * $04
C - - - - - 0x0085F6 02:85E6: 20 64 F9  JSR sub_0x01F974_запись_3х_цветов_с_условием
C - - - - - 0x0085F9 02:85E9: A6 10     LDX ram_0010
C - - - - - 0x0085FB 02:85EB: A9 30     LDA #con_sound_30   ; музыка 8й босс
C - - - - - 0x0085FD 02:85ED: 20 DE FD  JSR sub_0x01FDEE_play_music
C - - - - - 0x008600 02:85F0: A9 01     LDA #$01
C - - - - - 0x008602 02:85F2: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x008605 02:85F5: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x008608 02:85F8: A9 00     LDA #$00
C - - - - - 0x00860A 02:85FA: 9D 1E 07  STA ram_флаги_объектов,X
C - - - - - 0x00860D 02:85FD: A9 40     LDA #$40    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_57_8602_04:
C - - J - - 0x008612 02:8602: 20 87 88  JSR sub_8887
C - - - - - 0x008615 02:8605: 20 99 88  JSR sub_8899
C - - - - - 0x008618 02:8608: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00861B 02:860B: D0 D6     BNE bra_85E3_RTS
C - - - - - 0x00861D 02:860D: A9 02     LDA #$02
C - - - - - 0x00861F 02:860F: 85 08     STA ram_0008
bra_8611_loop:
C - - - - - 0x008621 02:8611: A0 6E     LDY #con_obj_id_58  ; маленький камень
C - - - - - 0x008623 02:8613: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x008626 02:8616: 90 0B     BCC bra_8623
C - - - - - 0x008628 02:8618: A4 11     LDY ram_0011
C - - - - - 0x00862A 02:861A: A5 08     LDA ram_0008
C - - - - - 0x00862C 02:861C: 99 48 07  STA ram_скролл_объекта_Y,Y
C - - - - - 0x00862F 02:861F: C6 08     DEC ram_0008
C - - - - - 0x008631 02:8621: 10 EE     BPL bra_8611_loop
bra_8623:
C - - - - - 0x008633 02:8623: 20 4C 88  JSR sub_884C
C - - - - - 0x008636 02:8626: A9 10     LDA #$10
C - - - - - 0x008638 02:8628: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x00863B 02:862B: FE 1E 07  INC ram_флаги_объектов,X
C - - - - - 0x00863E 02:862E: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x008641 02:8631: C9 14     CMP #$14
C - - - - - 0x008643 02:8633: 90 AE     BCC bra_85E3_RTS
C - - - - - 0x008645 02:8635: A9 01     LDA #con_mirroring_H
C - - - - - 0x008647 02:8637: 85 26     STA ram_mirroring
C - - - - - 0x008649 02:8639: A9 C8     LDA #$C8
C - - - - - 0x00864B 02:863B: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x00864E 02:863E: A9 58     LDA #$58
C - - - - - 0x008650 02:8640: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008653 02:8643: A9 01     LDA #$01
C - - - - - 0x008655 02:8645: 9D 8E 07  STA ram_позиция_объектов_Y_старш,X
C - - - - - 0x008658 02:8648: A9 00     LDA #$00
C - - - - - 0x00865A 02:864A: 85 FD     STA ram_scroll_X
C - - - - - 0x00865C 02:864C: 85 FC     STA ram_scroll_Y
C - - - - - 0x00865E 02:864E: A9 A8     LDA #$A8
C - - - - - 0x008660 02:8650: 85 FF     STA ram_for_2000
C - - - - - 0x008662 02:8652: 20 7F FC  JSR sub_0x01FC8F_copy_reg_values
C - - - - - 0x008665 02:8655: A9 0D     LDA #con_irq_area_8_boss
C - - - - - 0x008667 02:8657: 85 27     STA ram_irq_handler_hi
C - - - - - 0x008669 02:8659: 20 9F 88  JSR sub_889F
C - - - - - 0x00866C 02:865C: 20 CE A9  JSR sub_0x0069DE
C - - - - - 0x00866F 02:865F: A9 00     LDA #$00
C - - - - - 0x008671 02:8661: 9D 8E 07  STA ram_позиция_объектов_Y_старш,X
C - - - - - 0x008674 02:8664: A9 E0     LDA #$E0
C - - - - - 0x008676 02:8666: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008679 02:8669: 20 9C 88  JSR sub_889C
C - - - - - 0x00867C 02:866C: A0 00     LDY #$00
C - - - - - 0x00867E 02:866E: 20 3B 88  JSR sub_883B
C - - - - - 0x008681 02:8671: A9 40     LDA #$40    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_57_8676_05:
C - - J - - 0x008686 02:8676: A9 01     LDA #$01
C - - - - - 0x008688 02:8678: 9D 08 05  STA ram_кадр_объекта_или_пули,X
C - - - - - 0x00868B 02:867B: 20 90 88  JSR sub_8890
C - - - - - 0x00868E 02:867E: BD 22 05  LDA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x008691 02:8681: C9 5A     CMP #$5A
C - - - - - 0x008693 02:8683: 90 19     BCC bra_869E
C - - - - - 0x008695 02:8685: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x008698 02:8688: D0 13     BNE bra_869D_RTS
C - - - - - 0x00869A 02:868A: A9 01     LDA #$01
C - - - - - 0x00869C 02:868C: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x00869F 02:868F: A0 6E     LDY #con_obj_id_58  ; маленький камень
C - - - - - 0x0086A1 02:8691: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x0086A4 02:8694: 90 07     BCC bra_869D_RTS
C - - - - - 0x0086A6 02:8696: A4 11     LDY ram_0011
C - - - - - 0x0086A8 02:8698: A9 01     LDA #$01
C - - - - - 0x0086AA 02:869A: 99 56 07  STA ram_скролл_объекта_X,Y
bra_869D_RTS:
C - - - - - 0x0086AD 02:869D: 60        RTS
bra_869E:
C - - - - - 0x0086AE 02:869E: A9 30     LDA #$30
C - - - - - 0x0086B0 02:86A0: 20 99 AB  JSR sub_0x006BA9_выбрать_количество_HP_от_сложности_игры
C - - - - - 0x0086B3 02:86A3: A9 10     LDA #$10
C - - - - - 0x0086B5 02:86A5: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0086B8 02:86A8: 20 32 88  JSR sub_8832
C - - - - - 0x0086BB 02:86AB: 20 CA A7  JSR sub_0x0067DA_очистить_скорость_Y
C - - - - - 0x0086BE 02:86AE: A9 20     LDA #$20    ; счетчик
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_57_86B3_06:
; something during final boss spawn
C - - J - - 0x0086C3 02:86B3: 20 99 88  JSR sub_8899
C - - - - - 0x0086C6 02:86B6: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x0086C9 02:86B9: D0 E2     BNE bra_869D_RTS
C - - - - - 0x0086CB 02:86BB: A4 1E     LDY ram_index_ppu_buffer
C - - - - - 0x0086CD 02:86BD: A9 06     LDA #con_buf_mode_06
C - - - - - 0x0086CF 02:86BF: 99 00 03  STA ram_nmt_buffer,Y
C - - - - - 0x0086D2 02:86C2: A9 2D     LDA #> $2DD6
C - - - - - 0x0086D4 02:86C4: 99 01 03  STA ram_nmt_buffer + $01,Y  ; ppu hi
C - - - - - 0x0086D7 02:86C7: A9 D6     LDA #< $2DD6
C - - - - - 0x0086D9 02:86C9: 99 02 03  STA ram_nmt_buffer + $02,Y  ; ppu lo
C - - - - - 0x0086DC 02:86CC: A9 02     LDA #$02    ; tiles counter
C - - - - - 0x0086DE 02:86CE: 99 03 03  STA ram_nmt_buffer + $03,Y
C - - - - - 0x0086E1 02:86D1: A9 B9     LDA #$B9    ; tile
C - - - - - 0x0086E3 02:86D3: 99 04 03  STA ram_nmt_buffer + $04,Y
C - - - - - 0x0086E6 02:86D6: A9 BA     LDA #$BA    ; tile
C - - - - - 0x0086E8 02:86D8: 99 05 03  STA ram_nmt_buffer + $05,Y
C - - - - - 0x0086EB 02:86DB: A9 FF     LDA #$FF    ; close buffer
C - - - - - 0x0086ED 02:86DD: 99 06 03  STA ram_nmt_buffer + $06,Y
C - - - - - 0x0086F0 02:86E0: 98        TYA
C - - - - - 0x0086F1 02:86E1: 18        CLC
C - - - - - 0x0086F2 02:86E2: 69 07     ADC #$07
C - - - - - 0x0086F4 02:86E4: 85 1E     STA ram_index_ppu_buffer
C - - - - - 0x0086F6 02:86E6: A0 B0     LDY #con_F97C_colors + $2C * $04
C - - - - - 0x0086F8 02:86E8: 20 64 F9  JSR sub_0x01F974_запись_3х_цветов_с_условием
C - - - - - 0x0086FB 02:86EB: A6 10     LDX ram_0010
C - - - - - 0x0086FD 02:86ED: A9 20     LDA #$20
C - - - - - 0x0086FF 02:86EF: 9D 02 07  STA ram_счетчик_анимации_объектов,X
C - - - - - 0x008702 02:86F2: A9 00     LDA #$00
C - - - - - 0x008704 02:86F4: 9D 10 07  STA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008707 02:86F7: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x00870A 02:86FA: A9 06     LDA #$06
C - - - - - 0x00870C 02:86FC: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x00870F 02:86FF: A9 30     LDA #$30
C - - - - - 0x008711 02:8701: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x008714 02:8704: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

; ******************************************************************************************************************

ofs_038_57_8707_07:
C - - J - - 0x008717 02:8707: 20 27 87  JSR sub_8727
C - - - - - 0x00871A 02:870A: 4C 99 88  JMP loc_8899

; ******************************************************************************************************************

ofs_038_57_870D_08:
C - - J - - 0x00871D 02:870D: A0 02     LDY #$02
C - - - - - 0x00871F 02:870F: 20 3B 88  JSR sub_883B
C - - - - - 0x008722 02:8712: 20 90 88  JSR sub_8890
C - - - - - 0x008725 02:8715: 4C B8 A3  JMP loc_0x0063C8_установить_статус_уничтожения_босса_и_убить_все_объекты

; ******************************************************************************************************************

ofs_038_57_8718_09:
C - - J - - 0x008728 02:8718: 20 90 88  JSR sub_8890
C - - - - - 0x00872B 02:871B: 4C D8 A3  JMP loc_0x0063E8_большие_взрывы_для_боссов

; ******************************************************************************************************************

ofs_038_57_871E_0A:
                                        INC ram_002B
C - - - - - 0x008731 02:8721: 20 32 88  JSR sub_8832
C - - - - - 0x008734 02:8724: 4C A2 A2  JMP loc_0x0062B2_обработка_состояния_смерти_объекта

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8727:
C - - - - - 0x008737 02:8727: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00873A 02:872A: D0 20     BNE bra_874C
C - - - - - 0x00873C 02:872C: FE 72 07  INC ram_0772_obj,X
C - - - - - 0x00873F 02:872F: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x008742 02:8732: C9 0A     CMP #$0A
C - - - - - 0x008744 02:8734: A9 14     LDA #$14
C - - - - - 0x008746 02:8736: 90 07     BCC bra_873F
C - - - - - 0x008748 02:8738: A9 00     LDA #$00
C - - - - - 0x00874A 02:873A: 9D 72 07  STA ram_0772_obj,X
C - - - - - 0x00874D 02:873D: A9 80     LDA #$80
bra_873F:
C - - - - - 0x00874F 02:873F: 9D E6 06  STA ram_счетчики_для_объектов,X
C - - - - - 0x008752 02:8742: A0 37     LDY #con_obj_id_28  ; синий шип на боссе
C - - - - - 0x008754 02:8744: 84 17     STY ram_0017
C - - - - - 0x008756 02:8746: 20 08 F7  JSR sub_0x01F718_попытка_найти_свободный_слот_для_объекта_X_слотов
C - - - - - 0x008759 02:8749: 20 CD AB  JSR sub_0x00ABCD_попытка_создать_новый_объект_на_позиции_текущего_объекта
bra_874C:
C - - - - - 0x00875C 02:874C: BD F4 06  LDA ram_счетчкик_жизни_объектов,X
C - - - - - 0x00875F 02:874F: F0 08     BEQ bra_8759
C - - - - - 0x008761 02:8751: DE F4 06  DEC ram_счетчкик_жизни_объектов,X
C - - - - - 0x008764 02:8754: D0 03     BNE bra_8759
C - - - - - 0x008766 02:8756: 20 F7 87  JSR sub_87F7
bra_8759:
C - - - - - 0x008769 02:8759: DE 02 07  DEC ram_счетчик_анимации_объектов,X
C - - - - - 0x00876C 02:875C: D0 45     BNE bra_87A3_RTS
C - - - - - 0x00876E 02:875E: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x008771 02:8761: D0 24     BNE bra_8787
C - - - - - 0x008773 02:8763: FE 10 07  INC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x008776 02:8766: 20 A4 87  JSR sub_87A4
C - - - - - 0x008779 02:8769: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00877C 02:876C: C9 02     CMP #$02
C - - - - - 0x00877E 02:876E: A9 08     LDA #$08
C - - - - - 0x008780 02:8770: 90 2E     BCC bra_87A0
C - - - - - 0x008782 02:8772: A9 10     LDA #$10
C - - - - - 0x008784 02:8774: DE 56 07  DEC ram_скролл_объекта_X,X
C - - - - - 0x008787 02:8777: D0 1D     BNE bra_8796
C - - - - - 0x008789 02:8779: A9 04     LDA #$04
C - - - - - 0x00878B 02:877B: 9D F4 06  STA ram_счетчкик_жизни_объектов,X
C - - - - - 0x00878E 02:877E: A9 06     LDA #$06
C - - - - - 0x008790 02:8780: 9D 56 07  STA ram_скролл_объекта_X,X
C - - - - - 0x008793 02:8783: A9 40     LDA #$40
C - - - - - 0x008795 02:8785: D0 0F     BNE bra_8796    ; jmp
bra_8787:
C - - - - - 0x008797 02:8787: DE 10 07  DEC ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x00879A 02:878A: 20 A4 87  JSR sub_87A4
C - - - - - 0x00879D 02:878D: A9 08     LDA #$08
C - - - - - 0x00879F 02:878F: BC 10 07  LDY ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0087A2 02:8792: D0 0C     BNE bra_87A0
C - - - - - 0x0087A4 02:8794: A9 10     LDA #$10
bra_8796:
C - - - - - 0x0087A6 02:8796: A8        TAY
C - - - - - 0x0087A7 02:8797: BD 64 07  LDA ram_0764_obj,X
C - - - - - 0x0087AA 02:879A: 49 01     EOR #$01
C - - - - - 0x0087AC 02:879C: 9D 64 07  STA ram_0764_obj,X
C - - - - - 0x0087AF 02:879F: 98        TYA
bra_87A0:
C - - - - - 0x0087B0 02:87A0: 9D 02 07  STA ram_счетчик_анимации_объектов,X
bra_87A3_RTS:
C - - - - - 0x0087B3 02:87A3: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_87A4:
C - - - - - 0x0087B4 02:87A4: BD 10 07  LDA ram_счетчик_анимации_взрыва_объекта,X
C - - - - - 0x0087B7 02:87A7: C9 03     CMP #$03
C - - - - - 0x0087B9 02:87A9: 90 02     BCC bra_87AD
- - - - - - 0x0087BB 02:87AB: A9 02     LDA #$01 * $02
bra_87AD:
C - - - - - 0x0087BD 02:87AD: 0A        ASL
C - - - - - 0x0087BE 02:87AE: A8        TAY
C - - - - - 0x0087BF 02:87AF: B9 CD 87  LDA tbl_87CD_поинтеры,Y
C - - - - - 0x0087C2 02:87B2: 85 08     STA ram_0008
C - - - - - 0x0087C4 02:87B4: B9 CE 87  LDA tbl_87CD_поинтеры + $01,Y
C - - - - - 0x0087C7 02:87B7: 85 09     STA ram_0009
C - - - - - 0x0087C9 02:87B9: A0 00     LDY #$00
C - - - - - 0x0087CB 02:87BB: A6 1E     LDX ram_index_ppu_buffer
bra_87BD_loop:
C - - - - - 0x0087CD 02:87BD: B1 08     LDA (ram_0008),Y
C - - - - - 0x0087CF 02:87BF: 9D 00 03  STA ram_nmt_buffer,X
C - - - - - 0x0087D2 02:87C2: C8        INY
C - - - - - 0x0087D3 02:87C3: E8        INX
C - - - - - 0x0087D4 02:87C4: C9 FF     CMP #$FF
C - - - - - 0x0087D6 02:87C6: D0 F5     BNE bra_87BD_loop
C - - - - - 0x0087D8 02:87C8: 86 1E     STX ram_index_ppu_buffer
C - - - - - 0x0087DA 02:87CA: A6 10     LDX ram_0010
C - - - - - 0x0087DC 02:87CC: 60        RTS

tbl_87CD_поинтеры:
- D 0 - - - 0x0087DD 02:87CD: D3 87     .word off_87D3_00
- D 0 - - - 0x0087DF 02:87CF: DF 87     .word off_87DF_01
- D 0 - - - 0x0087E1 02:87D1: EB 87     .word off_87EB_02

; _________________________________________________________________________________________________________________

off_87D3_00:
- D 0 - I - 0x0087E3 02:87D3: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x0087E4 02:87D4: 2D 58     .dbyt $2D58 ; ppu address
- D 0 - I - 0x0087E6 02:87D6: 02        .byte $02   ; counter
- D 0 - I - 0x0087E7 02:87D7: 0D        .byte $0D, $0E   ; tiles

- D 0 - I - 0x0087E9 02:87D9: 2D 78     .dbyt $2D78 ; ppu address
- D 0 - I - 0x0087EB 02:87DB: 02        .byte $02   ; counter
- D 0 - I - 0x0087EC 02:87DC: 16        .byte $16, $17   ; tiles

- D 0 - I - 0x0087EE 02:87DE: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_87DF_01:
- D 0 - I - 0x0087EF 02:87DF: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x0087F0 02:87E0: 2D 58     .dbyt $2D58 ; ppu address
- D 0 - I - 0x0087F2 02:87E2: 02        .byte $02   ; counter
- D 0 - I - 0x0087F3 02:87E3: C6        .byte $C6, $C7   ; tiles

- D 0 - I - 0x0087F5 02:87E5: 2D 78     .dbyt $2D78 ; ppu address
- D 0 - I - 0x0087F7 02:87E7: 02        .byte $02   ; counter
- D 0 - I - 0x0087F8 02:87E8: C8        .byte $C8, $C9   ; tiles

- D 0 - I - 0x0087FA 02:87EA: FF        .byte $FF   ; end token

; _________________________________________________________________________________________________________________

off_87EB_02:
- D 0 - I - 0x0087FB 02:87EB: 06        .byte con_buf_mode_06   ; 

- D 0 - I - 0x0087FC 02:87EC: 2D 58     .dbyt $2D58 ; ppu address
- D 0 - I - 0x0087FE 02:87EE: 02        .byte $02   ; counter
- D 0 - I - 0x0087FF 02:87EF: CA        .byte $CA, $CB   ; tiles

- D 0 - I - 0x008801 02:87F1: 2D 78     .dbyt $2D78 ; ppu address
- D 0 - I - 0x008803 02:87F3: 02        .byte $02   ; counter
- D 0 - I - 0x008804 02:87F4: CC        .byte $CC, $CD   ; tiles

- D 0 - I - 0x008806 02:87F6: FF        .byte $FF   ; end token

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_87F7:
C - - - - - 0x008807 02:87F7: 20 0B AB  JSR sub_0x006B1B_выбрать_ближайшего_игрока_по_оси_x
C - - - - - 0x00880A 02:87FA: A0 05     LDY #$05
C - - - - - 0x00880C 02:87FC: 20 57 A9  JSR sub_0x006967
C - - - - - 0x00880F 02:87FF: A0 07     LDY #$07
bra_8801_loop:
C - - - - - 0x008811 02:8801: 84 08     STY ram_0008
C - - - - - 0x008813 02:8803: A9 2B     LDY #con_obj_id_1C
C - - - - - 0x008816 02:8806: 20 C8 AB  JSR loc_0x006BD8_поиск_пустого_слота_и_попытка_создать_новый_объект_на_позиции_текущего_объекта
C - - - - - 0x008819 02:8809: 90 24     BCC bra_882F
C - - - - - 0x00881B 02:880B: A4 11     LDY ram_0011
C - - - - - 0x00881D 02:880D: A5 08     LDA ram_0008
C - - - - - 0x00881F 02:880F: 99 48 07  STA ram_скролл_объекта_Y,Y
C - - - - - 0x008822 02:8812: BD A0 06  LDA ram_скорость_объектов_y_младш,X
C - - - - - 0x008825 02:8815: 99 A0 06  STA ram_скорость_объектов_y_младш,Y
C - - - - - 0x008828 02:8818: BD AE 06  LDA ram_скорость_объектов_Y_старш,X
C - - - - - 0x00882B 02:881B: 99 AE 06  STA ram_скорость_объектов_Y_старш,Y
C - - - - - 0x00882E 02:881E: BD BC 06  LDA ram_скорость_объектов_x_младш,X
C - - - - - 0x008831 02:8821: 99 BC 06  STA ram_скорость_объектов_x_младш,Y
C - - - - - 0x008834 02:8824: BD CA 06  LDA ram_скорость_объектов_X_старш,X
C - - - - - 0x008837 02:8827: 99 CA 06  STA ram_скорость_объектов_X_старш,Y
C - - - - - 0x00883A 02:882A: A4 08     LDY ram_0008
C - - - - - 0x00883C 02:882C: 88        DEY
C - - - - - 0x00883D 02:882D: 10 D2     BPL bra_8801_loop
bra_882F:
C - - - - - 0x00883F 02:882F: 4C C7 A7  JMP loc_0x0067D7_очистить_скорость_X_Y

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8832:
C - - - - - 0x008842 02:8832: A9 00     LDA #$00
C - - - - - 0x008844 02:8834: 85 FD     STA ram_scroll_X
C - - - - - 0x008846 02:8836: 85 FA     STA ram_00FA
C - - - - - 0x008848 02:8838: 85 FC     STA ram_scroll_Y
C - - - - - 0x00884A 02:883A: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_883B:
C - - - - - 0x00884B 02:883B: B9 48 88  LDA tbl_8848_скорость_Y,Y
C - - - - - 0x00884E 02:883E: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x008851 02:8841: B9 49 88  LDA tbl_8848_скорость_Y + $01,Y
C - - - - - 0x008854 02:8844: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x008857 02:8847: 60        RTS

tbl_8848_скорость_Y:
- D 0 - - - 0x008858 02:8848: C0 FF     .word $FFC0 ; 00 
- D 0 - - - 0x00885A 02:884A: 40 00     .word $0040 ; 01 

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_884C:
C - - - - - 0x00885C 02:884C: A9 00     LDA #$00
C - - - - - 0x00885E 02:884E: 85 00     STA ram_0000
C - - - - - 0x008860 02:8850: A4 1E     LDY ram_index_ppu_buffer
C - - - - - 0x008862 02:8852: A9 03     LDA #con_buf_mode_03
C - - - - - 0x008864 02:8854: 99 00 03  STA ram_nmt_buffer,Y
C - - - - - 0x008867 02:8857: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x00886A 02:885A: 0A        ASL
C - - - - - 0x00886B 02:885B: 26 00     ROL ram_0000
C - - - - - 0x00886D 02:885D: 0A        ASL
C - - - - - 0x00886E 02:885E: 26 00     ROL ram_0000
C - - - - - 0x008870 02:8860: 0A        ASL
C - - - - - 0x008871 02:8861: 26 00     ROL ram_0000
C - - - - - 0x008873 02:8863: 0A        ASL
C - - - - - 0x008874 02:8864: 26 00     ROL ram_0000
C - - - - - 0x008876 02:8866: 0A        ASL
C - - - - - 0x008877 02:8867: 26 00     ROL ram_0000
C - - - - - 0x008879 02:8869: 18        CLC
C - - - - - 0x00887A 02:886A: 69 9C     ADC #< $209C
C - - - - - 0x00887C 02:886C: 99 02 03  STA ram_nmt_buffer + $02,Y  ; ppu hi
C - - - - - 0x00887F 02:886F: A5 00     LDA ram_0000
C - - - - - 0x008881 02:8871: 69 20     ADC #> $209C
C - - - - - 0x008883 02:8873: 99 01 03  STA ram_nmt_buffer + $01,Y  ; ppu lo
C - - - - - 0x008886 02:8876: A9 04     LDA #$04    ; counter
C - - - - - 0x008888 02:8878: 99 03 03  STA ram_nmt_buffer + $03,Y
C - - - - - 0x00888B 02:887B: A9 00     LDA #$00    ; fill tile
C - - - - - 0x00888D 02:887D: 99 04 03  STA ram_nmt_buffer + $04,Y
C - - - - - 0x008890 02:8880: 98        TYA
C - - - - - 0x008891 02:8881: 18        CLC
C - - - - - 0x008892 02:8882: 69 05     ADC #$05
C - - - - - 0x008894 02:8884: 85 1E     STA ram_index_ppu_buffer
C - - - - - 0x008896 02:8886: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8887:
C - - - - - 0x008897 02:8887: BD 72 07  LDA ram_0772_obj,X
C - - - - - 0x00889A 02:888A: F0 03     BEQ bra_888F_RTS
C - - - - - 0x00889C 02:888C: 4C 6B AB  JMP loc_0x006B7B
bra_888F_RTS:
C - - - - - 0x00889F 02:888F: 60        RTS

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8890:
C - - - - - 0x0088A0 02:8890: 20 87 88  JSR sub_8887
C - - - - - 0x0088A3 02:8893: 20 4F A7  JSR sub_0x00675F
C - - - - - 0x0088A6 02:8896: 4C 9C 88  JMP loc_889C

; - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

sub_8899:
loc_8899:
C D 0 - - - 0x0088A9 02:8899: 20 5D A7  JSR sub_0x00676D
sub_889C:
loc_889C:
C D 0 - - - 0x0088AC 02:889C: 20 4F AA  JSR sub_0x006A5F
sub_889F:
C - - - - - 0x0088AF 02:889F: A9 F0     LDA #$F0
C - - - - - 0x0088B1 02:88A1: 38        SEC
C - - - - - 0x0088B2 02:88A2: E5 F9     SBC ram_00F9
C - - - - - 0x0088B4 02:88A4: 18        CLC
C - - - - - 0x0088B5 02:88A5: 69 31     ADC #$31
C - - - - - 0x0088B7 02:88A7: 85 45     STA ram_номер_сканлинии
C - - - - - 0x0088B9 02:88A9: A9 05     LDA #$05
C - - - - - 0x0088BB 02:88AB: 85 46     STA ram_0046
C - - - - - 0x0088BD 02:88AD: A9 BA     LDA #$BA
C - - - - - 0x0088BF 02:88AF: 38        SEC
C - - - - - 0x0088C0 02:88B0: E5 45     SBC ram_номер_сканлинии
C - - - - - 0x0088C2 02:88B2: 85 47     STA ram_0047
C - - - - - 0x0088C4 02:88B4: A9 C0     LDA #$C0
C - - - - - 0x0088C6 02:88B6: 85 4A     STA ram_004A
C - - - - - 0x0088C8 02:88B8: A9 2C     LDA #$2C
C - - - - - 0x0088CA 02:88BA: 85 4B     STA ram_004B
C - - - - - 0x0088CC 02:88BC: 60        RTS

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

_off001_0x0088CD_58_босс_8_падающие_камни:
- D 0 - I - 0x0088CD 02:88BD: C1 88     .word ofs_038_58_88C1_01_активация_объекта ; 
- D 0 - I - 0x0088CF 02:88BF: 33 89     .word ofs_038_58_8933_02 ; 

; ******************************************************************************************************************

ofs_038_58_88C1_01_активация_объекта:
C - - J - - 0x0088D1 02:88C1: A9 80     LDA #$80
C - - - - - 0x0088D3 02:88C3: 9D 2C 07  STA ram_состояние_хитбоксов_объектов,X
C - - - - - 0x0088D6 02:88C6: A9 03     LDA #$03
C - - - - - 0x0088D8 02:88C8: 9D 56 05  STA ram_атрибуты_спрайта_объекта_или_пули,X
C - - - - - 0x0088DB 02:88CB: BD 56 07  LDA ram_скролл_объекта_X,X
C - - - - - 0x0088DE 02:88CE: D0 1A     BNE bra_88EA
C - - - - - 0x0088E0 02:88D0: BD 1E 07  LDA ram_флаги_объектов,X
C - - - - - 0x0088E3 02:88D3: 0A        ASL
C - - - - - 0x0088E4 02:88D4: 0A        ASL
C - - - - - 0x0088E5 02:88D5: 0A        ASL
C - - - - - 0x0088E6 02:88D6: 69 24     ADC #$24
C - - - - - 0x0088E8 02:88D8: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0088EB 02:88DB: BC 48 07  LDY ram_скролл_объекта_Y,X
C - - - - - 0x0088EE 02:88DE: B9 21 89  LDA tbl_8921_позиция_X,Y
C - - - - - 0x0088F1 02:88E1: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x0088F4 02:88E4: B9 24 89  LDA tbl_8924_счетчики,Y
                                        STA ram_счетчики_для_объектов,X
                                        JMP loc_0x0062E7_увеличить_состояние_объекта
bra_88EA:
C - - - - - 0x0088FA 02:88EA: A9 C0     LDA #$C0
C - - - - - 0x0088FC 02:88EC: 9D 22 05  STA ram_позиция_y_спрайта_объекта_или_пули,X
C - - - - - 0x0088FF 02:88EF: A5 23     LDA ram_рандом_байт
C - - - - - 0x008901 02:88F1: 29 78     AND #$78
C - - - - - 0x008903 02:88F3: 09 80     ORA #$80
C - - - - - 0x008905 02:88F5: 9D 3C 05  STA ram_позиция_x_спрайта_объекта_или_пули,X
C - - - - - 0x008908 02:88F8: A5 23     LDA ram_рандом_байт
C - - - - - 0x00890A 02:88FA: 29 03     AND #$03
C - - - - - 0x00890C 02:88FC: 0A        ASL
C - - - - - 0x00890D 02:88FD: A8        TAY
C - - - - - 0x00890E 02:88FE: B9 27 89  LDA tbl_8927_скорость_Y,Y
C - - - - - 0x008911 02:8901: 9D A0 06  STA ram_скорость_объектов_y_младш,X
C - - - - - 0x008914 02:8904: B9 28 89  LDA tbl_8927_скорость_Y + $01,Y
C - - - - - 0x008917 02:8907: 9D AE 06  STA ram_скорость_объектов_Y_старш,X
C - - - - - 0x00891A 02:890A: A5 23     LDA ram_рандом_байт
C - - - - - 0x00891C 02:890C: 30 10     BMI bra_891E
C - - - - - 0x00891E 02:890E: 29 04     AND #$04
C - - - - - 0x008920 02:8910: 4A        LSR
C - - - - - 0x008921 02:8911: A8        TAY
C - - - - - 0x008922 02:8912: B9 2F 89  LDA tbl_892F_скорость_X,Y
C - - - - - 0x008925 02:8915: 9D BC 06  STA ram_скорость_объектов_x_младш,X
C - - - - - 0x008928 02:8918: B9 30 89  LDA tbl_892F_скорость_X + $01,Y
C - - - - - 0x00892B 02:891B: 9D CA 06  STA ram_скорость_объектов_X_старш,X
bra_891E:
C - - - - - 0x00892E 02:891E: 4C D7 A2  JMP loc_0x0062E7_увеличить_состояние_объекта

tbl_8921_позиция_X:
- D 0 - - - 0x008931 02:8921: E8        .byte $E8   ; 00 
- D 0 - - - 0x008932 02:8922: F0        .byte $F0   ; 01 
- D 0 - - - 0x008933 02:8923: F8        .byte $F8   ; 02 

tbl_8924_счетчики:
- D 0 - - - 0x008934 02:8924: 00        .byte $00   ; 00 
- D 0 - - - 0x008935 02:8925: 06        .byte $06   ; 01 
- D 0 - - - 0x008936 02:8926: 03        .byte $03   ; 02

tbl_8927_скорость_Y:
- D 0 - - - 0x008937 02:8927: 00 FF     .word $FF00 ; 00 
- D 0 - - - 0x008939 02:8929: C0 FE     .word $FEC0 ; 01 
- D 0 - - - 0x00893B 02:892B: 40 FF     .word $FF40 ; 02 
- D 0 - - - 0x00893D 02:892D: 80 FF     .word $FF80 ; 03 

tbl_892F_скорость_X:
; bzk it may look like there should be 4 more bytes,
; but no reads were logged below it.
; it just works
- D 0 - - - 0x00893F 02:892F: 40 00     .word $0040 ; 00 
- D 0 - - - 0x008941 02:8931: C0 FF     .word $FFC0 ; 04

; ******************************************************************************************************************

ofs_038_58_8933_02:
C - - J - - 0x008943 02:8933: BD E6 06  LDA ram_счетчики_для_объектов,X
C - - - - - 0x008946 02:8936: F0 04     BEQ bra_893C
C - - - - - 0x008948 02:8938: DE E6 06  DEC ram_счетчики_для_объектов,X
C - - - - - 0x00894B 02:893B: 60        RTS
bra_893C:
C - - - - - 0x00894C 02:893C: A0 17     LDY #$17
C - - - - - 0x00894E 02:893E: 20 FD AB  JSR sub_0x006C0D_выбрать_кадр_анимации_исходя_из_счетчиков
C - - - - - 0x008951 02:8941: A9 20     LDA #$20
C - - - - - 0x008953 02:8943: 20 CB AA  JSR sub_0x006ADB_прибавить_скорость_Y
C - - - - - 0x008956 02:8946: 4C D3 A6  JMP loc_0x0066E3_обработка_позиции_Y_X_объекта_от_скорости_и_камеры

; ==================================================================================================================
;  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
; ==================================================================================================================

; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************
; ******************************************************************************************************************

















.out .sprintf("Free bytes in bank 2F: %Xh [%d]", ($A000 - *), ($A000 - *))

